{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-14T20:40:08.301751+08:00",
  "window_end_taipei": "2025-09-15T20:40:08.301751+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Trump threatens to call national emergency in Washington DC over Ice cooperation – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
      "pub_time_taipei": "2025-09-15T20:18:28+08:00",
      "summary": "<p>President vows to ‘federalize’ capital city after mayor says police will not work with Ice in immigration crackdown</p><p><strong>Secretary of state Marco Rubio will travel to Qatar on Tuesday</strong>, the Washington Post is reporting, after holding talks with Benjamin Netanyahu today in Israel.</p><p>As my colleague <strong>Julian Borger</strong> <a href=\"https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas\">writes</a>: “Part of [Rubio’s] mission on this two-day visit is <strong>to</strong> <strong>convey</strong> <strong>Donald Trump</strong>’s <strong>irritation at the Israeli missile strike on Doha</strong> that was aimed at <a href=\"https://www.theguardian.com/world/hamas\">Hamas</a> leadership but killed their aides and a Qatari security officer.</p><p><em>Common sense dictates that drone technology should be harnessed to scan every elevated structure with a line of sight to a target.</em></p><p><em>If drones can enable the early detection and prevention of assassination attempts, why not use them? Better to have vigilant eyes in the sky than to remain blind to would-be assassins.</em></p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Conservative MP Danny Kruger says party is ‘over’ as he defects to Reform – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-09-15T20:18:05+08:00",
      "summary": "<p>Nigel Farage announces defection of MP for East Wiltshire and puts him in charge of preparing party for government</p><p><strong>Nigel Farage</strong> has announced that Danny Kruger has defected to Reform UK from the Tories. Kruger, MP for East Wiltshire, is a leading social conservative, and co-chaired the New Conservatives group in the last parliament with Miriam Cates.</p><p>Farage said that Kruger would be in charge of preparing the part for government.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US’s Rubio says efforts to recognise Palestinian state make it harder to end war – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates",
      "pub_time_taipei": "2025-09-15T20:16:16+08:00",
      "summary": "<p>Secretary of state holds press conference with Benjamin Netanyahu during visit to Jerusalem</p><p><strong>That brings the press conference to a close, as Netanyahu takes a moment to acknowledge both his and Rubio’s staff who are sat in the front row.</strong></p><p>The main takeaways from the event, which lasted just over half an hour, are that the US views international efforts to recognise the Palestinian state as a hindrance to peace efforts and that Netanyahu refuses to rule out future strikes on Hamas leaders – wherever they are.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Spain’s PM calls for Israel to be banned from sports events after Gaza protests force end to Vuelta race",
      "link": "https://www.theguardian.com/world/2025/sep/15/spains-pm-criticised-after-vuelta-a-espana-race-abandoned-over-pro-palestinian-protests",
      "pub_time_taipei": "2025-09-15T20:12:22+08:00",
      "summary": "<p>Speaking after Gaza protesters forced early end to cycle race, Pedro Sánchez says Israel should not be allowed to use sports to ‘whitewash’ its ‘barbarism’</p><p>Spain’s prime minister, Pedro Sánchez, has called for Israel to be barred from international sports competitions for as long as its “barbarism” in Gaza continues, saying the country should not be allowed to use high-profile events to “whitewash” its offensive.</p><p>Speaking a day after pro-Palestinian demonstrators <a href=\"https://www.theguardian.com/sport/2025/sep/14/jonas-vingegaard-wins-vuelta-a-espana-pro-palestinian-protests\">forced a premature end</a> to the Vuelta a España cycle race amid chaotic scenes and clashes with police, Sánchez said he had “a deep admiration” for all those who had protested peacefully against the participation of the Israel-Premier Tech team.</p> <a href=\"https://www.theguardian.com/world/2025/sep/15/spains-pm-criticised-after-vuelta-a-espana-race-abandoned-over-pro-palestinian-protests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US right capitalizes on fatal stabbing of Ukrainian refugee in North Carolina",
      "link": "https://www.theguardian.com/us-news/2025/sep/15/charlotte-north-carolina-bus-killing-far-right",
      "pub_time_taipei": "2025-09-15T20:00:02+08:00",
      "summary": "<p>Far right points to lax criminal justice system and racist narratives, not mental health system failures as experts say</p><p>The random and unprovoked <a href=\"https://www.theguardian.com/us-news/2025/sep/09/north-carolina-ukraine-woman-stabbing\">killing</a> of a young woman in <a href=\"https://www.theguardian.com/us-news/northcarolina\">North Carolina</a> several weeks ago has become a viral video, a political football, and a powerful rightwing talking point – even as the horror and anger her death has provoked obscures what experts say is a vital story about the failures of the American mental health system.</p><p>The alleged perpetrator, Decarlos Brown Jr, 34, has a long history of problems with the law and mental health issues. He had been arrested 14 times and served a five-year stint for armed robbery. Brown had also come to believe that there was something alien and malevolent inside him – a “man-made material”, he told people, possibly a computer chip implanted by the government that was fighting him for control of his body.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/15/charlotte-north-carolina-bus-killing-far-right\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russia and Belarus carry out military drills amid rising tension – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates",
      "pub_time_taipei": "2025-09-15T19:59:02+08:00",
      "summary": "<p>Allies rehearsing scenarios of an attack on Belarus in the first such exercises since Russia invaded Ukraine</p><p>EU trade spokesperson <strong>Olof Gill</strong> also defended the EU’s sanctions from criticism that they are not going far enough.</p><p>He said:</p><p><em>“Our assessment is that the successive sanctions packages we have brought forward, which includes new initiatives plus additional initiatives to make the previous one stronger if that makes sense, <strong>our assessment is that those sanctions are working. </strong></em></p><p><em>The economic evidence shows that <strong>they are having an impact on the Russian economy,</strong> and that is precisely what they intended to do. </em></p><p><em>“Phasing out of Russian fossil fuels is something that we have been doing and are doing actively for a number already of years, since the beginning of the war, with a very clear roadmap, with now even a clear legislative proposal in order to phase out the remaining gas still entering the EU.</em></p><p><em>… This is something on which the EU has been very actively and we have a very, very clear roadmap, and how to go about it.”</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "South Korea to review possible human rights violations in US raid on workers",
      "link": "https://www.theguardian.com/us-news/2025/sep/15/south-korea-to-review-possible-human-rights-violation-after-us-raid-on-workers",
      "pub_time_taipei": "2025-09-15T19:53:30+08:00",
      "summary": "<p>Lee Jae Myung says ‘bewildering’ incident may scare off future investment after Ice detained about 475 people</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates\">US politics live – latest updates</a></p></li></ul><p>South Korea’s government has said it will launch an investigation into whether human rights violations were committed when <a href=\"https://www.theguardian.com/us-news/2025/sep/05/immigration-ice-raid-hyundai-georgia\">hundreds of its citizens were detained</a> in a US immigration raid.</p><p>About 475 people, mostly South Korean nationals, were arrested at the construction site of an electric vehicle battery factory in the US state of Georgia on 4 September.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/15/south-korea-to-review-possible-human-rights-violation-after-us-raid-on-workers\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Google’s huge new Essex datacentre to emit 570,000 tonnes of CO2 a year",
      "link": "https://www.theguardian.com/technology/2025/sep/15/google-datacentre-kent-co2-thurrock-uk-ai",
      "pub_time_taipei": "2025-09-15T19:48:23+08:00",
      "summary": "<p><strong>Exclusive:</strong> Planning documents show impact of Thurrock ‘hyperscale’ unit as UK attempts to ramp up AI capacity</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates#top-of-blog\">Business live – latest updates</a></p></li></ul><p>A new Google datacentre in Essex is expected to emit more than half a million tonnes of carbon dioxide a year , equivalent to about 500 short-haul flights a week, planning documents show.</p><p>Spread across 52 hectares (128 acres), the Thurrock “hyperscale datacentre” will be part of a wave of mammoth computer and AI power houses if it secures planning consent.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/15/google-datacentre-kent-co2-thurrock-uk-ai\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New legal challenge to plan for Spurs football academy in London park",
      "link": "https://www.theguardian.com/environment/2025/sep/15/new-legal-challenge-spurs-plan-build-football-academy-london-green-space-campaigners-wildlife",
      "pub_time_taipei": "2025-09-15T19:42:57+08:00",
      "summary": "<p>Campaigners crowdfund £26,000 to seek judicial review of move to construct pitches in wildlife-rich area</p><p>Campaigners are mounting another legal challenge to the building of a women’s football academy by Tottenham Hotspur on wildlife-rich parkland in north London.</p><p>The <a href=\"https://www.avidbeats.com/guardians-of-whitewebbs\">Guardians of Whitewebbs</a> group has <a href=\"https://www.crowdjustice.com/case/savewhitewebbs/\">successfully crowdfunded</a> £26,000 to seek a judicial review of Enfield council’s granting of planning permission for the Spurs academy, which will include all-weather pitches, floodlights and a turf academy built on 53 hectares (130 acres) of Whitewebbs Park. Enfield council’s planning committee <a href=\"https://www.theguardian.com/uk-news/2025/feb/12/dark-day-for-parks-plans-to-build-spurs-academy-on-london-green-space-approved\">approved the proposals in February</a>, despite local protests, on greenbelt parkland rich in bats, newts and mature trees.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/15/new-legal-challenge-spurs-plan-build-football-academy-london-green-space-campaigners-wildlife\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Malcolm-Jamal Warner’s widow launches philanthropic organizations in his honor",
      "link": "https://www.theguardian.com/us-news/2025/sep/15/malcolm-jamal-warner-widow-tenisa-philanthropic-organizations",
      "pub_time_taipei": "2025-09-15T19:38:44+08:00",
      "summary": "<p>Tenisha Warner reveals identity as she starts two initiatives to support children on behalf of late actor and singer</p><p>The widow of actor and singer <a href=\"https://www.theguardian.com/tv-and-radio/2025/jul/23/malcolm-jamal-warner\">Malcolm-Jamal Warner</a> has announced the launch of two philanthropic organizations in his honor, paying tribute to her <a href=\"https://www.theguardian.com/tv-and-radio/2025/jul/21/malcolm-jamal-warner-dead-cosby-show\">late husband</a> in social media posts that identified her for the first time.</p><p>On Friday, the day before the eighth anniversary of their wedding, Tenisha Warner published a photo on <a href=\"https://www.instagram.com/p/DOhFImqksol/\">Instagram</a> of her and her Grammy-winning husband holding hands and laughing together on the day they got married. Some accompanying text explained that the doctor of psychology and her daughter had started the Warner Family Foundation as a young artists’ scholarship program as well as River &amp; Ember, which is dedicated to helping deepen bonds between parents and children.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/15/malcolm-jamal-warner-widow-tenisa-philanthropic-organizations\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Channel 4 to mark Trump’s UK visit with ‘longest uninterrupted reel of untruths’",
      "link": "https://www.theguardian.com/us-news/2025/sep/15/channel-4-donald-trump-uk-state-visit-reel-of-untruths",
      "pub_time_taipei": "2025-09-15T19:07:04+08:00",
      "summary": "<p>Broadcaster to dedicate Wednesday night schedule to unpicking US president’s false or misleading statements </p><p>More than 100 of Donald Trump’s inaccurate statements are to be dissected by Channel 4 to coincide with his state visit, in what it described as “the longest uninterrupted reel of untruths, falsehoods and distortions ever broadcast on television”.</p><p>The US president is expected to arrive in the UK on Tuesday night. He will enjoy a huge amount of special treatment as ministers attempt to preserve the special relationship, including a ceremonial welcome at Windsor Castle for Trump and his wife, Melania.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/15/channel-4-donald-trump-uk-state-visit-reel-of-untruths\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Poland calls for NATO-backed no-fly zone over Ukraine",
      "link": "https://www.washingtonpost.com/world/2025/09/15/poland-ukraine-russia-no-fly-zone/",
      "pub_time_taipei": "2025-09-15T18:57:09+08:00",
      "summary": "Foreign Minister Radoslaw Sikorski said shielding Ukraine from Russian drone attacks would protect the rest of Europe, too, amid concerns over the war’s spread."
    },
    {
      "source": "華盛頓郵報",
      "title": "Rubio visits Israel, expected to visit Qatar after strike on Hamas",
      "link": "https://www.washingtonpost.com/national-security/2025/09/15/rubio-israel-qatar/",
      "pub_time_taipei": "2025-09-15T18:27:07+08:00",
      "summary": "Secretary of State Marco Rubio’s trip to Israel coincides with a summit in Qatar where Arab and Muslim countries will decide how to respond to Israel’s attack."
    },
    {
      "source": "衛報",
      "title": "Charlie Kirk shooting suspect had ‘very different ideology’ than conservative family, Utah governor says",
      "link": "https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-shooting-suspect-roommate",
      "pub_time_taipei": "2025-09-15T18:24:10+08:00",
      "summary": "<p>Spencer Cox said suspect had been ‘radicalized’ and was in relationship with person transitioning from male to female</p><p>The <a href=\"https://www.theguardian.com/us-news/utah\">Utah</a> governor, Spencer Cox, has said the man suspected of <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">killing</a> <a href=\"https://www.theguardian.com/us-news/2025/sep/10/who-is-charlie-kirk-profile\">Charlie Kirk</a> comes “from a conservative family” but that “his ideology was very different than his family”.</p><p>During one of multiple national talkshow appearances Sunday, the Republican governor said Tyler Robinson, 22, was in relationship with a person “transitioning from male to female” and that investigators were continuing to explore a possible motive in the attack.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-shooting-suspect-roommate\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Long-winded apologies seem more sincere, study suggests",
      "link": "https://www.theguardian.com/science/2025/sep/15/long-winded-apologies-seem-more-sincere-study-suggests",
      "pub_time_taipei": "2025-09-15T18:14:06+08:00",
      "summary": "<p>Researchers find people interpret verbose statements of atonement as more genuine than concise ones </p><p>Sorry may be the hardest word, but it is also rather on the short side.</p><p>And that means it may not be enough to get out of trouble, a study suggests.</p> <a href=\"https://www.theguardian.com/science/2025/sep/15/long-winded-apologies-seem-more-sincere-study-suggests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Democrats activate weeklong voter drive to offset critical registration losses",
      "link": "https://www.theguardian.com/us-news/2025/sep/15/democrats-weeklong-voter-drive",
      "pub_time_taipei": "2025-09-15T18:01:01+08:00",
      "summary": "<p>The party lost 2.1 million registered voters from 2020 to 2024 – while Republicans gained 2.4 million</p><p>The <a href=\"https://www.theguardian.com/us-news/democrats\">Democrats</a> are launching a weeklong bid to register voters nationwide, particularly in battleground House districts as their party grapples with increasing numbers of Americans registering as Republicans.</p><p>The nationwide trends in party registration – detailed in <a href=\"https://www.nytimes.com/2025/08/20/us/politics/democratic-party-voter-registration-crisis.html\">an article</a> published in August by the New York Times – heightened concern that the Democrats’ drubbing in the 2024 election was not the one-off result of a <a href=\"https://www.theguardian.com/us-news/2025/sep/10/kamala-harris-memoir-joe-biden-election\">chaotic presidential campaign</a> won by Donald Trump and the Republicans, but rather signs of a broader shift by voters away from Democrats.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/15/democrats-weeklong-voter-drive\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Human rights commissioner blasts Queensland government’s ‘hostile’ approach to First Nations people",
      "link": "https://www.theguardian.com/australia-news/2025/sep/15/human-rights-commissioner-blasts-queensland-government-hostile-approach-first-nations-people",
      "pub_time_taipei": "2025-09-15T17:36:42+08:00",
      "summary": "<p>Scott McDougall uses speech at parliament to warn the LNP is ‘walking us backwards’ on reconciliation as he prepares to exit role</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Queensland’s human rights commissioner has blasted the state government’s “hostile”, “assimilationist” approach to First Nations people in a speech at Parliament House.</p><p>Scott McDougall, Queensland’s first-ever human rights commissioner, <a href=\"https://www.theguardian.com/law/2025/mar/14/lnp-anti-discrimination-law-reform-delay-ntwnfb\">has consistently criticised</a> <a href=\"https://www.theguardian.com/australia-news/2024/nov/28/queensland-youth-crime-laws-david-crisafulli-lnp-changes-children-life-sentences-murder\">both sides of politics</a> over a range of issues, particularly the state’s youth law and order crackdown. His seven-year term in the role comes to an end next month.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/15/human-rights-commissioner-blasts-queensland-government-hostile-approach-first-nations-people\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australian PM blames ‘aggressive protesters’ for closure of local electorate office",
      "link": "https://www.theguardian.com/australia-news/2025/sep/15/anthony-albanese-closes-grayndler-electorate-office-marrickville-palestine-protesters",
      "pub_time_taipei": "2025-09-15T17:35:23+08:00",
      "summary": "<p>Anthony Albanese says site next to church ‘became untenable’ after repeated protests against Gaza war in inner Sydney suburb</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Australian prime minister, Anthony Albanese, has closed his inner-Sydney electorate office after almost 30 years, saying his hand had been forced by repeated protests outside the office.</p><p>Albanese’s office in Marrickville, in his electorate of Grayndler, has long been a target of demonstrations, particularly over the war in Gaza, including <a href=\"https://www.crikey.com.au/2024/03/19/prime-minister-anthony-albanese-marrickville-office-gaza-protest/\">a months-long sit-in</a> outside the office in 2024.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/15/anthony-albanese-closes-grayndler-electorate-office-marrickville-palestine-protesters\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bali battles worst floods in more than a decade",
      "link": "https://www.theguardian.com/environment/2025/sep/15/bali-worst-floods-decade-landslides-rain-india-pakistan-australia",
      "pub_time_taipei": "2025-09-15T17:18:22+08:00",
      "summary": "<p>At least 17 dead as torrential downpours trigger landslides, while heavy rain lashes India, Pakistan and Australia</p><p>At least 17 people have been confirmed dead in Bali, Indonesia, after the island’s worst flooding in more than a decade.</p><p>Torrential rain last Tuesday and Wednesday triggered widespread flooding and landslides, leaving a trail of destruction. Eight victims were found in Denpasar, the island’s capital, and rescue teams continue to search for several others who remain missing.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/15/bali-worst-floods-decade-landslides-rain-india-pakistan-australia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We’ve got no tourists’: small businesses caught up in Australia’s largest manhunt struggle as aid announced",
      "link": "https://www.theguardian.com/australia-news/2025/sep/15/porepunkah-victorian-government-support-package-tourism-small-business-ntwnfb",
      "pub_time_taipei": "2025-09-15T17:16:56+08:00",
      "summary": "<p>Victorian government pledges up to $2.5m to help visitor economy in alpine region as search for alleged Porepunkah killer Dezi Freeman continues</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Victorian government has announced a support package for tourism operators and small businesses caught up in Australia’s largest manhunt.</p><p>The government announced on Monday that as much as $2.5m would be paid to support the visitor economy in Porepunkah, Bright and surrounding region, as the search for alleged police killer <a href=\"https://www.theguardian.com/australia-news/2025/aug/30/suspected-porepunkah-gunman-dezi-freeman-had-no-convictions-for-violence-or-firearm-offences-court-record-shows-ntwnfb\">Dezi Freeman</a> edged towards a fourth week.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/15/porepunkah-victorian-government-support-package-tourism-small-business-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Conor McGregor pulls out of Ireland’s presidential race",
      "link": "https://www.theguardian.com/world/2025/sep/15/conor-mcgregor-pulls-out-of-ireland-presidential-race",
      "pub_time_taipei": "2025-09-15T17:02:23+08:00",
      "summary": "<p>Former mixed martial arts fighter had vowed to curb immigration to shore up ‘Irish culture’ and give power ‘back to the people’</p><p>The former mixed martial arts fighter <a href=\"https://www.theguardian.com/sport/conor-mcgregor\">Conor McGregor </a>has withdrawn from <a href=\"https://www.theguardian.com/world/ireland\">Ireland</a>’s presidential election and complained that nomination rules were a “straitjacket” that prevented a true democratic contest.</p><p>“Following careful reflection, and after consulting with my family, I am withdrawing my candidacy from this presidential race,” he posted on X on Monday morning. “This was not an easy decision, but it is the right one at this moment in time.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/15/conor-mcgregor-pulls-out-of-ireland-presidential-race\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "To fight extremists, Trump administration warms to Russia-friendly junta",
      "link": "https://www.washingtonpost.com/world/2025/09/14/mali-trump-islamists-jnim-extremists/",
      "pub_time_taipei": "2025-09-15T17:00:52+08:00",
      "summary": "America has ramped up intelligence sharing with Mali’s repressive military junta, current and former U.S. officials said, as extremists gain ground in West Africa."
    },
    {
      "source": "衛報",
      "title": "Up to 20 deaths linked to ‘end of life’ business that sourced veterinary drug through fake whale charity, police allege",
      "link": "https://www.theguardian.com/australia-news/2025/sep/15/police-investigating-deaths-linked-to-end-of-life-business-gold-coast-veterinary-drug-found-mans-body-ntwnfb",
      "pub_time_taipei": "2025-09-15T16:40:50+08:00",
      "summary": "<p>Police allege Gold Coast business owner used charity to secure euthanasia drugs as 53-year-old charged with aiding suicide and trafficking dangerous drugs</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Police have uncovered an alleged “end of life” business believed to be linked to as many as 20 deaths, with investigations across three states after a man died from a veterinary euthanasia drug.</p><p>Queensland police have charged a Gold Coast man alleged to have operated the business, Brett Daniel Taylor, with two counts of aiding suicide and several drug offences including trafficking dangerous drugs.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/15/police-investigating-deaths-linked-to-end-of-life-business-gold-coast-veterinary-drug-found-mans-body-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "link": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "pub_time_taipei": "2025-09-15T16:26:29+08:00",
      "summary": "<p>Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates#top-of-blog\"><strong>Business live – latest updates</strong></a></p></li></ul><p></p><p>China’s economy showed further signs of weakness last month as it comes under strain from Donald’s Trump trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.</p><p>The disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.</p> <a href=\"https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As ties with U.S. fray, Indian sentiment turns sharply against America",
      "link": "https://www.washingtonpost.com/world/2025/09/15/india-us-relations-modi-trump/",
      "pub_time_taipei": "2025-09-15T16:00:55+08:00",
      "summary": "Harsh rhetoric from U.S. officials has dovetailed with escalating anti-Indian hate speech online, researchers found, hardening Indian attitudes towards America."
    },
    {
      "source": "衛報",
      "title": "Millions of Australians at risk from rising sea levels and heat deaths to soar, national climate risk assessment report warns",
      "link": "https://www.theguardian.com/australia-news/2025/sep/15/millions-of-australians-at-risk-from-rising-sea-levels-and-heat-deaths-could-soar-landmark-climate-report-warns",
      "pub_time_taipei": "2025-09-15T15:58:58+08:00",
      "summary": "<p>National climate risk assessment report finds heat-related deaths would surge 450% in Sydney if global heating surpasses 3C</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/15/australia-news-live-updates-albanese-png-climate-crisis-defence-rooftop-solar-power-energy-politics-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Anthony Albanese says a landmark report on the climate risks confronting Australia is a “wake-up call” that reinforces the need for “serious” action to combat global heating.</p><p>The prime minister said the findings of the national climate risk assessment would inform the government’s soon-to-be released 2035 emissions target, while stressing the need to plan for an “orderly” energy transition to avoid losing public support for climate action.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/15/millions-of-australians-at-risk-from-rising-sea-levels-and-heat-deaths-could-soar-landmark-climate-report-warns\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Monday briefing: Israel’s bombing of Qatar threatens the fabric of Gulf security",
      "link": "https://www.theguardian.com/world/2025/sep/15/monday-briefing-israels-bombing-of-qatar-threatens-the-fabric-of-gulf-security",
      "pub_time_taipei": "2025-09-15T13:36:33+08:00",
      "summary": "<p>In today’s newsletter: For decades, Gulf states have believed that a close relationship with US will guarantee their safety. That is no longer the case</p><p>Good morning. Last Monday, Israel’s foreign minister, Gideon Saar, announced that his country had accepted the US ceasefire proposal to end the devastating war in Gaza. The very next day, Israel attempted to kill Hamas’s negotiating team while they were in Qatar’s capital to discuss that same proposal.</p><p>Israel, initially bullish about the success of the operation, has since grown more doubtful that it killed any Hamas leaders in Doha. Hamas said that while six people were killed in the bombing – including the son of Khalil al-Hayya, the deputy head of its political bureau – the top leadership including the negotiating team survived.</p><p><em><strong>UK news </strong></em>| <a href=\"https://www.theguardian.com/uk-news/2025/sep/14/britain-far-right-protesters-flag-keir-starmer\">Britain will “never surrender” to far-right protesters</a> who use the English flag as cover for violence and to instil fear, Keir Starmer has said, condemning attacks against police officers and racist harassment after more than <a href=\"https://www.theguardian.com/uk-news/2025/sep/13/unite-the-kingdom-far-right-rally-london-tommy-robinson-police-assaulted\">110,000 people attended an extremist London rally</a>.</p><p><em><strong>Crime </strong></em>| <a href=\"https://www.theguardian.com/uk-news/2025/sep/15/prime-madeleine-mccann-suspect-refuses-met-interview-before-german-prison-release\">Christian Brueckner, prime suspect in the disappearance of Madeleine McCann</a>, has refused to be interviewed by the Metropolitan police before his pending release from prison in Germany, Scotland Yard has said.</p><p><em><strong>US </strong></em>| The Utah governor, Spencer Cox, has said <a href=\"https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-shooting-suspect-roommate\">22-year-old Tyler Robinson</a>, the man accused of killing Turning Point USA executive director Charlie Kirk, “does come from a conservative family – but his ideology was very different than his family”. Robinson was not cooperating with authorities, said Cox.</p><p><em><strong>Europe </strong></em>| Poland’s foreign minister has said the Russian drone incursion into Polish airspace was an <a href=\"https://www.theguardian.com/world/2025/sep/14/russian-drone-incursion-poland-nato-ukraine-europe\">attempt by the Kremlin to test Nato’s reactions</a> by incremental escalations without prompting a full-scale response, as Romania became the second Nato country to report an incursion in a matter of days.</p><p><em><strong>Television </strong></em>| It was a full sweep for Adolescence at the Emmys, winning every award in which the show was nominated tonight. Fifteen-year-old <a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/15/emmys-2025-adolescence-star-owen-cooper-makes-history-as-youngest-ever-winner-for-best-supporting-actor-in-a-limited-series\">Owen Cooper made history</a> as the youngest ever actor to win the Emmy for best supporting actor in a limited series. <a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/14/emmys-2025-full-list-of-winners\">Emmy awards 2025 – full list of winners</a></p> <a href=\"https://www.theguardian.com/world/2025/sep/15/monday-briefing-israels-bombing-of-qatar-threatens-the-fabric-of-gulf-security\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Prime Madeleine McCann suspect refuses Met interview before German prison release",
      "link": "https://www.theguardian.com/uk-news/2025/sep/15/prime-madeleine-mccann-suspect-refuses-met-interview-before-german-prison-release",
      "pub_time_taipei": "2025-09-15T13:00:57+08:00",
      "summary": "<p>Scotland Yard made formal request to interview Christian Brückner, due for release from seven-year rape sentence</p><p>The prime suspect in the disappearance of Madeleine McCann has refused to be interviewed by the Metropolitan police before his pending release from prison in Germany, the force has said.</p><p>The Met confirmed it had submitted a formal international request to question Christian Brückner, the 49-year-old German national who has long been under investigation in connection with Madeleine’s disappearance, but the suspect declined.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/15/prime-madeleine-mccann-suspect-refuses-met-interview-before-german-prison-release\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Europe’s summer of extreme weather caused €43bn of short-term losses, analysis finds",
      "link": "https://www.theguardian.com/world/2025/sep/15/europes-summer-of-extreme-weather-caused-43bn-of-short-term-losses-analysis-finds",
      "pub_time_taipei": "2025-09-15T12:00:55+08:00",
      "summary": "<p>Greatest damage from heat, drought and flooding done in Cyprus, Greece, Malta and Bulgaria </p><p>The violent weather that battered Europe this summer caused short-term economic losses of at least €43bn, according to an EU-wide estimate, with costs expected to rise to €126bn by 2029.</p><p>The immediate hit to the economy from a single brutal summer of heat, drought and flooding amounted to 0.26% of the EU’s economic output in 2024, according to the rapid analysis, which has not been submitted for peer review but is based on relationships between weather and economic data that were <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S001429212500131X\">published in an academic study</a> this month.</p> <a href=\"https://www.theguardian.com/world/2025/sep/15/europes-summer-of-extreme-weather-caused-43bn-of-short-term-losses-analysis-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump insists foreign workers are ‘welcome’ days after arrest of hundreds of South Koreans",
      "link": "https://www.theguardian.com/us-news/2025/sep/15/trump-foreign-workers-welcome-south-korea-arrests",
      "pub_time_taipei": "2025-09-15T08:39:54+08:00",
      "summary": "<p>US president says he doesn’t want to ‘disincentivize investment’ after images of workers chained and handcuffed caused widespread alarm in South Korea</p><p>President Donald Trump has said foreign workers sent to the United States are “welcome” and he doesn’t want to “frighten off” investors, 10 days after <a href=\"https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul\">hundreds of South Koreans were arrested</a> at a work site in Georgia.</p><p>In a <a href=\"https://truthsocial.com/@realDonaldTrump/posts/115204049358078594\">post on his Truth Social platform</a>, Trump wrote: “I don’t want to frighten off or disincentivize investment.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/15/trump-foreign-workers-welcome-south-korea-arrests\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "South Korea is going wild for ‘KPop Demon Hunters,’ made in the U.S.",
      "link": "https://www.washingtonpost.com/world/2025/09/13/kpop-demon-hunters-south-korea/",
      "pub_time_taipei": "2025-09-15T08:14:56+08:00",
      "summary": "South Korea gave the world BTS and “Gangnam Style,” “Parasite” and snail mucus face cream. The U.S. sent back “KPop Demon Hunters” — and South Koreans love it."
    },
    {
      "source": "衛報",
      "title": "Guy Pearce and Annie Lennox join call to end ‘normalised horror’ for children in Gaza",
      "link": "https://www.theguardian.com/world/2025/sep/14/guy-pearce-and-annie-lennox-join-call-to-end-normalised-horror-for-children-in-gaza",
      "pub_time_taipei": "2025-09-15T03:00:41+08:00",
      "summary": "<p>Stars read Michael Rosen’s 2014 poem Don’t Mention the Children in film released by Save the Children</p><p>Guy Pearce, Annie Lennox and Vanessa Redgrave are among the celebrities calling for an end to the “normalised horror” of children being killed in Gaza, as part of new short film.</p><p>Released by Save the Children and Choose Love, it features the stars reciting the words to a poem by Michael Rosen. Titled Don’t Mention the Children, the poem was written in 2014 in response to <a href=\"https://www.theguardian.com/world/2014/jul/24/israel-bans-radio-advert-listing-names-children-killed-gaza\">a Guardian article</a> about the Israeli government banning a radio advert naming children killed in Gaza. It begins:</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/guy-pearce-and-annie-lennox-join-call-to-end-normalised-horror-for-children-in-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rubio in Israel for talks to limit diplomatic damage over Qatar strikes",
      "link": "https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas",
      "pub_time_taipei": "2025-09-14T23:47:55+08:00",
      "summary": "<p>US secretary of state says Trump ‘not happy’ about Israeli attack that targeted Hamas officials in Doha for Gaza talks</p><p>The US secretary of state, Marco Rubio, has held talks in Israel with Benjamin Netanyahu aimed at limiting the diplomatic damage to both countries by <a href=\"https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas\">Israel’s attempt to assassinate Hamas leaders in Qatar</a>, its continued demolition of Gaza, and the accelerated expansion of settlements in the occupied West Bank.</p><p>The Israeli prime minister took Rubio on a tour of the Western Wall, where both men placed written prayers between the stones, before taking his American visitor underground to view archeological excavations.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brother of Briton jailed in India asks why UK border police are stopping him",
      "link": "https://www.theguardian.com/uk-news/2025/sep/14/brother-of-briton-jagtar-singh-johal-jailed-in-india-asks-why-uk-border-police-are-stopping-him",
      "pub_time_taipei": "2025-09-14T22:37:01+08:00",
      "summary": "<p>Gurpreet Singh Johal wants to know if stops are linked to his efforts to find out whether UK intelligence played a role in sibling’s arrest</p><p>The brother of Jagtar Singh Johal, a British Sikh jailed in India, has written to the Home Office to ask why he is being repeatedly stopped at the airport by British border police.</p><p>Gurpreet Singh Johal, a Labour councillor in Dumbarton, asked if it was linked to his legal efforts to discover whether British intelligence played a role in his brother’s arrest eight years ago.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/14/brother-of-briton-jagtar-singh-johal-jailed-in-india-asks-why-uk-border-police-are-stopping-him\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Massive nationalist rally shows MAGA-fueled movement’s appeal in U.K.",
      "link": "https://www.washingtonpost.com/world/2025/09/14/tommy-robinson-london-march-musk/",
      "pub_time_taipei": "2025-09-14T22:03:59+08:00",
      "summary": "Anti-migrant extremist Tommy Robinson drew over 110,000 people to the London protest, which turned violent. Experts say it was the largest far-right rally in U.K. history."
    }
  ]
}