{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-11T20:40:05.064992+08:00",
  "window_end_taipei": "2025-10-12T20:40:05.064992+08:00",
  "items": [
    {
      "source": "華盛頓郵報",
      "title": "Afghanistan and Pakistan claim to kill dozens of soldiers in border clash",
      "link": "https://www.washingtonpost.com/world/2025/10/12/afghanistan-taliban-pakistan-border-clash/",
      "pub_time_taipei": "2025-10-12T20:30:12+08:00",
      "summary": "Afghanistan’s Taliban government and Pakistan traded fire overnight, marking one of the deadliest border clashes since the fall of Kabul in 2021."
    },
    {
      "source": "衛報",
      "title": "Ceasefire live: aid trucks enter Gaza as Netanyahu says Israel is ready for ‘immediate’ release of hostages",
      "link": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
      "pub_time_taipei": "2025-10-12T20:14:53+08:00",
      "summary": "<p>Israel’s military says it has completed first phase of withdrawal, ahead of Monday peace summit in Egypt</p><p>Israeli prime minister, <strong>Benjamin Netanyahu</strong>, has said that Israel is ready for the “immediate” reception of all Gaza hostages.</p><p>“Israel is prepared and ready to immediately receive all of our hostages,” he said in a statement after a meeting with the coordinator for the hostage coordinator Gal Hirsch.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Survivor of 7 October Nova festival attack in Israel found dead",
      "link": "https://www.theguardian.com/world/2025/oct/12/roei-shalev-survivor-of-7-october-nova-festival-attack-in-israel-found-dead",
      "pub_time_taipei": "2025-10-12T20:08:59+08:00",
      "summary": "<p>Roei Shalev, 30, whose girlfriend and best friend were killed in front of him at festival, took his own life on Friday night</p><p>An Israeli man whose girlfriend and best friend were murdered in front of him at the Nova music festival on 7 October 2023 has killed himself days after the second anniversary of the terrorist atrocities.</p><p>Roei Shalev, who was shot during the Nova attack and survived, was found dead in his burned car north of Tel Aviv on Friday night. Hours before his death, Shalev, 30, had posted a message on social media saying he felt he could not go on.</p> <a href=\"https://www.theguardian.com/world/2025/oct/12/roei-shalev-survivor-of-7-october-nova-festival-attack-in-israel-found-dead\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Maga figures back Bukele’s call for Trump to crack down on US judges",
      "link": "https://www.theguardian.com/us-news/2025/oct/12/trump-bukele-judges",
      "pub_time_taipei": "2025-10-12T20:00:53+08:00",
      "summary": "<p>Experts say El Salvador president’s intervention comes as Trump is employing tactics used by autocrats abroad</p><p>Donald Trump is not known for taking advice, especially from foreign leaders who often seek to flatter and compliment the US president.</p><p>But El Salvador’s authoritarian leader Nayib Bukele has followed a different tack by calling on the Trump administration to follow his example in impeaching “corrupt judges”.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/12/trump-bukele-judges\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘It would be wonderful’: the team hoping to unearth ‘Cornwall’s Stonehenge’",
      "link": "https://www.theguardian.com/uk-news/2025/oct/12/it-would-be-wonderful-the-team-hoping-to-unearth-cornwalls-stonehenge",
      "pub_time_taipei": "2025-10-12T20:00:52+08:00",
      "summary": "<p>Experts and volunteers working at Castilly Henge have been trying determine if it is the county’s lost great stone circle</p><p>It was a grey Cornish autumn day, but Henry Stevens’s tough shift digging in a field next to the A30 was about to get very exciting.</p><p>Her eye was caught by something glinting in the soil and she picked up a flake of flint that had lain for thousands of years within what might just turn out to be a Cornish version of Stonehenge.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/12/it-would-be-wonderful-the-team-hoping-to-unearth-cornwalls-stonehenge\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Meta AI adviser spreads disinformation about shootings, vaccines and trans people",
      "link": "https://www.theguardian.com/technology/2025/oct/12/meta-ai-adviser-robby-starbuck",
      "pub_time_taipei": "2025-10-12T20:00:52+08:00",
      "summary": "<p>Critics condemn Robby Starbuck, appointed in lawsuit settlement, for ‘peddling lies and pushing extremism’</p><p>A prominent anti-DEI campaigner appointed by Meta in August as an adviser on AI bias has spent the weeks since his appointment spreading disinformation about shootings, transgender people, vaccines, crime, and protests.</p><p>Robby Starbuck, 36, of Nashville, was appointed in August as an adviser by Meta – owner of Facebook, Instagram, WhatsApp, and other tech platforms – in an August lawsuit settlement.</p> <a href=\"https://www.theguardian.com/technology/2025/oct/12/meta-ai-adviser-robby-starbuck\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thousands attend pro-Palestine rallies across Australia as organisers vow to keep protesting after Gaza ceasefire",
      "link": "https://www.theguardian.com/world/2025/oct/12/thousand-attend-pro-palestine-rallies-across-australia-as-organisers-vow-to-keep-protesting-after-gaza-ceasefire",
      "pub_time_taipei": "2025-10-12T19:51:44+08:00",
      "summary": "<p>‘We’ll absolutely continue to protest for a free Palestine,’ Sydney organiser says,  as others express hope US-brokered deal will ‘end the genocide’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Tens of thousands of people have rallied across Australia at pro-Palestine demonstrations, with organisers vowing to continue protesting after Donald Trump brokered a ceasefire deal in Gaza that initially <a href=\"https://www.theguardian.com/world/2025/oct/11/agencies-prepare-to-bring-aid-to-starving-people-in-gaza-as-ceasefire-appears-to-hold\">appeared to be holding</a>.</p><p>In Sydney, the Palestine Action Group said 30,000 people had marched from Hyde Park to Belmore Park in the central business district after a planned rally to the Opera House <a href=\"https://www.theguardian.com/australia-news/2025/oct/09/court-prohibits-pro-palestine-march-to-sydney-opera-house-after-police-raise-safety-concerns\">was prohibited</a> by the New South Wales court of appeal last week.</p> <a href=\"https://www.theguardian.com/world/2025/oct/12/thousand-attend-pro-palestine-rallies-across-australia-as-organisers-vow-to-keep-protesting-after-gaza-ceasefire\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Madagascar’s president says illegal power grab by military is under way",
      "link": "https://www.theguardian.com/world/2025/oct/12/madagascar-president-says-power-grab-military-under-way",
      "pub_time_taipei": "2025-10-12T19:43:57+08:00",
      "summary": "<p>Soldiers from elite Capsat unit have announced they are taking over after weeks of youth-led protests</p><p>Madagascar’s president said an “attempt to seize power illegally and by force” was under way, as an elite military unit that <a href=\"https://www.theguardian.com/world/2025/oct/11/soldiers-from-elite-capsat-unit-join-protests-against-madagascars-president\">joined protesters on the streets on Saturday</a> announced it was taking over the army.</p><p>The Capsat unit’s intervention comes after weeks of youth-led protests, which started on 25 September against water and electricity shortages and expanded to calling for the resignation of the president, Andry Rajoelina, an end to corruption and radical overhaul of the political system.</p> <a href=\"https://www.theguardian.com/world/2025/oct/12/madagascar-president-says-power-grab-military-under-way\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel and Gaza prepare for release of hostages and prisoners",
      "link": "https://www.theguardian.com/world/2025/oct/12/israel-and-gaza-prepare-for-release-of-hostages-and-prisoners",
      "pub_time_taipei": "2025-10-12T19:26:27+08:00",
      "summary": "<p>Forty-eight Israeli hostages due to be released on Monday, with nearly 2,000 Palestinian detainees to follow</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages\">Ceasefire live: aid trucks enter Gaza as Netanyahu says Israel is ready for ‘immediate’ release of hostages</a></p></li></ul><p>Authorities in Israel and Gaza are preparing for the release of Israeli hostages and Palestinian prisoners ahead of a Monday deadline for the swap stipulated in the ceasefire deal that could end the two-year war in Gaza.</p><p>Hamas is meant to release all living hostages from Gaza within 72 hours of the signing of the deal – a deadline that ends at noon local time (10am UK time). The militant group holds 48 hostages, <a href=\"https://www.theguardian.com/world/2025/oct/11/hostages-gaza-israel-profiles\">20 of whom are believed to be alive</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/12/israel-and-gaza-prepare-for-release-of-hostages-and-prisoners\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Woman arrested on suspicion of murder after death of two children in Stafford",
      "link": "https://www.theguardian.com/uk-news/2025/oct/12/woman-arrested-on-suspicion-of-murder-after-death-of-two-children-in-stafford",
      "pub_time_taipei": "2025-10-12T19:07:53+08:00",
      "summary": "<p>Police say woman, 43, remains in custody after two children pronounced dead at a home in the town</p><p>A woman has been arrested on suspicion of murder after the deaths of two children in Stafford, Staffordshire police have said.</p><p>Police were called to a home in the town at about 7.30am on Sunday by West Midlands ambulance service.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/12/woman-arrested-on-suspicion-of-murder-after-death-of-two-children-in-stafford\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump officials reportedly consider selling student loan debt to private investors",
      "link": "https://www.theguardian.com/us-news/2025/oct/12/trump-sell-student-loan-debt",
      "pub_time_taipei": "2025-10-12T19:00:51+08:00",
      "summary": "<p>Experts say the move could eliminate the federal government’s power to cancel educational loans</p><p>Officials in the Trump administration are reportedly weighing the possibility of selling portions of the federal government’s $1.6tn student loan portfolio to private investors, which experts say could carry risks for both taxpayers and borrowers – potentially reshaping the student loan landscape in unpredictable ways.</p><p>Senior officials at the education and treasury departments have been engaged in internal conversations about offloading select, high-performing segments of the government’s student debt holdings, according to a <a href=\"https://www.politico.com/news/2025/10/07/trump-administration-selling-federal-student-loan-portfolio-00595456\">Politico</a> report this week. These loans are part of the larger portfolio owed by roughly 45 million borrowers nationwide.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/12/trump-sell-student-loan-debt\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chicagoans optimistic about annual marathon even amid violent Ice activity",
      "link": "https://www.theguardian.com/us-news/2025/oct/12/chicago-marathon-ice",
      "pub_time_taipei": "2025-10-12T19:00:50+08:00",
      "summary": "<p>‘We haven’t seen Ice attack any large-scale festivals directly,’ said a community leader from the Pilsen neighborhood</p><p>As marathoners gather at the starting line in <a href=\"https://www.theguardian.com/us-news/chicago\">Chicago</a> on Sunday morning, organizers, business owners and runners are cautiously optimistic that the increased Immigration and Customs Enforcement (<a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\">Ice</a>) activity the city has seen in recent weeks won’t dampen the celebrations.</p><p>The race will begin and end at Grant Park – the famous public park downtown where Chicago’s adopted son, <a href=\"https://www.theguardian.com/us-news/barack-obama\">Barack Obama</a>, gave his victory speech on election night in 2008 – and take in the shores of Lake Michigan and 29 city neighborhoods.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/12/chicago-marathon-ice\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The story behind the spy stories: show reveals secrets of John le Carré’s craft",
      "link": "https://www.theguardian.com/books/2025/oct/12/the-story-behind-the-spy-stories-show-reveals-secrets-of-john-le-carre-craft",
      "pub_time_taipei": "2025-10-12T18:48:11+08:00",
      "summary": "<p>How author researched his plots and letters from Alec Guinness feature in  Oxford exhibition </p><p>Lamplighters, pavement artists, babysitters – they have taken on whole new meanings thanks to John le Carré. As his fans will know, they are part of tradecraft practised by the spies he wrote about so evocatively. Now, almost five years after his death, an exhibition, with the title Tradecraft, reveals the techniques and motivations of the characters’ real creator, David Cornwell.</p><p>As you enter the exhibition in Oxford University’s Bodleian library you are greeted with a large portrait of Cornwell, wearing a black bucket cap, looking straight ahead with piercing eyes, his chin resting on his gently clasped hands. Accompanying the photo are two of his quotes. “I am not a spy who writes novels, I am a writer who briefly worked in the secret world,” one says. The second, after questioning whom, if anyone, we can trust, continues: “What is loyalty – to ourselves, to whom, to what? Whom, if anyone, can we love? And what is the caring individual’s relationship to the institutions he services?”</p> <a href=\"https://www.theguardian.com/books/2025/oct/12/the-story-behind-the-spy-stories-show-reveals-secrets-of-john-le-carre-craft\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza PhD student ‘heartbroken’ as family blocked from entering the UK",
      "link": "https://www.theguardian.com/global-development/2025/oct/12/manar-al-houbi-gaza-phd-student-family-blocked-from-entering-uk",
      "pub_time_taipei": "2025-10-12T18:00:48+08:00",
      "summary": "<p>Manar al-Houbi’s husband and children refused entry despite her winning a scholarship to cover tuition fees, living costs and housing for them all</p><p>A Gaza PhD student who won a fully funded scholarship to the University of Glasgow has spoken of her heartbreak at her family being denied entry to the UK.</p><p>In May, Manar al-Houbi received confirmation of her successful application. “It felt almost too good to be true,” she said. As well as her tuition fees, her scholarship from a charity, the Council for At Risk Academics (Cara), covers housing and living costs for her and all family members.</p> <a href=\"https://www.theguardian.com/global-development/2025/oct/12/manar-al-houbi-gaza-phd-student-family-blocked-from-entering-uk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australian Madeleine Habib released from Israeli jail after aid flotilla intercepted en route to Gaza",
      "link": "https://www.theguardian.com/world/2025/oct/12/australian-madeleine-habib-released-from-israeli-jail-after-aid-flotilla-intercepted-en-route-to-gaza",
      "pub_time_taipei": "2025-10-12T17:54:14+08:00",
      "summary": "<p>It’s not yet known if Habib signed waiver as demanded by Israel before being taken to Jordan border on Sunday</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australian woman <a href=\"https://www.theguardian.com/world/2025/oct/10/australian-woman-on-pro-palestinian-aid-flotilla-will-be-indefinitely-detained-by-israel-unless-she-signs-waiver\">Madeleine Habib</a> has been released from an Israeli prison, four days after a ship she captained as part of another Gaza-bound aid flotilla <a href=\"https://www.theguardian.com/world/2025/oct/08/israel-intercepts-another-gaza-aid-flotilla-amid-criticism-over-treatment-of-activists\">was intercepted by the Israeli military</a> in international waters.</p><p>A source close to Habib said she was released on Sunday morning Israel time, along with other activists from the freedom flotilla, and taken to the Jordan border.</p> <a href=\"https://www.theguardian.com/world/2025/oct/12/australian-madeleine-habib-released-from-israeli-jail-after-aid-flotilla-intercepted-en-route-to-gaza\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "These American athletes are finding a second home in South Korean sports",
      "link": "https://www.washingtonpost.com/sports/2025/10/12/south-korea-expat-athletes/",
      "pub_time_taipei": "2025-10-12T17:00:31+08:00",
      "summary": "Americans Austin Dean, Jameel Warney and Dustin Nippert all took a gamble on moving their professional sports careers to South Korea. It paid off."
    },
    {
      "source": "華盛頓郵報",
      "title": "Her grandma saved her from the Russians, then chose to say goodbye",
      "link": "https://www.washingtonpost.com/world/2025/10/12/ukraine-children-occupation-flee-russia-grandmother/",
      "pub_time_taipei": "2025-10-12T17:00:13+08:00",
      "summary": "The 9-year-old Ukrainian girl had been separated from her mother for more than three years, and now the two have to get to know each other all over again."
    },
    {
      "source": "衛報",
      "title": "Parliamentary staff of colour earn £2,000 less than white colleagues, study suggests",
      "link": "https://www.theguardian.com/inequality/2025/oct/12/parliamentary-staff-of-colour-earn-2000-less-than-white-colleagues-study-suggests",
      "pub_time_taipei": "2025-10-12T15:00:47+08:00",
      "summary": "<p>Exclusive: GMB union’s report also finds pay disparity for women and disabled, trans, non-binary and gay staffers working for MPs and peers</p><p>A race and gender pay gap among parliamentary staff means people of colour earn on average £2,000 less each year than their white counterparts, research seen by the Guardian suggests.</p><p>A study due to be released this week will say that parliamentary employees who have a range of protected characteristics under equality legislation are more likely to suffer disparities in pay.</p> <a href=\"https://www.theguardian.com/inequality/2025/oct/12/parliamentary-staff-of-colour-earn-2000-less-than-white-colleagues-study-suggests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Brummies united against racism’: poster campaign takes on the far right",
      "link": "https://www.theguardian.com/uk-news/2025/oct/12/brummies-united-against-racism-birmingham-poster-campaign-takes-on-the-far-right",
      "pub_time_taipei": "2025-10-12T14:00:44+08:00",
      "summary": "<p>A message of neighbourly solidarity is thriving in Birmingham against a backdrop of racist intimidation</p><p>When Mus unfurled the leaflet lying on her driveway, she was left shocked, angry and upset. “White Britons are already a minority in London … it is clear that if these trends continue white people will become a minority in Britain,” it read.</p><p>The leaflet, written by a far-right group, was distributed along her street three years ago in Moseley, a leafy suburb of Birmingham. It went on to blame NHS waiting lists, a shortage of social housing and even traffic on “the rising population”.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/12/brummies-united-against-racism-birmingham-poster-campaign-takes-on-the-far-right\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Climate-curious but confused? Grab a beer and some cards.",
      "link": "https://www.washingtonpost.com/climate-solutions/2025/10/12/fresk-climate-change-ipcc-games/",
      "pub_time_taipei": "2025-10-12T14:00:21+08:00",
      "summary": "Fresk converts the latest climate science into a hands-on card game, helping players understand the causes, effects and feedback loops of climate change."
    },
    {
      "source": "衛報",
      "title": "Restitution row: how Nigeria’s new home for the Benin bronzes ended up with clay replicas",
      "link": "https://www.theguardian.com/news/ng-interactive/2025/oct/12/restitution-row-how-nigerias-new-home-for-the-benin-bronzes-ended-up-with-clay-replicas",
      "pub_time_taipei": "2025-10-12T13:00:44+08:00",
      "summary": "<p>The public display of artefacts looted by British colonial forces at the new Museum of West African Art was supposed to be the crowning glory of a decades-long restitution effort. What went wrong?</p><p>In a corner of the new Museum of West African Art, visitors can marvel at a sample display of the cultural treasures that adorned the royal palace that once stood in its place: a proud cockerel, a plaque with three mighty warriors, a bust of a king with a glorious beaded collar.</p><p>The artefacts, collectively known as the Benin bronzes, were looted by British colonial forces who went on to burn down the palace in a punitive expedition in 1897. In the decades that followed they were scattered across collections in Europe and America.</p> <a href=\"https://www.theguardian.com/news/ng-interactive/2025/oct/12/restitution-row-how-nigerias-new-home-for-the-benin-bronzes-ended-up-with-clay-replicas\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "European far right follows Trump in calling for antifa to be declared terrorists",
      "link": "https://www.theguardian.com/world/2025/oct/12/european-far-right-follows-trump-in-calling-for-antifa-to-be-declared-terrorists",
      "pub_time_taipei": "2025-10-12T13:00:44+08:00",
      "summary": "<p>Netherlands and Hungary move towards designation as draft resolution reportedly backed by 79 MEPs in 20 countries</p><p>Where Donald Trump leads, Europe’s nationalists and far right follow. After a Truth Social post last month, when Trump announced the US would designate <a href=\"https://www.theguardian.com/us-news/2025/sep/23/what-is-antifa-meaning-trump\">antifa</a>, the decentralised anti-fascist movement,<a href=\"https://www.theguardian.com/us-news/2025/sep/17/trump-antifa-terrorist-organization\"> “a major terrorist organisation”</a>, his international allies swung into action.</p><p>That same day, the Dutch parliament, where the largest party is Geert Wilders’ far-right PVV, passed a resolution, noting the US decision and calling on the government to declare antifa a terrorist organisation in the Netherlands.</p> <a href=\"https://www.theguardian.com/world/2025/oct/12/european-far-right-follows-trump-in-calling-for-antifa-to-be-declared-terrorists\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Cameroon’s 92-year-old president set for another term as country goes to polls",
      "link": "https://www.theguardian.com/world/2025/oct/12/cameroon-president-paul-biya-favourite-win-election",
      "pub_time_taipei": "2025-10-12T12:00:42+08:00",
      "summary": "<p>Paul Biya, in power since 1982, has brushed off calls to retire but is rarely seen in public</p><p>Cameroon goes to the polls on Sunday for a presidential election with Paul Biya, <a href=\"https://www.theguardian.com/world/2025/jul/20/worlds-oldest-president-paul-biya-cameroon-election\">already the world’s oldest head of state</a> at the age of 92, the favourite to win an eighth term in power in the central African country.</p><p>A fractured opposition of 11 candidates is standing against Biya, who, despite his advanced age and declining health, has dismissed calls for him to retire.</p> <a href=\"https://www.theguardian.com/world/2025/oct/12/cameroon-president-paul-biya-favourite-win-election\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chicago TV journalist pushed to ground and arrested during Ice raid, then later released",
      "link": "https://www.theguardian.com/us-news/2025/oct/10/chicago-ice-raid-arrest",
      "pub_time_taipei": "2025-10-12T06:52:20+08:00",
      "summary": "<p>Witnesses call arrest of video editor Debbie Brockman, a US citizen, by masked federal agents ‘absolutely horrifying’</p><p>A video editor and producer for <a href=\"https://www.theguardian.com/us-news/chicago\">Chicago</a>’s WGN television station was arrested by masked federal agents on Friday morning, and later released, during an Ice raid on the city’s North Side, as shown in videos shared widely on social media.</p><p>Videos show Debbie Brockman being violently forced to the ground by two agents before she is handcuffed and put in a van. A local resident filming the incident asks her name while she is face down on the street being handcuffed.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/10/chicago-ice-raid-arrest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Heavy clashes erupt along Pakistan-Afghanistan border",
      "link": "https://www.theguardian.com/world/2025/oct/11/heavy-clashes-erupt-along-pakistan-afghanistan-border",
      "pub_time_taipei": "2025-10-12T06:30:40+08:00",
      "summary": "<p>Escalation comes after Pakistani airstrike in Kabul, with Taliban launching reprisals against military posts</p><p>Intense clashes erupted along the Pakistan-Afghanistan border on Saturday night after an attack by the Taliban on Pakistani military posts.</p><p>This escalation comes after a Pakistani airstrike in Kabul this week, as reported by security officials from both nations.</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/heavy-clashes-erupt-along-pakistan-afghanistan-border\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Egypt confirms international leaders’ summit on Monday to discuss Gaza ceasefire - as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
      "pub_time_taipei": "2025-10-12T06:12:54+08:00",
      "summary": "<p>More than 500,000 Palestinians return to destruction in Gaza City as 20 world leaders, including Trump, prepare for talks. This blog is now closed.</p><p><strong><a href=\"https://www.theguardian.com/profile/malak-a-tantesh\">Malak A Tantesh</a></strong>, a young reporter who has contributed to the Guardian’s coverage, has written about a harrowing two years in besieged <strong>Gaza</strong>. You can read her account here:</p><p>The <strong>Trump</strong> plan calls for <strong>Israel</strong> to maintain an open-ended military presence inside <strong>Gaza</strong>, along its border with Israel. An international force, comprised largely of <strong>troops from Arab and Muslim countries</strong>, would be responsible for security inside Gaza. The <strong>US</strong> would lead a large internationally funded reconstruction effort, reports the Associated Press (AP).<br /><br />\n The plan envisions an eventual role for the <strong>Palestinian Authority</strong> – something Israeli prime minister <strong>Benjamin Netanyahu</strong> has long opposed. But it requires the authority, which administers parts of the <strong>West Bank</strong>, to undergo a sweeping reform programme that could take years.<br /><br />\n According to the AP, the <strong>Trump</strong> plan is even more vague about a future <strong>Palestinian state</strong>, which Netanyahu firmly rejects.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Gaza ceasefire holds; sides await release of hostages, prisoners",
      "link": "https://www.washingtonpost.com/world/2025/10/11/gaza-ceasefire-israel-hamas-hostage-release/",
      "pub_time_taipei": "2025-10-12T05:23:11+08:00",
      "summary": "Key steps to be executed in the next few days will determine whether the deal between Israel and Hamas can lead to a lasting peace."
    },
    {
      "source": "衛報",
      "title": "Soldiers from elite Capsat unit join protests against Madagascar’s president",
      "link": "https://www.theguardian.com/world/2025/oct/11/soldiers-from-elite-capsat-unit-join-protests-against-madagascars-president",
      "pub_time_taipei": "2025-10-12T01:29:39+08:00",
      "summary": "<p>Demonstrators march alongside regiment, who earlier in the day said they would not fire on the crowds</p><p>Madagascar’s prime minister called for calm after an elite group of soldiers joined thousands of protesters against the country’s president on the streets of the capital on Saturday afternoon.</p><p>Protesters marched alongside soldiers from the Capsat unit, who drove armoured vehicles, some waving Madagascar flags, from their base in Soanierana in the south of Antananarivo.</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/soldiers-from-elite-capsat-unit-join-protests-against-madagascars-president\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Zelenskyy urges Trump to use Gaza ceasefire momentum to broker peace in Ukraine",
      "link": "https://www.theguardian.com/world/2025/oct/11/zelenskyy-urges-trump-to-use-gaza-ceasefire-momentum-to-broker-peace-in-ukraine",
      "pub_time_taipei": "2025-10-11T23:41:21+08:00",
      "summary": "<p>Ukrainian leader discussed request for Tomahawk cruise missiles in phone call with US president</p><p>Ukraine’s president, Volodymyr Zelenskyy, urged Donald Trump to use the momentum of the Gaza ceasefire to broker peace in Ukraine, as the two leaders spoke by phone on Saturday.</p><p>Trump and Zelenskyy discussed Ukraine’s request for the US to allow the delivery of Tomahawk cruise missiles to bolster Kyiv’s ability to conduct long-range strikes inside Russia, among other issues, according to <a href=\"https://www.axios.com/2025/10/11/zelensky-trump-tomahawk-missiles-ukraine\">Axios</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/zelenskyy-urges-trump-to-use-gaza-ceasefire-momentum-to-broker-peace-in-ukraine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The Gaza effect: how a global pro-Palestine protest movement met repression and resistance",
      "link": "https://www.theguardian.com/world/2025/oct/11/the-gaza-effect-how-a-global-pro-palestine-protest-movement-met-repression-and-resistance",
      "pub_time_taipei": "2025-10-11T22:04:49+08:00",
      "summary": "<p>Across the west, solidarity marches are testing governments’ tolerance for dissent. From arrests to bans, free-speech boundaries are shifting</p><p>The ceasefire between Hamas and Israel has been met with joy and relief across the Middle East and beyond. Over the past two years, outrage at Israel’s war in Gaza has erupted across Europe and the US, manifesting itself in university campus protests, massive marches through countless capitals and the disruption of major sporting events.</p><p>Even as hopes rise of an end to the war, international anger over Israel’s actions in Gaza, which have been deemed a <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-committed-genocide-in-gaza-says-un-inquiry\">genocide by a UN commission of inquiry</a>, remains raw, as evidenced by last weekend’s <a href=\"https://apnews.com/article/europe-gaza-war-israel-protests-spain-italy-fdf6f3358912326c6255ae6b68145a0b\">huge rallies in Spain and Italy</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/the-gaza-effect-how-a-global-pro-palestine-protest-movement-met-repression-and-resistance\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Arab states expanded cooperation with Israeli military during Gaza war, files show",
      "link": "https://www.washingtonpost.com/national-security/2025/10/11/us-israel-arab-military-leaked-documents/",
      "pub_time_taipei": "2025-10-11T22:04:47+08:00",
      "summary": "Documents from U.S. Central Command show meetings over the past three years between Israeli and Arab military officials to coordinate on regional threats."
    },
    {
      "source": "衛報",
      "title": "Militia strikes kill at least 60 in Sudan displacement camp, says El Fasher group",
      "link": "https://www.theguardian.com/world/2025/oct/11/militia-drone-strike-kills-people-at-displacement-shelter-in-sudan-says-local-group",
      "pub_time_taipei": "2025-10-11T21:26:15+08:00",
      "summary": "<p>Drone and artillery strikes by RSF paramilitaries hit Dar al-Arqam shelter in western city, says resistance committee</p><p>Militia drone and artillery strikes have killed at least 60 people at a displacement shelter in the besieged city of El Fasher in western Sudan, a local activist group has said.</p><p>The resistance committee for El Fasher said the Rapid Support Forces (RSF) paramilitary group hit the Dar al-Arqam displacement centre, which is in the grounds of a university.</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/militia-drone-strike-kills-people-at-displacement-shelter-in-sudan-says-local-group\">Continue reading...</a>"
    }
  ]
}