{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-29T20:40:08.641722+08:00",
  "window_end_taipei": "2025-10-30T20:40:08.641722+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Tories call for Reeves to be sacked after breaking home rental rules but PM rules out investigation – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates",
      "pub_time_taipei": "2025-10-30T20:24:09+08:00",
      "summary": "<p>Reeves has been renting out her south London home without the specific £945 licence required by the local council</p><p><strong>Robert Peston</strong>, ITV’s political editor, says he thinks it is a mistake for the Conservatives to be saying Rachel Reeves should have to resign over the rental licence error. He explains why in <a href=\"https://x.com/Peston/status/1983814792549716039\">a post on social media</a>. Here is an extract.</p><p>Kemi Badenoch’s call for Starmer to sack Reeves, for failing to register her family home when she rented it on moving to Downing Street, lowers the bar quite significantly for sackable offences by ministers. I am not certain all her shadow cabinet colleagues will thank her.</p><p>The point is that there is a clear distinction between Rayner’s failure to take stamp duty advice and Reeves’s failure to register her home with the council for rent.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Five more suspects detained in Louvre heist, Paris prosecutor says",
      "link": "https://www.washingtonpost.com/world/2025/10/29/louvre-heist-suspect-partially-admit-involvement/",
      "pub_time_taipei": "2025-10-30T20:12:32+08:00",
      "summary": "None of France’s crown jewels have been recovered, though Paris’s public prosecutor said she remains hopeful they will be returned."
    },
    {
      "source": "衛報",
      "title": "Birmingham city council was probably never bankrupt, says accountancy expert",
      "link": "https://www.theguardian.com/society/2025/oct/30/birmingham-city-council-bankruptcy-spending-cuts-accountancy-expert",
      "pub_time_taipei": "2025-10-30T20:09:40+08:00",
      "summary": "<p>Declaration in 2023 that led to spending cuts was based on underestimation of reserves of more than £1bn, shows fresh analysis</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates\">UK politics live – latest updates</a></p></li></ul><p>Birmingham city council was “likely never bankrupt” and the decision to issue the section 114 notice two years ago was “based on unaudited and materially incorrect information”, accounting experts have claimed.</p><p>The Labour-run council issued a section 114 notice<a href=\"https://www.theguardian.com/society/2023/sep/05/birmingham-city-council-financial-distress-budget-section-114\"> in September 2023,</a> effectively declaring itself bankrupt, triggering a wave of spending cuts and plans to sell off £750m worth of assets. This prompted the government to appoint commissioners to run the council for five years.</p> <a href=\"https://www.theguardian.com/society/2025/oct/30/birmingham-city-council-bankruptcy-spending-cuts-accountancy-expert\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump-Xi meeting shows price of confrontation was too high for both sides",
      "link": "https://www.theguardian.com/us-news/2025/oct/30/trump-xi-jinping-meeting-us-china-price-confrontation",
      "pub_time_taipei": "2025-10-30T20:06:28+08:00",
      "summary": "<p>Outcome appears closer to truce than durable peace but outline of broader diplomatic relationship is visible</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\">Trump meets Xi in South Korea – live updates</a></p></li></ul><p>When Donald Trump launched his trade war against China in April, threatening tariffs as high as 145%, the Chinese government said it would never bow to blackmail and vowed to “fight to the end”.</p><p>The question now is whether the <a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade\">consensus reached between Trump and Xi Jinping</a> in Busan, South Korea, on Thursday means that the fight really has come to an end, and if so on whose terms.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-xi-jinping-meeting-us-china-price-confrontation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Donald Trump says rare earths dispute ‘settled’ and China to resume buying US soybeans after Xi Jinping talks – live",
      "link": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
      "pub_time_taipei": "2025-10-30T20:00:31+08:00",
      "summary": "<p>China leader says ‘consensus’ reached on trade issues as concerns raised over US president’s order to Pentagon to start nuclear weapons testing</p><p>In the days leading up to the Trump-Xi meeting, American officials signalled that the US president did not intend to make good on a recent threat to impose an additional 100% import tax on Chinese goods.</p><p>Also that China had shown signs it is willing to relax its export controls on rare earths as well as revive buying soybeans from the US.</p><p>The relationship with China is very good.</p><p>Because of the tremendous destructive power, I HATED to do it, but had no choice! Russia is second, and China is a distant third, but will be even within 5 years.</p><p>Because of other countries testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis. That process will begin immediately.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Toxin levels in fish lead to calls for UK-wide ban on mercury dental fillings",
      "link": "https://www.theguardian.com/environment/2025/oct/30/toxin-levels-in-fish-lead-to-calls-for-uk-wide-ban-on-mercury-dental-fillings",
      "pub_time_taipei": "2025-10-30T20:00:01+08:00",
      "summary": "<p>Exclusive: More than 98% of fish and mussels tested in English waters contain mercury above EU safety limits</p><p>Britain is facing mounting pressure to ban mercury dental fillings, one of the few countries yet to prevent the practice, as new data reveals alarming contamination levels in the nation’s fish and shellfish.</p><p>Mercury is a potent neurotoxin that can harm the nervous, digestive and immune systems, as well as the lungs, kidneys, skin and eyes, even at low levels of exposure. Its organic form, methylmercury, is particularly dangerous to unborn babies and can move through the food chain building up in insects, fish and birds.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/30/toxin-levels-in-fish-lead-to-calls-for-uk-wide-ban-on-mercury-dental-fillings\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Geert Wilders faces shutout as centrists hail huge gains in knife-edge Dutch election",
      "link": "https://www.theguardian.com/world/2025/oct/30/geert-wilders-faces-shutout-centrists-dutch-election-netherlands",
      "pub_time_taipei": "2025-10-30T19:58:37+08:00",
      "summary": "<p>Far right is neck-and-neck with liberal D66 but all major mainstream parties have ruled out working with anti-Islam firebrand  </p><p>Geert Wilders is almost certain to be shut out of the next Dutch government after a knife-edge general election in which support for his far-right Freedom party (PVV) slumped and the liberal-progressive D66 party made spectacular gains.</p><p>With more than 98% of votes counted from <a href=\"https://www.theguardian.com/world/2025/oct/29/exit-poll-suggests-progressive-d66-party-will-become-largest-in-dutch-parliament\">Wednesday’s election</a>, the two parties were neck-and-neck on a projected 26 seats each in the Netherlands’ 150-seat parliament, with the difference between them only a couple of thousand votes.</p> <a href=\"https://www.theguardian.com/world/2025/oct/30/geert-wilders-faces-shutout-centrists-dutch-election-netherlands\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "German dentists hold memorial recognising sadistic practices of profession under Nazis",
      "link": "https://www.theguardian.com/world/2025/oct/30/german-dentists-memorial-recognising-sadistic-practices-under-nazis",
      "pub_time_taipei": "2025-10-30T19:41:29+08:00",
      "summary": "<p>Recent studies have exposed theft of gold fillings, excruciating extractions, human experiments and  forced sterilisations</p><p>German dentists have offered a belated acknowledgment of their profession’s brutal practices under the Nazis, admitting broad “systemic” involvement in crimes at concentration camps including sadistic tooth extractions, human experiments, forced sterilisations and murder.</p><p>Their central professional organisation, the German Society for Dental, Oral and Orthodontic Medicine (DGZMK), held its first memorial ceremony exposing the atrocities committed by dentists during the Nazi era and paying tribute to the victims, at Berlin’s Humboldt University on Wednesday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/30/german-dentists-memorial-recognising-sadistic-practices-under-nazis\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tories will not deport legally settled people, Badenoch clarifies",
      "link": "https://www.theguardian.com/politics/2025/oct/30/tories-will-not-deport-legally-settled-people-kemi-badenoch-katie-lam",
      "pub_time_taipei": "2025-10-30T19:41:16+08:00",
      "summary": "<p>Katie Lam spoke ‘imprecisely’ in stating large number of people would ‘need to go home’, says Conservative leader  </p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates\">UK politics live – latest updates</a></p></li></ul><p>The Conservative MP Katie Lam spoke “imprecisely” in stating the party would deport large numbers of legally settled families from the UK, Kemi Badenoch said, adding she had no plans to make tougher immigration rules retrospective.</p><p>Badenoch’s comments to reporters after a speech in London end days of confusion over Tory migration policy, particularly over whether many thousands of people who have made lives in the UK could lose their status of indefinite leave to remain (ILR) under a future Conservative government.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/30/tories-will-not-deport-legally-settled-people-kemi-badenoch-katie-lam\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Dutch election results: far-right and centrist parties in dead heat as last votes counted – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/30/dutch-election-results-netherlands-geert-wilders-rob-jetten-france-louvre-russia-poland-ukraine-latest-news-updates",
      "pub_time_taipei": "2025-10-30T19:33:59+08:00",
      "summary": "<p>Geert Wilders’s PVV and Rob Jetten’s D66 in effect tied as centrist party expected to lead talks to form next coalition</p><p>And <strong>Wilders</strong> struck a similar tone in <a href=\"https://x.com/geertwilderspvv/status/1983772722879459419\">his earlier social media update</a>, saying that <strong>his party would want to have a go at forming the next government</strong> if it was confirmed as the largest party.</p><p>It’s <strong>not immediately clear how this could work</strong> given all other major parties ruled out a coalition with his PVV party, but his comments suggest a slight change of heart on the back of the closer than previously anticipated results – last night he said he did not expect to be involved in the next government.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/30/dutch-election-results-netherlands-geert-wilders-rob-jetten-france-louvre-russia-poland-ukraine-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "WPP jobs at risk as ad group’s new boss condemns ‘unacceptable’ performance",
      "link": "https://www.theguardian.com/media/2025/oct/30/wpp-jobs-at-risk-as-ad-groups-new-boss-condemns-unacceptable-performance",
      "pub_time_taipei": "2025-10-30T19:30:07+08:00",
      "summary": "<p>Review launched after firm struggles to stem exodus of clients and compete with AI and data capabilities of rivals</p><p>Jobs at WPP could be at risk as its new chief executive launched a review designed to revive the advertising group’s fortunes after a fresh profit warning.</p><p>Cindy Rose announced the review on Thursday, saying she was taking action to address “unacceptable” performance at the company, which has <a href=\"https://www.theguardian.com/business/2025/oct/20/whats-gone-wrong-at-wpp-crown-slips-worlds-biggest-advertising-group\">struggled to stem a growing exodus of clients</a> and compete with the <a href=\"https://www.theguardian.com/technology/2025/jun/09/ai-advertising-industry-google-facebook-meta-ads\">AI and data capabilities</a> of its rivals.</p> <a href=\"https://www.theguardian.com/media/2025/oct/30/wpp-jobs-at-risk-as-ad-groups-new-boss-condemns-unacceptable-performance\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK rule change allows Palestinian scholars to bring families from Gaza",
      "link": "https://www.theguardian.com/education/2025/oct/30/uk-rule-change-allows-palestinian-scholars-to-bring-families-from-gaza-university-students",
      "pub_time_taipei": "2025-10-30T19:10:17+08:00",
      "summary": "<p>Previous visa policy had forced the students ‘to choose between their education and their family’</p><p>Palestinian students taking up scholarships at UK universities will be allowed to bring their families from Gaza with them after the government said it would consider case-by-case exemptions.</p><p>The students had previously been unable to take up their scholarships because they were barred from bringing their children or dependents by existing student visa policies.</p> <a href=\"https://www.theguardian.com/education/2025/oct/30/uk-rule-change-allows-palestinian-scholars-to-bring-families-from-gaza-university-students\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Revealed: ICE violates its own policy by holding people in secretive rooms for days or weeks",
      "link": "https://www.theguardian.com/us-news/2025/oct/30/ice-hidden-detention-sites",
      "pub_time_taipei": "2025-10-30T19:00:55+08:00",
      "summary": "<p>Guardian analysis finds ICE increasingly keeps people in holding rooms with little oversight, as some facilities see a 600% rise in detention length</p><p>Immigration officials have been increasingly detaining people in small, secretive holding facilities for days or even weeks at a time in violation of federal policy, a Guardian investigation has found.</p><p>These holding facilities – located at ICE offices, in federal buildings and other locations around the country – are typically used to detain people after they have been arrested but before they are transferred or released. In many cases, they consist of small concrete rooms with no beds and are designed to only be used for a few hours.</p><p>ICE has used at least 170 ICE holding facilities nationwide, including at 25 ICE field offices.</p><p>The Trump administration and its campaign of mass deportation has led to a near across the board increase in the time people are forced to spend in detention in holding rooms. After Donald Trump’s inauguration, the average time that people spend in detention increased at 127 hold rooms across the country.</p><p>Despite ICE’s rule change in June, the agency is continuing to violate its own policy by detaining people at these sites for multiple days at a time.</p><p>In some cases, such as a New York City holding facility located on the 10th floor of a federal building in downtown Manhattan, time in detention increased by nearly 600% on average after the June rule change.</p><p>In one case the Guardian discovered by looking through agency data, ICE documented that a 62-year-old man was held inside that same New York City holding facility for two and a half months.</p><p>The Guardian also found an additional 63 people at the site who were held there for longer than one week, between Trump’s inauguration and late July.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/30/ice-hidden-detention-sites\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Melissa hurtles toward Bermuda, will fuel downpours in Northeast U.S.",
      "link": "https://www.washingtonpost.com/world/2025/10/30/melissa-hurricane-northeast-us-bermuda/",
      "pub_time_taipei": "2025-10-30T18:47:05+08:00",
      "summary": "Melissa, now a Category 2 hurricane, will bring heavy rain from the Mid-Atlantic to New England as it heads toward Bermuda and Newfoundland, Canada."
    },
    {
      "source": "華盛頓郵報",
      "title": "Dutch voters deliver rebuke to the far-right in knife-edge election",
      "link": "https://www.washingtonpost.com/world/2025/10/30/netherlands-election-results-geert-wilders-rob-jetten/",
      "pub_time_taipei": "2025-10-30T18:40:52+08:00",
      "summary": "The centrist D66 party nearly tripled its seats, while Geert Wilders’ right-wing party suffered a drop from its shocking first-place finish in 2023."
    },
    {
      "source": "衛報",
      "title": "Reeves should be sacked if she broke house rental rules, says Badenoch",
      "link": "https://www.theguardian.com/politics/2025/oct/30/reeves-should-be-sacked-if-she-broke-house-rental-rules-says-badenoch",
      "pub_time_taipei": "2025-10-30T18:36:35+08:00",
      "summary": "<p>Tory leader says chancellor should have been on top of paperwork when she rented out her south London home</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates\">UK politics live – latest updates</a></p></li></ul><p>Rachel Reeves must be sacked as chancellor if she broke any laws in failing to get a licence to rent out her south London home, Kemi Badenoch has said, arguing that it was up to the chancellor to have been on top of the necessary paperwork.</p><p>With pressure building on Reeves despite Keir Starmer saying he believed the chancellor’s <a href=\"https://www.theguardian.com/politics/2025/oct/29/rachel-reeves-admits-breaking-rules-by-renting-out-her-house-without-a-licence\">apology for</a> an “inadvertent” breach of Southwark council’s rules was sufficient, Badenoch said this was not the end of the matter.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/30/reeves-should-be-sacked-if-she-broke-house-rental-rules-says-badenoch\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump directs Pentagon to test nuclear weapons for first time since 1992",
      "link": "https://www.washingtonpost.com/politics/2025/10/29/trump-nuclear-test-plans/",
      "pub_time_taipei": "2025-10-30T18:28:52+08:00",
      "summary": "The president said he wanted testing to occur “on an equal basis” with Russia and China. The Kremlin condemned the move, and there was no indication on when tests might take place."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump cuts tariffs on China after ‘truly great’ meeting with Xi",
      "link": "https://www.washingtonpost.com/politics/2025/10/30/trump-xi-meeting-tariff-cuts/",
      "pub_time_taipei": "2025-10-30T18:03:50+08:00",
      "summary": "China’s leader agreed to delay restrictions on rare earth minerals for a year and buy more soybeans, Trump said after a meeting designed to calm trade tensions."
    },
    {
      "source": "衛報",
      "title": "Extremists exploit political ‘trigger events’ to recruit people online, says study",
      "link": "https://www.theguardian.com/us-news/2025/oct/30/extremists-political-violence-online",
      "pub_time_taipei": "2025-10-30T17:00:57+08:00",
      "summary": "<p>NYU report monitored social feeds and found groups call for retaliatory action after politically motivated violent events</p><p>Extremists are exploiting political violence on online platforms to recruit new people to their causes and amplify the use of violence for political goals, according to a new report that monitored social platforms after recent attacks.</p><p>Researchers at New York University’s Stern Center for Business and Human Rights tracked social media feeds for several months this year, including in the aftermath of <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">Charlie Kirk’s assassination</a>.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/30/extremists-political-violence-online\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Can a sense of humor get Albania into the E.U.?",
      "link": "https://www.washingtonpost.com/world/2025/10/30/albania-eu-florjan-binaj-mayor-edi-rama/",
      "pub_time_taipei": "2025-10-30T17:00:10+08:00",
      "summary": "Once known as a Stalinist backwater, Albania is now a front-runner for E.U. accession and has a comedian running for mayor of its capital."
    },
    {
      "source": "衛報",
      "title": "Trump directs Pentagon to match Russia and China in nuclear weapons testing",
      "link": "https://www.theguardian.com/us-news/2025/oct/29/trump-pentagon-us-nuclear-weapons",
      "pub_time_taipei": "2025-10-30T16:58:40+08:00",
      "summary": "<p>US president makes threat after Russian nuclear-powered weapons tests and shortly before meeting with Chinese leader</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\">Trump meets Xi in South Korea – latest updates</a></p></li></ul><p>Donald Trump has instructed the Pentagon to immediately start matching other nuclear powers in their testing of nuclear weapons, specifically citing Russia and China.</p><p>In a <a href=\"https://truthsocial.com/@realDonaldTrump/posts/115460423936412555\">post to Truth Social</a>, Trump said “because of other countries’ testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis. That process will begin immediately.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/29/trump-pentagon-us-nuclear-weapons\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Geert Wilders convinced Dutch voters the far right could run the country. What is their verdict now?",
      "link": "https://www.theguardian.com/world/2025/oct/29/geert-wilders-convinced-dutch-voters-the-far-right-could-run-the-country-what-is-their-verdict-now",
      "pub_time_taipei": "2025-10-30T16:56:58+08:00",
      "summary": "<p>A failed two-year experiment has lessons for the rest of Europe about the appeal – and the limits – of populism</p><p><em>• </em><a href=\"https://www.theguardian.com/commentisfree/2018/mar/22/this-is-europe-sign-up-guardian-email-updates\"><em>Don’t get This Is Europe delivered to your inbox? Sign up here</em></a></p><p>What happens when you put far-right populists in charge? Entrusted with ministerial responsibilities, can they deliver the radical solutions that they often preach? Or do they, sooner or later, when faced with complex policy dilemmas, end up self-destructing, leaving an even bigger mess in their wake?</p><p>That is the question <a href=\"https://www.theguardian.com/world/live/2025/oct/29/netherlands-parliamentary-election-geert-wilders-europe-latest-news-updates\">Dutch voters</a> had to weigh on Wednesday after a tumultuous two-year experiment in which Geert Wilders’ far-right Freedom Party (PVV) entered a rightwing coalition to run the Netherlands for the first time.</p> <a href=\"https://www.theguardian.com/world/2025/oct/29/geert-wilders-convinced-dutch-voters-the-far-right-could-run-the-country-what-is-their-verdict-now\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump-Xi meeting: US president says rare earths deal and tariff cut agreed",
      "link": "https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade",
      "pub_time_taipei": "2025-10-30T16:20:53+08:00",
      "summary": "<p>Donald Trump hails ‘amazing’ trade talks with Chinese counterpart, with ‘no roadblock at all on rare earth’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\">Trump meets Xi in South Korea – live updates</a></p></li></ul><p>Donald Trump has described crucial trade talks with the Chinese president in South Korea as “amazing”, saying their dispute over the <a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade\">supply of rare earths</a> had been settled and that he would visit China in April.</p><p>Xi Jinping has not commented on Thursday’s discussions but noted that the economic and trade teams from both countries had “reached a basic consensus on addressing our respective major concerns” during recent talks in Kuala Lumpur, according to Chinese state media. That had “provided the necessary conditions” for their meeting on Thursday, he added.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Queensland to create public register of sex offenders as Daniel Morcombe’s parents ‘hope it will go national’",
      "link": "https://www.theguardian.com/australia-news/2025/oct/30/queensland-to-create-public-register-of-sex-offenders-as-daniel-morcombes-parents-hope-it-will-go-national",
      "pub_time_taipei": "2025-10-30T16:14:44+08:00",
      "summary": "<p>Bruce and Denise Morcombe call on other states to act as LNP passes ‘Daniel’s law’, allowing public naming of some child sexual abusers</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Queensland parliament has passed laws to create the state’s first public register of some child sexual abusers, with the new legislation named in memory of child murder victim Daniel Morcombe.</p><p>The move adds momentum to a campaign by Daniel’s parents, Bruce and Denise Morcombe, for a national register. The couple founded the child safety education charity the Daniel Morcombe Foundation after the murder of their 13-year-old son in 2003 by paedophile Brett Peter Cowan.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/30/queensland-to-create-public-register-of-sex-offenders-as-daniel-morcombes-parents-hope-it-will-go-national\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "State disability ministers threaten Butler with boycott over two-minute speaking limit at NDIS meeting",
      "link": "https://www.theguardian.com/australia-news/2025/oct/30/state-disability-ministers-threaten-mark-butler-boycott-ndis",
      "pub_time_taipei": "2025-10-30T15:53:26+08:00",
      "summary": "<p>Ministers say they will reconsider their attendance at the meeting if they get at least 10 minutes each</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>State and territory disability ministers have threatened to boycott an upcoming NDIS meeting with the Albanese government after being given just two minutes to contribute to discussions.</p><p>In a joint letter from all jurisdictions sent on Thursday to the health and disability minister, Mark Butler, and the NDIS minister, Jenny McAllister, ministers warned they were “no longer able to confirm” their attendance at the meeting next Friday unless given the opportunity to “meaningfully contribute”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/30/state-disability-ministers-threaten-mark-butler-boycott-ndis\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "A look at past nuclear weapons tests in Russia, China and the U.S.",
      "link": "https://www.washingtonpost.com/national-security/2025/10/30/trump-us-nuclear-tests-china-russia/",
      "pub_time_taipei": "2025-10-30T15:34:05+08:00",
      "summary": "Trump said the U.S. will test nuclear weapons “on an equal basis” with Russia and China. None of the three countries has tested live nuclear weapons since the 1990s."
    },
    {
      "source": "衛報",
      "title": "New record as Senate question time blows out into chaotic marathon over transparency fight",
      "link": "https://www.theguardian.com/australia-news/2025/oct/30/david-pocock-murray-watt-labor-coalition-senate-transparency-debate-question-time-extended",
      "pub_time_taipei": "2025-10-30T15:30:24+08:00",
      "summary": "<p>Labor government loses control of chamber and threatens to strip Coalition members from parliamentary committees</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>In chaotic Senate scenes, Labor has set a 125-year record by keeping question time running for more than three hours, after the government lost control of the chamber and threatened to strip Coalition members from parliamentary committees in a fight over transparency.</p><p>Senator <a href=\"https://www.theguardian.com/australia-news/audio/2025/oct/13/what-pococks-ban-from-parliaments-sport-club-says-about-lobbying-full-story-podcast\">David Pocock</a> led a push to dramatically extend question time and force ministers to answer more questions, with the Coalition, Greens and crossbench defying the government to force changes to long-held conventions and rules in the upper house. It was a rare move which Labor minister Murray Watt labelled a “dummy spit”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/30/david-pocock-murray-watt-labor-coalition-senate-transparency-debate-question-time-extended\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Former Adelaide MP named new ALP president – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb",
      "pub_time_taipei": "2025-10-30T15:22:50+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/30/david-pocock-murray-watt-labor-coalition-senate-transparency-debate-question-time-extended\">New record as Senate question time blows out into chaotic marathon over transparency fight</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Australians should be ‘alarmed’ if Labor negotiates with Greens on environment bill</strong></p><p>I told you it would be environment-heavy didn’t I!</p><p>I think Australians should be alarmed at the thought that Labor would go to the Greens and do a deal on this, because our country would be much worse off. Let’s look at the wealth of our nation and where that wealth has come from. Let’s look at where the money goes from mining into the coffers of state governments, and how they then deliver on hospitals and schools around their nation and infrastructure … We are a long way from doing a deal with Labor on this.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘They killed civilians in their beds’: chaos and brutality reign after fall of El Fasher",
      "link": "https://www.theguardian.com/global-development/2025/oct/30/they-killed-civilians-in-their-beds-chaos-and-brutality-reign-after-fall-of-el-fasher",
      "pub_time_taipei": "2025-10-30T14:00:54+08:00",
      "summary": "<p>Thousands have fled the Sudanese city in terror with stories of the Rapid Support Forces attacking and killing civilians</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/29/hundreds-reportedly-killed-at-sudanese-hospital-as-evidence-of-rsf-atrocities-mounts\">Hundreds reportedly killed at Sudanese hospital as evidence of RSF atrocities mounts</a></p></li></ul><p>Nawal Khalil had been volunteering as a nurse for three years at El Fasher South hospital when the Sudanese city was <a href=\"https://www.theguardian.com/world/2025/oct/27/fears-civilians-sudan-paramilitary-rsf-capture-el-fasher\">captured on Sunday</a> by the Rapid Support Forces (RSF). She was busy treating patients, including an elderly woman who needed a blood transfusion, when the attack began.</p><p>“They killed six wounded soldiers and civilians in their beds – some of them women,” she says. “I don’t know what happened to my other patients. I had to run when they stormed the hospital.”</p> <a href=\"https://www.theguardian.com/global-development/2025/oct/30/they-killed-civilians-in-their-beds-chaos-and-brutality-reign-after-fall-of-el-fasher\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "4 killed in strike on another boat U.S. alleges was carrying illegal drugs",
      "link": "https://www.washingtonpost.com/national-security/2025/10/30/hegseth-narcotics-boat-destroyed-pacific/",
      "pub_time_taipei": "2025-10-30T12:54:15+08:00",
      "summary": "At least 61 people have been killed in U.S. strikes against alleged drug boats in the Pacific Ocean and Caribbean Sea since September."
    },
    {
      "source": "華盛頓郵報",
      "title": "How one cyberscamming syndicate used Singapore for legitimacy",
      "link": "https://www.washingtonpost.com/world/2025/10/26/cyber-scamming-prince-group-syndicate-singapore/",
      "pub_time_taipei": "2025-10-30T11:47:07+08:00",
      "summary": "The chairman of Prince Group, indicted over online scams, and his associates took advantage of Singapore’s reputation as a stable and predictable financial capital."
    },
    {
      "source": "衛報",
      "title": "Donald Trump praises ‘great’ Washington meeting with Anthony Albanese as leaders dine at Apec",
      "link": "https://www.theguardian.com/australia-news/2025/oct/30/donald-trump-anthony-albanese-apec-dinner-gyeongju-south-korea",
      "pub_time_taipei": "2025-10-30T11:40:46+08:00",
      "summary": "<p>US president tells reporters he and Australian PM ‘working on a lot of things together’ </p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>After waiting a long time to meet Donald Trump, Anthony Albanese has now done so twice in 10 days, as his US counterpart talks up cooperation on rare earths and other issues.</p><p>Albanese followed last week’s trip to Washington by sitting next to the US president on Wednesday evening at the Asia-Pacific Economic Cooperation (Apec) summit dinner in Gyeongju, South Korea.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/30/donald-trump-anthony-albanese-apec-dinner-gyeongju-south-korea\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump says South Korea will be able to build nuclear-powered submarine",
      "link": "https://www.washingtonpost.com/world/2025/10/29/trump-south-korea-nuclear-submarine/",
      "pub_time_taipei": "2025-10-30T11:22:48+08:00",
      "summary": "Trump’s announcement was short on detail but came a day after he finalized a trade deal with South Korea that includes a pledge of $350 billion in investment."
    },
    {
      "source": "衛報",
      "title": "Hurricane Melissa death toll rises as storm wreaks destruction across Caribbean – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
      "pub_time_taipei": "2025-10-30T11:13:26+08:00",
      "summary": "<p>This blog is closed</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/29/hurricane-melissa-hits-cuba-after-turning-jamaica-into-disaster-area\">Hurricane Melissa hits Cuba after turning Jamaica into ‘disaster area’</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/oct/28/hurricane-melissa-a-visual-guide-to-the-strongest-storm-to-hit-jamaica-in-almost-two-centuries\">Visual guide to Hurricane Melissa</a></p></li><li><p><a href=\"https://www.theguardian.com/global/2025/oct/27/tell-us-if-youve-been-affected-by-hurricane-melissa\">Tell us if you’ve been affected</a></p></li></ul><p><strong>As Cuba prepares for the storm to make landfall any minute, officials in Jamaica are preparing to assess the damage on Wednesday.</strong></p><p>A <a href=\"https://x.com/JamaicaConstab/status/1983311743616221615\">video</a> shared by the Jamaican Constabulary Force shows officers surveying extensive destruction in Black River, close to where Hurricane Melissa made landfall on Tuesday as a Category 5 storm.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "News Corp had no first-hand source suggesting Sam Groth’s wife underage at start of relationship, MP’s lawyer tells court",
      "link": "https://www.theguardian.com/australia-news/2025/oct/30/sam-groth-wife-brittany-privacy-laws-news-corp-ntwnfb",
      "pub_time_taipei": "2025-10-30T10:26:53+08:00",
      "summary": "<p>Australia’s new privacy laws to be tested as Victorian Liberal MP and wife Brittany Groth sue over Herald Sun articles</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A News Corp journalist had “not one piece of information” to suggest the deputy Victorian Liberal leader, Sam Groth, began a relationship with his wife when she was underage, the MP’s lawyers have told a court.</p><p>In what a federal court judge described as a “test case” for Australia’s new privacy laws, Groth and his wife, Brittany, are suing the Herald and Weekly Times (HWT), reporter Stephen Drill and the Herald Sun’s editor, Sam Weir, over a series of articles published in July.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/30/sam-groth-wife-brittany-privacy-laws-news-corp-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "National guard deployment in Washington DC extended until February",
      "link": "https://www.theguardian.com/us-news/2025/oct/29/hegseth-washington-dc-national-troops",
      "pub_time_taipei": "2025-10-30T09:28:53+08:00",
      "summary": "<p>Pentagon chief Pete Hegseth gives approval for troops to remain in US capital past November end, CNN reports</p><p>National guard troops sent to the nation’s capital will reportedly remain there through at least February.</p><p>The order was set to lapse at the end of November but was extended by Pete Hegseth, who leads the US Department of Defense. As of Wednesday, there are nearly 2,400 national guard troops in Washington DC, <a href=\"https://edition.cnn.com/2025/10/29/politics/national-guard-dc-extension-february-2026\">according to CNN</a>. The network also notes that their presence costs about $1m daily.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/29/hegseth-washington-dc-national-troops\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hurricane Melissa hits Cuba after turning Jamaica into ‘disaster area’",
      "link": "https://www.theguardian.com/world/2025/oct/29/hurricane-melissa-hits-cuba-after-turning-jamaica-into-disaster-area",
      "pub_time_taipei": "2025-10-30T09:15:48+08:00",
      "summary": "<p>Most intense tropical cyclone to hit Jamaica in nearly two centuries leaves trail of devastation in its wake</p><p>Hurricane Melissa has torn through the Caribbean, slamming into Cuba while leaving parts of neighbouring Jamaica broken and reeling from ferocious winds and extreme rainfall.</p><p>The effects of the colossal hurricane were felt across the region, even in countries that were not directly in its path. In nearby Haiti, residents of a small town were mourning the death of 25 people swept away in floods.</p> <a href=\"https://www.theguardian.com/world/2025/oct/29/hurricane-melissa-hits-cuba-after-turning-jamaica-into-disaster-area\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Microsoft reports strong earnings as Azure hit by major outage",
      "link": "https://www.theguardian.com/technology/2025/oct/29/microsoft-earnings-azure-outage-xbox",
      "pub_time_taipei": "2025-10-30T07:56:29+08:00",
      "summary": "<p>Tech giant reports earnings of $3.72 per share day after deal with OpenAI pushed value of company to more than $4tn</p><p><a href=\"https://www.theguardian.com/technology/microsoft\">Microsoft</a> blew off concerns of overspending on AI on Wednesday, reporting elevated earnings even as it faced an outage of its cloud computing service, Azure, and its office software suite, 365. The strong earnings report comes a day after a deal with <a href=\"https://www.theguardian.com/technology/openai\">OpenAI</a> pushed the value of the tech giant to more than $4tn.</p><p>After its Xbox and investor relations pages went down, the company issued a statement that said: “We are working to address an issue affecting Azure Front Door that is impacting the availability of some services.”</p> <a href=\"https://www.theguardian.com/technology/2025/oct/29/microsoft-earnings-azure-outage-xbox\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "In South Korea, Trump secures a trade deal — and a glittering crown",
      "link": "https://www.washingtonpost.com/politics/2025/10/29/trump-apec-south-korea/",
      "pub_time_taipei": "2025-10-30T06:44:07+08:00",
      "summary": "The trade agreement will lower U.S. tariffs on Korean cars and parts to 15 percent in exchange for $350 billion in investment, a Korean official said."
    },
    {
      "source": "衛報",
      "title": "Top Senate Democrat blames ‘heartless’ Trump for food aid being cut off – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/29/donald-trump-south-korea-china-latest-news-updates-live",
      "pub_time_taipei": "2025-10-30T06:08:47+08:00",
      "summary": "<p>This live blog is now closed.</p><p><strong>On X, </strong><strong>Adam Schiff</strong><strong>, one of California’s Democratic senators, criticized acting US attorney </strong><strong>Bill Essayli</strong><strong>, after a judge found that he was in the Los Angeles-based position illegally.</strong></p><p>Schiff <a href=\"https://x.com/SenAdamSchiff/status/1983371520400314675\">wrote</a>:</p><p>“Unlawfully serving” in his role. Acting illegally. But left in place? While this Administration continues to replace career professionals with illegitimate political allies eager to do Trump’s bidding, Californians need better relief than this.</p><p>I do the American People’s bidding at the direction of their duly elected President. That’s how our Constitution works. Try reading and abiding by it sometime.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/29/donald-trump-south-korea-china-latest-news-updates-live\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump nominee at U.S. export bank withdraws amid scrutiny of Russia ties",
      "link": "https://www.washingtonpost.com/world/2025/10/29/trump-nominee-export-bank-russia/",
      "pub_time_taipei": "2025-10-30T05:43:14+08:00",
      "summary": "Bryce McFerran is a senior executive at a steel-trading business co-owned by one of Russia’s richest oligarchs and is married to a member of a Russian family with extensive ties to the Kremlin."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. to withdraw some troops from Romania, NATO’s eastern flank",
      "link": "https://www.washingtonpost.com/world/2025/10/29/romania-nato-us-troops-withdrawal/",
      "pub_time_taipei": "2025-10-30T05:19:43+08:00",
      "summary": "It is the first announcement of the Trump administration’s plans to scale back forces in Europe, where the U.S. has underpinned security since World War II."
    },
    {
      "source": "華盛頓郵報",
      "title": "Hurricane Melissa hits Cuba; has killed at least 26 in Haiti and Jamaica",
      "link": "https://www.washingtonpost.com/weather/2025/10/29/hurricane-melissa-cuba-jamaica-damage/",
      "pub_time_taipei": "2025-10-30T04:56:14+08:00",
      "summary": "At least 20 people in Haiti died Wednesday when a river overflowed. The storm was expected to hit the Bahamas next."
    },
    {
      "source": "華盛頓郵報",
      "title": "Death toll of police raid in Rio doubles to 132, state watchdog says",
      "link": "https://www.washingtonpost.com/world/2025/10/28/rio-alemao-penha-brazil-police-raid/",
      "pub_time_taipei": "2025-10-30T04:17:53+08:00",
      "summary": "The operation was the deadliest in Brazilian history. Authorities say they were targeting the Red Command, one of Brazil’s most powerful organized-crime groups."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump rebukes Putin for testing new missiles, tells him to end the war",
      "link": "https://www.washingtonpost.com/world/2025/10/27/russia-us-trump-putin-missile-test/",
      "pub_time_taipei": "2025-10-30T04:09:08+08:00",
      "summary": "Russia tested a nuclear-powered cruise missile that it said is capable of traveling thousands of miles. Trump countered that there is a U.S. nuclear submarine off Russia’s coast."
    },
    {
      "source": "華盛頓郵報",
      "title": "See the devastating effects of Melissa’s path through Jamaica, Cuba",
      "link": "https://www.washingtonpost.com/world/interactive/2025/hurricane-melissa-jamaica-photos-videos/",
      "pub_time_taipei": "2025-10-30T03:56:03+08:00",
      "summary": "The storm made landfall in Jamaica on Tuesday, causing widespread flooding and damage before continuing on to Cuba"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli strikes kill more than 100 people in Gaza, including 46 children",
      "link": "https://www.washingtonpost.com/world/2025/10/29/israel-gaza-ceasefire-airstrikes/",
      "pub_time_taipei": "2025-10-30T03:47:18+08:00",
      "summary": "Israel said the strikes were a response to alleged violations of the ceasefire by Hamas."
    },
    {
      "source": "衛報",
      "title": "‘This was a slaughter, not an operation’: the favela reeling from Rio’s deadliest police raid",
      "link": "https://www.theguardian.com/world/2025/oct/29/favela-reeling-rio-deadliest-police-raid-brazil",
      "pub_time_taipei": "2025-10-30T02:55:31+08:00",
      "summary": "<p>Residents of Vila Cruzeiro gather bodies after more than 130 were killed in pre-dawn assault</p><p>Day had yet to break over Vila Cruzeiro but already dozens of corpses were splayed out along the favela’s main drag after more than 130 people were killed during the <a href=\"https://www.theguardian.com/world/2025/oct/28/brazil-rio-at-war-police-drug-raids-favelas\">deadliest police operation</a> in Rio’s history: grotesquely disfigured, blood-smeared bodies that had been dragged out of nearby forests and dumped on blue tarpaulins and black plastic sheets covering the street.</p><p>“I’ve brought 53 down myself … there must be another 12 or 15 up there in the bush,” said Erivelton Vidal Correia, the head of the local residents’ association, bleary-eyed from a sleepless night spent hauling bullet-riddled local men down from the hills.</p> <a href=\"https://www.theguardian.com/world/2025/oct/29/favela-reeling-rio-deadliest-police-raid-brazil\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hundreds reportedly killed at Sudanese hospital as evidence of RSF atrocities mounts",
      "link": "https://www.theguardian.com/world/2025/oct/29/hundreds-reportedly-killed-at-sudanese-hospital-as-evidence-of-rsf-atrocities-mounts",
      "pub_time_taipei": "2025-10-30T02:39:06+08:00",
      "summary": "<p>Rapid Support Forces, which claimed control of El Fasher on Sunday, reportedly killed at least 460 people ‘in cold blood’</p><p>Sudan’s Rapid Support Forces killed hundreds of patients and staff inside a hospital in El Fasher, according to the World Health Organization and the Sudan Doctors Network, after the paramilitary group claimed control of the city on Sunday.</p><p>The WHO secretary general, Tedros Adhanom Ghebreyesus, said he was “appalled and deeply shocked” at reports that more than 460 people had been killed at the Saudi maternity hospital, without assigning blame, in a <a href=\"https://x.com/DrTedros/status/1983529376130965998\">post on X</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/29/hundreds-reportedly-killed-at-sudanese-hospital-as-evidence-of-rsf-atrocities-mounts\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Election protests erupt in Tanzania with opposition leaders jailed, disqualified",
      "link": "https://www.washingtonpost.com/world/2025/10/29/tanzania-election-president-samia-suluhu-hassan-opposition/",
      "pub_time_taipei": "2025-10-30T02:37:06+08:00",
      "summary": "“Clearly this is a sham election,” said one Tanzanian rights activist, of an election season that has seen opposition to the ruling party suppressed."
    },
    {
      "source": "衛報",
      "title": "Israel strikes Gaza again after overnight bombardment that killed at least 104",
      "link": "https://www.theguardian.com/world/2025/oct/29/israeli-strikes-in-gaza-overnight-as-ceasefire-looks-increasingly-fragile",
      "pub_time_taipei": "2025-10-30T01:55:00+08:00",
      "summary": "<p>Attacks shatter Palestinians’ short-lived relief since start of ceasefire that now looks increasingly fragile</p><p>Israel carried out another strike in the Gaza Strip on Wednesday, killing at least two people, after bombarding the territory overnight and killing at least 104 Palestinians, including children, in the gravest challenge yet to the increasingly fragile US-brokered ceasefire.<strong> </strong></p><p>The Israeli military said it had struck military infrastructure where weapons were being stored<strong> </strong>for an imminent attack in Beit Lahia, northern Gaza. Al-Shifa hospital in Gaza City said it had received two bodies from the strike.</p> <a href=\"https://www.theguardian.com/world/2025/oct/29/israeli-strikes-in-gaza-overnight-as-ceasefire-looks-increasingly-fragile\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Greek police increase security after protests against Israeli cruise ship",
      "link": "https://www.theguardian.com/world/2025/oct/29/greek-police-increase-security-after-protests-against-israeli-cruise-ship",
      "pub_time_taipei": "2025-10-30T01:38:39+08:00",
      "summary": "<p>Measures are being taken at the harbours of Patras and Katakolo after demonstrations earlier this week</p><p>Greek authorities have stepped up security in two harbours in an attempt to keep protesters away from a cruise liner carrying Israeli tourists on an 11-day tour around the Mediterranean.</p><p>The measures taken at Patras and Katakolo in the Peloponnese followed demonstrations when the MS Crown Iris docked at Kalamata earlier this week. <a href=\"https://www.theguardian.com/world/2025/jul/22/israeli-cruise-rerouted-after-aegean-islanders-protest-gaza-war\">In July passengers on the same ship were prevented from disembarking</a> and it was forced to divert to Cyprus after local people staged a protest in support of Palestine<strong> </strong>on the Cycladic isle of Syros.</p> <a href=\"https://www.theguardian.com/world/2025/oct/29/greek-police-increase-security-after-protests-against-israeli-cruise-ship\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Violent protests erupt as Tanzanian president nears election victory",
      "link": "https://www.theguardian.com/world/2025/oct/29/tanzania-election-president-samia-suluhu-hassan-poised-to-retain-power",
      "pub_time_taipei": "2025-10-29T22:15:06+08:00",
      "summary": "<p>Government critics abducted, killed or arrested in run-up to vote as global monitor records internet blackout</p><p>Violent demonstrations broke out in Tanzania’s largest city, Dar es Salaam, as the country held an election on Wednesday.</p><p>Samia Suluhu Hassan, the president, is expected to strengthen her grip on the country against the backdrop of rapidly intensifying repression and the exclusion of opponents from the presidential contest.</p> <a href=\"https://www.theguardian.com/world/2025/oct/29/tanzania-election-president-samia-suluhu-hassan-poised-to-retain-power\">Continue reading...</a>"
    }
  ]
}