{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-19T20:40:07.316653+08:00",
  "window_end_taipei": "2025-10-20T20:40:07.316653+08:00",
  "items": [
    {
      "source": "華盛頓郵報",
      "title": "Witkoff arrives in Mideast to talk ceasefire, day after Israeli strikes",
      "link": "https://www.washingtonpost.com/world/2025/10/20/israel-gaza-ceasefire-trump-witkoff/",
      "pub_time_taipei": "2025-10-20T20:19:14+08:00",
      "summary": "U.S. envoy Steve Witkoff’s visit was planned in advance of Israeli strikes across Gaza, launched after two Israeli soldiers were killed and threatened the ceasefire."
    },
    {
      "source": "衛報",
      "title": "Starmer urged to apologise as MP says rioting by Maccabi Tel Aviv fans justifies their ban from Aston Villa game – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/20/uk-politics-latest-news-updates-prince-andrew-covid-starmer-labour-reform-education",
      "pub_time_taipei": "2025-10-20T20:18:53+08:00",
      "summary": "<p>Independent MP Ayoub Khan makes comments after Tel Aviv football derby between Hapoel and Maccabi called off after rioting</p><p>There will be two urgent questions in the Commons this afternoon, followed by a statement. Here is the running order.</p><p><em>3.30pm:</em> A Home Office minister will respond to a UQ from Chris Philp, the shadow home secretary, about the China spy case.</p><p>The family of Virginia Giuffre, whose life was destroyed, are angry and aghast. The public across these isles are angry and aghast and they both deserve to know that some MPs share their outrage.</p><p>So I won’t sit silent. If an act of parliament is required to strip the likes of Peter Mandelson and Prince Andrew of their titles then there can be no justification from this Labour government as to why that is not immediately happening.</p><p>Public funds, police protection and royal privilege have long buffered Prince Andrew from the consequences of his actions. And we’ve paid for all this.</p><p>I will support any efforts to hold royals to the same standards and laws as everyone else – parliament must have the power to remove privileges from abusers of position.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/20/uk-politics-latest-news-updates-prince-andrew-covid-starmer-labour-reform-education\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Scramble to shore up ceasefire as Israel hits Gaza with deadly strikes | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/oct/20/first-thing-scramble-to-shore-up-ceasefire-as-israel-hits-gaza-with-deadly-strikes",
      "pub_time_taipei": "2025-10-20T20:15:24+08:00",
      "summary": "<p>IDF says attack followed Hamas killing of two soldiers, but both sides say they are committed to ceasefire. Plus, No Kings protesters on their hopes for resistance movement against Trump</p><p>Good morning.</p><p>Israel launched waves of lethal airstrikes yesterday and cut off all aid into Gaza “until further notice” <a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\">after a reported attack by Hamas</a>, in escalations that marked the most serious threat so far to the increasingly fragile ceasefire.</p><p><strong>What else is the US doing to help maintain the ceasefire?</strong> Senior US officials, possibly including the vice-president, JD Vance, were expected to arrive in Israel in the coming days for what observers said was a clear effort to hold the Israeli prime minister, Benjamin Netanyahu, to the deal signed in Sharm-el-Sheikh, Egypt, earlier this month.</p><p><strong>What happened in the meeting with Zelenskyy? </strong>Ukraine’s president had flown to Washington hoping to capitalise on Trump’s growing frustration with Vladimir Putin after the summit in Alaska failed to produce a breakthrough in the war. But Zelenskyy left the US empty-handed, failing to secure long-range Tomahawk cruise missiles after weeks of lobbying.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/20/first-thing-scramble-to-shore-up-ceasefire-as-israel-hits-gaza-with-deadly-strikes\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Zelenskyy says he would join Trump-Putin summit in Hungary if invited – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/20/zelenskyy-trump-putin-russia-ukraine-war-eu-france-latest-news-updates",
      "pub_time_taipei": "2025-10-20T20:14:49+08:00",
      "summary": "<p>Ukrainian president criticises choice of Budapest as location for meeting as Trump suggests Kyiv must cede land to end war</p><p>An investigation into the <strong>Lisbon funicular crash</strong> will publish its first report today into the causes of the derailment, which killed 16 people in early September.</p><p>Portugal’s air and rail accident investigations bureau (GPIAAF) had previously found that a cable linking two cabins disconnected shortly before the September 3 crash, in a note published three days after the tragedy.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/20/zelenskyy-trump-putin-russia-ukraine-war-eu-france-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza ceasefire live: Trump’s envoys arrive in Israel amid scramble to shore up fragile truce – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates",
      "pub_time_taipei": "2025-10-20T20:14:02+08:00",
      "summary": "<p>US envoy Steve Witkoff and Trump son-in-law Jared Kushner already in Israel with vice-president JD Vance due tomorrow</p><p>The Guardian’s global affairs correspondent, <a href=\"https://www.theguardian.com/profile/roth-andrew\">Andrew Roth</a>, has written <a href=\"https://www.theguardian.com/news/ng-interactive/2025/oct/19/the-enormous-conflict-of-interest-at-centre-of-jared-kushners-gaza-ceasefire-deal\">an interesting profile</a> on <strong>Jared Kushner</strong> in which he explores his central role in the ceasefire negotiations and his extensive business dealings in the Middle East. Here is a snippet:</p><p><em>The soft-spoken heir to his father’s real estate empire has quietly become a key conduit for Trump’s outreach to the Middle East, leveraging his Rolodex of leaders in the region and positioning himself to win a lucrative windfall if the goal of redeveloping Gaza ever comes to fruition.</em></p><p><em>It has been a notable return to the political fold after Kushner and his wife, Ivanka Trump, effectively swore off politics after the January 6 riots at the US Capitol that followed Trump’s loss in the 2020 elections.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Contract that never was’ adds twist to scientist’s fight over Everglades project",
      "link": "https://www.theguardian.com/us-news/2025/oct/20/florida-everglades-project-tom-van-lent",
      "pub_time_taipei": "2025-10-20T20:00:41+08:00",
      "summary": "<p>A legal saga stemming from a water quality project saw Tom Van Lent briefly jailed in a case brought by allies of DeSantis</p><p>An environmental scientist briefly jailed in what he called a “political prosecution” brought by allies of Florida’s rightwing Republican governor, Ron DeSantis, now alleges new evidence shows his jail sentence stemmed from fraudulent allegations.</p><p>Tom Van Lent’s claim represents the latest twist in a <a href=\"https://newrepublic.com/article/182364/everglades-scientist-trial-ron-desantis-florida\">three-year legal saga</a> ignited by a disagreement over a proposed restoration project that aimed to address Florida’s recurrent red tides and toxic algal blooms by helping restore the environment of the vast Everglades wetlands.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/20/florida-everglades-project-tom-van-lent\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Experts hail ‘remarkable’ success of electronic implant in restoring sight",
      "link": "https://www.theguardian.com/science/2025/oct/20/experts-hail-remarkable-success-of-electronic-implant-in-restoring-sight",
      "pub_time_taipei": "2025-10-20T20:00:40+08:00",
      "summary": "<p>Sight of 84% of people with form of age-related macular degeneration restored after being fitted with device</p><p>An electronic eye implant half the thickness of a human hair has helped people with incurable sight loss to see again, opening up a potential “new era” in tackling blindness.</p><p>Doctors who implanted the sim card-shaped prosthetic device say it has helped many of the 38 elderly patients in the trial regain their ability to read letters, numbers and words.</p> <a href=\"https://www.theguardian.com/science/2025/oct/20/experts-hail-remarkable-success-of-electronic-implant-in-restoring-sight\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sanae Takaichi on course to become Japan’s first female PM after new coalition deal",
      "link": "https://www.theguardian.com/world/2025/oct/20/sanae-takaichi-likely-become-japan-first-female-prime-minister",
      "pub_time_taipei": "2025-10-20T19:56:16+08:00",
      "summary": "<p>Officials confirm reports that Takaichi’s Liberal Democratic party will join forces with rightwing Nippon Ishin</p><p>Sanae Takaichi is on course to become Japan’s <a href=\"https://www.theguardian.com/world/2025/oct/04/sanae-takaichi-the-new-leader-of-japans-liberal-democratic-party-who-cites-thatcher-as-an-influence\">first female prime minister</a> this week after her party agreed to form a new coalition with a minor party.</p><p>Officials confirmed on Monday that Takaichi’s Liberal Democratic party (LDP) had joined forces with the rightwing <a href=\"https://www.theguardian.com/world/2021/nov/01/japan-election-rightwing-populists-sweep-vote-in-osaka\">Nippon Ishin</a> (Japan Innovation party), which shares her hawkish stance on China and support for restrictions on immigration.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/sanae-takaichi-likely-become-japan-first-female-prime-minister\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Next great leap’: grassroots movement to wild East Anglia goes national",
      "link": "https://www.theguardian.com/environment/2025/oct/20/grassroots-movement-to-wild-east-anglia-national-pledge",
      "pub_time_taipei": "2025-10-20T19:20:26+08:00",
      "summary": "<p>Set up by three ‘eco-anxious’ farmers, WildEast has created UK-wide version of pledge to encourage people to restore nature</p><p>A grassroots movement to wild a fifth of East Anglia is going national with the launch of Wild Kingdom’s “map of dreams” to collect pledges and connect communities, businesses and ordinary people seeking to revive nature.</p><p><a href=\"https://wildeast.co.uk/\">WildEast</a> was <a href=\"https://www.theguardian.com/environment/2020/jul/14/farmers-wildeast-hatch-plan-return-area-size-dorset-wild-nature-east-anglia\">formed five years ago</a> when three “eco-anxious” farmers decided to commit at least a fifth of their land to nature. Since then, thousands of people have pledged to rewild gardens, school grounds, communities and businesses.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/20/grassroots-movement-to-wild-east-anglia-national-pledge\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: Eight dead as Tropical Storm Fengshen hits Philippines",
      "link": "https://www.theguardian.com/environment/2025/oct/20/weather-tracker-dead-as-tropical-storm-fengshen-hits-philippines",
      "pub_time_taipei": "2025-10-20T19:16:16+08:00",
      "summary": "<p>Tens of thousands evacuated amid significant damage from intense rainfall and storm surge</p><p>Eight people have died and 27,000 have been evacuated after Tropical Storm Fengshen hit the Philippines during the weekend. Fengshen made landfall from the western Pacific Ocean near the municipality of Gubat on the southern tip of the island of Luzon, and while it remains on the weaker side in terms of sustained winds, the intense rainfall and a storm surge have caused significant damage across the region.</p><p>Anticipated waves of 2 metres (6ft) led the Philippines weather bureau, Pagasa, to issue a risk warning of moderate coastal flooding for the region. Twenty-seven thousand people were evacuated from the Albay province because of these warnings and moved to a safer area further inland. Despite the precautionary measures, five people died when a tree fell on to a house near Pitogo on Sunday morning.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/20/weather-tracker-dead-as-tropical-storm-fengshen-hits-philippines\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "China’s economic growth slows amid Trump tariff war and property woes",
      "link": "https://www.theguardian.com/business/2025/oct/20/china-economic-growth-trump-tariff-war-property-gdp",
      "pub_time_taipei": "2025-10-20T19:13:00+08:00",
      "summary": "<p>GDP rises by 4.8% year on year between July and September, down from second-quarter growth rate of 5.2%</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news\">Business live – latest updates</a></p></li></ul><p>China’s economy grew at its slowest pace in a year in the latest quarter amid a trade war with the US and long-running woes in its property market.</p><p>Fragile domestic demand has left China’s economy heavily reliant on manufacturing and trade, at a time of mounting tensions with the Donald Trump administration.</p> <a href=\"https://www.theguardian.com/business/2025/oct/20/china-economic-growth-trump-tariff-war-property-gdp\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Police hunt Louvre jewel thieves as questions swirl over museum’s security",
      "link": "https://www.washingtonpost.com/world/2025/10/20/louvre-museum-france-paris-robbery-investigation/",
      "pub_time_taipei": "2025-10-20T18:56:17+08:00",
      "summary": "Thieves broke into the Louvre museum in Paris and stole thousands of diamonds and other precious jewels, prompting questions about the museum’s security."
    },
    {
      "source": "衛報",
      "title": "Robert De Niro on Donald Trump: ‘You have to fight. There’s no other way to face a bully’",
      "link": "https://www.theguardian.com/film/2025/oct/20/robert-de-niro-have-to-fight-donald-trump-bully-no-kings",
      "pub_time_taipei": "2025-10-20T18:55:14+08:00",
      "summary": "<p>The actor has renewed his vocal opposition to the US president and spoken in support of the millions-strong ‘No Kings’ street protests</p><p>Robert De Niro has renewed his vocal opposition to Donald Trump, saying “there’s no other way to face a bully”.</p><p><a href=\"https://www.youtube.com/watch?v=Uc18Ukt2kWQ\">The actor spoke to MSNBC on Sunday</a> in support of the anti-Trump “No Kings” protests, which saw <a href=\"https://www.theguardian.com/us-news/2025/oct/18/no-kings-protests-events-states\">millions take to the streets across the US</a>. De Niro said there needed to be “much more” resistance, adding: “The politicians are going to recognise that: either face the wrath of Trump or the wrath of the people – and they have to be more afraid of the wrath of the people.”</p> <a href=\"https://www.theguardian.com/film/2025/oct/20/robert-de-niro-have-to-fight-donald-trump-bully-no-kings\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tensions mount as Alassane Ouattara seeks fourth term in Ivory Coast vote",
      "link": "https://www.theguardian.com/world/2025/oct/20/tensions-mount-alassane-ouattara-seeks-fourth-term-ivory-coast-vote-president",
      "pub_time_taipei": "2025-10-20T18:52:13+08:00",
      "summary": "<p>Protests have been banned and opposition figures sidelined as 83-year-old president ignores calls to step down</p><p>“This is worth several more terms,” the Ivorian president, Alassane Ouattara, joked while opening a bridge named after him in the country’s commercial capital, Abidjan, in 2023.</p><p>The appearance in recent years of several new bridges in west Africa’s second most populous city has been hailed by the president’s supporters as symbolic of an era of modernity and stable leadership under his watch.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/tensions-mount-alassane-ouattara-seeks-fourth-term-ivory-coast-vote-president\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Amazon Web Services outage hitting platforms around world ‘showing signs of recovery’",
      "link": "https://www.theguardian.com/technology/2025/oct/20/amazon-web-services-aws-outage-hits-dozens-websites-apps",
      "pub_time_taipei": "2025-10-20T18:37:11+08:00",
      "summary": "<p>Problem that originated in US and affected Snapchat and Ring among others appears to be IT issue rather than cyber-attack, says expert</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news\">Business live – latest updates</a></p></li></ul><p>A major internet outage has hit dozens of websites and apps around the world, with users reporting trouble getting online after problems at Amazon’s cloud computing service.</p><p>The affected platforms include Snapchat, Roblox, Signal and Duolingo as well as a host of Amazon-owned operations including its main retail site and the Ring doorbell company.</p> <a href=\"https://www.theguardian.com/technology/2025/oct/20/amazon-web-services-aws-outage-hits-dozens-websites-apps\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Reform UK reviews if it underpaid VAT on tickets and merchandise",
      "link": "https://www.theguardian.com/politics/2025/oct/20/reform-uk-reviews-if-it-underpaid-vat-on-tickets-and-merchandise",
      "pub_time_taipei": "2025-10-20T18:29:05+08:00",
      "summary": "<p>Nigel Farage’s party reported to have exceeded £90,000 threshold due to ticket sales for Birmingham conference</p><p>Reform UK has launched an investigation into whether it underpaid VAT on thousands of pounds of ticket sales and merchandise.</p><p>Nigel Farage’s party, which is leading in the public opinion polls, said it was reviewing its tax affairs after a <a href=\"https://www.thetimes.com/uk/politics/article/reform-nigel-farage-hmrc-tax-vat-shrpppnvf\">Times investigation</a> alleged it may have breached the law and could face a fine from HM Revenue and Customs (HMRC).</p> <a href=\"https://www.theguardian.com/politics/2025/oct/20/reform-uk-reviews-if-it-underpaid-vat-on-tickets-and-merchandise\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jacinta Nampijinpa Price plotted with school principal to oust CEO of land council, court hears",
      "link": "https://www.theguardian.com/australia-news/2025/oct/20/jacinta-nampijinpa-price-didnt-check-details-of-media-release-that-allegedly-defamed-ceo-court-hears",
      "pub_time_taipei": "2025-10-20T18:10:55+08:00",
      "summary": "<p>High-profile lawyer Sue Chrysanthou SC is representing the Central Land Council boss in the case against NT senator</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/20/australia-news-live-space-debris-wa-albanese-trump-meeting-labor-supermarkets-price-gouging-barnaby-joyce-nationals-coalition-sussan-ley-net-zero-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Liberal senator Jacinta Nampijinpa Price plotted with a school principal to oust the chief executive of an Aboriginal land council she defamed in a media release, a court has been told.</p><p>The senator is fighting a claim by Central Land Council chief executive Lesley Turner that she defamed him in a July 2024 release.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/20/jacinta-nampijinpa-price-didnt-check-details-of-media-release-that-allegedly-defamed-ceo-court-hears\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Lawmakers slam Ice after US military veterans are arrested, injured",
      "link": "https://www.theguardian.com/us-news/2025/oct/20/military-veterans-arrested-injured-lawmakers-ice",
      "pub_time_taipei": "2025-10-20T18:00:40+08:00",
      "summary": "<p>The Guardian revealed how US veterans have been injured and arrested at protests against Ice deportations</p><p>Some of the most decorated military veterans in <a href=\"https://www.theguardian.com/us-news/us-congress\">Congress</a> say they are outraged after a report in the Guardian <a href=\"https://www.theguardian.com/us-news/2025/oct/13/us-veterans-protest-ice-raids\">revealed</a> US military veterans have been arrested or injured amid protests over <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s deportation campaign and his push to deploy the national guard to American cities.</p><p>“I went to war three times for this country to defend the right of Americans to say things I may not like,” said Representative Jason Crow, a Democrat from Colorado and former army ranger who was awarded the Bronze Star for his service in Iraq as a platoon leader with the 82nd airborne division. “Now is the time for every American to speak out.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/20/military-veterans-arrested-injured-lawmakers-ice\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Zelenskyy calls for more US Patriot air defences after Trump again sides with Putin",
      "link": "https://www.theguardian.com/world/2025/oct/20/zelenskyy-calls-for-more-us-patriot-air-defences-after-trump-again-sides-with-putin",
      "pub_time_taipei": "2025-10-20T17:43:07+08:00",
      "summary": "<p>Ukrainian president ready to join Putin-Trump summit and asks for additional anti-missile batteries, paid for with frozen Russian assets</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/20/trump-zelenskyy-ukraine-donbas-region-end-russia-invasion\">Trump suggests carving up Ukraine’s Donbas region to end war after meeting with Zelenskyy</a></p></li></ul><p>Volodymyr Zelenskyy has called for the delivery of an additional 25 US Patriot anti-missile batteries amid the <a href=\"https://www.theguardian.com/world/2025/oct/17/ukrainian-defenders-struggling-to-stem-russia-air-assault\">rapidly escalating air war with Russia</a>, as it became clear that Donald Trump had <a href=\"https://www.theguardian.com/world/2025/oct/20/trump-zelenskyy-ukraine-donbas-region-end-russia-invasion\">once again tacked sharply towards Moscow.</a></p><p>The Ukrainian president added that he would be ready to join Vladimir Putin and Trump at their summit in Hungary if he was invited.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/zelenskyy-calls-for-more-us-patriot-air-defences-after-trump-again-sides-with-putin\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How China weaponized soybeans to squeeze U.S. farmers — and spite Trump",
      "link": "https://www.washingtonpost.com/world/2025/10/18/us-china-soybean-trade-war/",
      "pub_time_taipei": "2025-10-20T17:41:11+08:00",
      "summary": "China, the world’s biggest importer of soybeans, has stopped buying U.S. crops to put pressure on Trump ahead of his trade-focused meeting with Xi Jinping."
    },
    {
      "source": "華盛頓郵報",
      "title": "Ukraine sends robots to war to break battlefield deadlock",
      "link": "https://www.washingtonpost.com/world/2025/10/20/ukraine-russia-battlefield-land-drones/",
      "pub_time_taipei": "2025-10-20T17:31:52+08:00",
      "summary": "Aerial drones changed the fighting in Ukraine, and now explosive-laden, unmanned vehicles are further transforming the war."
    },
    {
      "source": "華盛頓郵報",
      "title": "Officials, locals undercut Trump claims about Venezuela drug boats",
      "link": "https://www.washingtonpost.com/world/2025/10/20/trump-attacks-venezuela-drug-boats/",
      "pub_time_taipei": "2025-10-20T17:00:00+08:00",
      "summary": "Trump says the U.S. is blowing up boats carrying deadly fentanyl to the United States. U.S. and other officials say the route under attack carries cocaine and marijuana to Europe and Africa."
    },
    {
      "source": "衛報",
      "title": "British troops to get powers to shoot down drones near military bases",
      "link": "https://www.theguardian.com/world/2025/oct/20/british-troops-powers-shoot-down-drones-military-bases",
      "pub_time_taipei": "2025-10-20T16:58:36+08:00",
      "summary": "<p>Defence secretary will announce measures to combat threat of unmanned aircraft after incursions in Europe</p><p>Soldiers are to be given new powers to shoot down unidentified drones believed to be threatening UK military bases in response to a <a href=\"https://www.theguardian.com/world/2025/oct/08/this-is-europe-russia-hybrid-war-destabilise-europe\">recent spate of incursions and sightings in Europe</a>.</p><p>John Healey, the defence secretary, will announce the measure at a speech in the City of London on Monday, in which he will also warn of an increased level of Russian drone attacks into Ukraine and eastern Europe.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/british-troops-powers-shoot-down-drones-military-bases\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gucci owner Kering to sell beauty division to L’Oréal for €4bn",
      "link": "https://www.theguardian.com/business/2025/oct/20/gucci-kering-beauty-division-loreal-luca-de-meo",
      "pub_time_taipei": "2025-10-20T16:57:40+08:00",
      "summary": "<p>New chief executive Luca de Meo aims to bring down debt burden and refocus on core fashion business</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news\">Business live – latest updates</a></p></li></ul><p>The Gucci owner, Kering, is selling its beauty division to L’Oréal for €4bn (£3.5bn), as its new chief executive, Luca de Meo, seeks to turn around the French luxury company.</p><p>The deal will give the French beauty group L’Oréal Kering’s fragrance line Creed, which was founded in 1760. The deal also includes rights to develop fragrance and beauty products under Kering’s fashion labels Gucci, Bottega Veneta and Balenciaga under a 50-year exclusive licence.</p> <a href=\"https://www.theguardian.com/business/2025/oct/20/gucci-kering-beauty-division-loreal-luca-de-meo\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Louvre heist puts pressure on French government over museum security",
      "link": "https://www.theguardian.com/world/2025/oct/20/louvre-heist-pressure-french-government-museum-security-paris",
      "pub_time_taipei": "2025-10-20T16:41:36+08:00",
      "summary": "<p>Justice minister says ‘we have failed’ after thieves take seven minutes to steal priceless jewels from museum</p><ul><li><p><a href=\"http://theguardian.com/world/live/2025/oct/20/zelenskyy-trump-putin-russia-ukraine-war-eu-france-latest-news-updates\">Europe live – latest updates</a></p></li></ul><p>The French government is under increasing pressure over museum security as police continue to search for thieves who took <a href=\"https://www.theguardian.com/world/2025/oct/19/louvre-closed-after-robbery-french-culture-minister-says\">seven minutes to steal priceless jewels</a> from the Louvre, the world’s most-visited museum.</p><p>“What is certain is that we have failed, since people were able to park a furniture hoist in the middle of Paris, get people up it in several minutes to grab priceless jewels, and give France a terrible image,” the justice minister, Gérald Darmanin, told France Inter radio on Monday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/louvre-heist-pressure-french-government-museum-security-paris\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hong Kong: two killed after cargo plane veers off runway into sea while landing",
      "link": "https://www.theguardian.com/world/2025/oct/20/hong-kong-cargo-plane-skids-off-airport-runway-people-killed",
      "pub_time_taipei": "2025-10-20T16:17:23+08:00",
      "summary": "<p>Authorities say plane collided with patrol vehicle, taking it with it as it ditched in sea</p><p>Two people were killed in Hong Kong after a cargo plane hit a ground vehicle while trying to land and skidded off the runway into the sea.</p><p>The Emirates flight had flown in to Hong Kong international airport from Dubai at about 4am on Monday when it veered off the runway and crashed through a fence, according to airport officials. It then collided with the security patrol car, taking the vehicle with it as it ditched into the sea.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/hong-kong-cargo-plane-skids-off-airport-runway-people-killed\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australia says Chinese fighter jet released flares near RAAF aircraft in ‘dangerous’ incident",
      "link": "https://www.theguardian.com/australia-news/2025/oct/20/australia-accuses-chinese-fighter-jet-of-releasing-flares-near-raaf-aircraft-in-dangerous-incident",
      "pub_time_taipei": "2025-10-20T15:42:53+08:00",
      "summary": "<p>Richard Marles condemns Chinese military after flares let off ‘very close’ to Australian surveillance aircraft over South China Sea</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The acting prime minister, Richard Marles, has condemned the “unsafe and unprofessional” behaviour of the Chinese military, saying a fighter jet released flares close to an Australian surveillance plane over the <a href=\"https://www.theguardian.com/world/south-china-sea\">South China Sea</a>.</p><p>Australia’s defence forces expressed “concerns” about the incident in a statement, saying it posed a risk to Royal Australian Air Force personnel and their aircraft. No injuries or damage was sustained as a result of actions.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/20/australia-accuses-chinese-fighter-jet-of-releasing-flares-near-raaf-aircraft-in-dangerous-incident\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Coalition showdown on net zero looms amid speculation more MPs could quit over policy",
      "link": "https://www.theguardian.com/australia-news/2025/oct/20/coalition-net-zero-policy-speculation-more-could-quit-sussan-ley",
      "pub_time_taipei": "2025-10-20T15:14:21+08:00",
      "summary": "<p>Meeting called for end of sitting week inviting backbench MPs to argue for or against dumping the policy after Barnaby Joyce announced resignation</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Coalition backbenchers are preparing for a showdown on net zero as pressure mounts on Sussan Ley’s opposition to resolve its position, with speculation more MPs could join Barnaby Joyce in quitting if the policy isn’t dumped.</p><p>Liberal and Nationals MPs have been invited to remain in Canberra after the upcoming sitting week for a three-hour, closed-door debate on energy policy, including net zero by 2050.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/20/coalition-net-zero-policy-speculation-more-could-quit-sussan-ley\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Head of ABS defends debunking far-right ‘mass migration’ claims after censorship accusations",
      "link": "https://www.theguardian.com/australia-news/2025/oct/20/abs-censorship-accusations-defends-debunking-far-right-mass-migration-claims",
      "pub_time_taipei": "2025-10-20T14:20:02+08:00",
      "summary": "<p>Chief statistician David Gruen says bureau did not censor anyone and is ‘trying to take the side of truth’ after misuse of overseas arrivals figures</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/20/australia-news-live-space-debris-wa-albanese-trump-meeting-labor-supermarkets-price-gouging-barnaby-joyce-nationals-coalition-sussan-ley-net-zero-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australia’s chief statistician, David Gruen, has defended the <a href=\"https://www.theguardian.com/australia-news/australian-bureau-of-statistics\">Australian Bureau of Statistics</a>’ recent public debunking of far-right claims of “mass migration”, as he said the independent agency “stands ready to respond” to “egregious misrepresentations” of its data.</p><p>The biennial World Stats Day on 20 October comes amid a rising tide of mis- and disinformation around the world that has propelled often anonymous statistical bodies and their officials into the public eye.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/20/abs-censorship-accusations-defends-debunking-far-right-mass-migration-claims\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Gaza ceasefire burnishes Qatari image as global mediator",
      "link": "https://www.washingtonpost.com/world/2025/10/20/qatar-diplomacy-gaza-ceasefire/",
      "pub_time_taipei": "2025-10-20T14:00:00+08:00",
      "summary": "Having transformed an Israeli attack on Qatari soil into diplomatic momentum for a ceasefire in Gaza, Doha is forging ahead on other thorny conflicts."
    },
    {
      "source": "衛報",
      "title": "Jacinta Allan blames ‘very small number’ of counter-protesters for violence at Melbourne immigration rally",
      "link": "https://www.theguardian.com/australia-news/2025/oct/20/melbourne-protests-anti-immigration-rallies-counter-protest-police-injured",
      "pub_time_taipei": "2025-10-20T13:59:48+08:00",
      "summary": "<p>Victorian premier insists city is safe and police have necessary powers after two officers hospitalised on Sunday </p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/20/australia-news-live-space-debris-wa-albanese-trump-meeting-labor-supermarkets-price-gouging-barnaby-joyce-nationals-coalition-sussan-ley-net-zero-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Jacinta Allan has blamed a “very small number” of counter-protesters for violent scenes in <a href=\"https://www.theguardian.com/australia-news/melbourne\">Melbourne</a>’s CBD, insisting the city is safe and police have the powers they need to maintain order.</p><p>The Victorian premier’s comments come after two officers were hospitalised as police spent hours trying to seperate an anti-immigration rally, organised by March for Australia, from a counter anti-racism protest, dubbed “United Against Racism: Migrants and Refugees Are Welcome”, in the CBD on Sunday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/20/melbourne-protests-anti-immigration-rallies-counter-protest-police-injured\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Monday briefing: ‘New levels of misery’ for Ukraine’s soldiers as diplomatic wrangling drags on",
      "link": "https://www.theguardian.com/world/2025/oct/20/monday-briefing-new-levels-of-misery-for-ukraines-soldiers-as-diplomatic-wrangling-drags-on",
      "pub_time_taipei": "2025-10-20T13:24:17+08:00",
      "summary": "<p>In today’s newsletter: Trump’s stance on the war continues to oscillate while Zelenskyy’s infantry face gruelling stints at the ‘zero line’ amid increasingly lethal Russian attacks</p><p></p><p>Good morning. It looked, for a moment, as if Donald Trump had finally taken a clear side in the war between Russia and Ukraine: with hints that he might be ready to provide Tomahawk missiles, and a vaunted White House meeting with Volodymyr Zelenskyy, some observers thought he was on the brink of rowing in behind Ukraine in a decisive way.</p><p>Then he got on the phone with Vladimir Putin, and agreed to a face-to-face meeting within the next two weeks. And, after the White House meeting on Friday, Trump <a href=\"https://www.theguardian.com/world/2025/oct/17/trump-putin-phone-call-sinks-kyiv-ukraine-hopes-for-us-tomahawk-missiles\">downplayed the idea that the missiles would be provided</a>. <a href=\"https://www.ft.com/content/7960c6aa-dbfa-4a55-91e8-ae44601842ec\">Later reports</a> suggested that the meeting was a “shouting match” in which Trump echoed Russian talking points and added: “If [Putin] wants it, he will destroy you.”</p><p><em><strong>Israel-Gaza war </strong></em>| Israel <a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\">launched waves of lethal airstrikes on Sunday</a> and cut off all aid into Gaza “until further notice” after a reported attack by Hamas, in escalations that marked the most serious threat so far to the increasingly fragile ceasefire. Israel later said that it had “begun the renewed enforcement of the ceasefire”.</p><p><em><strong>Royals </strong></em>| The Metropolitan police <a href=\"https://www.theguardian.com/uk-news/2025/oct/19/met-prince-andrew-police-bodyguard-information-virginia-giuffre\">are looking into claims</a> that Prince Andrew asked his taxpayer-funded close protection officer to uncover information about Virginia Giuffre hours before the emergence of a bombshell picture of them together. The news follows Friday’s announcement that Andrew had relinquished his royal titles.</p><p><em><strong>China-UK relations </strong></em>| Approving a Chinese super-embassy in east London could be unlawful if ministers gave Beijing assurances about the project in advance, <a href=\"https://www.theguardian.com/world/2025/oct/19/chinese-embassy-approval-could-be-unlawful-if-uk-ministers-gave-advance-assurances\">a top planning lawyer has concluded</a>. The news came as the government denied any political interference in the decision to drop charges against two men accused of spying for China.</p><p><em><strong>France </strong></em>| <a href=\"https://www.theguardian.com/world/2025/oct/19/louvre-closed-after-robbery-french-culture-minister-says\">French police are hunting four thieves</a> who carried out a highly professional daylight robbery on the Louvre, breaking into one of the museum’s most ornate rooms and escaping with eight pieces of “priceless” historic jewellery, including a necklace given by Napoleon to his wife.</p><p><em><strong>Reform UK </strong></em>| The leader of Reform UK’s flagship local authority has told councillors that <a href=\"https://www.theguardian.com/politics/2025/oct/19/reform-kent-council-leader-launched-hunt-for-cowards-who-leaked-recorded-meeting\">she has launched a hunt for the “cowards”</a> who leaked a recorded meeting in which she said those who disagreed with decisions would have to “fucking suck it up”. Bitter divisions among Reform members of Kent county council were laid bare at the weekend by the Guardian.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/monday-briefing-new-levels-of-misery-for-ukraines-soldiers-as-diplomatic-wrangling-drags-on\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Albanese arrives in US for Trump meeting as Republican congressman says Aukus ‘keeps Xi up at night’",
      "link": "https://www.theguardian.com/australia-news/2025/oct/20/anthony-albanese-arrives-us-trump-meeting-white-house-aukus",
      "pub_time_taipei": "2025-10-20T13:22:16+08:00",
      "summary": "<p>The prime minister says it is ‘wonderful to be here’ ahead of long-awaited meeting with the president in the Oval Office at the White House</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/20/australia-news-live-space-debris-wa-albanese-trump-meeting-labor-supermarkets-price-gouging-barnaby-joyce-nationals-coalition-sussan-ley-net-zero-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Anthony Albanese has arrived in the US for a long-awaited meeting with President Donald Trump, where they are expected to discuss the Aukus pact – an agreement a respected Republican has called a “crucial deterrent” in the Indo-Pacific that “keeps [the Chinese president, Xi Jinping] up at night”.</p><p>Albanese arrived in Washington DC late on Sunday night local time (Monday afternoon AEDT) ahead of his meeting with Trump at the White House on Monday morning local time (Tuesday morning AEDT). The two men will meet in the Oval Office, followed by a scheduled lunch afterward, according to the White House.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/20/anthony-albanese-arrives-us-trump-meeting-white-house-aukus\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "China’s economy grows at slowest pace in a year as trade war bites",
      "link": "https://www.washingtonpost.com/world/2025/10/20/china-economy-gdp-growth/",
      "pub_time_taipei": "2025-10-20T13:14:31+08:00",
      "summary": "Official data put the annual growth rate at 4.8 percent, a sobering number for Chinese Communist Party leaders as they begin an important planning meeting."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump’s Argentina gambit is not ‘America First’",
      "link": "https://www.washingtonpost.com/world/2025/10/20/argentina-bailout-milei-trump-us-million/",
      "pub_time_taipei": "2025-10-20T12:00:30+08:00",
      "summary": "For all the triumphal nationalism on show at the White House, there are times when it’s unclear what American interests are boosted by Trump’s agenda."
    },
    {
      "source": "衛報",
      "title": "Rodrigo Paz Pereira wins Bolivia’s presidential runoff marking a new shift to the right",
      "link": "https://www.theguardian.com/world/2025/oct/20/rodrigo-paz-pereira-bolivia-wins-presidential-runoff-electiion-right-wing",
      "pub_time_taipei": "2025-10-20T09:06:50+08:00",
      "summary": "<p>Sunday’s election marked the first time since 2005 that no candidate from Evo Morales’ Mas party was on the ballot</p><p>Centre-right senator Rodrigo Paz Pereira, 58, won Bolivia’s presidential runoff on Sunday and will be the country’s next president, marking a shift to the right after nearly 20 years of dominance by the leftist Movimiento al Socialismo (Mas) party.</p><p>With just over 97% of ballots counted in the electoral court’s “preliminary” tally, Paz Pereira secured 54.6% of the vote, while rightwing former president Jorge “Tuto” Quiroga received 45.4%.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/rodrigo-paz-pereira-bolivia-wins-presidential-runoff-electiion-right-wing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Scramble to shore up ceasefire as Israel hits Gaza with deadly raids",
      "link": "https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions",
      "pub_time_taipei": "2025-10-20T05:48:01+08:00",
      "summary": "<p>IDF says attack followed Hamas forces killing two soldiers, but both sides say they are committed to ceasefire</p><p>Israel launched waves of lethal airstrikes on Sunday and cut off all aid into Gaza “until further notice” after a reported attack by Hamas, in escalations that marked the most serious threat so far to the increasingly fragile ceasefire in the devastated territory.</p><p><a href=\"https://www.timesofisrael.com/liveblog-october-19-2025/\">Two Israeli soldiers</a>, including an officer, were killed in the Hamas attack. Palestinian officials said dozens died in the retaliatory airstrikes.</p> <a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Strikes hit Gaza after truce violations alleged – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates",
      "pub_time_taipei": "2025-10-20T05:12:34+08:00",
      "summary": "<p>This blog is now closed. See our latest full report here: </p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\">Scramble to shore up ceasefire as Israel hits Gaza with deadly raids </a></p></li></ul><p><strong>Freed Israeli hostage David Cunio</strong> received a hero’s welcome in the city of <strong>Yavne</strong>, where residents lined the streets waving <strong>Israeli and American flags</strong> as he was driven from hospital to rejoin his family, The Times of Israel reports.</p><p>Cunio, who was <strong>abducted from kibbutz </strong><strong>Nir Oz</strong> with his family during the <strong>7 October 2023 Hamas attack</strong>, leaned out of the car window to <strong>shake hands and thank supporters</strong> as music played and people applauded.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Thieves steal treasured jewelry from Louvre in 7-minute daylight heist",
      "link": "https://www.washingtonpost.com/world/2025/10/19/louvre-museum-robbery-jewels/",
      "pub_time_taipei": "2025-10-20T04:33:52+08:00",
      "summary": "Thieves broke into the Apollo Gallery, which houses the French crown jewels, and took with them objects adorned with thousands of diamonds."
    },
    {
      "source": "華盛頓郵報",
      "title": "Amid shaky truce, Israel says it struck Gaza after Hamas attacks",
      "link": "https://www.washingtonpost.com/world/2025/10/19/amid-shaky-truce-israel-says-it-struck-gaza-after-hamas-attacks/",
      "pub_time_taipei": "2025-10-20T03:00:13+08:00",
      "summary": "The Israel Defense Forces said Hamas militants fired at troops in Rafah in southern Gaza and later announced that two soldiers had been killed."
    },
    {
      "source": "華盛頓郵報",
      "title": "Desperately needed aid now reaching more of Gaza’s population amid truce",
      "link": "https://www.washingtonpost.com/world/2025/10/19/gaza-ceasefire-food-humanitarian-aid/",
      "pub_time_taipei": "2025-10-20T02:51:25+08:00",
      "summary": "But humanitarian groups continue to face challenges in supplying assistance, including blocked roads, damaged warehouses and Israeli government restrictions."
    },
    {
      "source": "衛報",
      "title": "Trump calls Colombia president ‘illegal drug dealer’ as US says it hit another ship",
      "link": "https://www.theguardian.com/us-news/2025/oct/19/trump-colombia-gustavo-petro",
      "pub_time_taipei": "2025-10-20T02:16:07+08:00",
      "summary": "<p>Trump vows to cut US funding as Pete Hegseth says US hit Colombian rebel group vessel and ‘three terrorists killed’</p><p>Donald Trump on Sunday accused Colombia’s president, Gustavo Petro, of being an “illegal drug dealer” and threatened to immediately cut US funding to the country, as a Republican senator said the US would soon announce “major tariffs” on the country.</p><p>It comes after the US defense secretary confirmed in a social media post an attack on a vessel associated with a Colombian leftist rebel group. Pete Hegseth said “three terrorists were killed” in the operation, which was “conducted in international waters”.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/19/trump-colombia-gustavo-petro\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Palestinians in Gaza fear ceasefire ‘could collapse at any moment’",
      "link": "https://www.theguardian.com/world/2025/oct/19/palestinians-in-gaza-fear-ceasefire-could-collapse-at-any-moment",
      "pub_time_taipei": "2025-10-20T01:51:05+08:00",
      "summary": "<p>Wave of Israeli airstrikes leaves nine-day truce teetering as residents recall previous dashed peace hopes</p><p><strong> </strong>For two years, Ismail Baba had dreamed of a ceasefire. The father of four had been displaced 11 times during the war in Gaza and was struggling to find adequate food for his children amid a worsening hunger crisis.</p><p>When a ceasefire was announced last week, Baba thought he could finally relax. Though his home was still plagued by chaos, at least he knew his family would not be struck by an Israeli bomb. <br /><br />\n The fleeting peace, however, was shattered on Sunday morning by a wave of <a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\">Israeli airstrikes across Gaza</a>, after Israel claimed Hamas militants targeted its troops in southern Gaza.</p> <a href=\"https://www.theguardian.com/world/2025/oct/19/palestinians-in-gaza-fear-ceasefire-could-collapse-at-any-moment\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza war has caused huge shifts in Middle East – and that may just be the beginning",
      "link": "https://www.theguardian.com/world/2025/oct/19/war-in-gaza-caused-big-political-shifts-and-more-are-likely-on-the-road-to-peace",
      "pub_time_taipei": "2025-10-20T01:43:25+08:00",
      "summary": "<p>Trump’s 20-point plan is forcing regional rivals to set aside differences and collaborate after years of competition</p><p>If the war in Gaza had dramatic consequences across the Middle East, overturning long-held assumptions, resetting the geopolitical map and provoking massive shifts in public opinion, any durable peace is likely to have equally momentous effects.</p><p>Some counsel caution.</p> <a href=\"https://www.theguardian.com/world/2025/oct/19/war-in-gaza-caused-big-political-shifts-and-more-are-likely-on-the-road-to-peace\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Story of Indigenous activist’s murder takes top prize at London film festival",
      "link": "https://www.theguardian.com/film/2025/oct/19/story-of-indigenous-activists-takes-top-prize-at-london-film-festival",
      "pub_time_taipei": "2025-10-19T21:52:48+08:00",
      "summary": "<p>Jury says documentary about killing of Argentinian campaigner Javier Chocobar brings ‘a measure of the justice’ denied by the courts</p><p>A documentary about the murder of the Indigenous activist Javier Chocobar has taken the top prize at the London film festival, with the jury calling it “a measure of the justice” that has long been denied by the courts.</p><p>The Argentine film-maker Lucrecia Martel’s first documentary, Landmarks, won the best film award in the festival’s official competition, it was announced on Sunday.</p> <a href=\"https://www.theguardian.com/film/2025/oct/19/story-of-indigenous-activists-takes-top-prize-at-london-film-festival\">Continue reading...</a>"
    }
  ]
}