{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-17T20:40:06.811075+08:00",
  "window_end_taipei": "2025-09-18T20:40:06.811075+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Trump and Starmer address business leaders as PM claims new US-UK investments ‘break all records’ – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/18/donald-trump-state-visit-uk-keir-starmer-labour-politics-latest-news",
      "pub_time_taipei": "2025-09-18T20:30:42+08:00",
      "summary": "<p>Starmer says deals worth £250bn are ‘flowing both ways across the Atlantic’</p><p>President Trump is now leaving Windsor Castle. He will be flying to Chequers by helicopter.</p><p><strong>Volodymyr Zelenskyy</strong>, the Ukrainian president, has thanked King Charles for what he said at the state banquet last night strongly supporting the Ukrainian cause.</p><p>I extend my deepest thanks to His Majesty King Charles III @RoyalFamily for his steadfast support. Ukraine greatly values the United Kingdom’s unwavering and principled stance.</p><p>When tyranny threatens Europe once again, we must all hold firm, and Britain continues to lead in defending freedom on many fronts. Together, we have achieved a lot, and with the support of freedom-loving nations—the UK, our European partners, and the US—we continue to defend values and protect lives. We are united in our efforts to make diplomacy work and secure lasting peace for the European continent.</p><p>Our countries have the closest defence, security and intelligence relationship ever known. In two world wars, we fought together to defeat the forces of tyranny.</p><p>Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine, to deter aggression and secure peace. And our Aukus submarine partnership, with Australia, sets the benchmark for innovative and vital collaboration.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/18/donald-trump-state-visit-uk-keir-starmer-labour-politics-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Strikes and marches against budget cuts cause disruption across France, with 94 arrests – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/18/france-strikes-lecornu-merz-sanchez-von-der-leyen-europe-live-latest-updates",
      "pub_time_taipei": "2025-09-18T20:25:02+08:00",
      "summary": "<p>Up to 800,000 people are expected to protest over public services and wages, a week after the appointment of prime minister Sébastien Lecornu</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/18/people-in-france-share-your-views-of-thursdays-nationwide-strike\">People in France: share your views on the strike</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/sep/18/france-strikes-day-sebastien-lecornu-emmanuel-macron-politics\">Full report: France’s biggest strike in years under way amid political crisis</a></p></li></ul><p>I am keeping an eye on the EU’s midday briefing just now, but there is <strong>no substantial update from the EU on the 19th package of sanctions against Russia.</strong></p><p>The European Commission’s deputy chief spokesperson, <strong>Olof Gill</strong>, repeated that <strong>“we expect to present … [them] soon</strong><strong>”</strong>, as he asked journalists to “please bear with us on that”, without offering more detail.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/18/france-strikes-lecornu-merz-sanchez-von-der-leyen-europe-live-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump celebrates Jimmy Kimmel suspension as some networks replace show with Charlie Kirk tribute – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
      "pub_time_taipei": "2025-09-18T20:22:11+08:00",
      "summary": "<p>Jamie Lee Curtis and Ben Stiller join outcry over indefinite removal of Jimmy Kimmel Live! as Senate Democratic leader says the suspension should ‘go to court’</p><ul><li><p><a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments\">Full report: Jimmy Kimmel Live! suspended over Charlie Kirk comments after US government pressure</a></p></li><li><p><a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-suspension-sparks-shock-fears-for-free-speech-censoring-realtime\">‘Censoring you in real time’: Kimmel suspension sparks shock and fears for free speech</a></p></li></ul><p>In reaction to the news that <strong>Jimmy Kimmel’</strong>s late-night show has been indefinitely suspended, the <strong>American Federation of Musicians (AFM)</strong> said that “Trump’s FCC identified speech it did not like and threatened ABC with extreme reprisals. This is state censorship.”</p><p>On X, the president of the American Federation of Musicians of the United States and Canada, <strong>Tino Gagliardi</strong>, issued a statement in response to <strong>ABC</strong> taking <strong>Jimmy Kimmel Live!</strong>, which employs musicians from the <strong>American Federation of Musicians Local 47</strong> in <strong>Los Angeles</strong>, off the air. In it he said:</p><p>This is not complicated: Trump’s FCC identified speech it did not like and theatened ABC with extreme reprisals. This is state censorship. It’s now happening in the United States of America, not some far-off country. It’s happening right here and right now.</p><p>This act by the Trump administration represents a direct attack on free speech and artistic expression. These are fundamental rights that we must protect in a free society. The American Federation of Musicians strongly condemns the decision to take Jimmy Kimmel Live! off the air.</p><p><em>As a Guild, we stand united in opposition to anyone who uses their power and influence to silence the voices of writers, or anyone who speaks in dissent. If free speech applied only to ideas we like, we needn’t have bothered to write it into the constitution. What we have signed on to – painful as it may be at times – is the freeing agreement to disagree.”</em></p><p>Democracy thrives when diverse points of view are expressed.</p><p>The decision to suspend airing Jimmy Kimmel Live! is the type of suppression and retaliation that endangers everyone’s freedoms. Sag-Aftra stands with all media artists and defends their right to express their diverse points of view, and everyone’s right to hear them.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "British taxpayers lose £400m as result of investment fund set up by Sunak",
      "link": "https://www.theguardian.com/politics/2025/sep/18/rishi-sunak-future-fund-british-taxpayers-lose",
      "pub_time_taipei": "2025-09-18T20:10:32+08:00",
      "summary": "<p>Report shows 334 companies backed by Future Fund, set up in May 2020 by then chancellor, have since gone under</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/18/bank-of-england-uk-interest-rates-bond-selling-qt-programme-andrew-bailey-business-live\">Business live – latest updates</a></p></li></ul><p>UK taxpayers have lost £400m after the collapse of hundreds of startups backed by <a href=\"https://www.theguardian.com/business/2023/apr/15/a-naive-and-stupid-idea-how-rishi-sunaks-future-fund-spent-millions-on-failed-firms\">a heavily-criticised Covid-era investment fund</a> launched by former prime minister Rishi Sunak.</p><p>The so-called Future Fund had originally spent £1.14bn backing 1,190 companies, including those not usually associated with government portfolios, such as the sex party organiser Killing Kittens and now-defunct festival tickets business Pollen. The fund also invested nearly £2m in companies <a href=\"https://www.theguardian.com/politics/2023/oct/19/sunaks-covid-startup-fund-invested-nearly-2m-in-firms-linked-to-his-wife\">linked to Sunak’s wife, Akshata Murty</a>.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/18/rishi-sunak-future-fund-british-taxpayers-lose\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bishop calls on Christians to reclaim England flag from ‘toxic tide of racism’",
      "link": "https://www.theguardian.com/world/2025/sep/18/bishop-arun-arora-christians-reclaim-england-flag",
      "pub_time_taipei": "2025-09-18T20:05:42+08:00",
      "summary": "<p>Arun Arora, bishop of Kirkstall, says Christians should not be ‘neutral in the face of violence and injustice’</p><p>A Church of England bishop has called on Christians to reclaim the flag and their faith from rightwing activists, saying both were being desecrated by people seeking to divide the nation.</p><p>The Right Rev Arun Arora, the bishop of Kirkstall and the C of E’s co-lead on racial justice, made his comments in a sermon days after more than 110,000 people marched through London in a rightwing protest, many carrying crosses.</p> <a href=\"https://www.theguardian.com/world/2025/sep/18/bishop-arun-arora-christians-reclaim-england-flag\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Growing number of Americans say U.S. supports Israel too much in Gaza war, poll shows",
      "link": "https://www.washingtonpost.com/world/2025/09/18/israel-gaza-us-support-poll/",
      "pub_time_taipei": "2025-09-18T20:00:00+08:00",
      "summary": "Republicans stand apart in backing U.S. support for Israel during the war in Gaza."
    },
    {
      "source": "衛報",
      "title": "Macrons to submit scientific evidence to US court to prove Brigitte was not born a man",
      "link": "https://www.theguardian.com/world/2025/sep/18/macrons-submit-scientific-evidence-us-court-prove-brigitte-not-man",
      "pub_time_taipei": "2025-09-18T19:56:56+08:00",
      "summary": "<p>French president and wife allege rightwing influencer Candace Owens is using defamatory attacks against them to boost media profile</p><p>The French president, Emmanuel Macron, and his wife plan to present scientific evidence to a US court to prove that Brigitte Macron was not born a man, the lawyer representing them in a defamation suit has said.</p><p>The couple <a href=\"https://www.theguardian.com/world/2025/jul/23/emmanuel-brigitte-macron-candace-owens-lawsuit-defamation\">filed the suit in July</a> against Candace Owens, a rightwing influencer, and her business, alleging continuing defamatory attacks against them in order to boost the profile of her media platform, gain more audience and make money.</p> <a href=\"https://www.theguardian.com/world/2025/sep/18/macrons-submit-scientific-evidence-us-court-prove-brigitte-not-man\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First person removed to France under ‘one in, one out’ asylum deal, says UK",
      "link": "https://www.theguardian.com/uk-news/2025/sep/18/first-person-removed-france-one-in-one-out-asylum-deal-home-office",
      "pub_time_taipei": "2025-09-18T19:49:49+08:00",
      "summary": "<p>Agreement reached with France allows for removal of asylum seekers who arrive on small boats</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/18/donald-trump-state-visit-uk-keir-starmer-labour-politics-latest-news\">UK politics live – latest updates</a></p></li></ul><p>The first Channel migrant has been deported to France under the controversial one in, one out deal, the Home Office has confirmed.</p><p>It follows three days of cancellations of tickets of asylum seekers due to fly and a high court challenge that halted the imminent removal of a 25-year-old Eritrean man to France on Tuesday evening. He was granted more time to gather evidence relating to his claim that he is a victim of trafficking.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/18/first-person-removed-france-one-in-one-out-asylum-deal-home-office\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "He was set to break a record cycling across Eurasia, then came Russia",
      "link": "https://www.washingtonpost.com/world/2025/09/18/sofiane-sehili-cyclist-arrested-vladivostok-russia/",
      "pub_time_taipei": "2025-09-18T19:48:09+08:00",
      "summary": "The day he was to break the record for the 11,000-mile trip from Portugal to the Pacific, Sofiane Sehili, who had a valid visa, was arrested crossing the border from China."
    },
    {
      "source": "衛報",
      "title": "More than half of RSC staff urged to apply for voluntary redundancy",
      "link": "https://www.theguardian.com/stage/2025/sep/18/rsc-staff-urged-apply-voluntary-redundancy",
      "pub_time_taipei": "2025-09-18T19:35:20+08:00",
      "summary": "<p>Arts institution seeks to make ‘urgent’ savings as it is thought to be facing a shortfall of between £5m and £6m</p><p>More than half of the Royal Shakespeare Company’s staff are being encouraged to apply for voluntary redundancy as the struggling arts institution seeks to make “urgent” savings to plug what is thought to be a shortfall of between £5m and £6m.</p><p>The cuts are aimed at ensuring that the RSC is “best placed to be a leading global theatre company”, according to a statement that blamed the budget hole on increasing staffing costs after the pandemic, a decline in public investment and the cost of living crisis affecting takings.</p> <a href=\"https://www.theguardian.com/stage/2025/sep/18/rsc-staff-urged-apply-voluntary-redundancy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Italy first in EU to pass comprehensive law regulating use of AI",
      "link": "https://www.theguardian.com/world/2025/sep/18/italy-first-in-eu-to-pass-comprehensive-law-regulating-ai",
      "pub_time_taipei": "2025-09-18T19:29:59+08:00",
      "summary": "<p>Legislation limits child access and imposes prison terms for damaging use of artificial intelligence</p><p>Italy has become the first country in the EU to approve a comprehensive law regulating the use of artificial intelligence, including imposing prison terms on those who use the technology to cause harm, such as generating deepfakes, and limiting child access.</p><p>Giorgia Meloni’s rightwing government said the legislation, which aligns with the <a href=\"https://www.theguardian.com/world/2023/dec/08/eu-agrees-historic-deal-with-worlds-first-laws-to-regulate-ai\">EU’s landmark AI Act</a>, is a decisive move in influencing how AI is used across Italy.</p> <a href=\"https://www.theguardian.com/world/2025/sep/18/italy-first-in-eu-to-pass-comprehensive-law-regulating-ai\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Pope Leo, in new biography, resists doctrinal change on hot-button topics",
      "link": "https://www.washingtonpost.com/world/2025/09/18/pope-leo-biography-first-interview/",
      "pub_time_taipei": "2025-09-18T19:10:55+08:00",
      "summary": "In extensive interviews, Pope Leo XIV, who turned 70 on Sunday, contours the future of his papacy, potentially one of the longest in decades."
    },
    {
      "source": "衛報",
      "title": "Two men and a woman arrested in Essex on suspicion of spying for Russia",
      "link": "https://www.theguardian.com/uk-news/2025/sep/18/three-people-arrested-in-essex-on-suspicion-of-assisting-russian-intelligence-service",
      "pub_time_taipei": "2025-09-18T19:06:47+08:00",
      "summary": "<p>Arrests follow counter-terrorism investigation into suspected National Security Act offences, Met police say</p><p>Two men and a woman have been arrested on suspicion of spying for Russia amid increasing alarm at the activities of Moscow’s intelligence services in the UK.</p><p>The Metropolitan police said two men aged 41 and 46 and a 35-year-old woman were arrested at two separate homes in Grays, Essex, on suspicion of assisting the Russian intelligence service and taken to a police station in London.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/18/three-people-arrested-in-essex-on-suspicion-of-assisting-russian-intelligence-service\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Picasso painting not seen for 80 years unveiled by Paris auction house",
      "link": "https://www.theguardian.com/artanddesign/2025/sep/18/picasso-painting-hidden-for-80-years-auction-paris",
      "pub_time_taipei": "2025-09-18T19:03:17+08:00",
      "summary": "<p>Portrait of Dora Maar completed in Paris during war had been in private collection since being bought in 1944</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/18/france-strikes-lecornu-merz-sanchez-von-der-leyen-europe-live-latest-updates\">Europe live – latest updates</a></p></li></ul><p>A newly discovered painting by Pablo Picasso of the French photographer and painter Dora Maar completed during the German occupation of Paris that has not been seen for 80 years, has been unveiled.</p><p>The work, Bust of a Woman in a Flowery Hat (Dora Maar), was finished towards the end of the couple’s turbulent nine-year relationship and shows Maar in a softer, more colourful light than Picasso’s previous portraits of his then lover.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/sep/18/picasso-painting-hidden-for-80-years-auction-paris\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘The dungeon’ at Louisiana’s notorious prison reopens as Ice detention center",
      "link": "https://www.theguardian.com/us-news/2025/sep/18/louisiana-angola-prison-trump-ice-immigration",
      "pub_time_taipei": "2025-09-18T19:00:13+08:00",
      "summary": "<p>Critics condemn reopening of ‘Camp J’ unit at Angola in service of Trump’s nationwide immigration crackdown, noting its history of brutality and violence</p><p>There were no hurricanes in the Gulf, as can be typical for <a href=\"https://www.theguardian.com/us-news/louisiana\">Louisiana</a> in late July – but Governor Jeff Landry quietly declared a state of emergency. The Louisiana state penitentiary at <a href=\"https://www.theguardian.com/us-news/2023/oct/30/bloodiest-prison-in-the-us-children-detained-in-louisianas-angola-prison-allege-abuses\">Angola</a> – the largest maximum security prison in the country – was out of bed space for “violent offenders” who would be “transferred to its facilities”, he warned in an executive order.</p><p>The emergency declaration allowed for the rapid refurbishing of a notorious, shuttered housing unit at Angola formerly known as Camp J – commonly referred to by prisoners as “the dungeon” because it was once used to house men in extended solitary confinement, sometimes for years on end.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/18/louisiana-angola-prison-trump-ice-immigration\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump cheers suspension of Jimmy Kimmel’s show after host’s Charlie Kirk comments | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/sep/18/first-thing-trump-cheers-jimmy-kimmel-suspension-charlie-kirk-comments",
      "pub_time_taipei": "2025-09-18T18:46:51+08:00",
      "summary": "<p>The two largest Hollywood unions voiced support for Kimmel. Plus, Bernie Sanders becomes first US senator to say Israel committing genocide in Gaza</p><p>Good morning.</p><p>Jimmy Kimmel Live! has been <a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments\">suspended “indefinitely”</a> after comments he made about the killing of Charlie Kirk, ABC has announced, hours after the Donald Trump-appointed chair of the broadcast regulator threatened broadcasters’ licenses if action was not taken against the late-night host.</p><p><strong>What did Kimmel say?</strong> During his opening monologue for Tuesday night’s show, <a href=\"https://www.theguardian.com/us-news/2025/sep/18/what-did-jimmy-kimmel-say-said-comments-about-charlie-kirk\">Kimmel said</a>: “Many in Maga-land are working very hard to capitalize on the murder of Charlie Kirk.” He accused the US vice-president, JD Vance, of blaming the left for Kirk’s death without evidence. “Here’s a question JD Vance might be able to answer: who wanted to hang the guy who was vice-president before you? Was that the liberal left? Or the toothless army who stormed the Capitol on January 6?” Kimmel said.</p><p><strong>How are people reacting?</strong> Trump celebrated the suspension on social media, calling it “great news for America”. But the two largest Hollywood unions – the Writers Guild of America and the Screen Actors Guild – as well as several Democratic lawmakers voiced support for Kimmel.</p><p><strong>What’s the context?</strong> It comes after an independent UN commission of experts <a href=\"https://www.ohchr.org/en/press-releases/2025/09/israel-has-committed-genocide-gaza-strip-un-commission-finds\">concluded that Israel’s actions</a> “meet the criteria set forth in the genocide convention”. It said: “Explicit statements by Israeli civilian and military authorities and the pattern of conduct of the Israeli security forces indicate that the genocidal acts were committed with intent to destroy, in whole or in part, Palestinians in the Gaza Strip as a group.”</p><p><strong>What’s the latest in Gaza City?</strong> The Israeli ground operation, which began on Tuesday morning, continues with Israeli troops pressing ahead yesterday, making further efforts to force more people to flee their homes and travel to overcrowded and unsafe areas in the south of the devastated territory. Read our <a href=\"https://www.theguardian.com/world/2025/sep/17/idf-try-to-force-civilians-out-of-gaza-city-as-ground-offensive-continues\">coverage here</a>.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/18/first-thing-trump-cheers-jimmy-kimmel-suspension-charlie-kirk-comments\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jimmy Kimmel Live! suspended over Charlie Kirk comments after US government pressure",
      "link": "https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments",
      "pub_time_taipei": "2025-09-18T18:38:41+08:00",
      "summary": "<p>Removal of late-night show criticised as part of Trump administration’s attack on critical voices in media, academia and business</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/18/what-did-jimmy-kimmel-say-said-comments-about-charlie-kirk\">What did Jimmy Kimmel say about Charlie Kirk?</a></p></li><li><p><a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-suspension-sparks-shock-fears-for-free-speech-censoring-realtime\">‘Censoring you in real time’: suspension of Jimmy Kimmel show sparks shock and fears for free speech</a></p></li></ul><p>Jimmy Kimmel’s late-night show has been suspended “indefinitely” after the US government put pressure on broadcasters to crack down on the comedian, who had <a href=\"https://www.theguardian.com/culture/2025/sep/17/jimmy-kimmel-republicans-charlie-kirk\">accused Donald Trump’s political movement of exploiting the killing of Charlie Kirk</a>.</p><p>ABC, which Disney owns, announced on Wednesday night that it would remove Kimmel’s show from its schedule for the foreseeable future.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Threatened by Trump, Canada tries to make up and team up with Mexico",
      "link": "https://www.washingtonpost.com/world/2025/09/18/canada-mexico-trade-carney-sheinbaum-usmca/",
      "pub_time_taipei": "2025-09-18T18:30:53+08:00",
      "summary": "Canadians mused last year about a U.S.-Canada trade deal that cut out Mexico. Prime Minister Mark Carney is visiting President Claudia Sheinbaum to mend ties."
    },
    {
      "source": "衛報",
      "title": "Vaccine ‘skeptics’ among new advisers joining CDC committee",
      "link": "https://www.theguardian.com/us-news/2025/sep/18/cdc-vaccine-committee",
      "pub_time_taipei": "2025-09-18T18:00:13+08:00",
      "summary": "<p>Some have little to no documented experience with vaccines while others have undermined their safety</p><p>Five new advisers will join the vaccines committee for the US Centers for Disease Control and Prevention (CDC) later this week, the agency and the US Department of Health and Human Services (HHS) announced on Monday, in a move that underscores the increasingly anti-vaccine stance of the committee.</p><p>Some of the new members have little to no documented experience with vaccines, while others have repeatedly undermined the safety and effectiveness of vaccines and other measures to control infectious disease.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/18/cdc-vaccine-committee\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "For the first time, Bernie Sanders calls Israel’s war in Gaza a genocide",
      "link": "https://www.washingtonpost.com/politics/2025/09/18/bernie-sanders-gaza-genocide-israel-statement/",
      "pub_time_taipei": "2025-09-18T17:30:14+08:00",
      "summary": "His move comes a day after a U.N. panel said Israel was committing genocide in Gaza. Israel rejected the findings, which echo those of a growing number of governments and rights groups."
    },
    {
      "source": "衛報",
      "title": "How vulnerable are Australia’s cities to extreme heat? Explore our maps",
      "link": "https://www.theguardian.com/environment/2025/sep/18/climate-crisis-how-vulnerable-australian-cities-sydney-melbourne-extreme-heat-explore-our-maps",
      "pub_time_taipei": "2025-09-18T17:27:14+08:00",
      "summary": "<p><strong>Exclusive:</strong> Residents of western Sydney and outer suburbs of Melbourne are at particular risk of high temperatures, data shows</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li></ul><p>As the federal government <a href=\"https://www.theguardian.com/environment/2025/sep/15/australia-national-climate-risk-assessment-summary-five-key-takeaways-heat-related-deaths-economic-cost-climate-change\">warns the climate crisis</a> will increase heat-related deaths, with the impact disproportionately borne by the already vulnerable, data obtained exclusively by Guardian Australia shows the parts of Australia’s major cities that are most vulnerable to heat.</p><p>The new measure, called the Heat Vulnerability Index and compiled by researchers at RMIT, combines temperature readings from satellites, with data on populations particularly susceptible to heat (such as older Australians and those with disabilities), the built environment and green space, and socioeconomic factors like income and education.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/18/climate-crisis-how-vulnerable-australian-cities-sydney-melbourne-extreme-heat-explore-our-maps\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brittany Higgins’ husband David Sharaz to pay $92,000 for tweet that defamed Linda Reynolds, court orders",
      "link": "https://www.theguardian.com/australia-news/2025/sep/18/brittany-higgins-husband-david-sharaz-to-pay-92000-for-tweet-that-defamed-linda-reynolds-court-orders-ntwnfb",
      "pub_time_taipei": "2025-09-18T17:15:41+08:00",
      "summary": "<p>Sharaz also liable for former defence minister’s legal costs on an indemnity basis, which is expected to exceed $500,000</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>David Sharaz has been ordered to pay $92,000 for social media posts the Western Australian supreme court found were defamatory against former defence minister Linda Reynolds.</p><p>Sharaz, a former journalist and Higgins’ now-husband, has also been found jointly responsible for another defamatory tweet to which Higgins responded, according to the court’s orders.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/18/brittany-higgins-husband-david-sharaz-to-pay-92000-for-tweet-that-defamed-linda-reynolds-court-orders-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Albanese’s Oprah-style emissions target aims to please almost everyone but risks falling short on climate action",
      "link": "https://www.theguardian.com/australia-news/2025/sep/18/government-climate-emissions-target-albanese-oprah-style-aims-please-everyone-australia-falls-short-real-climate-action",
      "pub_time_taipei": "2025-09-18T17:10:26+08:00",
      "summary": "<p>The prime minister has a stonking majority and a progressive crossbench that wants deeper cuts. So what has happened to lower the goal?</p><ul><li><p>Want to get this in your inbox when it publishes?<a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\"> Sign up for the Clear Air Australia newsletter here</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Australian government has announced an Oprah Winfrey-style emissions <a href=\"https://www.dcceew.gov.au/about/news/setting-2035-target-path-net-zero#_2035-target\">target for 2035</a>. It has tried to promise (nearly) everyone a prize.</p><p>By choosing a target range of a 62% to 70% cut compared with 2005 levels – based on long-awaited advice from the <a href=\"https://www.theguardian.com/environment/2025/sep/15/labor-will-announce-its-2035-emissions-target-this-week-heres-how-it-could-shape-australias-next-decade\">Climate Change Authority</a> and its chair, Matt Kean – it has opted for a political solution.</p><p><strong><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=copyembed\">Sign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/18/government-climate-emissions-target-albanese-oprah-style-aims-please-everyone-australia-falls-short-real-climate-action\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New details of allegations against broadcaster Alan Jones revealed in court documents",
      "link": "https://www.theguardian.com/media/2025/sep/18/alan-jones-pleads-not-guilty-27-charges-ntwnfb",
      "pub_time_taipei": "2025-09-18T17:05:36+08:00",
      "summary": "<p>Former 2GB and Sky News Australia presenter pleads not guilty to 27 charges after number of alleged victims drops from 11 to nine</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Court documents have revealed the extent of Alan Jones’s alleged offences, including claims of kissing, stroking, undressing and rubbing the penis of victims in the broadcaster’s home, restaurants and at public events.</p><p>In one instance in 2014, the veteran broadcaster allegedly indecently assaulted “complainant G” by rubbing his leg “towards his crotch” during a performance at the Sydney Opera House.</p> <a href=\"https://www.theguardian.com/media/2025/sep/18/alan-jones-pleads-not-guilty-27-charges-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ley, Waters and Pocock condemn government’s emissions call – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb",
      "pub_time_taipei": "2025-09-18T16:13:02+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/18/albanese-unveils-responsible-new-climate-target-to-slash-emissions-over-next-decade\">Bowen says cutting emissions by more than 70% ‘not achievable’ as 2035 target criticised from all sides</a></p></li><li><p><a href=\"https://www.theguardian.com/environment/2025/sep/18/what-is-a-climate-target-australia-2035-global-comparison\">Explainer: what is a climate target and how does Australia’s 2035 goal stack up against other countries?</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Michaelia Cash disputes UN body findings and says genocide not ‘simply about loss of life in war’</strong></p><p><strong>Michaelia Cash</strong>, the shadow foreign affairs minister, has discounted <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-committed-genocide-in-gaza-says-un-inquiry\">findings from a UN commission</a> this week that Israel is committing genocide in Gaza, saying genocide was not “simply about loss of life in war”.</p><p>Well, genocide, Sally, as you know, and I’m a lawyer, has a very specific meaning in international law.</p><p>It’s not simply about loss of life in war, however, tragic. It requires a deliberate intent to destroy a people in whole or in part. Now, Israel has made it very clear that its actions are about defending its citizens from Hamas terrorism, not about destroying the Palestinian people. …</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Saudi Arabia and Pakistan sign mutual defence pact as regional tensions escalate",
      "link": "https://www.theguardian.com/world/2025/sep/18/saudi-arabia-pakistan-mutual-defence-pact",
      "pub_time_taipei": "2025-09-18T13:17:51+08:00",
      "summary": "<p>Deal with nuclear-armed Pakistan comes as Gulf Arab states worry about US reliability while Saudi official says pact isn’t responding to ‘specific events’</p><p>Saudi Arabia and nuclear-armed Pakistan have signed a formal mutual defence pact in a move that significantly strengthens a decades-long security partnership amid heightened regional tensions.</p><p>The enhanced defence ties come as Gulf Arab states grow increasingly wary about the reliability of the US as their longstanding security guarantor – concerns heightened by <a href=\"https://www.theguardian.com/world/2025/sep/12/israels-strike-on-hamas-leaders-in-qatar-shatters-gulfs-faith-in-us-protection\">Israel’s attack in Qatar</a> last week.</p> <a href=\"https://www.theguardian.com/world/2025/sep/18/saudi-arabia-pakistan-mutual-defence-pact\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US judge orders Mahmoud Khalil deported citing ‘misrepresented facts’ on green card form",
      "link": "https://www.theguardian.com/us-news/2025/sep/18/mahmoud-khalil-judge-orders-activist-deported-green-card-form",
      "pub_time_taipei": "2025-09-18T12:30:14+08:00",
      "summary": "<p>Lawyers say pro-Palestinian activist remains protected from immigration enforcement while separate federal court case proceeds</p><p>An immigration judge in the US state of Louisiana has ordered the deportation of pro-Palestinian protest leader Mahmoud Khalil to Algeria or Syria, ruling that he failed to disclose information on his green card application, according to court documents filed on Wednesday.</p><p>Khalil’s lawyers said they intended to appeal against the deportation order, and that a federal district court’s separate orders remain in effect prohibiting the government from immediately deporting or detaining him as his federal court case proceeds. The lawyers submitted a letter to the federal court in New Jersey overseeing his civil rights case and said he will challenge the decision.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/18/mahmoud-khalil-judge-orders-activist-deported-green-card-form\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Venezuela starts days of military and ‘electronic warfare’ drills after US strikes on alleged drug boats",
      "link": "https://www.theguardian.com/world/2025/sep/18/venezuela-military-exercises-after-us-boat-attacks-kill-14-people",
      "pub_time_taipei": "2025-09-18T08:41:51+08:00",
      "summary": "<p>Armed forces say ‘special naval militia’ involved in Caribbean deployment as defence minister cites ‘threatening, vulgar voice’ of Washington</p><p>Venezuela says it has begun three days of military exercises on its Caribbean island of La Orchila as tensions soar amid US military activity in the region.</p><p>Forces deployed for what Washington called an anti-drug operation have <a href=\"https://www.theguardian.com/us-news/2025/sep/15/trump-strike-venezuela-drug-cartel-vessel\">blown up at least two Venezuelan boats</a> and a combined 14 people allegedly transporting drugs across the Caribbean this month – a move slammed by UN experts as “extrajudicial execution”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/18/venezuela-military-exercises-after-us-boat-attacks-kill-14-people\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Starmer to recognise Palestinian state ‘after Trump state visit’",
      "link": "https://www.theguardian.com/politics/2025/sep/17/reports-say-starmer-will-recognise-palestinian-state-over-weekend",
      "pub_time_taipei": "2025-09-18T06:59:27+08:00",
      "summary": "<p>Other nations including France, Australia and Canada plan to take the same step at next week’s UN summit </p><p>Keir Starmer will reportedly recognise a Palestinian state over the weekend after Donald Trump concludes his state visit to the UK.</p><p>The prime minister has previously said he plans to recognise Palestinian statehood before the UN general assembly in New York this month if Israel does not meet a series of conditions to improve the humanitarian situation in Gaza.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/17/reports-say-starmer-will-recognise-palestinian-state-over-weekend\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. wins release of Wells Fargo banker placed under exit ban in China",
      "link": "https://www.washingtonpost.com/national-security/2025/09/16/china-exit-ban-us-citizen-released/",
      "pub_time_taipei": "2025-09-18T04:12:12+08:00",
      "summary": "Beijing has allowed Mao Chenyue, a bank managing director in Atlanta, to return to the United States, people familiar with the matter said."
    },
    {
      "source": "華盛頓郵報",
      "title": "Gaza City’s communications cut amid widening Israeli ground invasion",
      "link": "https://www.washingtonpost.com/world/2025/09/17/gaza-city-israel/",
      "pub_time_taipei": "2025-09-18T04:06:01+08:00",
      "summary": "Palestinian journalists reported continuous fire in Gaza City, where hundreds of thousands remain. The Israeli military is effectively encircling the city."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump’s U.K. visit was meant to be cloistered. Protesters had other ideas.",
      "link": "https://www.washingtonpost.com/world/2025/09/17/trump-britain-protests-epstein-visit/",
      "pub_time_taipei": "2025-09-18T02:50:36+08:00",
      "summary": "President Donald Trump’s second state visit to Britain was designed to keep him away from crowds, but opponents of the American president made it clear they would be heard."
    },
    {
      "source": "華盛頓郵報",
      "title": "E.U. delays new Russia sanctions as Trump demands end to oil purchases",
      "link": "https://www.washingtonpost.com/world/2025/09/17/eu-sanctions-russia-oil-trump/",
      "pub_time_taipei": "2025-09-18T01:30:31+08:00",
      "summary": "European officials said President Donald Trump is right about the need to end purchases of Russian fossil fuels, but his demand delays new pressure on Moscow for a ceasefire."
    },
    {
      "source": "衛報",
      "title": "UN warns of ‘grave’ concerns for fuel and food in famine-hit northern Gaza – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates",
      "pub_time_taipei": "2025-09-18T00:30:57+08:00",
      "summary": "<p>Food and supplies running out in northern Gaza after Israel closed only crossing, UN says. This live blog is closed</p><p>The <strong>Israeli</strong> army said it has struck more than 150 targets in <strong>Gaza</strong> <strong>City</strong> since launching a major ground offensive on the <strong>Gaza</strong> <strong>Strip</strong>’s main urban hub early on Tuesday.</p><p>“Over the past two days, the [Israeli air force] and artillery corps troops struck over 150 terror targets throughout Gaza City in support of the manoeuvring troops in the area,” the military said in a statement issued on Wednesday, reports Agence France-Presse (AFP).</p><p>No one can fail to be distressed by the devastating impact the war has had on the children of Gaza, and I cannot imagine the fear and anguish their families have endured. It is a soul-destroying situation that compels us to act.</p><p>Every child deserves the chance to heal, to play, to simply be able to dream again. These young patients have witnessed horrors no child should ever see, but this marks the start of their journey towards recovery.</p><p>In Gaza, where the healthcare system has been decimated and hospitals are no longer functioning, there are severely ill children unable to get the medical care they need to survive.</p><p>As we welcome the first group of children to the UK for urgent treatment, their arrival reflects our determined commitment to humanitarian action and the power of international cooperation.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel’s culture minister threatens national film awards after Palestinian story takes top prize",
      "link": "https://www.theguardian.com/film/2025/sep/17/israels-culture-minister-threatens-national-film-awards-after-palestinian-story-takes-top-prize",
      "pub_time_taipei": "2025-09-18T00:20:19+08:00",
      "summary": "<p>Miki Zohar says he will cancel funding for the Ophir awards after The Sea, about a 12-year-old Palestinian boy who is denied entry to Tel Aviv, wins best picture</p><p>Israel’s culture minister, Miki Zohar, has announced that funding for the Ophirs, the country’s national film awards, would be cancelled after The Sea, a film about a 12-year-old Palestinian boy, won the best feature film prize.</p><p><a href=\"https://x.com/zoharm7/status/1968234990195417590\">In a statement on X</a>, translated by Israeli news media, Zohar said: “There is no greater slap in the face of Israeli citizens than the embarrassing and detached annual Ophir awards ceremony. Starting with the 2026 budget, this pathetic ceremony will no longer be funded by taxpayers’ money. Under my watch, Israeli citizens will not pay from their pockets for a ceremony that spits in the faces of our heroic soldiers.”</p> <a href=\"https://www.theguardian.com/film/2025/sep/17/israels-culture-minister-threatens-national-film-awards-after-palestinian-story-takes-top-prize\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "What Trump needs to know about royal etiquette on his U.K. state visit",
      "link": "https://www.washingtonpost.com/world/2025/09/17/royal-etiquette-101-trump-britain/",
      "pub_time_taipei": "2025-09-17T22:28:50+08:00",
      "summary": "When encountering a British royal, a bow or curtsy is okay, a hug generally is not, and “Your Majesty” or “Your Royal Highness,” is much preferred over saying “Chuck” or “Kate.”"
    },
    {
      "source": "華盛頓郵報",
      "title": "America and Britain were pillars of the world order. The world has changed.",
      "link": "https://www.washingtonpost.com/world/2025/09/16/america-britain-trump-world-order/",
      "pub_time_taipei": "2025-09-17T20:53:21+08:00",
      "summary": "President Trump arrived in Britain for meetings with King Charles III and Prime Minister Keir Starmer against a backdrop of global division, disarray and destruction."
    }
  ]
}