{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-08T20:40:07.170163+08:00",
  "window_end_taipei": "2025-10-09T20:40:07.170163+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Gaza ceasefire plan live: Israel says it is preparing to pull back troops; living hostages could be released within days",
      "link": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
      "pub_time_taipei": "2025-10-09T20:24:22+08:00",
      "summary": "<p>US president Donald Trump says Israel and Hamas have agreed to ‘first phase’ of plan to pause fighting and release some hostages and prisoners</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-and-hamas\">Full report: ‘First phase’ of deal to end war in Gaza agreed</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/oct/09/gaza-ceasefire-deal-first-phase-trump-peace-plan\">What we know so far about the deal</a></p></li></ul><p>Families of Israelis held hostage in Gaza gathered in what has come to be known as Hostages Square in Tel Aviv after the announcement.</p><p>“President Trump, thank you very much. We thank him, our children will not have returned home without him,” said <strong>Hatan Angrest</strong>, whose son Matan is among the hostages.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hero dog leads police to Florida woman, 86, who had fallen while walking him",
      "link": "https://www.theguardian.com/us-news/2025/oct/09/hero-dog-florida-woman-fallen",
      "pub_time_taipei": "2025-10-09T20:23:09+08:00",
      "summary": "<p>Dog named Eeyore attracted sheriff’s deputy’s attention: ‘He practically dragged me to her’</p><p>A dog named Eeyore turned into a very good boy and a hero of the hour after leading a Florida sheriff’s deputy to where a missing 86-year-old woman had fallen while walking him, body-cam footage shows.</p><p>The woman’s husband reported her missing on the night of 25 September after she failed to return from her walk in their Destin neighborhood in the Panhandle region of the US state.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/09/hero-dog-florida-woman-fallen\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ukrainian counteroffensive has derailed Russian plans to capture parts of Donetsk, says Zelenskyy – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates",
      "pub_time_taipei": "2025-10-09T20:21:24+08:00",
      "summary": "<p>Ukrainian president accuses Russia of wanting to sow ‘chaos’ with overnight attacks on energy and rail infrastructure, but says Ukrainian long-range strikes have caused gas shortages in Russia</p><p>Below is a video published by the Guardian showing Ukrainian firefighters tackling blazes in burning shipping containers after <strong><a href=\"https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates?CMP=share_btn_url&amp;page=with%3Ablock-68e783cd8f08e1d65d2a5d2b#block-68e783cd8f08e1d65d2a5d2b\">a</a></strong><a href=\"https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates?CMP=share_btn_url&amp;page=with%3Ablock-68e783cd8f08e1d65d2a5d2b#block-68e783cd8f08e1d65d2a5d2b\"> </a><strong><a href=\"https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates?CMP=share_btn_url&amp;page=with%3Ablock-68e783cd8f08e1d65d2a5d2b#block-68e783cd8f08e1d65d2a5d2b\">Russian drone attack injured at least five people in Odesa.</a></strong></p><p>The attack cut power to 30,000 people and damaged the city’s port infrastructure.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "President Petro accuses US of killing Colombians in attacks on ‘narco-boats’",
      "link": "https://www.theguardian.com/world/2025/oct/09/gustavo-petro-colombia-boats-us-military",
      "pub_time_taipei": "2025-10-09T20:18:36+08:00",
      "summary": "<p>Gustavo Petro demands US release names of victims: ‘A new theatre of war has opened up: the Caribbean’</p><p>Colombia’s president, Gustavo Petro, has drawn Washington’s ire after accusing the US of killing Colombian citizens during a recent boat strike in the Caribbean Sea.</p><p>“A new theatre of war has opened up: the Caribbean,” Petro wrote on his official X account on Wednesday night.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/gustavo-petro-colombia-boats-us-military\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Live updates: Israelis and Palestinians celebrate Gaza ceasefire deal that would release hostages",
      "link": "https://www.washingtonpost.com/world/2025/10/09/israel-hamas-gaza-deal-ceasefire-live/",
      "pub_time_taipei": "2025-10-09T20:18:15+08:00",
      "summary": "The ceasefire deal’s first phase, if successful, would halt fighting in Gaza to release hostages in exchange for Israel’s release of Palestinian prisoners."
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas took 251 hostages from Israel into Gaza. Where are they?",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T20:18:15+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "National guard troops ‘protecting’ ICE and other federal property in Chicago area – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
      "pub_time_taipei": "2025-10-09T20:11:11+08:00",
      "summary": "<p>Move comes as Donald Trump calls for imprisonment of Brandon Johnson, Chicago’s mayor, and JB Pritzker, the Illinois governor</p><p>We’ll hear from <strong>Donald Trump</strong> at <strong>11am EST today</strong>, when he hosts a cabinet meeting at the White House. We can expect to hear more about the first phase of the peace plan, but also some more reaction to National Guard troops deployed to Chicago.</p><p>The president’s last cabinet meeting went on for more than three hours…so we’re buckled in.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Britain missing out on potential £2bn recycling industry by exporting plastic waste",
      "link": "https://www.theguardian.com/environment/2025/oct/09/britain-2bn-recycling-industry-export-plastic-waste",
      "pub_time_taipei": "2025-10-09T20:05:48+08:00",
      "summary": "<p>Exclusive: Government failure to close loophole allows 600,000 tonnes to be shipped abroad each year</p><p>A plastic recycling industry potentially worth £2bn and 5,000 jobs is dying in the UK because of government failure to close a loophole that allows <a href=\"https://www.letsrecycle.com/news/uk-is-third-highest-exporter-of-waste-says-cleanhub/\">600,000 tonnes of plastic waste to be exported each year</a>.</p><p>The Guardian can reveal that in the past two years 21 plastic recycling and processing factories across the UK have shut down due to the scale of exports, the cheap price of virgin plastic and an influx of cheap plastic from Asia, according to data gathered by industry insiders.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/09/britain-2bn-recycling-industry-export-plastic-waste\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "László Krasznahorkai wins the Nobel prize in literature 2025",
      "link": "https://www.theguardian.com/books/2025/oct/09/laszlo-krasznahorkai-wins-the-nobel-prize-in-literature-2025",
      "pub_time_taipei": "2025-10-09T20:04:45+08:00",
      "summary": "<p>The Hungarian novelist whose books ‘reaffirm the power of art’ was announced as winner at a ceremony in Stockholm<br />• <a href=\"https://www.theguardian.com/books/live/2025/oct/09/nobel-prize-in-literature-2025-live\">Nobel prize in literature 2025 live: László Krasznahorkai wins ‘for his compelling and visionary oeuvre’</a><br /></p><p>The Nobel prize in literature for 2025 has been awarded to Hungarian author László Krasznahorkai, the Swedish Academy has announced.</p><p>The Academy cited the 71-year-old’s “compelling and visionary oeuvre that, in the midst of apocalyptic terror, reaffirms the power of art”.</p> <a href=\"https://www.theguardian.com/books/2025/oct/09/laszlo-krasznahorkai-wins-the-nobel-prize-in-literature-2025\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK ‘stands ready to play our part’ in Gaza ceasefire deal, says foreign secretary – politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/09/foreign-secretary-yvette-cooper-keir-starmer-gaza-ceasefire-uk-politics-live",
      "pub_time_taipei": "2025-10-09T20:01:46+08:00",
      "summary": "<p>Yvette Cooper says deal to bring end to assault on Gaza and free hostages should be ‘implemented as swiftly as possible’</p><p><strong>Compensation schemes for victims of the <a href=\"https://www.theguardian.com/uk-news/post-office-horizon-scandal\">Post Office Horizon IT scandal</a> will be improved, with a new appeals process and funded legal advice for post office operators, the government has announced.</strong></p><p>Responding to the <a href=\"https://www.theguardian.com/uk-news/2025/jul/08/post-office-scandal-inquiry-horizon-it-scandal\">first part of the findings</a> from a two-year public inquiry into the Horizon IT scandal, regarded as one of the worst miscarriages of justice in UK legal history, the business secretary, Peter Kyle, said there would be a new appeals process for people who have accepted fixed-sum offers under the Horizon Shortfall Scheme, one of several compensation schemes. Funded legal advice will also be offered.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/09/foreign-secretary-yvette-cooper-keir-starmer-gaza-ceasefire-uk-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Alarm as CDC calls for separate MMR vaccines despite measles outbreak",
      "link": "https://www.theguardian.com/us-news/2025/oct/09/cdc-separate-mmr-vaccines",
      "pub_time_taipei": "2025-10-09T20:00:24+08:00",
      "summary": "<p>Concerns that three separate shots would be more costly and time-consuming, and keep kids from being vaccinated</p><p>The measles, mumps and rubella (MMR) vaccine is undergoing more scrutiny by the Trump administration in their ongoing reassessment of vaccines despite the worst measles outbreak in decades.</p><p>Jim O’Neill, the deputy secretary of the US Department of Health and Human Services (HHS) and the acting director of the US Centers for Disease Control and Prevention (CDC), called on Monday for new vaccines to replace the current MMR shots.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/09/cdc-separate-mmr-vaccines\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "World leaders voice support for ceasefire deal",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T19:52:50+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "China puts new limits on rare earths as Xi’s meeting with Trump looms",
      "link": "https://www.washingtonpost.com/world/2025/10/09/china-rare-earths-export-controls-trump-xi/",
      "pub_time_taipei": "2025-10-09T19:46:52+08:00",
      "summary": "China has put new export controls on rare earths, used in U.S. defense technology and computer chips, ahead of a meeting between the two countries’ leaders."
    },
    {
      "source": "衛報",
      "title": "US regulators launch investigation into self-driving Teslas after series of crashes",
      "link": "https://www.theguardian.com/technology/2025/oct/09/tesla-cars-self-driving-us-regulators-investigation",
      "pub_time_taipei": "2025-10-09T19:45:28+08:00",
      "summary": "<p>NHTSA reported Teslas driving through red traffic lights and driving against direction of travel during a lane change</p><p>US automobile safety regulators have opened an investigation into Tesla vehicles equipped with its full self-driving technology over traffic-safety violations after a series of crashes.</p><p>The National Highway Traffic Safety Administration (NHTSA) said the electric carmaker’s self driving assistance system, which requires drivers to pay attention and intervene if needed, had “induced vehicle behaviour that violated traffic safety laws”.</p> <a href=\"https://www.theguardian.com/technology/2025/oct/09/tesla-cars-self-driving-us-regulators-investigation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Millions in England face higher water bills after regulator backs more price rises",
      "link": "https://www.theguardian.com/business/2025/oct/09/millions-of-households-face-jump-in-water-bills-after-regulator-backs-more-price-rises",
      "pub_time_taipei": "2025-10-09T19:45:15+08:00",
      "summary": "<p>Competition watchdog agrees to requests from Anglian, Northumbrian, South East, Southern and Wessex to increase charges</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/09/water-customers-bill-hike-winter-blackouts-risk-falls-stock-markets-pound-ftse-business-live-news\">Business live – latest updates</a></p></li></ul><p>Water bills for millions of households in England are to increase by even more than expected after the competition regulator gave the green light for five water suppliers to raise charges to customers – but rejected most of the companies’ demands.</p><p>An independent group of experts appointed by the Competition and Markets Authority (CMA) decided provisionally to let the companies collectively charge customers an extra £556m over the next five years, it said on Thursday. That was only 21% of the £2.7bn the companies had sought.</p> <a href=\"https://www.theguardian.com/business/2025/oct/09/millions-of-households-face-jump-in-water-bills-after-regulator-backs-more-price-rises\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Radioactive’ shrimp crisis: Indonesia grapples with contaminated industrial zone",
      "link": "https://www.theguardian.com/world/2025/oct/09/radioactive-shrimp-crisis-indonesia-contaminated-industrial-zone",
      "pub_time_taipei": "2025-10-09T19:42:55+08:00",
      "summary": "<p>Authorities investigate site after shrimp exported to the US found to contain hazardous isotope Caesium-137</p><p>A large industrial zone on the outskirts of Jakarta, Indonesia, is grappling with radioactive contamination after a government taskforce found traces of the hazardous isotope Caesium-137 at 22 production facilities at the site, which<strong> </strong>includes<strong> </strong>businesses that export frozen seafood.</p><p>The discovery, which has prompted emergency decontamination and relocation of residents, follows a contamination scare in the US that was traced back to the Jakarta facilities.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/radioactive-shrimp-crisis-indonesia-contaminated-industrial-zone\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Man who attacked synagogue on Yom Kippur proclaimed allegiance to ISIS",
      "link": "https://www.washingtonpost.com/world/2025/10/09/synagogue-attacker-allegiance-isis-manchester/",
      "pub_time_taipei": "2025-10-09T19:39:44+08:00",
      "summary": "The man called police and declared his Islamic State allegiance but officials said there was no evidence that he was affiliated with any organized group."
    },
    {
      "source": "衛報",
      "title": "Head of largest US bank warns of risk of American stock market crash",
      "link": "https://www.theguardian.com/business/2025/oct/09/head-of-jpmorgan-chase-warns-of-risk-of-american-stock-market-crash",
      "pub_time_taipei": "2025-10-09T19:30:04+08:00",
      "summary": "<p>Jamie Dimon, chair of JPMorgan Chase, said he was ‘far more worried than others’ about serious market correction</p><p>The chances of the US stock market crashing is far greater than many financiers believe, the head of America’s largest bank has said.</p><p>Jamie Dimon, who is the chair and chief executive of the giant Wall Street bank JPMorgan Chase, said he was “far more worried than others” about a serious market correction, which he predicted could come in the next six months to two years.</p> <a href=\"https://www.theguardian.com/business/2025/oct/09/head-of-jpmorgan-chase-warns-of-risk-of-american-stock-market-crash\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "National guard remains in Chicago area as judge to rule on Trump deployment",
      "link": "https://www.theguardian.com/us-news/2025/oct/09/chicago-national-guard-troops",
      "pub_time_taipei": "2025-10-09T19:25:37+08:00",
      "summary": "<p>President attacks Chicago mayor and Illinois governor as extra troops at army training site south-west of city</p><p>Hundreds of national guard troops remained in the Chicago area as city and Illinois officials awaited a judge’s decision to stop Donald Trump’s aggressive immigration enforcement operation in the nation’s third-largest city.</p><p>It was still unclear where specifically the Trump administration would send the troops who reported to an army training site south-west of Chicago, which was laden with extra fencing and tarps put up to block the public’s view of the facility late on Wednesday evening.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/09/chicago-national-guard-troops\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel’s security cabinet will  meet on Thursday evening to vote on the deal, followed by...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T19:16:20+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Increase sentence for Gisèle Pelicot rapist, prosecutor tells court of appeal",
      "link": "https://www.theguardian.com/world/2025/oct/09/increase-sentence-for-gisele-pelicot-rapist-prosecutor-tells-appeal-court",
      "pub_time_taipei": "2025-10-09T19:14:00+08:00",
      "summary": "<p>Dominique Sie recommends 12-year jail term after Husamettin Dugan’s ‘refusal to take responsibility’ for assault</p><p>The French state prosecutor has called for the jail term of an unemployed builder to be increased after he contested his conviction for raping Gisèle Pelicot after she had been drugged unconscious by her husband.</p><p>Dominique Sie, the lead state prosecutor, told the court of appeal in Nîmes that <a href=\"https://www.theguardian.com/world/2025/oct/08/gisele-pelicot-appeal-trial-never-gave-consent-husamettin-dogan\">Husamettin Dogan’s</a> claims of innocence were an example of how rape culture was still widespread in society as part of “archaic” forms of “male domination”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/increase-sentence-for-gisele-pelicot-rapist-prosecutor-tells-appeal-court\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Richard Desmond asks for ‘generosity’ in £1.3bn National Lottery claim",
      "link": "https://www.theguardian.com/media/2025/oct/09/richard-desmond-seeks-13m-claim-gambling-commission-uk-lottery",
      "pub_time_taipei": "2025-10-09T19:07:15+08:00",
      "summary": "<p>Payout likely to be funded by taxpayers if media mogul wins case against gambling regulator</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/09/water-customers-bill-hike-winter-blackouts-risk-falls-stock-markets-pound-ftse-business-live-news\">Business live – latest updates</a></p></li></ul><p>The billionaire media mogul Richard Desmond will urge a court to “err on the side of generosity” in assessing a £1.3bn damages claim against the Gambling Commission that would probably have to be funded by taxpayers if he wins.</p><p>Companies owned by the former proprietor of the Daily Express, Asian Babes and Readers’ Wives are <a href=\"https://www.theguardian.com/uk-news/2022/apr/15/national-lottery-richard-desmond-takes-legal-action-over-licence-award\">suing the gambling regulator</a> in a bitter dispute that opens today.</p> <a href=\"https://www.theguardian.com/media/2025/oct/09/richard-desmond-seeks-13m-claim-gambling-commission-uk-lottery\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New French PM to be named by Friday as Macron resists pressure to call snap elections",
      "link": "https://www.theguardian.com/world/2025/oct/09/new-french-pm-to-be-named-by-friday-as-macron-resists-pressure-to-call-snap-elections",
      "pub_time_taipei": "2025-10-09T18:58:09+08:00",
      "summary": "<p>Government spokesperson says it may be ‘last chance’ for politicians to regain credibility and cut risk of far right taking power</p><p>Emmanuel Macron will name a new prime minister by Friday evening, his office has said, hinting at the president’s hopes that a sixth prime minister in less than two years will manage to steer a budget through France’s deeply fragmented parliament.</p><p>“This might be the last chance,” the government spokesperson Aurore Bergé told RTL radio on Thursday. “I believe this is the last chance for politicians to regain credibility ... all of this is only strengthening the chances and capabilities of the far right to take power.”</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/new-french-pm-to-be-named-by-friday-as-macron-resists-pressure-to-call-snap-elections\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Sharm el-Sheikh has a history of hosting high-stakes negotiations",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T18:58:05+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Venice opera house staff to strike over hiring of Meloni-linked conductor",
      "link": "https://www.theguardian.com/world/2025/oct/09/venice-opera-house-staff-strike-meloni-linked-conductor-beatrice-venezi",
      "pub_time_taipei": "2025-10-09T18:55:54+08:00",
      "summary": "<p>La Fenice’s musicians and staff claim Beatrice Venezi lacks experience and was picked because of government ties</p><p>Staff at Venice’s La Fenice opera house have voted to strike over the appointment of a conductor with ties to Giorgia Meloni’s far-right government.</p><p>The strike will be held on Friday 17 October, the date of the opera house’s first performance of a run of Alban Berg’s Wozzeck, which will close its 2024-25 season.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/venice-opera-house-staff-strike-meloni-linked-conductor-beatrice-venezi\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas took 251 hostages from Israel into Gaza. Where are they?",
      "link": "https://www.washingtonpost.com/world/interactive/hamas-hostages-israel-war-gaza/",
      "pub_time_taipei": "2025-10-09T18:40:25+08:00",
      "summary": "We’re tracking what happened to the hostages taken by Hamas on Oct. 7, 2023, from Israel. Dozens were freed or killed, and about 20 are believed to be alive in Gaza."
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli military operations in the West Bank should not be ignored following the ceasefire agreement, Shaina...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T18:20:50+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Agencies need time to prepare Gaza aid surge, worker says",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T18:07:17+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "As Pope Leo riles conservatives, some say ‘just focus on the church’",
      "link": "https://www.washingtonpost.com/world/2025/10/09/pope-leo-riles-conservatives-vatican/",
      "pub_time_taipei": "2025-10-09T18:06:21+08:00",
      "summary": "Conservatives who hoped that Leo, the first U.S.-born pope, would be more of a traditionalist instead hear echoes of his predecessor, Francis, in his public statements."
    },
    {
      "source": "華盛頓郵報",
      "title": "Who are the hostages believed to still be alive in Gaza?",
      "link": "https://www.washingtonpost.com/world/2025/05/12/hamas-gaza-remaining-israel-hostages/",
      "pub_time_taipei": "2025-10-09T18:02:04+08:00",
      "summary": "Fewer than two dozen hostages are believed to be alive in Gaza, including a student, a software tester, a bartender and several soldiers."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. aid cuts are being felt across Africa. Here’s where.",
      "link": "https://www.washingtonpost.com/world/2025/10/09/usaid-cuts-africa-health-crisis/",
      "pub_time_taipei": "2025-10-09T18:00:17+08:00",
      "summary": "How the abrupt withdrawal of U.S. aid has affected disease preparedness and response in Ethiopia, Zimbabwe, Kenya, Somalia and Tanzania."
    },
    {
      "source": "華盛頓郵報",
      "title": "Former hostages, families gather in Tel Aviv to celebrate ceasefire deal",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T17:59:37+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. envoy Steve Witkoff will arrive in Israel tonight, according to Israeli media and a person...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T17:54:56+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Who are the hostages believed to still be alive in Gaza?",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T17:37:28+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Video: Trump tells hostage families their loved ones will return Monday",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T17:20:31+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "“Trump forced a plan on both Netanyahu and Hamas that neither of them really wanted” about...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T17:04:41+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Two years later, some Israelis who fled Hamas attack have yet to go home",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T16:40:15+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "What we know about the ceasefire deal so far",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T16:35:16+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "PTSD and suicides spike among Israeli troops amid Gaza war devastation",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T16:20:57+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Australia must ‘have the guts’ to stand up to Japanese companies reselling gas for profit, Husic says",
      "link": "https://www.theguardian.com/australia-news/2025/oct/09/australia-japanese-companies-reselling-gas-for-profit-ed-husic",
      "pub_time_taipei": "2025-10-09T16:06:27+08:00",
      "summary": "<p>Labor backbencher is calling for drastic intervention to secure supplies for the east coast</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Labor backbencher Ed Husic is demanding an intervention to combat Japanese gas companies re-selling Australian exports to other markets, breaking ranks from the government and risking diplomatic blowback from Tokyo.</p><p>The former industry minister said the government must send a “powerful signal” to overseas multinationals, in particular in Japan, to stop “playing us off as mugs” by profiting off the resale of Australian gas while households and industry on the east coast face high prices and potential supply shortages.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/09/australia-japanese-companies-reselling-gas-for-profit-ed-husic\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Almost 55,000 preschool children in Gaza acutely malnourished, Lancet study estimates",
      "link": "https://www.theguardian.com/world/2025/oct/08/almost-55000-children-in-gaza-acutely-malnourished-lancet-study-estimates",
      "pub_time_taipei": "2025-10-09T15:58:44+08:00",
      "summary": "<p>Study shows clear link between Israeli aid restrictions and malnutrition among children aged between six months and five years</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous\">Gaza ceasefire plan live – latest updates</a></p></li></ul><p>Almost 55,000 children under the age of six in Gaza are estimated to be acutely malnourished, far more than have so far been <a href=\"https://www.unicef.org/press-releases/devastating-rate-child-malnutrition-gaza-strip-august-surpasses-july-record\">identified</a> as victims of the potentially lethal condition, a study published in the Lancet, the respected international medical periodical, has revealed.</p><p>The study, <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(25)01820-3/fulltext\">published on Wednesday,</a> and led by the UN Relief and Works Agency for Palestine Refugees (Unrwa), offers a month-by-month breakdown through much of the two-year conflict, and shows for the first time a clear link between Israeli restrictions on supplies entering Gaza and levels of malnutrition among children.</p> <a href=\"https://www.theguardian.com/world/2025/oct/08/almost-55000-children-in-gaza-acutely-malnourished-lancet-study-estimates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Most points of the ceasefire deal were probably agreed to in broad strokes before negotiations began...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T15:55:57+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "‘First phase’ of ceasefire deal to end war in Gaza agreed by Israel and Hamas",
      "link": "https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-and-hamas",
      "pub_time_taipei": "2025-10-09T15:54:07+08:00",
      "summary": "<p>Donald Trump announces all hostages will be released ‘very soon’ and Israel will withdraw troops to an agreed timeline</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous\">Gaza ceasefire plan – live updates</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/oct/09/gaza-ceasefire-deal-first-phase-trump-peace-plan\">What we know so far about the deal</a></p></li></ul><p>Israel and Hamas have agreed to the initial phase of a ceasefire plan in Gaza, pausing hostilities in the devastated territory and bringing the best hope yet of a definitive end to a bloody two-year conflict that has killed tens of thousands, destabilised much of the Middle East and prompted protests around the world.</p><p>Donald Trump announced the agreement on his Truth Social network saying <a href=\"https://www.theguardian.com/world/2025/oct/09/gaza-ceasefire-deal-first-phase-trump-peace-plan\">all of the hostages held in Gaza</a> would be released soon and Israel would withdraw troops to an agreed line as the first step to a “Strong, Durable, and Everlasting Peace”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-and-hamas\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Victoria considers sentencing changes as premier says community wants ‘consequences’ for ‘brazen behaviour’",
      "link": "https://www.theguardian.com/australia-news/2025/oct/09/victoria-sentencing-premier-jacinta-allan-says-community-wants-consequences-ntwnfb",
      "pub_time_taipei": "2025-10-09T15:43:49+08:00",
      "summary": "<p><strong>Exclusive: </strong>Jacinta Allan’s comments come after a cabinet subcommittee met to address growing concerns about youth crime</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Victorian premier, Jacinta Allan, has left the door open to sentencing reform, saying the community wants “consequences” for “brazen, shocking behaviour” amid concerns about violent crime.</p><p>The comments mark a shift in language and come after a cabinet subcommittee met on Monday to address growing concerns about youth crime in the state and police and union calls for tougher sentences for repeat offenders.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/09/victoria-sentencing-premier-jacinta-allan-says-community-wants-consequences-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How Israel’s invasion has shattered lives, livelihoods and learning in Gaza",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T15:33:48+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "High court dismisses former army lawyer David McBride’s application for case to be heard – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb",
      "pub_time_taipei": "2025-10-09T15:18:48+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Will Australia’s east coast get a gas reserve?</strong></p><p>There have been growing calls for an east coast gas reserve to help combat sky high gas prices, including a push from the <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb?page=with%3Ablock-68e580658f0827be08c21bcd#block-68e580658f0827be08c21bcd\">Bluescope steel CEO yesterday</a>.</p><p>We will do a careful piece of work here. In the last term of government, we intervened on gas prices following Russia’s illegal invasion of Ukraine and the impact that had in global energy markets in order to support, of course, households, but also industry.</p><p>Gas is absolutely critical for sections of Australian industry … It’s a critical transition fuel to lower Australia’s industrial emissions.</p><p>We’re a big exporter of gas, and it’s reasonable that I think for Australian industry and for Australians to say we need to make sure there is sufficient gas for Australian industry.</p><p>This is a critical industrial capability for Australia. We have vast reserves of copper ore, and there is global trade imbalances, subsidies in some markets, volatility that is making it an unfair playing field for Australian copper producers in global markets. We need to see that.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "More than 67,000 Palestinians — or about 3 percent of Gaza’s population — have been killed...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T15:16:40+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Ruby Chen, the father of an American-Israeli Israel Defense Forces soldier who was believed to be...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T15:01:39+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Google blocked STI awareness ads as ‘adult content’, Senate estimates hears",
      "link": "https://www.theguardian.com/australia-news/2025/oct/09/google-blocked-sti-awareness-ads-as-adult-content-senate-estimates-hears",
      "pub_time_taipei": "2025-10-09T14:27:34+08:00",
      "summary": "<p>Search engine added ‘STI testing’ to list of sensitive topics, censoring important public health campaign, Greens leader says</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Google has blocked ads for a commonwealth-funded STI awareness campaign as “adult content” in a move sexual health organisations say frustrates efforts to share evidence-based public health information online.</p><p>The Greens leader, Larissa Waters, told a Senate estimates hearing on Thursday that the tech company’s moderation practices had recently undermined the reach and cost-effectiveness of the national campaign, run by Sexual and Reproductive Health Australia (SRHA).</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/09/google-blocked-sti-awareness-ads-as-adult-content-senate-estimates-hears\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "NSW transport bureaucrat admits being given envelopes of cash at Oporto to artificially inflate invoices",
      "link": "https://www.theguardian.com/australia-news/2025/oct/09/nsw-transport-bureaucrat-cash-bribes-oporto-fake-invoices-ntwnfb",
      "pub_time_taipei": "2025-10-09T14:15:05+08:00",
      "summary": "<p>Ibrahim Helmy tells Icac hearing he created fake invoices as part of alleged multimillion-dollar kickback scheme</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A former transport bureaucrat has admitted to being paid with envelopes of cash at an Oporto fast-food restaurant after allegedly asking a contractor to artificially inflate invoices so they could share the difference.</p><p>Ibrahim Helmy, 38, appeared before the <a href=\"https://www.theguardian.com/australia-news/new-south-wales\">New South Wales</a> Independent Commission Against Corruption (Icac) on Thursday for a second day of evidence on his alleged involvement at the centre of a multimillion-dollar kickback scheme.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/09/nsw-transport-bureaucrat-cash-bribes-oporto-fake-invoices-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Happy, stressed, overwhelmed: Palestinians evacuated from Gaza start their studies in UK",
      "link": "https://www.theguardian.com/education/2025/oct/09/palestinians-evacuated-gaza-studies-uk-universities",
      "pub_time_taipei": "2025-10-09T14:00:18+08:00",
      "summary": "<p>Abdallah, 27, and Soha, 31, describe adjusting to their new lives after leaving their war-torn home</p><p>The young man emerging from a backstreet accommodation block in a bustling corner of east London looks much like any other student, getting to grips with his studies at the start of a new term. But 27-year-old Abdallah carries more of a burden than most. A qualified doctor, he has recently been evacuated from Gaza to begin his studies at Queen Mary University of London on a fully funded, government-backed Chevening scholarship.</p><p>As well as his work in hospitals, he has been striving for months on behalf of the dozens of Palestinian scholars like himself who have been stranded in war-torn Gaza awaiting evacuation by the British government to take up places in UK universities.</p> <a href=\"https://www.theguardian.com/education/2025/oct/09/palestinians-evacuated-gaza-studies-uk-universities\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump says Netanyahu called him to celebrate the deal",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T13:59:32+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump announces ceasefire deal to begin ending the war in Gaza",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T13:59:07+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Thursday briefing: What the first phase of a Gaza peace plan will bring",
      "link": "https://www.theguardian.com/world/2025/oct/09/first-edition-gaza-peace-plan-first-phase",
      "pub_time_taipei": "2025-10-09T13:55:53+08:00",
      "summary": "<p>In today’s newsletter: A ceasefire between Israel and Hamas will see the release of hostages and the withdrawal of most of Israel’s troops</p><p>Good morning. After more than two years of devastating war, a ceasefire has finally been announced in Gaza.</p><p>US president Donald Trump said Israel and Hamas have agreed to the first phase of a peace plan to pause fighting and secure the release of hostages and prisoners. Under the deal, Hamas is expected to release 20 surviving hostages over the coming days in exchange for Palestinian detainees, while Israeli forces will begin withdrawing from most of Gaza.</p><p><em><strong>Gaza</strong></em> | Israel and Hamas have agreed to the <a href=\"https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-and-hamas\">“first phase” of a peace plan</a> to pause fighting and release some hostages and prisoners held in Gaza, bringing the best hope yet of a definitive end to a bloody two-year conflict that has killed ten of thousands, destabilised much of the Middle East and prompted protests across the world.</p><p><em><strong>Health</strong></em> | Ministers <a href=\"https://www.theguardian.com/business/2025/oct/08/nhs-could-pay-25-more-for-medicines-under-plan-to-end-row-with-drugmakers-and-trump\">are preparing to raise</a> the amount the NHS pays pharmaceutical firms for medicines by up to 25% after weeks of intensive talks with the Donald Trump administration and drugmakers.</p><p><em><strong>Education</strong></em> | Universities in the UK reassured arms companies they would monitor students’ chat groups and social media accounts after firms raised concerns about campus protests, <a href=\"https://www.theguardian.com/education/2025/oct/08/uk-universities-offered-to-monitor-student-social-media-for-arms-firms-emails-show\">according to internal emails</a>.</p><p><em><strong>AI</strong></em> | The Bank of England <a href=\"https://www.theguardian.com/business/2025/oct/08/bank-of-england-warns-of-growing-risk-that-ai-bubble-could-burst\">has warned</a> there is a growing risk of a “sudden correction” in global markets as it raised concerns about soaring valuations of leading AI tech companies.</p><p><em><strong>Politics</strong></em> | The Conservatives will scrap stamp duty on sales of primary residences if they win the next election, <a href=\"https://www.theguardian.com/politics/2025/oct/08/tories-scrap-stamp-duty-kemi-badenoch-conservative-conference-speech\">Kemi Badenoch has said</a>, in a policy-heavy speech designed to improve her standing as Tory leader and her party’s economic credibility with voters.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/first-edition-gaza-peace-plan-first-phase\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Cristina Fernández de Kirchner: Argentinian court sentences man to 10 years for attempted assassination",
      "link": "https://www.theguardian.com/world/2025/oct/09/cristina-fernandez-de-kirchner-former-argentinian-president-attempted-assassination-court-sentences-man",
      "pub_time_taipei": "2025-10-09T09:43:33+08:00",
      "summary": "<p>Court in Buenos Aires sentences Fernando Sabag Montiel and accomplice over 2022 incident in which gun was pointed at former president but did not go off</p><p>A court in Argentina has sentenced a man to 10 years in prison after finding him guilty of attempting to kill former president Cristina Fernández de Kirchner.</p><p>The court in Buenos Aires also sentenced the man’s accomplice to eight years in prison, capping a dramatic case that has captivated the country since 2022, when the main defendant, Fernando Sabag Montiel, squeezed through a crowd outside the ex-president’s home, thrust a loaded gun at her face and pulled the trigger.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/cristina-fernandez-de-kirchner-former-argentinian-president-attempted-assassination-court-sentences-man\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Senate Republicans vote against check on Trump using deadly force against cartels",
      "link": "https://www.theguardian.com/us-news/2025/oct/08/senate-republicans-trump-deadly-force-cartels",
      "pub_time_taipei": "2025-10-09T09:19:46+08:00",
      "summary": "<p>First vote in Congress on military campaign that White House says has hit four vessels and killed at least 21 people</p><p>Senate Republicans voted down legislation Wednesday that would have put a check on <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s ability to use deadly military force against drug cartels after Democrats tried to counter the administration’s extraordinary assertion of presidential war powers to destroy vessels in the Caribbean.</p><p>The vote fell mostly along party lines, 48-51, with two Republicans, <a href=\"https://www.theguardian.com/us-news/rand-paul\">Rand Paul</a> and Lisa Murkowski, voting in favor and the Democrat John Fetterman voting against.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/08/senate-republicans-trump-deadly-force-cartels\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Humanitarian’ visa must be created for Pacific Islanders displaced by climate crisis, experts say",
      "link": "https://www.theguardian.com/world/2025/oct/09/climate-crisis-humanitarian-visa-displaced-pacific-islanders",
      "pub_time_taipei": "2025-10-09T09:02:25+08:00",
      "summary": "<p>Calls for reform to allow people across the Pacific threatened by climate crisis to more easily migrate, particularly to New Zealand</p><p>Climate and migration experts are calling for urgent action to create legal pathways for people displaced by the climate crisis, as a new report highlights the scale of the problem across the Pacific.</p><p>Research by Amnesty International released on Thursday found current immigration systems are inadequate for Pacific Islanders seeking safety and stability, as rising seas threaten to make their homelands uninhabitable.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/climate-crisis-humanitarian-visa-displaced-pacific-islanders\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Remaining trekkers rescued from Mount Everest after snowstorm",
      "link": "https://www.washingtonpost.com/world/2025/10/08/everest-hikers-trapped-blizzard/",
      "pub_time_taipei": "2025-10-09T08:39:05+08:00",
      "summary": "The final group of 15 hikers stranded on the Chinese side of Mount Everest have made it down safely and are receiving medical care, state media said."
    },
    {
      "source": "華盛頓郵報",
      "title": "Bipartisan measure to restrict Trump’s war powers fails in Senate",
      "link": "https://www.washingtonpost.com/national-security/2025/10/08/venezuela-war-powers-senate-vote/",
      "pub_time_taipei": "2025-10-09T08:33:07+08:00",
      "summary": "A bipartisan Senate resolution to restrain Trump’s ability to wage war against alleged Venezuelan drug traffickers failed in a 48-51 vote."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump, Hamas officials say Gaza ceasefire deal ‘very close’",
      "link": "https://www.washingtonpost.com/world/2025/10/08/us-israel-gaza-egypt-peace-talks/",
      "pub_time_taipei": "2025-10-09T06:30:24+08:00",
      "summary": "A senior Hamas official said late Wednesday that an agreement to end the war in Gaza was “imminent.”"
    },
    {
      "source": "衛報",
      "title": "Keir Starmer to look at India’s digital ID system during visit to Mumbai",
      "link": "https://www.theguardian.com/politics/2025/oct/08/keir-starmer-india-digital-id-visit-mumbai",
      "pub_time_taipei": "2025-10-09T05:00:05+08:00",
      "summary": "<p>Prime minister hopes to learn from success of scheme rolled out to most of country’s 1.4bn citizens</p><p>Keir Starmer is to examine India’s digital ID system on his visit to Mumbai as a potential model for the UK, praising the system as a “massive success”.</p><p>Speaking on his two-day trip to Mumbai, where he met an expert on India’s digital ID system, Starmer defended the introduction of a similar measure in the UK, saying he believed the rollout of a voluntary system could be expanded to school applications, mortgages and driving licences.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/08/keir-starmer-india-digital-id-visit-mumbai\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "A long ‘journey’ for Nobel chemistry winner born to Palestinian refugees",
      "link": "https://www.washingtonpost.com/world/2025/10/08/nobel-prize-palestinian-omar-yaghi-chemistry/",
      "pub_time_taipei": "2025-10-09T04:12:20+08:00",
      "summary": "Omar Yaghi, 60, a U.S. citizen born in Jordan, said he was raised with a dozen others in one room."
    },
    {
      "source": "華盛頓郵報",
      "title": "Here’s what’s under negotiation in Gaza ceasefire talks",
      "link": "https://www.washingtonpost.com/world/2025/10/08/gaza-peace-talks-trump-plan-ceasefire-israel-hamas-egypt/",
      "pub_time_taipei": "2025-10-09T01:37:35+08:00",
      "summary": "Trump’s framework to end the war in Gaza is the basis for talks between Israel and Hamas in Egypt, with Qatari, Turkish and the U.S. officials involved."
    },
    {
      "source": "衛報",
      "title": "Jamaica imposes local curfews after two deadly shootings rattle the island",
      "link": "https://www.theguardian.com/world/2025/oct/08/jamaican-authorities-curfews-shootings",
      "pub_time_taipei": "2025-10-09T00:57:50+08:00",
      "summary": "<p>Shootings left six people dead, including a four-year-old, and nine others injured amid suspected gang violence</p><p>Authorities in <a href=\"https://www.theguardian.com/world/jamaica\">Jamaica</a> have imposed curfews after two recent shootings in which six people, including a four-year-old child, were killed and nine others injured as suspected gang violence rattles the Caribbean island.</p><p>The most recent shooting took place on Tuesday night after unidentified gunmen drove past a group of people in the capital, Kingston, and opened fire. Six people, including two nine-year-old children and two teenagers, were shot, according to the Kingston Central police superintendent Beresford Williams.</p> <a href=\"https://www.theguardian.com/world/2025/oct/08/jamaican-authorities-curfews-shootings\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Illegal gold mining clears 140,000 hectares of Peruvian Amazon",
      "link": "https://www.theguardian.com/environment/2025/oct/08/gold-mining-deforestation-peru-amazon",
      "pub_time_taipei": "2025-10-09T00:00:03+08:00",
      "summary": "<p>Armed criminal groups tear down precious rainforest to capitalise on record gold prices, report finds</p><p>An illegal gold rush has cleared 140,000 hectares of rainforest in the Peruvian Amazon and is accelerating as foreign, armed groups move into the region to profit from record gold prices, according to a report.</p><p>About 540 square miles of land have been cleared for mining in the South American country since 1984, and the environmental destruction is spreading rapidly across the country, Monitoring of the Andean Amazon Project (MAAP) and its Peruvian partner organisation, Conservación Amazónica, found.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/08/gold-mining-deforestation-peru-amazon\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "That’s no schnitzel! E.U. moves to ban using meat names for veggie fare.",
      "link": "https://www.washingtonpost.com/world/2025/10/08/imitation-meat-labeling-europe-vegetarian-vegan/",
      "pub_time_taipei": "2025-10-08T23:07:37+08:00",
      "summary": "More and more European shoppers are buying imitation schnitzel, bratwurst and steak made from plants but some politicians say only real meat should use those names."
    },
    {
      "source": "華盛頓郵報",
      "title": "Russia escalates warning as Trump considers sale of Tomahawks to Ukraine",
      "link": "https://www.washingtonpost.com/world/2025/10/08/russia-warning-ukraine-tomahawk/",
      "pub_time_taipei": "2025-10-08T22:33:59+08:00",
      "summary": "The warning is part of a concerted Russian effort to deter President Donald Trump from giving Ukraine access to the missiles, repeating a tactic Moscow has used throughout the war."
    },
    {
      "source": "衛報",
      "title": "Paraglider bomb attack by Myanmar military kills at least 20 at protest",
      "link": "https://www.theguardian.com/world/2025/oct/08/paraglider-bomb-attack-by-myanmar-military-kills-people-at-protest",
      "pub_time_taipei": "2025-10-08T21:38:29+08:00",
      "summary": "<p>Dozens more injured by night strike on anti-government demonstration held during national holiday</p><p>A Myanmar military operation that used a motorised paraglider to drop bombs on a village this week killed at least 20 people including children and injured dozens more, according to witnesses and local media.</p><p>The attack hit Chaung U, in Sagaing region, during a national holiday. Myanmar has been engulfed in armed conflict since the military seized power in 2021 and the village has been a key battleground in the war.</p> <a href=\"https://www.theguardian.com/world/2025/oct/08/paraglider-bomb-attack-by-myanmar-military-kills-people-at-protest\">Continue reading...</a>"
    }
  ]
}