{
  "mode": "last_24h",
  "window_start_taipei": "2025-08-29T20:40:04.025167+08:00",
  "window_end_taipei": "2025-08-30T20:40:04.025167+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Ukrainian lawmaker shot dead in Lviv as Zelenskyy says hunt for killer is under way – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/aug/30/russia-ukraine-war-live-news-updates-zaporizhzhia",
      "pub_time_taipei": "2025-08-30T20:15:38+08:00",
      "summary": "<p>‘All necessary forces and means are engaged in the investigation and search for the killer,’ Ukraine’s president said</p><p><strong>Andriy Parubiy</strong>, a <strong>Ukrainian</strong> politician who previously served as the parliament speaker, has been shot dead in western city of <strong>Lviv</strong>, say officials.</p><p>Confirming the news, Ukrainian president <strong>Volodymyr Zelenskyy</strong> wrote on X:</p><p>Ukraine’s minister of internal affairs Ihor Klymenko and prosecutor general Ruslan Kravchenko have just reported the first known circumstances of the horrendous murder in Lviv. Andriy Parubiy was killed.</p><p>My condolences to his family and loved ones. All necessary forces and means are engaged in the investigation and search for the killer.</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/30/russia-ukraine-war-live-news-updates-zaporizhzhia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Alarm as US far-right extremists eye drones for use in domestic attacks",
      "link": "https://www.theguardian.com/us-news/2025/aug/30/us-far-right-extremists-drones",
      "pub_time_taipei": "2025-08-30T20:00:01+08:00",
      "summary": "<p>Experts say extremists openly talking of how home-built drones will be critical tool in so-called second civil war</p><p>Taking their cues from modern warfare, the far-right American terrorist movement sees off-the-shelf or home-built first-person viewer (FPV) drones as a critical weapon in their own future war against the US government, which has American authorities on edge.</p><p>And there’s ample reasons for those fears: in the open and closed online spaces where far-right extremists congregate, talk is commonplace of how these cheap drones are revolutionizing current wars and will be the critical tools of a so-called second civil war.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/30/us-far-right-extremists-drones\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Proposals for commercial planes to operate with one pilot shelved after critical EU report",
      "link": "https://www.theguardian.com/world/2025/aug/30/proposals-for-commercial-planes-to-operate-with-one-pilot-shelved-after-critical-eu-report",
      "pub_time_taipei": "2025-08-30T20:00:00+08:00",
      "summary": "<p>Regulator Easa concludes there is not enough evidence it is as safe as flying with two pilots as currently required</p><p>Proposals for commercial aeroplanes to operate with just one pilot in the cockpit have been put on ice after a report for the European regulator suggested it would make flying more dangerous.</p><p>A three-year research project into “extended minimum crew operations” commissioned by the EU Aviation Safety Agency (Easa) found that despite advances in technology there was not sufficient evidence that flying with a single pilot could be as safe as with the two currently required.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/proposals-for-commercial-planes-to-operate-with-one-pilot-shelved-after-critical-eu-report\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Louisiana judge orders return of devices to ex-priest caught having sex on church altar",
      "link": "https://www.theguardian.com/us-news/2025/aug/30/louisiana-judge-ex-priest-electronics-obscenity",
      "pub_time_taipei": "2025-08-30T20:00:00+08:00",
      "summary": "<p>Former Roman Catholic priest and two dominatrices were evidently recording sexual videos in the church in 2020</p><p>A judge in <a href=\"https://www.theguardian.com/us-news/louisiana\">Louisiana</a> has ordered the return of electronics belonging to an ex-Roman Catholic priest who pleaded guilty to obscenity for being caught having sex with two dominatrices atop a church altar while still belonging to the clergy in 2020.</p><p>However, the judge also told authorities to erase all data from the devices and storage media as a precaution against videos taken of the tryst from becoming public.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/30/louisiana-judge-ex-priest-electronics-obscenity\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Car rams into crowd outside bar in northern France, killing one",
      "link": "https://www.theguardian.com/world/2025/aug/30/car-rams-crowd-outside-bar-evreux-northern-france-death-normandy",
      "pub_time_taipei": "2025-08-30T19:01:25+08:00",
      "summary": "<p>Police launch investigation into escalation of dispute in bar in Évreux, Normandy, after five others injured</p><p>A man has driven a car into a crowd outside a bar in northern France after a dispute in which one person was killed and five others injured, according to prosecutors.</p><p>The incident took place in the town of Évreux, Normandy, at about 4am on Saturday.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/car-rams-crowd-outside-bar-evreux-northern-france-death-normandy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US senators demand ‘massive surge’ of baby formula and aid to be sent to Gaza",
      "link": "https://www.theguardian.com/world/2025/aug/30/senators-demand-baby-formula-aid-gaza",
      "pub_time_taipei": "2025-08-30T19:00:07+08:00",
      "summary": "<p>Group of five senators in letter to Marco Rubio call on US to use its ‘full power’ to help people facing starvation</p><p>Five democratic<strong> </strong>US senators are demanding secretary of state Marco Rubio facilitate an immediate “massive surge” of baby formula and humanitarian aid to Gaza, where infants are dying of starvation.</p><p>The letter, led by Democrat Ruben Gallego of Arizona and obtained exclusively by the Guardian, comes as Gaza City and surrounding areas have been officially classified as experiencing famine by international monitors. More than 300 people, including at least 119 children, <a href=\"https://www.theguardian.com/world/2025/aug/27/ten-palestinians-have-died-from-starvation-in-last-24-hours-says-gaza-health-ministry\">have died from hunger</a> in Gaza since October 2023, according to health authorities.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/senators-demand-baby-formula-aid-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Firefighter arrested by US border agents was on track for legal status, lawyers say",
      "link": "https://www.theguardian.com/us-news/2025/aug/30/us-border-agents-oregon-firefighters",
      "pub_time_taipei": "2025-08-30T19:00:06+08:00",
      "summary": "<p>Lawyers say arrest of man fighting Bear Gulch fire in Oregon was illegal and demand immediate release from detention</p><p>Lawyers are demanding the release of a longtime Oregon resident arrested by Border Patrol while fighting a Washington state wildfire, saying Friday that the firefighter was already on track for legal status after helping federal investigators solve a crime against his family.</p><p>His arrest was illegal, the lawyers said, and violated Department of Homeland Security polices that say immigration enforcement must not be conducted at locations where emergency responses are happening.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/30/us-border-agents-oregon-firefighters\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘I’m not coming home’: Trump policy holds people in Ice custody without bail",
      "link": "https://www.theguardian.com/us-news/2025/aug/30/immigration-custody-bail-trump",
      "pub_time_taipei": "2025-08-30T19:00:06+08:00",
      "summary": "<p>Restaurant worker’s case shows how Trump administration is ‘inflicting the maximum punishment’, experts say</p><p>Liset Fernandez spent most of the summer worried about her dad, Luis, but a few weeks ago<strong> </strong>she<strong> </strong>got some good news. After being held in Immigration and Customs Enforcement (Ice) custody for weeks, an immigration judge in Texas granted him release on a $5,000 bond.</p><p>Luis, came to the US from Ecuador in 1994, had been held in detention at a facility in Livingston, Texas, thousands of miles away from his home in Queens. Liset, 17, had taken on extra shifts working a retail job to support her mom and nine-year-old brother. Luis’s co-workers at the <a href=\"https://www.squaredinernyc.com/\">Square diner</a>, a railcar-style greasy spoon in Manhattan’s Tribeca neighborhood for over 100 years, had raised <a href=\"https://www.gofundme.com/f/help-bring-luis-fernandez-back-home\">more than $20,000</a> to support him and his family.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/30/immigration-custody-bail-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Home Office bans asylum seekers from buying luxury goods and services",
      "link": "https://www.theguardian.com/uk-news/2025/aug/30/home-office-bans-asylum-seekers-from-buying-luxury-goods-and-services",
      "pub_time_taipei": "2025-08-30T19:00:05+08:00",
      "summary": "<p>Purchase of snowmobiles, timeshares and furs prohibited, despite asylum seekers receiving only £9.95 a week</p><p>Are you an asylum seeker and are you considering buying an armoured car, a snowmobile or a timeshare using your Home Office pre-paid cash card? If so, think again, for these are just some of the luxuries on a list of banned items and activities drawn up by the government.</p><p>Quite how asylum seekers living in hotels who are banned from working but are provided with meals and <a href=\"https://www.gov.uk/asylum-support/what-youll-get\"> receive £9.95 a week</a> are expected to afford any luxuries is unclear. Similarly, those in self-catering accommodation who receive £49.18 a week may find it tricky to foot the bill for flowers (also on the list).</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/30/home-office-bans-asylum-seekers-from-buying-luxury-goods-and-services\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Coventry council to use Palantir AI in social work, Send and children’s services",
      "link": "https://www.theguardian.com/uk-news/2025/aug/30/coventry-city-council-signs-ai-deal-contract-palantir-technologies",
      "pub_time_taipei": "2025-08-30T19:00:04+08:00",
      "summary": "<p>Exclusive: Workers say £500k contract with US tech firm which supplies Israeli forces raises ‘serious ethical questions’</p><p>Public sector workers have voiced “deep concern” after Coventry city council signed a £500,000-a-year artificial intelligence contract with the US data technology company Palantir.</p><p>The deal is the first of its kind between a UK local authority and the Denver-based company, which <a href=\"https://www.theguardian.com/commentisfree/2025/aug/24/palantir-artificial-intelligence-civil-rights\">supplies technology</a> to the Israel Defense Forces (IDF) and to <a href=\"https://www.theguardian.com/technology/2025/aug/10/trump-immigration-companies-profit\">help Donald Trump’s mass deportation efforts</a>.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/30/coventry-city-council-signs-ai-deal-contract-palantir-technologies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labour must act to close asylum hotels or face Reform poll gains, ex-minister warns",
      "link": "https://www.theguardian.com/uk-news/2025/aug/30/labour-asylum-seeker-hotels-reform-uk-polls-lord-falconer",
      "pub_time_taipei": "2025-08-30T18:49:38+08:00",
      "summary": "<p>Charlie Falconer says government was right to challenge Epping hotel ruling but now has to ‘move forward’</p><p>A former Labour justice secretary has warned that Reform UK will continue to rise in opinion polls unless the government moves faster to close hotels housing people seeking asylum.</p><p>On Friday, the government <a href=\"https://www.theguardian.com/uk-news/2025/aug/29/court-of-appeal-revokes-ban-on-epping-hotel-bell-housing-asylum-seekers\">won a court of appeal challenge</a> against an injunction by Epping Forest district council that would have resulted in 130 asylum seekers being moved out of the Bell hotel. In recent weeks the hotel has become the focus of repeated protests, some of which have been orchestrated by far-right extremists and have turned violent.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/30/labour-asylum-seeker-hotels-reform-uk-polls-lord-falconer\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Scientists breathe new life into climate website after shutdown under Trump",
      "link": "https://www.theguardian.com/environment/2025/aug/30/climate-gov-website-trump",
      "pub_time_taipei": "2025-08-30T18:00:01+08:00",
      "summary": "<p>Climate.gov, which went dark this summer, set to be revived by volunteers as climate.us with expanded mission</p><p>Earlier this summer, access to climate.gov – one of the most widely used portals of climate information on the internet – was thwarted by the Trump administration, and its production team was <a href=\"https://www.theguardian.com/us-news/2025/jun/11/climate-website-shut-down-noaa\">fired in the process</a>.</p><p>The website offered years’ worth of accessibly written material on climate science. The site is <a href=\"https://www.climate.gov/news-features/all\">technically still online</a> but has been intentionally buried by the team of political appointees who now run the National Oceanic and Atmospheric Administration.</p> <a href=\"https://www.theguardian.com/environment/2025/aug/30/climate-gov-website-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Sliding into an abyss’: experts warn over rising use of AI for mental health support",
      "link": "https://www.theguardian.com/society/2025/aug/30/therapists-warn-ai-chatbots-mental-health-support",
      "pub_time_taipei": "2025-08-30T18:00:00+08:00",
      "summary": "<p>Therapists say they are seeing negative impacts of people increasingly turning to AI chatbots for help</p><p>Vulnerable people turning to AI chatbots instead of professional therapists for mental health support could be “sliding into a dangerous abyss”, psychotherapists have warned.</p><p>Psychotherapists and psychiatristssaid they were increasingly seeing negative impacts of AI chatbots being used for mental health, such as fostering emotional dependence, exacerbating anxiety symptoms, self-diagnosis, or amplifying delusional thought patterns, dark thoughts and suicide ideation.</p> <a href=\"https://www.theguardian.com/society/2025/aug/30/therapists-warn-ai-chatbots-mental-health-support\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Doctors develop AI stethoscope that can detect major heart conditions in 15 seconds",
      "link": "https://www.theguardian.com/technology/2025/aug/30/doctors-ai-stethoscope-heart-disease-london",
      "pub_time_taipei": "2025-08-30T17:15:56+08:00",
      "summary": "<p>Upgraded medical tool has ability to diagnose heart failure, heart valve disease and abnormal heart rhythms</p><p>Doctors have successfully developed an artificial intelligence-led stethoscope that can detect three heart conditions in 15 seconds.</p><p>Invented in 1816, the traditional stethoscope – used to listen to sounds within the body – has been a vital part of every medic’s toolkit for more than two centuries.</p> <a href=\"https://www.theguardian.com/technology/2025/aug/30/doctors-ai-stethoscope-heart-disease-london\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Never mind the flag bans, where are the policies? Assessing 100 days of Reform-led councils",
      "link": "https://www.theguardian.com/politics/ng-interactive/2025/aug/30/100-days-of-reform-led-councils-flag-bans-policies",
      "pub_time_taipei": "2025-08-30T15:45:29+08:00",
      "summary": "<p>Some are happy to see new faces in the chambers but many are frustrated with a lack of improvements on the ground since party’s sweeping victories</p><p>“This motion is bizarre to say the least,” said a bemused Doncaster Labour councillor as Reform proposed that the council fly no flags apart from the union flag from its buildings.</p><p>It would not just mean no Pride flag on Pride Day, <a href=\"https://www.youtube.com/watch?v=dLA5u92unZw\">a debate heard</a>. It would mean no white rose flag on Yorkshire Day, no Rovers flag celebrating the football team <a href=\"https://www.doncasterroversfc.co.uk/news/2025/may/03/notts-county-0-rovers-2---rovers-are-crowned-league-two-champions/\">winning the league</a>, no St George’s flag marking England’s Lionesses’ Euros triumph, and no green flags celebrating municipal park management achievements in the city’s green spaces. The motion was “a waste of time and a waste of resources”, one councillor said.</p> <a href=\"https://www.theguardian.com/politics/ng-interactive/2025/aug/30/100-days-of-reform-led-councils-flag-bans-policies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australian government criticised over ‘disgraceful’ $400m deal to deport foreign-born former detainees to Nauru",
      "link": "https://www.theguardian.com/australia-news/2025/aug/30/australia-signs-400m-deal-to-deport-foreign-born-former-detainees-to-nauru",
      "pub_time_taipei": "2025-08-30T13:03:57+08:00",
      "summary": "<p>An agreement relating to the NZYQ cohort, who previously faced indefinite immigration detention, was signed by home affairs minister Tony Burke on Friday</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Human rights lawyers, refugee advocates and the Greens have accused the Albanese government of striking a “discriminatory, disgraceful and dangerous” deal to deport hundreds of foreign-born former detainees at a cost of almost half a billion dollars.</p><p>On Friday Australia and Nauru signed a memorandum of understanding allowing the government to deport about 280 members of the NZYQ cohort, a group of noncitizens living in the Australian community whose visas were cancelled on character grounds.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/30/australia-signs-400m-deal-to-deport-foreign-born-former-detainees-to-nauru\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fire kills three people in Indonesia after protesters storm council buildings in the wake of driver’s death",
      "link": "https://www.theguardian.com/world/2025/aug/30/fire-kills-three-people-in-indonesia-after-protesters-storm-council-buildings-in-the-wake-of-taxi-drivers-death",
      "pub_time_taipei": "2025-08-30T12:39:20+08:00",
      "summary": "<p>Major cities in Indonesia have been rocked by protests after footage spread of a gig motorcycle driver being run over by a police tactical vehicle</p><p>At least three people were killed by a fire started by protesters at a council building in the Indonesian city of Makassar, after demonstrations broke out across the country over the death of a motorcycle taxi driver hit by a police vehicle.</p><p>Major cities in <a href=\"https://www.theguardian.com/world/indonesia\">Indonesia</a>, including the capital Jakarta on Friday, have been rocked by <a href=\"https://www.theguardian.com/world/2025/aug/29/protests-clashes-indonesia-jakarta-police-vehicle-death-affan-kurniawan\">protests</a> after footage spread of a gig motorcycle driver being run over by a police tactical vehicle during <a href=\"https://www.theguardian.com/world/2025/aug/26/indonesia-protests-austerity-parliament-member-privileges\">earlier rallies over low wages and perceived lavish perks</a> for lawmakers.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/fire-kills-three-people-in-indonesia-after-protesters-storm-council-buildings-in-the-wake-of-taxi-drivers-death\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Melbourne Symphony Orchestra performance in London interrupted by pro-Palestine protestors",
      "link": "https://www.theguardian.com/australia-news/2025/aug/30/melbourne-symphony-orchestra-performance-london-interrupted-pro-palestine-protestors-bbc-proms-ntwnfb",
      "pub_time_taipei": "2025-08-30T12:26:36+08:00",
      "summary": "<p>Jewish Artists for Palestine interrupted a BBC Proms performance at Royal Albert Hall on Friday, claiming the MSO ‘silenced artists’ and ‘silenced protest’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Pro-Palestine protesters have interrupted a performance by the Melbourne Symphony Orchestra (MSO) at the&nbsp;BBC Proms in London, accusing the organisation’s management of silencing artists who have criticised Israel’s conduct in Gaza.</p><p>The Jewish Artists for Palestine group interrupted the performance for more than 10 minutes on Friday night, with some members shouting from the upper stalls of Royal Albert Hall, including claims the MSO “silenced artists” and “silenced protest”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/30/melbourne-symphony-orchestra-performance-london-interrupted-pro-palestine-protestors-bbc-proms-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Putin embarks on China visit with Ukraine war top of agenda",
      "link": "https://www.theguardian.com/world/2025/aug/30/vladimir-putin-china-visit-xi-jinping-ukraine",
      "pub_time_taipei": "2025-08-30T12:00:52+08:00",
      "summary": "<p>Analysts say Putin and Xi will aim to align positions during Russian leader’s unusually long stay</p><p>Vladimir Putin will travel to China this weekend for what the Kremlin has called a “truly unprecedented” visit to his most important ally, which comes at a crunch moment in talks over Ukraine.</p><p>During the trip, which is expected to stretch to close to a week – unusually long for the Russian leader – he will attend the Shanghai Cooperation Organisation summit, hold talks with Xi Jinping, and take in Beijing’s Victory Day military <a href=\"https://www.theguardian.com/world/2025/aug/28/vladimir-putin-kim-jong-un-join-president-xi-chinese-military-parade-defiance-to-west\">parade</a> marking 80 years since Japan’s defeat in the second world war, where Putin is due to be the star guest alongside North Korea’s Kim Jong-un and leaders of Iran and Cuba.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/vladimir-putin-china-visit-xi-jinping-ukraine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘La tapisserie, c’est moi’: Macron accused of putting politics first in Bayeux tapestry loan",
      "link": "https://www.theguardian.com/world/2025/aug/30/emmanuel-macron-bayeux-tapestry-loan-british-museum-petition",
      "pub_time_taipei": "2025-08-30T12:00:52+08:00",
      "summary": "<p>Organiser of petition says French president ignoring expert advice that artefact too fragile to be transported to UK</p><p>The Bayeux tapestry is so fragile that transporting it risks irreparable damage, French experts have said, as a petition urging Emmanuel Macron to reverse a “catastrophic” decision to loan the unique embroidery to Britain passed 60,000 signatures.</p><p>France’s president <a href=\"https://www.theguardian.com/culture/2025/jul/08/bayeux-tapestry-to-return-to-britain-for-first-time-in-900-years\">declared in July</a> that the nearly 1,000-year-old, 70-metre-long wool-on-linen artwork, <a href=\"https://www.theguardian.com/culture/2025/jul/12/historys-most-devastating-document-of-war-the-simple-yet-graphic-details-of-the-bayeux-tapestry\">which depicts</a> William the Conqueror’s victory over King Harold II of England at Hastings in 1066, would cross the Channel next year.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/emmanuel-macron-bayeux-tapestry-loan-british-museum-petition\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Court blocks Trump bid to end protections for 600,000 Venezuelans",
      "link": "https://www.theguardian.com/us-news/2025/aug/29/court-blocks-trump-venezuela",
      "pub_time_taipei": "2025-08-30T08:44:50+08:00",
      "summary": "<p>Appellate panel upholds lower court’s ruling as homeland security spokesperson attacks ‘activist’ judges</p><p>A federal appeals court on Friday blocked <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s plans to end protections for 600,000 people from Venezuela who have permission to live and work in the US, saying that plaintiffs are likely to win their claim that the president’s administration’s actions were unlawful.</p><p>A three-judge panel of the ninth US circuit court of appeals unanimously upheld a lower court ruling that maintained temporary protected status for Venezuelans while TPS holders challenge actions by the Republican president’s administration in court.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/29/court-blocks-trump-venezuela\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Suspected Porepunkah gunman Dezi Freeman had no convictions for violence or firearm offences, court record shows",
      "link": "https://www.theguardian.com/australia-news/2025/aug/30/suspected-porepunkah-gunman-dezi-freeman-had-no-convictions-for-violence-or-firearm-offences-court-record-shows-ntwnfb",
      "pub_time_taipei": "2025-08-30T08:00:46+08:00",
      "summary": "<p>The 56-year-old made a series of threats against police and had a long history of minor offences, culminating in the loss of his driver’s licence in 2022</p><ul><li><p><a href=\"https://www.theguardian.com/news/2025/aug/29/what-we-know-so-far-porepunkah-police-shooting-victoria-manhunt-suspect-dezi-freeman-ntwnfb\">What we know so far about the Victoria police shooting and suspect Dezi Freeman</a></p></li><li><p>Report: <a href=\"https://www.theguardian.com/news/2025/aug/28/porepunkah-suspect-used-to-spy-on-my-family-with-drones-says-former-neighbour\">Porepunkah suspect used to spy on my family with drones, says former neighbour</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The suspected Porepunkah gunman had a criminal record stretching more than 30 years, but had not been convicted of any serious offences, court extracts show.</p><p>Dezi Freeman, 56, made a series of <a href=\"https://www.theguardian.com/australia-news/2025/aug/28/who-is-dezi-freeman-porepunkah-victoria-police-shooting-suspect-sovereign-citizen-ntwnfb\">threats against police</a>, and had his firearms licence cancelled, in the years before allegedly killing two police officers <a href=\"https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area\">at a remote property in north-eastern Victoria on Tuesday</a>. Victoria police is now investigating whether its risk assessment before the incident was adequate.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/30/suspected-porepunkah-gunman-dezi-freeman-had-no-convictions-for-violence-or-firearm-offences-court-record-shows-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Former NSW police officer who lost her arm after a car accident awarded $2.3m by the court",
      "link": "https://www.theguardian.com/australia-news/2025/aug/30/former-nsw-police-officer-who-lost-her-arm-after-a-car-accident-awarded-23m-by-the-court",
      "pub_time_taipei": "2025-08-30T08:00:45+08:00",
      "summary": "<p>County court judge found physical and psychological injuries from the accident caused ‘complete destruction of her capacity for any form of meaningful remunerative work’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A former police officer has been awarded $2.3m after a car accident during a cannabis clearing operation that led to the amputation of her arm and the “complete destruction” of her earning capacity.</p><p>In a district court decision handed down in Sydney on Friday, acting judge Leonard Levy SC found the state of New South Wales had breached its duty of care to the former officer Jillian Oliver, and that its negligence had resulted in the accident, her injuries, and her “catastrophic” physical and psychological situation.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/30/former-nsw-police-officer-who-lost-her-arm-after-a-car-accident-awarded-23m-by-the-court\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza famine likely to worsen as Israel ends pauses for aid deliveries",
      "link": "https://www.theguardian.com/world/2025/aug/29/israeli-military-ends-pauses-aid-deliveries-gaza-city-famine",
      "pub_time_taipei": "2025-08-30T04:23:33+08:00",
      "summary": "<p>Israeli military announces move in Gaza City as it steps up attacks before planned offensive</p><p>Israel’s military will no longer pause fighting to allow aid deliveries in Gaza City, a military spokesperson has said, in a decision likely to deepen the famine already gripping the north of the territory.</p><p>Israeli forces have been stepping up attacks in and around Gaza City as the military prepares for a ground operation that humanitarian groups and many of Israel’s closest allies have warned will be catastrophic for hundreds of thousands of Palestinian civilians already struggling to survive hunger, disease and Israeli attacks.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/israeli-military-ends-pauses-aid-deliveries-gaza-city-famine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "IDF declares famine-hit Gaza City a combat zone, ending ‘tactical pauses’ that allowed limited food delivery – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates",
      "pub_time_taipei": "2025-08-30T02:12:01+08:00",
      "summary": "<p>This live blog is now closed. You can read our latest news report here:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/aug/29/israeli-military-ends-pauses-aid-deliveries-gaza-city-famine\">Gaza famine likely to worsen as Israel ends pauses for aid deliveries in capital</a></p></li></ul><p>A spokesperson for the Israeli military said earlier this week that the evacuation of Gaza City is “inevitable”. Benjamin Netanyahu has said Israel will launch its Gaza City assault while simultaneously pursuing a ceasefire, though talks have stalled.</p><p>The Israeli prime minister has claimed the assault is the best way to weaken Hamas and return hostages, but many hostage families disagree and fear it will endanger hostages lives.</p><p><em>In accordance with the situational assessment &amp; directives of the political echelon, starting today at 10:00, the local tactical pause in military activity will not apply to the area of Gaza City, which constitutes a dangerous combat zone.</em></p><p><em>The IDF continues supporting humanitarian efforts while conducting operations to protect Israel.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Irish missionary and eight others freed weeks after kidnapping in Haiti",
      "link": "https://www.theguardian.com/world/2025/aug/29/nine-captives-haiti-kidnapping-release",
      "pub_time_taipei": "2025-08-30T01:58:45+08:00",
      "summary": "<p>Gena Heraty was abducted at orphanage she ran along with seven Haitian colleagues and a three-year-old child</p><p>An Irish aid worker and eight fellow captives have been released nearly a month after they were kidnapped in Haiti.</p><p>Gena Heraty, a missionary who ran the Our Little Brothers and Sisters orphanage in the hills outside Haiti’s capital, Port-au-Prince, was<a href=\"https://www.theguardian.com/world/2025/aug/04/haiti-mass-kidnapping-orphanage\"> abducted on 3 August along with seven Haitian colleagues and a three-year-old child</a>.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/nine-captives-haiti-kidnapping-release\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sixty-nine people drown as migrant boat capsizes off coast of Mauritania",
      "link": "https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania",
      "pub_time_taipei": "2025-08-30T01:31:50+08:00",
      "summary": "<p>Coastguard reports boat carrying about 160 people capsized in sight of town 50 miles north of Nouakchott</p><p>Sixty-nine people drowned when a vessel full of migrants overturned off the coast of Mauritania earlier this week, coastguard officials said on Friday.</p><p>The accident occurred late on Tuesday after passengers on the boat spotted the lights of a coastal town about 50 miles (80km) north of the capital, Nouakchott, prompting the occupants to press to one side of the boat, causing it to capsize, Mohamed Abdallah, the head of the coastguard, told reporters.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/sixty-nine-people-drown-as-migrant-boat-capsizes-off-coast-of-mauritania\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Civil rights groups alarmed over Quebec’s move to ban prayer in public",
      "link": "https://www.theguardian.com/world/2025/aug/29/quebec-public-prayer-ban",
      "pub_time_taipei": "2025-08-30T00:56:37+08:00",
      "summary": "<p>Announcement follows statements from Quebec premier, who expressed frustration over public prayers in Montreal</p><p>Quebec says it will ban prayer in public, a move that civil rights groups described as an “alarming measure” that targets religious minority groups and would infringe on “basic democratic freedoms”.</p><p>The province’s secularism minister, Jean-François Roberge, said the move had been prompted by the “proliferation of street prayer” which he described as “a serious and sensitive issue” adding that the government had watched with “unease”. Roberge said the government would introduce legislation in the fall.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/quebec-public-prayer-ban\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Murray Watt backs ‘no-go’ zones where development is banned – but not for Tasmania’s Robbins Island",
      "link": "https://www.theguardian.com/environment/2025/aug/30/murray-watt-backs-no-go-zones-where-development-is-banned-but-not-for-tasmanias-robbins-island",
      "pub_time_taipei": "2025-08-29T23:00:36+08:00",
      "summary": "<p>Environment minister says scientific evidence did not convince government that remote island qualified</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li></ul><p>Australia’s environment minister, Murray Watt, has backed the creation of “no-go zones” where development will be banned in some places under a revamped nature law, <a href=\"https://www.theguardian.com/australia-news/2025/aug/29/labor-approves-robbins-island-windfarm-tasmania\">but said Tasmania’s remote Robbins Island</a> – the site of a contentious windfarm proposal – does not qualify.</p><p>Watt this week said the Albanese government would accelerate its plan to overhaul the Environment Protection and Biodiversity Conservation (EPBC) Act so that legislation <a href=\"https://www.theguardian.com/australia-news/2025/aug/26/environment-law-overhaul-to-be-put-to-australian-parliament-in-2025-minister-says\">was introduced to parliament this year</a>, sooner than previously suggested.</p> <a href=\"https://www.theguardian.com/environment/2025/aug/30/murray-watt-backs-no-go-zones-where-development-is-banned-but-not-for-tasmanias-robbins-island\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN human rights staff urge leadership to declare Israel’s war in Gaza a genocide",
      "link": "https://www.theguardian.com/world/2025/aug/29/un-human-rights-staff-urge-leadership-to-declare-israels-war-in-gaza-a-genocide",
      "pub_time_taipei": "2025-08-29T21:48:07+08:00",
      "summary": "<p>Internal letter also calls on UN member states to suspend arms sales, saying ‘criticising Israel is not enough’</p><p>Hundreds of employees of the United Nations’ leading human rights agency have backed an internal letter telling its leadership to declare <a href=\"https://www.theguardian.com/world/israel\">Israel</a>’s offensive in Gaza a genocide and to call on UN member states to suspend arms sales to Israel.</p><p>The 1,100-word letter, signed by about a quarter of the 2,000 staff of the Geneva- and New York-based Office of the High Commissioner for Human Rights (OHCHR), says the Israeli offensive in Gaza meets the legal threshold of genocide and that this means “arms sales, transfers and related logistical or financial support to Israeli authorities” constitutes a clear breach of international law by all those involved.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/un-human-rights-staff-urge-leadership-to-declare-israels-war-in-gaza-a-genocide\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Protests erupt in Indonesia over death of man hit by police vehicle",
      "link": "https://www.theguardian.com/world/2025/aug/29/protests-clashes-indonesia-jakarta-police-vehicle-death-affan-kurniawan",
      "pub_time_taipei": "2025-08-29T21:30:06+08:00",
      "summary": "<p>Government faces calls for police reform amid violent clashes across Jakarta and demonstrations in other cities</p><p>Hundreds of Indonesians have protested at sites across Jakarta over the death of a man hit by a police vehicle, in the first big test for Prabowo Subianto’s nearly year-old government.</p><p>The man, a motorcycle ride-sharing driver, was hit at the site of violent clashes near parliament on Thursday as police sought to disperse demonstrators protesting about a number of issues including lawmakers’ pay and education funding.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/protests-clashes-indonesia-jakarta-police-vehicle-death-affan-kurniawan\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN to end Lebanon peacekeeping mission next year after Israeli and US pressure",
      "link": "https://www.theguardian.com/world/2025/aug/29/un-unifil-lebanon-peacekeeping-mission-withdrawal",
      "pub_time_taipei": "2025-08-29T21:11:12+08:00",
      "summary": "<p>Unifil mandate extended but troops patrolling Lebanon-Israel border to be withdrawn in December 2026</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates\">Middle East crisis – live updates</a></p></li></ul><p>The UN security council has voted to extend the body’s peacekeeping mission in Lebanon for a further 16 months, but ordered it finished at the end of 2026 under Israeli and US pressure.</p><p>UNSC members voted unanimously on Thursday to extend the mandate for the UN interim force in Lebanon (Unifil) ahead of its expiration on Sunday, prompting relief from Lebanese officials who rely on it. The approved resolution said Unifil would begin an “orderly and safe withdrawal” of its 10,800 peacekeepers from Lebanon in December 2026.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/un-unifil-lebanon-peacekeeping-mission-withdrawal\">Continue reading...</a>"
    }
  ]
}