{
  "mode": "last_24h",
  "window_start_taipei": "2025-08-26T20:40:04.231918+08:00",
  "window_end_taipei": "2025-08-27T20:40:04.231918+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Israeli military carries out raid in West Bank city of Nablus – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
      "pub_time_taipei": "2025-08-27T20:18:50+08:00",
      "summary": "<p>Soldiers and armoured vehicles enter city in northern occupied West Bank, confirms Israeli military, as residents say soldiers are searching houses</p><p>Al Jazeera reports that the <strong>prime minister of Belgium</strong> has begun a meeting with his deputies on the topic of <strong>recognising the state of Palestine.</strong></p><p><strong>Bart De Wever</strong> said in a statement yesterday that it does not make sense to recognise the Palestinian state unless certain conditions are satisfied.</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Second Melbourne man charged over arson attack on Adass Israel synagogue fronts court",
      "link": "https://www.theguardian.com/australia-news/2025/aug/27/second-melbourne-man-charged-over-arson-attack-adass-israel-synagogue-faces-court-ntwnfb",
      "pub_time_taipei": "2025-08-27T20:09:15+08:00",
      "summary": "<p>Younes Ali Younes, 20, will appear again in December with co-accused Giovanni Laulu although court heard no evidence of links to Iran </p><ul><li><p><strong>Get our </strong><a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\"><strong>breaking news email</strong></a><strong>, </strong><a href=\"https://app.adjust.com/w4u7jx3\"><strong>free app</strong></a><strong> or </strong><a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\"><strong>daily news podcast</strong></a></p></li></ul><p>A man charged with torching a Melbourne synagogue in an antisemitic attack was remanded in custody when he appeared in court on Wednesday.</p><p>Younes Ali Younes, 20, last week became the second suspect to be charged for the December arson attack on the Adass Israel synagogue which Australia accuses Iran of directing. Police allege three masked arsonists doused the building’s interior with a liquid accelerant before igniting it, causing extensive damage and injuring a worshipper.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/27/second-melbourne-man-charged-over-arson-attack-adass-israel-synagogue-faces-court-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Energy bills to rise more than expected for millions of British households",
      "link": "https://www.theguardian.com/money/2025/aug/27/higher-energy-bills-price-cap-rises",
      "pub_time_taipei": "2025-08-27T20:07:47+08:00",
      "summary": "<p>Typical annual bill to increase by just over £35 to £1,755 from October when Ofgem raises government price cap by 2%</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/27/energy-price-cap-rise-trump-tariff-india-business-live-news\">Business live – latest updates</a></p></li></ul><p>Energy bills will rise more than expected for millions of British households this autumn as a result of the mounting cost of government subsidies.</p><p>The energy regulator for Great Britain, Ofgem, will raise the government’s cap on bills by 2% from October, or the equivalent of just over £35 a year, to £1,755 for a typical annual dual-fuel bill.</p> <a href=\"https://www.theguardian.com/money/2025/aug/27/higher-energy-bills-price-cap-rises\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump’s 50% tariffs on India come into force as president puts pressure on country over buying Russian oil – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news",
      "pub_time_taipei": "2025-08-27T20:07:31+08:00",
      "summary": "<p>Indian commerce ministry official says exporters will be encouraged to diversify to markets such as China and the Middle East</p><p><strong>The US transportation department said Wednesday it plans to reclaim management of Washington DC’s Union Station.</strong></p><p>In March, the White House forced Stephen Gardner, the CEO of US passenger railroad company Amtrak, to step down after president Donald Trump sought the changes.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
      "pub_time_taipei": "2025-08-27T20:04:06+08:00",
      "summary": "<p>Danish foreign minister Lars Løkke Rasmussen says any attempt to interfere in kingdom’s internal affairs is unacceptable</p><p>Opening the press conference, <strong>Merz</strong> says he wanted to revive the tradition of cabinet discussions on security to show the issue is treated seriously and to “send a signal” to EU and Nato allies.</p><p>Merz says before the meeting, they met with Nato’s Supreme Allied Commander Europe, <strong>Alexus Grynkewich</strong>, to discuss the military situation.</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tories and Reform offer only ‘easy answers and snake oil’ on UK-EU relationship, minister warns – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news",
      "pub_time_taipei": "2025-08-27T19:59:09+08:00",
      "summary": "<p>Nick Thomas-Symonds also accused Nigel Farage of ‘dividing communities and stoking anger’</p><p>Responding to <strong>Ofgem</strong> announcing that the energy price cap will rise by 2% (<a href=\"https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news?page=with%3Ablock-68aeb4498f08884614ab650d#block-68aeb4498f08884614ab650d\">see 8.47am BST</a>), Liberal Democrat leader <strong>Ed Davey</strong> said:</p><p>The last thing struggling families and pensioners need is higher energy bills this winter. The government should cancel this rise and take up our plan to halve energy bills instead.</p><p>Ministers should be cutting bills by making sure energy firms pass on the benefits of cheap renewables, not putting up bills yet again.</p> <a href=\"https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Lego sales rise as parents steer children to activities away from smartphones",
      "link": "https://www.theguardian.com/lifeandstyle/2025/aug/27/lego-sales-rise-as-parents-steer-children-to-activities-away-from-smartphones",
      "pub_time_taipei": "2025-08-27T19:54:01+08:00",
      "summary": "<p>Record lift for Danish firm comes as sales for UK-based Yoto, creator of screen-free speakers for children, almost double</p><p>Lego said it could be benefiting from parents’ desire to keep children – and themselves – away from smartphones as sales rose 12%, helped by strong sales of its Botanicals and Formula One grand prix-themed sets.</p><p>The Danish toy company said sales increased to a record 34.6bn Danish kroner (£4bn) in the first half of the year, rising well ahead of the recovering global toy market in which sales rose 7%.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/aug/27/lego-sales-rise-as-parents-steer-children-to-activities-away-from-smartphones\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "England and Wales fertility rate hits record low",
      "link": "https://www.theguardian.com/uk-news/2025/aug/27/england-and-wales-fertility-rate-falls-for-third-consecutive-year",
      "pub_time_taipei": "2025-08-27T19:31:59+08:00",
      "summary": "<p>Last year’s total fertility rate of 1.41 was lowest since comparable data was first collected in 1938, ONS says</p><p>The fertility rate for England and Wales has fallen for the third year in a row to reach a record low, figures show.</p><p>The total fertility rate across both nations, meaning the average number of live children women can expect to have across their child-bearing life, stood at 1.41 in 2024, down from 1.42 in 2023, the lowest since comparable data was first collected in 1938, according to the Office for National Statistics.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/27/england-and-wales-fertility-rate-falls-for-third-consecutive-year\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Parents’ rights’ groups gain ground in Canada amid Alberta book ban",
      "link": "https://www.theguardian.com/world/2025/aug/27/alberta-book-ban-canada-parents-rights-groups",
      "pub_time_taipei": "2025-08-27T19:30:01+08:00",
      "summary": "<p>Two such groups claim they persuaded Alberta to institute sweeping public school book ban</p><p>Socially conservative “parents’ rights” groups that have <a href=\"https://www.theguardian.com/books/2025/apr/08/majority-of-attempts-to-ban-books-in-us-come-from-organised-groups-not-parents\">emerged as powerfully political lobbying groups</a> in the US are quickly gaining ground in Canada, academics and free speech advocates say, after two such groups claimed they had persuaded Alberta to institute a sweeping public school book ban.</p><p>Alberta recently directed schools to purge library books from shelves that fit its definition of “explicit sexual content” by 1 October. If <a href=\"https://kings-printer.alberta.ca/Documents/MinOrders/2025/Education_and_Childcare/2025_030_Education_and_Childcare.pdf\">the policy</a> is applied precisely as outlined, a host of books face being purged, including George Orwell’s 1984 due to passages in the text that discuss sexual intercourse and rape.</p> <a href=\"https://www.theguardian.com/world/2025/aug/27/alberta-book-ban-canada-parents-rights-groups\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Home Office planning to halve time asylum seekers given to find accommodation",
      "link": "https://www.theguardian.com/uk-news/2025/aug/27/charities-warn-rise-rough-sleeping-refugees-winter-uk",
      "pub_time_taipei": "2025-08-27T19:24:25+08:00",
      "summary": "<p>Charities sound alarm over plan to give asylum seekers just 28 days to find new housing once they have a decision on their case</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news\">UK politics live – latest updates</a></p></li></ul><p>Refugee charities warn that thousands of people in the UK could find themselves homeless on the streets this winter after the Home Office quietly reversed its asylum accommodation policy.</p><p>The Guardian has learned that ministers are planning to halve the period asylum seekers are given to find new accommodation after getting a decision on their case, from 56 to 28 days. Refugee organisations say this is not enough time to find work and a home to rent and will lead to many people pitching tents in the streets.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/27/charities-warn-rise-rough-sleeping-refugees-winter-uk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Girl who stabbed teachers in Welsh school had been considered for Prevent",
      "link": "https://www.theguardian.com/uk-news/2025/aug/27/girl-stabbed-teachers-welsh-school-considered-prevent",
      "pub_time_taipei": "2025-08-27T19:00:59+08:00",
      "summary": "<p>Multi-agency report says girl, 13, had fascination with Hitler, weapons and claimed to speak German and Russian</p><p>A teenager who was interested in Adolf Hitler had been considered for referral to the anti-terror programme Prevent before she stabbed three people at her school, a report has revealed.</p><p>The 13-year-old had a curiosity for war memorabilia and the Nazi dictator, a fascination with weapons and claimed to speak German and Russian.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/27/girl-stabbed-teachers-welsh-school-considered-prevent\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Domestic violence is leading cause of homicide in Utah amid Trump cuts",
      "link": "https://www.theguardian.com/us-news/2025/aug/27/utah-domestic-violence-homicide",
      "pub_time_taipei": "2025-08-27T19:00:03+08:00",
      "summary": "<p>US president cuts funding for victims as state faces more than a third of killings from partner or familial violence</p><p>Domestic violence is the leading cause of homicide in <a href=\"https://www.theguardian.com/us-news/utah\">Utah</a>, according to an analysis of FBI and state data by a local news station in Salt Lake City. <a href=\"https://www.fox13now.com/news/local-news/domestic-violence-is-utahs-leading-cause-of-homicide-new-data-shows\">The investigation</a> is based on intimate partner homicide data recently <a href=\"https://siac.utah.gov/intimate-partner-domestic-violence-data-analysis/\">released by the state</a>.</p><p>The station, Fox 13, found that 51 – more than a third – of the 137 homicides between July 2023 and January 2025 were the result of intimate partner or familial violence. The majority of the perpetrators were men, while the sexes of the victim were nearly evenly split, with 26 male and 25 female victims. This could be because in many cases, there were multiple victims, including a victim’s children, parents or siblings.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/27/utah-domestic-violence-homicide\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "When science meets music: Florida’s oyster decline is being told through jazz",
      "link": "https://www.theguardian.com/us-news/2025/aug/27/florida-oyster-decline-jazz",
      "pub_time_taipei": "2025-08-27T19:00:02+08:00",
      "summary": "<p>A professor teamed up with student musicians to inspire interest in data about the ‘catastrophic scale’ of the crisis</p><p>A university professor has set her team’s research on the plight of Florida’s declining oyster population to music, aiming to inform a receptive new audience about the <a href=\"https://floridapolitics.com/archives/713857-pbs-stations-to-show-documentary-on-decline-of-floridas-oyster-reefs/\">“catastrophic” scale</a> of the crisis.</p><p>Heather O’Leary, professor of anthropology at St Petersburg’s University of South Florida (USF), partnered with student composers and faculty from its music department to create <a href=\"https://www.youtube.com/watch?v=MW3mnGnod0g\">Oysters Ain’t Safe</a>, a soft jazz alternative to crunching data into a “boring” technical report.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/27/florida-oyster-decline-jazz\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: UN demands justice over Israel’s double bombing of Gaza hospital",
      "link": "https://www.theguardian.com/us-news/2025/aug/27/first-thing-un-demands-justice-israel-double-bombing-gaza-hospital",
      "pub_time_taipei": "2025-08-27T18:52:28+08:00",
      "summary": "<p>Human rights office says attack, which killed 20 people, raises questions about the targeting of journalists. Plus, painting looted by Nazis spotted in Argentina </p><p>Good morning.</p><p>The UN has demanded that Israel’s investigations into unlawful killings in Gaza, including its “double-tap” bombing of Nasser hospital, <a href=\"https://www.theguardian.com/world/2025/aug/26/un-demands-investigations-into-gaza-hospital-killings\">which killed 20 people</a> including five journalists, yield results and ensure accountability.</p><p><strong>What does international law say about the attack?</strong> It may constitute a war crime on many fronts, <a href=\"https://www.theguardian.com/world/2025/aug/25/israel-attack-gaza-hospital-may-constitute-war-on-many-fronts\">writes</a> the Guardian’s Peter Beaumont. “What is striking about this incident is that each individual element – the targeting of a working hospital, of journalists and rescue workers, of injured civilians already under treatment – would be expected to draw accusations of a war crime in its own right,” he writes.</p><p><strong>Who were the five Palestinian journalists killed?</strong> Their names were Moaz Abu Taha, Mariam Abu Dagga, Mohammad Salama, Ahmed Abu Aziz and Hussam al-Masri, and you can <a href=\"https://www.theguardian.com/world/2025/aug/26/he-loved-his-work-deeply-profiles-of-five-palestinian-journalists-killed-in-gaza-airstrike\">read their stories here</a>. “He loved his work deeply,” said Abu Taha’s brother Adly.</p><p><strong>Meanwhile, what</strong><strong> is happening in Israel?</strong> Tens of thousands of people took part in <a href=\"https://www.theguardian.com/world/2025/aug/26/israeli-protesters-stage-day-of-disruption-calling-for-end-to-war-in-gaza\">demonstrations</a> on Tuesday, blocking highways on a “day of disruption” that aimed to push Benjamin Netanyahu into agreeing a deal to end the war and call off plans to attack Gaza City.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/27/first-thing-un-demands-justice-israel-double-bombing-gaza-hospital\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "In idyllic Porepunkah, a manhunt this huge feels ‘surreal’ – and the alleged killer could be anywhere",
      "link": "https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-victoria-manhunt-alleged-killer-bush-search-ntwnfb",
      "pub_time_taipei": "2025-08-27T18:07:32+08:00",
      "summary": "<p>A peaceful Victoria town has been rocked by the fatal shootings of two police officers, leaving locals shuttered indoors and police scouring bushland for the suspect</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-shooting-suspect-dezi-freeman-victoria-police-ntwnfb\">Who is Dezi Freeman? Porepunkah shooting suspect called police ‘terrorist thugs’ and tried to arrest magistrate</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/27/how-porepunkah-shooting-unfolded-victoria-police-search-warrant-attack-ntwnfb\">How a police search warrant at a rural Victorian property ended in a day of tragedy</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>It would have been idyllic were it not for the sound of a police helicopter reverberating over the valley.</p><p>By late afternoon on Wednesday the rain had slowed to a drizzle in Porepunkah. Mist curled around the foothills of Mt Buffalo. Cows and sheep grazed under a grey sky, unperturbed by the massive manhunt around them.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-victoria-manhunt-alleged-killer-bush-search-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Who is Dezi Freeman? Porepunkah shooting suspect called police ‘terrorist thugs’ and tried to arrest a magistrate, court records reveal",
      "link": "https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-shooting-suspect-dezi-freeman-victoria-police-ntwnfb",
      "pub_time_taipei": "2025-08-27T18:05:27+08:00",
      "summary": "<p>Victoria police say alleged shooter remains on the run and armed after two officers killed and a third injured</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/26/victoria-police-shooting-what-we-know-so-far-ntwnfb\">What we know so far about the shooting in rural Australia</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Dezi Freeman, the man suspected of <a href=\"https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area\">shooting and killing two police officers</a> and injuring a third at a rural Victorian property, said he had a history of unpleasant encounters with the force, who he called “terrorist thugs”, “frigging Nazis” and “Gestapo” that wore “the satanic symbol” of an “inverted pentagram” on their uniforms, according to court records.</p><p>Freeman also has a history of association with pseudolaw and “sovereign citizen” ideas.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-shooting-suspect-dezi-freeman-victoria-police-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Immigration advocates alarmed over detention of Daca recipient: ‘No legal basis’",
      "link": "https://www.theguardian.com/us-news/2025/aug/27/daca-recipient-detention-immigration",
      "pub_time_taipei": "2025-08-27T18:00:16+08:00",
      "summary": "<p>Border patrol agents arrested Catalina Santiago, granted temporary protection as a Dreamer, on 3 August</p><p>Catalina “Xochitl” Santiago had already made it past the security line at the El Paso airport when two border patrol agents called her in for questioning and whisked her away to an immigration detention center.</p><p>Nearly a month after her arrest, she and her family still aren’t clear why she is detained. Santiago is a beneficiary of the Deferred Action for Childhood Arrivals (Daca) program – which has allowed her to legally live and work in the US.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/27/daca-recipient-detention-immigration\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Woolworths struggles to win back ‘price trust’ from customers – and investors – as Coles’ value rises",
      "link": "https://www.theguardian.com/business/2025/aug/27/woolworths-coles-results-market-value",
      "pub_time_taipei": "2025-08-27T17:39:40+08:00",
      "summary": "<p>Market value of Woolworths, Australia’s largest supermarket chain, slips from more than $40bn to less than $35bn</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Woolworths has shed more than $5bn in market value as it struggles to regain customer “price trust” and stretches product availability.</p><p>Australia’s biggest supermarket chain on Wednesday reported sales rose 3% in the year to June and 2% in July and August compared to the year before, while profits in 2024-25 fell by a fifth, to nearly $1.4bn.</p> <a href=\"https://www.theguardian.com/business/2025/aug/27/woolworths-coles-results-market-value\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Porepunkah shooting: loud bangs heard near property – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/aug/27/porepunkah-shooting-live-updates-victoria-police-manhunt-latest-news-ntwnfb",
      "pub_time_taipei": "2025-08-27T17:25:28+08:00",
      "summary": "<p>Victoria police chief commissioner Mike Bush says suspect Dezi Freeman, 56, is ‘heavily armed’ and still at large. This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area\">Porepunkah shooting: two Victoria police officers dead, one injured in attack at rural property</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/26/victoria-police-shooting-what-we-know-so-far-ntwnfb\">What we know so far about the shooting in rural Australia</a></p></li></ul><p>The chief commissioner of Victoria police, <strong>Mike Bush</strong>, said Freeman, 56, is “heavily armed” and still at large. Bush said a “large team” were “absolutely focused” on finding the suspect:</p><p>We are pouring every resource into this search for this person, we must find him … The hunt will continue until we find him.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/aug/27/porepunkah-shooting-live-updates-victoria-police-manhunt-latest-news-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Deforestation has killed half a million people in past 20 years, study finds",
      "link": "https://www.theguardian.com/environment/2025/aug/27/deforestation-has-killed-half-a-million-people-in-past-20-years-study-finds",
      "pub_time_taipei": "2025-08-27T17:00:57+08:00",
      "summary": "<p>Localised rises in temperature caused by land clearance cause 28,330 heat-related deaths a year, researchers find</p><p>Deforestation has killed more than half a million people in the tropics over the past two decades as a result of heat-related illness, <a href=\"https://www.nature.com/articles/s41558-025-02411-0\">a study has found</a>.</p><p>Land clearance is raising the temperature in the rainforests of the Amazon, Congo and south-east Asia because it reduces shade, diminishes rainfall and increases the risk of fire, the authors of the paper found.</p> <a href=\"https://www.theguardian.com/environment/2025/aug/27/deforestation-has-killed-half-a-million-people-in-past-20-years-study-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Attempt to partner African countries with Japanese cities triggers xenophobic backlash",
      "link": "https://www.theguardian.com/world/2025/aug/27/attempt-to-partner-african-countries-with-japanese-cities-triggers-xenophobic-backlash",
      "pub_time_taipei": "2025-08-27T13:01:42+08:00",
      "summary": "<p>Cities in Japan have received thousands of complaints amid confusion over scheme that was intended to foster closer ties</p><p>An attempt to promote friendship between <a href=\"https://www.theguardian.com/world/japan\">Japan</a> and countries in Africa has transformed into a xenophobic row about migration after inaccurate media reports suggested the scheme would lead to a “flood of immigrants”.</p><p>The controversy erupted after the Japan International Cooperation Agency, or JICA, said this month it had designated four Japanese cities as “Africa hometowns” for partner countries in Africa: Mozambique, Nigeria, Ghana and Tanzania.</p> <a href=\"https://www.theguardian.com/world/2025/aug/27/attempt-to-partner-african-countries-with-japanese-cities-triggers-xenophobic-backlash\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brazil judge orders round-the-clock surveillance of ‘flight risk’ Bolsonaro",
      "link": "https://www.theguardian.com/world/2025/aug/26/brazil-judge-orders-round-the-clock-surveillance-of-flight-risk-bolsonaro",
      "pub_time_taipei": "2025-08-27T06:21:06+08:00",
      "summary": "<p>Pre-trial monitoring ordered after police reported former president had drafted request for asylum in Argentina</p><p>Jair Bolsonaro must be under constant police surveillance, a supreme court justice has ruled, to prevent Brazil’s former president from fleeing days before the start of the trial that could see him jailed for more than 40 years.</p><p>The far-right leader has been wearing an electronic ankle tag since mid-July and has been under house arrest since early August. But last Monday, the prosecutor general asked the supreme court to tighten surveillance of the 70-year-old, after federal police reported he had even <a href=\"https://www.theguardian.com/world/2025/aug/21/jair-bolsonaro-argentina-asylum-plan-brazil\">drafted a request for political asylum in Argentina</a>.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/brazil-judge-orders-round-the-clock-surveillance-of-flight-risk-bolsonaro\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli protesters stage ‘day of disruption’ calling for end to war in Gaza",
      "link": "https://www.theguardian.com/world/2025/aug/26/israeli-protesters-stage-day-of-disruption-calling-for-end-to-war-in-gaza",
      "pub_time_taipei": "2025-08-27T02:46:43+08:00",
      "summary": "<p>Netanyahu continues to prepare Gaza City offensive as mediators await response to ceasefire proposal</p><p>Tens of thousands of people took part in demonstrations across Israel on Tuesday, blocking highways on a “day of disruption” that aimed to push Benjamin Netanyahu into agreeing a deal to end the war and calling off plans to attack Gaza City.</p><p>Relatives of hostages led the biggest march and rally in Tel Aviv, while in Jerusalem hundreds of people gathered outside the prime minister’s office as the security cabinet met to discuss the war. There were dozens of other protests around the country, including on the main highway to the northern city of Haifa and inside Ben Gurion airport.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/israeli-protesters-stage-day-of-disruption-calling-for-end-to-war-in-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Teenager convicted over IS-inspired plot to attack Taylor Swift concert",
      "link": "https://www.theguardian.com/music/2025/aug/26/teenager-took-part-in-terror-plot-to-attack-taylor-swift-concert-court-finds",
      "pub_time_taipei": "2025-08-27T02:15:20+08:00",
      "summary": "<p>Mohammad A, 16, given 18-month suspended sentence for helping plan foiled attack in Vienna</p><p>A Berlin court has convicted a Syrian teenager of contributing to an Islamic State-inspired plot to attack a <a href=\"https://www.theguardian.com/music/taylor-swift\">Taylor Swift</a> concert in Vienna.</p><p>Three dates in the US pop star’s record-breaking Eras tour were cancelled last summer after authorities learned of the plot.</p> <a href=\"https://www.theguardian.com/music/2025/aug/26/teenager-took-part-in-terror-plot-to-attack-taylor-swift-concert-court-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "France faces new political crisis as PM expected to lose confidence vote",
      "link": "https://www.theguardian.com/world/2025/aug/26/france-political-crisis-francois-bayrou-prime-minister",
      "pub_time_taipei": "2025-08-27T02:04:12+08:00",
      "summary": "<p>François Bayrou says he will ‘fight like a dog’ to stay in power but he appears almost certain to be toppled</p><p>France is braced for another political crisis as the minority government of François Bayrou appears almost certain to be toppled in a confidence vote next month, amid deep political divisions over an unpopular austerity budget and debt-reduction plan.</p><p>“I will fight like a dog,” the centrist prime minister told <a href=\"https://www.lexpress.fr/politique/exclusif-francois-bayrou-sur-le-vote-de-confiance-je-me-battrai-comme-un-chien-FW5FGWGS2BFT3O4CS7G3A5KWBQ/\">L’Express</a> on Tuesday after his surprise decision to <a href=\"https://www.theguardian.com/world/2025/aug/25/francois-bayrou-france-prime-minister-confidence-vote\">call a vote of confidence</a> from parliamentarians.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/france-political-crisis-francois-bayrou-prime-minister\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US envoy sparks uproar after telling Lebanese journalists to ‘act civilised’",
      "link": "https://www.theguardian.com/world/2025/aug/26/syria-tom-barrack-lebanon-beirut-journalists",
      "pub_time_taipei": "2025-08-27T01:46:21+08:00",
      "summary": "<p>Reporters demand apology from Tom Barrack, US special envoy to Syria, after his remarks at Beirut press conference </p><p>Journalists in <a href=\"https://www.theguardian.com/world/lebanon\">Lebanon</a> have demanded an apology from a senior US envoy after he told them to “act civilized” and not be “animalistic”.</p><p>As reporters shouted questions after the US delegation’s meeting with the Lebanese president, Joseph Aoun, on Tuesday, Tom Barrack, the US ambassador to Turkey and special envoy to Syria, stepped up to the podium in the packed room and said: “We’re going to have a different set of rules ... please be quiet for a moment.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/syria-tom-barrack-lebanon-beirut-journalists\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russia could back delay to ‘snapback’ of nuclear sanctions against Iran",
      "link": "https://www.theguardian.com/world/2025/aug/26/iran-nuclear-sanctions-delay-russia",
      "pub_time_taipei": "2025-08-27T01:16:38+08:00",
      "summary": "<p>Moscow willing to support six-month extension of deadline before punishments are reimposed, reports suggest</p><p>Russia could back an extended six-month deadline for its ally Iran before European powers reimpose sweeping United Nations sanctions over Tehran’s refusal to allow UN inspectors back into nuclear sites after the Israeli-US assault in June.</p><p>France, Britain and Germany – known as the E3 – have long threatened to trigger a “snapback” of sanctions at the UN security council before 18 October, when a largely defunct nuclear deal struck 10 years ago between Tehran and major powers expires.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/iran-nuclear-sanctions-delay-russia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hundreds of senior diplomats call for EU to take urgent action over Gaza crisis – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
      "pub_time_taipei": "2025-08-27T01:00:03+08:00",
      "summary": "<p>Open letter has been signed by 209 former EU ambassadors, senior diplomatic staff and ambassadors from EU nation states</p><p>The UN says that Israel must not only investigate alleged unlawful killings in Gaza like the hospital strike that killed 20 people, including journalists, the previous day, but also ensure those probes yield results.</p><p>“There needs to be justice,” United Nations rights office spokesman Thameen Al-Kheetan told AFP in Geneva, adding that the large number of media workers killed in the Gaza war “raises many, many questions about the targeting of journalists”.</p><p>The Israeli authorities have, in the past, announced investigations in such killings.</p><p>It’s of course the responsibility of Israel, as the occupying power, to investigate - but these investigations need to yield results.</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Botswana’s president declares health emergency over supply shortages",
      "link": "https://www.theguardian.com/world/2025/aug/26/botswana-president-declares-public-health-emergency-medicine-supply-shortages",
      "pub_time_taipei": "2025-08-26T23:57:33+08:00",
      "summary": "<p>Duma Boko announces urgent funding package for medicines to be distributed with military oversight</p><p>Botswana’s president has declared a public health emergency due to shortages of essential medicines and equipment, as a downturn in the global diamond market and US aid cuts take a toll on the country’s finances.</p><p>The announcement came after the Ministry of Health suspended non-urgent surgeries on 4 August, <a href=\"https://web.facebook.com/photo/?fbid=1223265643163058&amp;set=a.294720102684288\">stating</a> that the country was short of medicines to treat hypertension, diabetes, cancer, asthma and eye conditions, as well as supplies including bandages and sutures and those for sexual and reproductive health.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/botswana-president-declares-public-health-emergency-medicine-supply-shortages\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Iran has a long history of clandestine attacks abroad to further its ends",
      "link": "https://www.theguardian.com/world/2025/aug/26/iran-has-a-long-history-clandestine-attacks-abroad-to-further-its-ends",
      "pub_time_taipei": "2025-08-26T23:12:51+08:00",
      "summary": "<p>If Tehran was behind antisemitic attacks in Australia, experts say it is a sign of weakness rather than strength</p><p>Iran’s involvement in clandestine violence and espionage overseas takes many forms, but all have a single aim – to win advantage for Tehran by striking unexpectedly at the “soft underbelly” of enemies.</p><p>It’s a strategy that dates back to the 1979 revolution, and is rooted in a pragmatic if regretful assessment of Iran’s continuing weakness on the conventional battlefield.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/iran-has-a-long-history-clandestine-attacks-abroad-to-further-its-ends\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Old master painting looted by Nazis spotted in Argentinian property listing",
      "link": "https://www.theguardian.com/world/2025/aug/26/old-master-painting-giuseppe-ghislandi-looted-by-nazis-argentina-property-listing",
      "pub_time_taipei": "2025-08-26T22:27:13+08:00",
      "summary": "<p>Dutch newspaper AD says it has traced Giuseppe Ghislandi’s Portrait of a Lady to house near Buenos Aires</p><p>More than 80 years after it was looted by the Nazis from a Jewish art dealer in Amsterdam, a portrait by an Italian master has been spotted on the website of an estate agent advertising a house for sale in Argentina.</p><p>A photo shows the painting, Portrait of a Lady (Contessa Colleoni) by the late-baroque portraitist <a href=\"https://www.metmuseum.org/art/collection/search/359308\">Giuseppe Ghislandi</a>, also known as Fra’ Galgario,<strong> </strong>hanging above a sofa in the living room of the property, in a seaside town near Buenos Aires.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/old-master-painting-giuseppe-ghislandi-looted-by-nazis-argentina-property-listing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "India’s supreme court orders inquiry into giant zoo run by son of Asia’s richest person",
      "link": "https://www.theguardian.com/world/2025/aug/26/india-supreme-court-giant-zoo-son-asia-richest-person-vantara",
      "pub_time_taipei": "2025-08-26T22:16:49+08:00",
      "summary": "<p>Activists claim Anant Ambani’s Vantara facility has no plan to return its endangered species to the wild</p><p>India’s supreme court has ordered an investigation into a vast private zoo founded by the son of Asia’s richest person over allegations of illegal wildlife imports and financial misconduct.</p><p>Home to a reported 200 lions, 250 leopards and 900 crocodiles, Vantara in western Gujarat state describes itself as the “world’s biggest wild animal rescue centre”. It is run by Anant Ambani, a son of Mukesh Ambani, the billionaire head of the conglomerate Reliance Industries, and was one of the venues for his extravagant wedding celebrations last year, where celebrities were encouraged to wear “jungle fever” outfits.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/india-supreme-court-giant-zoo-son-asia-richest-person-vantara\">Continue reading...</a>"
    }
  ]
}