{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-20T20:40:04.299138+08:00",
  "window_end_taipei": "2025-09-21T20:40:04.299138+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Lammy hints at U-turn to allow Palestinian scholars to bring children to UK",
      "link": "https://www.theguardian.com/uk-news/2025/sep/21/lammy-hints-at-u-turn-to-allow-palestinian-scholars-bring-children-to-uk",
      "pub_time_taipei": "2025-09-21T20:20:08+08:00",
      "summary": "<p>Group of students from Gaza with places at British universities are due to arrive in the UK within days</p><p>David Lammy has hinted that the UK government could U-turn to allow Palestinian scholars to bring their children to the UK.</p><p>A group of 34 Palestinian students, including Chevening scholars, with places at British universities have been given permission to continue their studies in Britain. But nearly all have been told by the Foreign Office that they are not allowed to bring their children with them.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/21/lammy-hints-at-u-turn-to-allow-palestinian-scholars-bring-children-to-uk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Keir Starmer set to announce UK recognition of Palestine later today - UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/21/keir-starmer-palestine-recognition-announcement-gaza-uk-politics-live",
      "pub_time_taipei": "2025-09-21T20:19:53+08:00",
      "summary": "<p>Announcement from prime minister expected this afternoon despite Israeli opposition</p><p><strong>Keir Starmer</strong> has arrived at Westminster Abbey for the Battle of Britain service.</p><p>The ceremony, held between 11am and 12pm, marks the 85th anniversary of the victory by Royal Air Force pilots and aircrew during the Battle of Britain in 1940.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/21/keir-starmer-palestine-recognition-announcement-gaza-uk-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "States rally to offset fracturing of federal healthcare agencies: ‘Diseases don’t see state lines’",
      "link": "https://www.theguardian.com/us-news/2025/sep/21/states-healthcare-vaccines-recommendations",
      "pub_time_taipei": "2025-09-21T20:00:42+08:00",
      "summary": "<p>Changes to regulatory or information environments will help states decouple from federal health recommendations</p><p>Seven US states and the nation’s largest city <a href=\"https://www.mass.gov/news/several-northeastern-states-and-americas-largest-city-announce-the-northeast-public-health-collaborative\">announced</a> this week that they have formed the Northeast Public Health Collaborative, in an effort to strengthen the region’s health guidance as the national health landscape fractures.</p><p>As national health agencies revisit their recommendations, including high-profile restrictions on the updated Covid shots and the measles, mumps, rubella and varicella (MMRV) vaccine, the pressure is increasingly falling on states to navigate recommendations and new federal rules.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/21/states-healthcare-vaccines-recommendations\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "House of Commons nursery provider criticised for article praising Reform conference",
      "link": "https://www.theguardian.com/uk-news/2025/sep/21/house-of-commons-nursery-provider-article-praising-reform-conference",
      "pub_time_taipei": "2025-09-21T19:52:08+08:00",
      "summary": "<p>Piece on website of LEYF, which runs nurseries across London, talked of party’s ‘growing appeal to mothers’</p><p>The company running the House of Commons nursery and others across London has been criticised for publishing an article on its website praising Reform UK’s conference and claiming anti-immigration protests were “driven by a sense of injustice”.</p><p>The article, which was taken down by LEYF nurseries after an approach by the Guardian, was written by its chief executive, June O’Sullivan, after her visit to the party’s conference.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/21/house-of-commons-nursery-provider-article-praising-reform-conference\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "British artists reclaim St George’s flag with a message of inclusivity",
      "link": "https://www.theguardian.com/uk-news/2025/sep/21/british-artists-reclaim-st-georges-flag-inclusivity",
      "pub_time_taipei": "2025-09-21T19:37:32+08:00",
      "summary": "<p>In Manchester and beyond creative responses to the unwelcome message of ‘raise the colours’ are appearing</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/21/readers-polarised-unite-the-kingdom-rally\">‘Scary’ and ‘I loved it’: the ‘unite the kingdom’ march</a></p></li></ul><p>Artists in Britain have customised St George’s flags with messages celebrating diversity, in response to a campaign in which national banners have been flown from lamp-posts, outside homes and painted on roundabouts.</p><p>While for many, flying the flag is a genuine expression of national pride, some flags have been <a href=\"https://www.theguardian.com/politics/2025/sep/16/for-some-minority-britons-the-unite-the-kingdom-rally-shows-far-right-politics-is-becoming-legitimised\">graffitied on businesses and places of worship</a> belonging to minority ethnic Britons, in some cases with slurs, after the launch of the operation “raise the colours”.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/21/british-artists-reclaim-st-georges-flag-inclusivity\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Delays continue at Heathrow, Brussels and Berlin airports after alleged cyber-attack",
      "link": "https://www.theguardian.com/business/2025/sep/21/delays-continue-at-heathrow-brussels-and-berlin-airports-after-alleged-cyber-attack",
      "pub_time_taipei": "2025-09-21T19:04:00+08:00",
      "summary": "<p>Airlines reverted to manual check-in from Friday after service provider hit by ‘cyber-related incident’</p><p>Passengers at London Heathrow airport and those in Brussels and Berlin faced another day of delays on Sunday after an <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport-delays-cyber-attack-berlin-brussels-cancelled-delays\">alleged cyber-attack hit check-in desk software</a>.</p><p>Airlines were forced to revert to manual check-in from Friday night after the alleged attack hit Collins Aerospace, which provides check-in desk technology to various airlines.</p> <a href=\"https://www.theguardian.com/business/2025/sep/21/delays-continue-at-heathrow-brussels-and-berlin-airports-after-alleged-cyber-attack\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chatbot site depicting child sexual abuse images raises fears over misuse of AI",
      "link": "https://www.theguardian.com/technology/2025/sep/21/chatbot-site-depicting-child-sexual-abuse-images-raises-fears-over-misuse-of-ai",
      "pub_time_taipei": "2025-09-21T19:00:43+08:00",
      "summary": "<p>Child safety watchdog calls for child protection guidelines to be built into AI models from the outset</p><p>A chatbot site offering explicit scenarios with preteen characters, illustrated by illegal abuse images has raised fresh fears about the misuse of artificial intelligence.</p><p>A report by a child safety watchdog has triggered calls for the UK government to impose safety guidelines on AI companies, <a href=\"https://www.theguardian.com/technology/2025/jul/10/ai-generated-child-sexual-abuse-videos-surging-online-iwf\">amid a surge</a> in child sexual abuse material (CSAM) created by the technology.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/21/chatbot-site-depicting-child-sexual-abuse-images-raises-fears-over-misuse-of-ai\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Virginia woman donates $150,000 Powerball prize to charity: ‘I needed to give it all away’",
      "link": "https://www.theguardian.com/us-news/2025/sep/21/virginia-woman-donates-powerball-prize-charities",
      "pub_time_taipei": "2025-09-21T19:00:43+08:00",
      "summary": "<p>Carrie Edwards, a widow and grandma, gave the money to dementia research, food access and aid for military families</p><p>Carrie Edwards of <a href=\"https://www.theguardian.com/us-news/virginia\">Virginia</a> wasn’t the big winner when she won $150,000 playing the Powerball recently – instead, that honor went to dementia research, food access and support for military families, the charitable causes to which she donated her entire prize.</p><p>Edwards, described by lottery officials as a widow and grandmother, has gained praise in parts of the web dedicated to finding uplifting news stories – along with the charities benefiting from her windfall – after buying an online ticket for the Powerball drawing on 8 September.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/21/virginia-woman-donates-powerball-prize-charities\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Shouting and stroking ponies outlawed by rural councils in England as antisocial behaviour",
      "link": "https://www.theguardian.com/uk-news/2025/sep/21/shouting-and-stroking-ponies-outlawed-by-rural-councils-as-antisocial-behaviour",
      "pub_time_taipei": "2025-09-21T19:00:41+08:00",
      "summary": "<p>Civil liberties groups say swathes of new rules, including for swearing and wild swimming, criminalise normal behaviour</p><p>Shouting, leaving your spectacles in the sun and stroking a pony are among the rural activities outlawed by councils under the banner of managing antisocial behaviour this summer, according to campaigners.</p><p>The Manifesto Club, a leading civil liberties group, said swathes of new public spaces protection orders (PSPOs) have been <a href=\"https://manifestoclub.info/the-council-crackdown-on-countryside-freedoms/\">introduced or extended</a> by local authorities, criminalising activities and behaviours under the banner of managing antisocial behaviour or environmental harm.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/21/shouting-and-stroking-ponies-outlawed-by-rural-councils-as-antisocial-behaviour\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "To find their next great runners, U.S. colleges look to rural Kenya",
      "link": "https://www.washingtonpost.com/world/2025/09/20/kenya-athletes-colleges-recruitment-ncaa/",
      "pub_time_taipei": "2025-09-21T19:00:00+08:00",
      "summary": "A recruiting drive in Kenya is changing the face of U.S. college athletics. Time trials have become bitterly competitive as runners seek a way out of poverty."
    },
    {
      "source": "華盛頓郵報",
      "title": "A Trump-shaped wrecking ball swings toward a faltering United Nations",
      "link": "https://www.washingtonpost.com/world/2025/09/21/unga-trump-un-funding-80-years/",
      "pub_time_taipei": "2025-09-21T18:00:00+08:00",
      "summary": "As world leaders gather for UNGA, the U.N. faces malaise fueled by crises of funding and relevance, 80 years after it emerged from the ashes of World War II."
    },
    {
      "source": "華盛頓郵報",
      "title": "The Taliban are reaching out — and some countries are responding",
      "link": "https://www.washingtonpost.com/world/2025/09/21/taliban-diplomacy-official-recognition/",
      "pub_time_taipei": "2025-09-21T17:00:59+08:00",
      "summary": "Anti-immigrant sentiment in Europe, concerns about militancy in Asia and acceptance that the Taliban regime is unlikely to collapse soon present a diplomatic opening."
    },
    {
      "source": "衛報",
      "title": "Optus admits process not followed after it missed at least five warnings of triple zero outage",
      "link": "https://www.theguardian.com/business/2025/sep/21/abhorrent-behaviour-call-for-optus-to-face-stiff-penalties-after-triple-zero-outage-deaths",
      "pub_time_taipei": "2025-09-21T15:38:32+08:00",
      "summary": "<p>Albanese government under pressure to ensure stiff penalties are imposed as emergency management minister blasts telco as “absolutely disgraceful”</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Optus failed to immediately respond to at least five calls from customers unable to contact triple zero in the hours before it realised its systems had failed, as the embattled telco confirmed “established processes were not followed”.</p><p>The company’s chief executive, Stephen Rue said on Sunday the company had identified at least five calls, routed to an offshore customer call centre, in relation to the emergency line outage that has been <a href=\"https://www.theguardian.com/business/2025/sep/20/optus-network-outage-in-which-three-people-died-lasted-eight-hours-longer-than-telco-initially-said\">linked to at least three deaths</a>.</p> <a href=\"https://www.theguardian.com/business/2025/sep/21/abhorrent-behaviour-call-for-optus-to-face-stiff-penalties-after-triple-zero-outage-deaths\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tulip Siddiq fears plans to use ‘fake’ documents to secure conviction in corruption trial",
      "link": "https://www.theguardian.com/politics/2025/sep/21/tulip-siddiq-fears-plans-to-use-fake-documents-to-secure-conviction-in-corruption-trial",
      "pub_time_taipei": "2025-09-21T15:00:36+08:00",
      "summary": "<p>Exclusive: Ex-minister being tried in absentia in Bangladesh claims ID card and passport tendered as evidence not hers</p><p>The former City minister <a href=\"https://www.theguardian.com/politics/2025/jan/14/who-is-tulip-siddiq-niece-of-deposed-bangladeshi-pm-who-quit-treasury-role\">Tulip Siddiq</a> has said she fears prosecutors could be planning to use “fake” documents to secure her conviction in her trial in Bangladesh on corruption charges.</p><p>The Labour MP, who is being tried in absentia, spoke out after images of a Bangladeshi national identity card and a passport said to be in her name were published in newspapers in the UK and in Bangladesh.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/21/tulip-siddiq-fears-plans-to-use-fake-documents-to-secure-conviction-in-corruption-trial\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thousands gather at Charlie Kirk memorial in Arizona where Trump to pay tribute to slain organizer",
      "link": "https://www.theguardian.com/us-news/2025/sep/21/thousands-gather-at-charlie-kirk-memorial-in-arizona-where-trump-to-pay-tribute-to-slain-organizer",
      "pub_time_taipei": "2025-09-21T14:28:58+08:00",
      "summary": "<p>US Secret Service leads massive security presence, while conservatives demand punishment of those who disparaged rightwing ‘youth whisperer’</p><p>Thousands were gathering in Arizona on Sunday for a public memorial honoring <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">Charlie Kirk</a>, the rightwing youth organizer who was fatally shot during an event at a Utah college.</p><p>Donald Trump, his vice-president, JD Vance, and Kirk’s widow, Erika Kirk, were among a long list of prominent officials and figures expected to pay tribute to the slain activist, a reflection of his deep imprint on the president’s Make America Great Again (Maga) movement.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/21/thousands-gather-at-charlie-kirk-memorial-in-arizona-where-trump-to-pay-tribute-to-slain-organizer\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Owner of Georgian broadcaster called country’s ‘propaganda megaphone’ is based in London",
      "link": "https://www.theguardian.com/world/2025/sep/21/owner-of-georgian-broadcaster-called-countrys-propaganda-megaphone-is-based-in-london",
      "pub_time_taipei": "2025-09-21T14:00:36+08:00",
      "summary": "<p> Imedi TV owner denies criticism by EU disinformation monitor and says it is editorially independent</p><p>On Pont Street in Belgravia in central London, on the first floor of a handsome Edwardian townhouse, sitting above the royal green awning of the Jeroboams wine shop, is an office. There are no obvious signs for it beyond a little note next to the intercom. When buzzed this week, no one appeared at the door.</p><p>This is the registered office of Hunnewell Partners, which describes itself as an “entrepreneurial private equity and litigation funding practice”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/21/owner-of-georgian-broadcaster-called-countrys-propaganda-megaphone-is-based-in-london\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Optus CEO says ‘compulsory escalation process’ for reports of triple-zero failures to be introduced – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb",
      "pub_time_taipei": "2025-09-21T13:55:33+08:00",
      "summary": "<p>This blog is now closed</p><p><strong>Low tariffs not dependent on sit-down meeting with Trump, Bowen says</strong></p><p>On the potential for a meeting between <strong>Anthony Albanese </strong>and<strong> Donald Trump</strong>, Bowen has poured cold water on whether any charm offensive by the Australian PM might have turned the US from its present course.</p><p>There are plenty of world leaders who have met with Donald Trump who haven’t had good outcomes, who have got very high tariffs. Who have come over, had meetings, left optimistic and then they’ve got high tariffs. The way Anthony Albanese has managed the relationship, we have the world’s lowest tariff on Australia.</p><p>Results matter, David. Of course, the prime minister has made it clear he’s very happy to meet, but results matter. And this prime minister and this foreign minister and this government have delivered pretty good results when it comes to the bilateral relationship.</p><p>It’s not my place to announce these things, David. I’m a humble cabinet minister.</p><p>Of course a meeting with the president is always a good thing. But I’ll tell you what’s even more important is results. I’d much rather Anthony Albanese get a great result for our economy with the world’s lowest tariff without a meeting, than to have a meeting and get the opposite result, which is what many other world leaders have found themselves in that situation.</p><p>Well, we obviously have set Australia’s foreign policy based on our interests and our values. And while everyone is entitled to their views, we will determine Australian foreign policy, not anyone else. And we’ve determined a couple of things – that the time is right, in concert, as you said, with like-minded states.</p><p>We have been waiting 80 years for a two-state solution, and that we now see recognising Palestine as a step towards a two-state solution, not the result of negotiations.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The US right claimed free speech was sacred – until the Charlie Kirk killing",
      "link": "https://www.theguardian.com/news/ng-interactive/2025/sep/21/us-right-free-speech-charlie-kirk",
      "pub_time_taipei": "2025-09-21T13:00:34+08:00",
      "summary": "<p>Rightwingers had long complained of a censorious leftwing ‘cancel culture’ but seem happy to now reframe that as ‘consequence culture’</p><p>In the emotionally and politically charged days since the killing of Charlie Kirk, the conservative youth activist who was a close ally of Donald Trump, one statement has loomed large. On Monday, the US attorney general – the official in charge of the rule of law in America – said that the Trump administration would “absolutely target” those who espouse “hate speech” about Kirk.</p><p>Unlike in many other countries, hate speech is protected by US law unless it incites imminent violence or constitutes a true threat. But that did not deter the nation’s top law enforcement officer, who also <a href=\"https://x.com/Acyn/status/1967759168217157837\">suggested</a> that – for example – a print shop employee who refused to print flyers memorializing Kirk could be “prosecuted”.</p> <a href=\"https://www.theguardian.com/news/ng-interactive/2025/sep/21/us-right-free-speech-charlie-kirk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Canavan claims Coalition ‘on the cusp’ of abandoning net zero as Ley urged to follow Dutton’s voice referendum tactics",
      "link": "https://www.theguardian.com/environment/2025/sep/21/canavan-claims-coalition-on-the-cusp-of-abandoning-net-zero-as-ley-urged-to-follow-duttons-voice-referendum-tactics",
      "pub_time_taipei": "2025-09-21T12:05:27+08:00",
      "summary": "<p>Queensland Nationals senator tells Cpac conference ‘last rites being administered’ and praises Andrew Hastie for threat to quit frontbench over policy</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Nationals senator Matt Canavan has claimed the Coalition is “on the cusp of walking away from net zero”, urging Sussan Ley to campaign against the emissions reduction target by taking inspiration from Peter Dutton’s opposition to the Indigenous voice referendum.</p><p>The conservative political conference Cpac has <a href=\"https://www.theguardian.com/australia-news/2025/sep/20/tony-abbott-implores-cpac-to-give-liberals-one-last-chance-and-condemned-partys-factional-warlords\">heaped more pressure on Ley to dump the climate target</a>, with a host of rightwing Liberal and National politicians calling for the 2050 aspiration – agreed by the former Coalition prime minister Scott Morrison – to be scrapped immediately.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/21/canavan-claims-coalition-on-the-cusp-of-abandoning-net-zero-as-ley-urged-to-follow-duttons-voice-referendum-tactics\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "NT attorney general criticised after confirming family link to hit-and-run driver",
      "link": "https://www.theguardian.com/australia-news/2025/sep/21/northern-territory-attorney-general-confirms-hit-run-driver-family-link",
      "pub_time_taipei": "2025-09-21T09:37:31+08:00",
      "summary": "<p>Marie-Clare Boothby faces questions after revealing she is related to man spared prison over a crash that killed Aboriginal pedestrian</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Northern Territory’s attorney general, Marie-Clare Boothby, has faced criticism after confirming she is related to a man who was spared prison last week over a hit-and-run car crash that killed an Aboriginal man.</p><p>Jake Danby, 24, was sentenced to a 12-month community corrections order in relation to the crash in June 2024. Danby hit two Aboriginal pedestrians, killing one, and fled the scene.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/21/northern-territory-attorney-general-confirms-hit-run-driver-family-link\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US Republicans warn Australia of ‘punitive measures’ over recognition of Palestinian state",
      "link": "https://www.theguardian.com/world/2025/sep/21/republicans-warn-australia-of-punitive-measures-over-recognition-of-palestinian-state",
      "pub_time_taipei": "2025-09-21T06:55:08+08:00",
      "summary": "<p>Donald Trump allies, including Ted Cruz, pen letter warning Anthony Albanese against ‘reckless policy’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Anthony Albanese says he will push for improved global peace and security during meetings with world leaders this week, as allies of Donald Trump warn Australia’s recognition of Palestine could spark “punitive measures” from the US.</p><p>Albanese arrived in New York on Sunday morning, Australian time, ahead of the UN general assembly and his <a href=\"https://www.theguardian.com/australia-news/2025/sep/19/everything-is-on-the-table-trump-meeting-weighs-heavily-as-albanese-heads-to-new-york\">possible first meeting with the US president</a>.</p> <a href=\"https://www.theguardian.com/world/2025/sep/21/republicans-warn-australia-of-punitive-measures-over-recognition-of-palestinian-state\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tulsi Gabbard did not alert White House before revoking 37 security clearances",
      "link": "https://www.theguardian.com/us-news/2025/sep/20/tulsi-gabbard-white-house-security-clearances",
      "pub_time_taipei": "2025-09-21T06:26:55+08:00",
      "summary": "<p>Exclusive: White House only realized afterwards that clearances at the CIA and in Congress had been rescinded</p><p>Tulsi Gabbard, the director of national intelligence, did not inform the White House that her office was <a href=\"https://www.theguardian.com/us-news/2025/aug/20/trump-revokes-security-clearances-gabbard\">revoking the security clearances of 37 people</a> – including top deputies to the CIA director, John Ratcliffe – before it happened last month, according to three people familiar with matter.</p><p>The move caused consternation because it resulted in the White House not having an opportunity to closely vet the list before it became public and there appeared to be no paper trail from the president directing the effort, the people said.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/20/tulsi-gabbard-white-house-security-clearances\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK set to recognise Palestinian state on Sunday",
      "link": "https://www.theguardian.com/world/2025/sep/20/uk-to-recognise-palestinian-state-despite-pressure-from-us-and-families-of-hostages",
      "pub_time_taipei": "2025-09-21T06:13:23+08:00",
      "summary": "<p>Keir Starmer expected to confirm move after concluding the situation has worsened significantly in recent weeks</p><p>The UK is expected to <a href=\"https://www.theguardian.com/world/2025/sep/19/what-uk-recognition-palestine-state-will-mean\">recognise a Palestinian state</a> on Sunday after Israel failed to meet the conditions set out by Keir Starmer in July.</p><p>The prime minister is to make the announcement after concluding the humanitarian situation has deteriorated significantly in the past few weeks. The move comes despite pressure from the US and the families of hostages held by Hamas.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/uk-to-recognise-palestinian-state-despite-pressure-from-us-and-families-of-hostages\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Dutch police clash with anti-immigration protesters in The Hague",
      "link": "https://www.theguardian.com/world/2025/sep/20/dutch-police-clash-with-anti-immigration-protesters-in-the-hague",
      "pub_time_taipei": "2025-09-21T04:07:39+08:00",
      "summary": "<p>Thirty arrests made and two officers injured as teargas and water cannon deployed against violent protesters</p><p>Dutch police have used teargas and a water cannon to disperse violent anti-immigration protesters in The Hague on Saturday, a local government spokesperson has said.</p><p>Thirty people have been arrested and two police officers were injured. Authorities did not rule out additional arrests in the coming days as they review camera footage.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/dutch-police-clash-with-anti-immigration-protesters-in-the-hague\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Heathrow flights delayed and cancelled as cyber-attack hits European airports",
      "link": "https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport-delays-cyber-attack-berlin-brussels-cancelled-delays",
      "pub_time_taipei": "2025-09-21T02:58:55+08:00",
      "summary": "<p>Attack raises questions over security as Brussels and Berlin airports’ check-in and boarding systems also affected</p><p>Flights have been delayed and cancelled at three leading European airports – including London’s largest, Heathrow – after the company behind the software used for check-in and boarding said it was hit by a cyber-attack.</p><p>Airports in Brussels and Berlin are also experiencing delays and disruption as a result of the problem affecting Collins Aerospace, which works for several airlines at airports across the world.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport-delays-cyber-attack-berlin-brussels-cancelled-delays\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "British couple detained by Taliban in Afghanistan return to UK",
      "link": "https://www.theguardian.com/uk-news/2025/sep/20/british-couple-detained-by-taliban-in-afghanistan-return-to-uk",
      "pub_time_taipei": "2025-09-21T00:32:40+08:00",
      "summary": "<p>Barbie Reynolds, 76, and husband Peter, 80, were released after being held without charge for nearly eight months</p><p>A British couple who were detained without charge for nearly eight months by the Taliban in Afghanistan have arrived in the UK.</p><p>Barbie Reynolds, 76, and her husband Peter, 80, were <a href=\"https://www.theguardian.com/world/2025/sep/19/british-couple-peter-and-barbie-reynolds-freed-after-six-months-in-captivity-in-afghanistan\">released on Friday</a>, having been arrested as they travelled to their home in Bamyan province, central Afghanistan, in February.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/british-couple-detained-by-taliban-in-afghanistan-return-to-uk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Security guarantees for Ukraine require readiness to fight Russia, says Finland’s president",
      "link": "https://www.theguardian.com/world/2025/sep/20/security-guarantees-for-ukraine-require-readiness-to-fight-russia-says-finlands-president",
      "pub_time_taipei": "2025-09-20T23:00:17+08:00",
      "summary": "<p>Exclusive: Alexander Stubb says a plausible deterrent and ‘American backstop’ are needed in the event of a future peace deal</p><p>Finland’s president, Alexander Stubb, has said security guarantees for Ukraine, <a href=\"https://www.theguardian.com/world/2025/sep/04/european-leaders-pressure-trump-to-reveal-how-much-support-us-will-give-ukraine\">which are being discussed by the so-called “coalition of the willing”</a>, would compel the European countries that sign to fight Russia if Moscow launched military action against Ukraine again in future.</p><p>“Security guarantees in essence are a deterrent. That deterrent has to be plausible and in order for it to be plausible it has to be strong,” Stubb told the Guardian, in an interview in Helsinki before travelling to New York for the UN general assembly.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/security-guarantees-for-ukraine-require-readiness-to-fight-russia-says-finlands-president\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel attack on Yemeni newspaper was second deadliest on journalists ever recorded",
      "link": "https://www.theguardian.com/world/2025/sep/20/israeli-attack-on-yemeni-newspaper-complex-kills-media-workers",
      "pub_time_taipei": "2025-09-20T22:32:28+08:00",
      "summary": "<p>Press freedom group says ‘brutal and unjustified attack’ is deadliest since 2009 Maguindanao massacre in Philippines</p><p>Thirty one journalists and media staff were killed by Israeli strikes on newspaper offices in Yemen last week in what the <a href=\"https://cpj.org/2025/09/israels-killing-of-31-yemeni-journalists-marks-deadliest-global-attack-in-16-years/\">Committee to Protect Journalists (CPJ)</a> said on Friday was the deadliest attack on journalists in the last 16 years.</p><p>Israel struck a newspaper complex in Sana’a, Yemen’s capital, which housed three Houthi-connected media outlets on 10 September. At the time, members of the Yemeni army’s press arm were finishing the weekly print edition, according to the publication’s editor-in-chief, which increased the number of journalists present during the strike.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/israeli-attack-on-yemeni-newspaper-complex-kills-media-workers\">Continue reading...</a>"
    }
  ]
}