{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-01T20:40:10.547286+08:00",
  "window_end_taipei": "2025-09-02T20:40:10.547286+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Congress returns after recess as threat of government shutdown looms – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
      "pub_time_taipei": "2025-09-02T20:23:43+08:00",
      "summary": "<p>Republicans and Democrats are at loggerheads over funding, while Donald Trump is to make a mystery announcement from the Oval Office later today </p><p>Donald Trump’s “exciting announcement” expected at 2pm ET will be “related to the Department of Defense”, White House press secretary Karoline Leavitt said.</p><p><strong>Representatives Thomas Massie and Ro Khanna plan to hold a news conference tomorrow with survivors of Jeffrey Epstein’s sexual abuse as the political fallout from the saga continues to engage Congress on several fronts.</strong></p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kraft Heinz to split a decade after merger in bid to revive growth",
      "link": "https://www.theguardian.com/business/2025/sep/02/kraft-heinz-split-merger-growth",
      "pub_time_taipei": "2025-09-02T20:20:20+08:00",
      "summary": "<p>Chicago-based food group says it will split into two publicly traded companies through tax-free spin-off</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Kraft Heinz, the US company behind kitchen staples such as Philadelphia cheese and Heinz tomato ketchup, has announced plans to split into two independent businesses a decade after it was created in a mega merger.</p><p><a href=\"https://ir.kraftheinzcompany.com/news/the-kraft-heinz-company-announces-plan-to-separate-into-two-scaled-focused-companies-to-accelerate/e42732fe-2843-48d6-ac72-a8b46c13bb6f\">The Chicago-based packaged food group said</a> it would separate into two publicly traded companies through a tax-free spin-off to try to reduce complexity and improve financial performance after years of falling sales.</p> <a href=\"https://www.theguardian.com/business/2025/sep/02/kraft-heinz-split-merger-growth\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pressure rises on Reeves as government borrowing costs hit 27-year high",
      "link": "https://www.theguardian.com/business/2025/sep/02/rachel-reeves-uk-borrowing-costs-budget-bond-yields",
      "pub_time_taipei": "2025-09-02T20:19:11+08:00",
      "summary": "<p>Chancellor will face more limited fiscal headroom at budget after yield on 30-year bond increases to 5.68%</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates\">Business live – latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/business/2025/sep/01/reshuffle-gymnastics-prepare-starmer-to-walk-tricky-budget-tightrope\">Reshuffle gymnastics prepare Starmer to walk tricky budget tightrope</a></p></li></ul><p>Britain’s long-term borrowing costs have hit their highest level in 27 years, intensifying the pressure on the chancellor, Rachel Reeves, before the autumn budget.</p><p>The yield, or interest rate, on 30-year UK government debt hit 5.714% on Tuesday. That is its highest level since 1998, indicating that it will cost the UK more to borrow from the markets, above the previous 27-year high of 5.649% set in April.</p> <a href=\"https://www.theguardian.com/business/2025/sep/02/rachel-reeves-uk-borrowing-costs-budget-bond-yields\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sainsbury’s tests facial recognition technology in effort to tackle shoplifting",
      "link": "https://www.theguardian.com/business/2025/sep/02/sainsburys-tests-facial-recognition-technology-in-effort-to-tackle-shoplifting",
      "pub_time_taipei": "2025-09-02T20:18:48+08:00",
      "summary": "<p>Retailer starts eight-week trial at stores in London and Bath before potentially expanding nationwide</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Sainsbury’s has begun testing the use of controversial facial recognition technology in its UK shops as part of efforts to tackle shoplifters.</p><p>The UK’s second largest supermarket chain told staff in two stores – a supermarket in Sydenham, south-east London, and convenience store in Oldfield Park in Bath– that it was starting an eight-week trial before potentially rolling out the technology nationwide.</p> <a href=\"https://www.theguardian.com/business/2025/sep/02/sainsburys-tests-facial-recognition-technology-in-effort-to-tackle-shoplifting\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Europe live: Putin claims he never opposed EU membership for Ukraine but draws line at Nato",
      "link": "https://www.theguardian.com/world/live/2025/sep/02/russia-ukraine-war-putin-china-visit-europe-live-news-updates",
      "pub_time_taipei": "2025-09-02T20:14:05+08:00",
      "summary": "<p>Russian leader, continuing China visit, is joined by Slovakia’s Robert Fico</p><p>In the meantime, we have had an update from Ukraine where <strong>a man accused of murdering a pro-western Ukrainian politician in the city of Lviv last weekend admitted that he carried out the killing but denied working for Russia</strong>, describing the attack as “personal revenge,” AFP reported.</p><p>“This is <strong>my personal revenge on the Ukrainian authorities,</strong>” the suspect told reporters in a video published by Ukrainian media outlets, denying he worked directly with Russian special services.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/02/russia-ukraine-war-putin-china-visit-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Belgium to recognise Palestinian state at UN and sanction Israel – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
      "pub_time_taipei": "2025-09-02T20:13:17+08:00",
      "summary": "<p>Foreign minister says move is not aimed at Israeli people but ‘ensuring their government respects international and humanitarian law’</p><p>At least 63,633 Palestinian people have been killed and 160,914 others injured in Israeli attacks on Gaza since 7 October 2023, the Gaza health ministry said in a statement on Tuesday.</p><p>At least 76 Palestinian people, including 12 aid seekers, were killed in the last 24 hours alone, the ministry said.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jair Bolsonaro faces justice over alleged attempt to usurp Brazilian democracy",
      "link": "https://www.theguardian.com/world/2025/sep/02/jair-bolsonaro-faces-justice-over-alleged-attempt-to-usurp-brazilian-democracy",
      "pub_time_taipei": "2025-09-02T20:12:38+08:00",
      "summary": "<p>Former president in court along with seven others accused of failed power grab after losing 2022 election</p><p>Brazil’s former president Jair Bolsonaro and seven of his allies, including four senior members of the military, have gone on trial for allegedly attempting to stage a coup – the first time in Brazilian history such powerful figures have faced justice for seeking to topple the country’s democracy.</p><p>Bolsonaro, a paratrooper turned far-right populist who governed from 2019 until 2023, stands accused of masterminding a failed power grab after losing the 2022 election to the leftist Luiz Inácio Lula da Silva.</p> <a href=\"https://www.theguardian.com/world/2025/sep/02/jair-bolsonaro-faces-justice-over-alleged-attempt-to-usurp-brazilian-democracy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We’re here to replace you,’ new Green leader Polanski tells Labour as he terms Starmer’s politics ‘despicable’ – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/02/cooper-reeves-starmer-green-party-leader-badenoch-devolution-latest-updates",
      "pub_time_taipei": "2025-09-02T19:57:26+08:00",
      "summary": "<p>Landslide winner of leadership election says migrants are backbone of UK and his party should not sell out patriotism to Farage</p><p><strong>Lamb</strong> says the Greens are “the antidote to Reform”.</p><p>That gets a big round of applause.</p><p>We’re a home for all those people across the country holding their heads in their hands as the Labour government lets them down again and again and again, whether it is switching from the aid budget or from people with disabilities and not bringing in taxes … we need.</p><p>And that is why, in reaction, a new Green wave is sweeping the country as people turn to us.</p><p>It’s already become a bit of a cliche, but we are really moving into a multi-party system, with the Greens poised to help create the next government.</p><p>And, like all the best cliches, it has the distinct advantage of also being for true.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/02/cooper-reeves-starmer-green-party-leader-badenoch-devolution-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Whisky maker Suntory’s CEO resigns amid investigation into suspected illegal supplements",
      "link": "https://www.theguardian.com/business/2025/sep/02/whisky-suntory-ceo-resigns-takeshi-niinami",
      "pub_time_taipei": "2025-09-02T19:52:37+08:00",
      "summary": "<p>Takeshi Niinami bought supplements in the belief that they were legal, says Jim Beam and Laphroaig owner</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Takeshi Niinami, one of <a href=\"https://www.theguardian.com/world/japan\">Japan</a>’s best-known business leaders, has resigned as chief executive of the drinks company Suntory after police raided his home as part of an investigation into suspected illegal supplements.</p><p>His resignation from the owner of the Jim Beam whisky brand has sent shockwaves through Japan’s corporate world, with Suntory executives attempting to reassure investors and consumers at a hastily arranged news conference.</p> <a href=\"https://www.theguardian.com/business/2025/sep/02/whisky-suntory-ceo-resigns-takeshi-niinami\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Zack Polanski wins Green party leadership election",
      "link": "https://www.theguardian.com/politics/2025/sep/02/zack-polanski-wins-green-party-leadership-election",
      "pub_time_taipei": "2025-09-02T19:41:47+08:00",
      "summary": "<p>Candidate defeats Adrian Ramsay and Ellie Chowns to lead Greens in England and Wales with vision for ‘eco-populism’ movement</p><p>Zack Polanski has won the election to lead the Green party in England and Wales, with an overwhelming mandate for the party to adopt <a href=\"https://www.theguardian.com/politics/2025/may/05/green-deputy-zack-polanski-launches-leadership-bid-with-uk-eco-populism-vision\">his vision</a> to become a mass membership “eco-populism” movement directly taking on Reform UK.</p><p>Polanski, who was the party’s deputy leader and is a Green member of the London assembly, defeated Adrian Ramsay and Ellie Chowns by 20,411 to 3,705 votes in a ballot of party members. Ramsay and Chowns, who were standing as a co-leadership team, are two of the Greens’ four MPs.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/02/zack-polanski-wins-green-party-leadership-election\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Man and dog taken down from King’s Cross clock tower after Iran protest",
      "link": "https://www.theguardian.com/uk-news/2025/sep/02/man-with-dog-iran-protest-kings-cross-station-london",
      "pub_time_taipei": "2025-09-02T19:27:32+08:00",
      "summary": "<p>Protester who unfurled banner below clock face removed by cherry picker after almost four hours</p><p>A man holding what appeared to be a pomeranian dog who climbed the clock tower at King’s Cross station in London to unfurl a banner calling for freedom for Iran has come down.</p><p>As rain began to pour, the protester packed his banner away. He spoke to mediators and was brought down by a cherry picker at 11.50am, bringing the standoff to an end after nearly four hours.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/02/man-with-dog-iran-protest-kings-cross-station-london\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Billy Bragg releases song in support of Palestine and Greta Thunberg aid flotilla",
      "link": "https://www.theguardian.com/music/2025/sep/02/billy-bragg-releases-song-hundred-year-hunger-in-support-of-palestine-and-aid-flotilla-greta-thunberg-gaza",
      "pub_time_taipei": "2025-09-02T18:40:02+08:00",
      "summary": "<p>Hundred Year Hunger – which has a chorus in Arabic – has been released by the British protest singer to coincide with a humanitarian aid flotilla heading for Gaza</p><p>Billy Bragg has released a new original song to show his support for the people of Palestine. The title of Hundred Year Hunger was inspired by a new book of the same name by E Mark Windle about the history of chronic malnutrition and deprivation in Gaza and will raise money for the Amos Trust’s Gaza Appeal.</p><p>Writing on Instagram, the British protest singer said that the song “looks at the current famine that Israel has created in Gaza through the lens of a century of enforced food insecurity and malnutrition imposed on the Palestinian people, firstly by British imperialism, then as a weapon of mass displacement by the state of Israel”.</p> <a href=\"https://www.theguardian.com/music/2025/sep/02/billy-bragg-releases-song-hundred-year-hunger-in-support-of-palestine-and-aid-flotilla-greta-thunberg-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Archaeologists in Peru discover 3D mural that could date back 4,000 years",
      "link": "https://www.theguardian.com/world/2025/sep/02/archaeologists-peru-discover-mural-4000-years",
      "pub_time_taipei": "2025-09-02T18:30:33+08:00",
      "summary": "<p>The unprecedented find has shifted archaeological understanding about the first civilisations in the Americas</p><p>Archaeologists in Peru have discovered a multicoloured three-dimensional mural that could date back 4,000 years, in an unprecedented find that has shifted archaeological understanding about the first civilisations in the Americas.</p><p>The centrepiece of the three-by-six metre mural is a stylistic depiction of a large bird of prey with outstretched wings, its head adorned with three-dimensional diamond motifs that visually align the south and north faces of the mural. It is covered with high-relief friezes and features designs painted in blue, yellow, red and black.</p> <a href=\"https://www.theguardian.com/world/2025/sep/02/archaeologists-peru-discover-mural-4000-years\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Afghanistan earthquake death toll passes 1,400 as Taliban appeal for aid",
      "link": "https://www.theguardian.com/world/2025/sep/02/afghanistan-earthquake-taliban-appeals-for-international-aid-as-rescue-teams-search-for-survivors",
      "pub_time_taipei": "2025-09-02T18:24:42+08:00",
      "summary": "<p>Rescuers search into the night for people trapped under debris of mud and stone homes in steep valleys</p><p>The Taliban have called for international aid as Afghanistan reels from an earthquake that killed more than 1,400 people and left thousands more injured.</p><p>Rescuers searched into the night on Monday for survivors after the 6.0-magnitude quake <a href=\"https://www.theguardian.com/world/2025/sep/01/afghanistan-earthquake-near-jalalabad-magnitude-6-quake-pakistan-border\">struck on Sunday</a> destroying entire villages across the country’s eastern Kunar province, which borders Pakistan.</p> <a href=\"https://www.theguardian.com/world/2025/sep/02/afghanistan-earthquake-taliban-appeals-for-international-aid-as-rescue-teams-search-for-survivors\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labor MP questions Albanese on claim ‘good people’ went to anti-immigration rallies",
      "link": "https://www.theguardian.com/australia-news/2025/sep/02/labor-unease-anthony-albanese-comments-march-for-australia-rallies-ntwnfb",
      "pub_time_taipei": "2025-09-02T18:24:01+08:00",
      "summary": "<p>‘Where do we draw the line?’ backbencher Mary Doyle said to have asked at closed-door caucus meeting</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A Labor backbencher has questioned Anthony Albanese’s suggestion that some “good people” attended Sunday’s anti-immigration rallies amid wider internal unease about the comments.</p><p>The member for the Melbourne-based seat of Aston, Mary Doyle, sought to clarify the language Albanese used to characterise the crowds at the March for Australia rallies during a closed-door caucus meeting on Tuesday morning, four Labor MPs confirmed to Guardian Australia.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/02/labor-unease-anthony-albanese-comments-march-for-australia-rallies-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Alarm after FBI arrests US army veteran for ‘conspiracy’ over protest against Ice",
      "link": "https://www.theguardian.com/us-news/2025/sep/02/fbi-arrest-us-army-veteran-ice-protest",
      "pub_time_taipei": "2025-09-02T18:00:33+08:00",
      "summary": "<p>Legal experts say charges against Afghanistan war veteran Bajun Mavalwalla II mark an escalation in the Trump administration’s crackdown on first amendment rights</p><p>The arrest of a US army veteran who protested against the Trump administration’s immigration crackdown has raised alarms among legal experts and fellow veterans familiar with his service in Afghanistan.</p><p>Bajun Mavalwalla II – a former army sergeant who survived a roadside bomb blast on a special operations mission<strong> </strong>in Afghanistan – was <a href=\"https://www.justice.gov/usao-edwa/pr/defendants-charged-assaulting-federal-law-enforcement-officers-other-offenses-during\">charged</a> in July with “conspiracy to impede or injure officers” after joining a demonstration against federal Immigration and Customs Enforcement (Ice) in Spokane, Washington.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/02/fbi-arrest-us-army-veteran-ice-protest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rising inequality is turning US into an autocratic state, billionaire warns",
      "link": "https://www.theguardian.com/business/2025/sep/02/rising-inequality-is-turning-us-into-an-autocratic-state-billionaire-warns",
      "pub_time_taipei": "2025-09-02T17:52:25+08:00",
      "summary": "<p>Ray Dalio says business leaders scared to criticise Donald Trump as he warns of debt-induced crisis for the economy</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>One of the world’s most prominent hedge fund billionaires has warned that rising inequality is turning the US into an autocratic state and condemned business leaders for failing to speak out against Donald Trump’s policies.</p><p>Ray Dalio, the founder of Bridgewater Associates, said “gaps in wealth” and a collapse in trust were driving “more extreme” policies in the US.</p> <a href=\"https://www.theguardian.com/business/2025/sep/02/rising-inequality-is-turning-us-into-an-autocratic-state-billionaire-warns\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thorpe labels alleged Camp Sovereignty attack ‘a hate crime’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb",
      "pub_time_taipei": "2025-09-02T16:18:01+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/02/jacinta-allan-not-afraid-neo-nazi-goons-after-press-conference-gatecrashed-ntwnfb\">Neo-Nazi Thomas Sewell arrested outside Melbourne court over alleged attack on Indigenous protest site</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Rallies ‘deeply unsettling for many Australians’: Mark Butler</strong></p><p><strong>Mark Butler</strong> is continuing his media rounds and has moved across to ABC News Breakfast.</p><p>I think these rallies were deeply unsettling for many Australians. For most Australians who saw from that rally, a message of division, intolerance and in some cases, violence - including violence against police.</p><p>I think what we want to do from a federal government [point of view] is just reinforce the importance of social cohesion – the importance of us being a really successful multicultural community with all of the benefits.</p><p>These new, evolving, technologies require and a new, proactive, approach to harm prevention– and we’ll work closely with industry to achieve this.</p><p>While this move won’t eliminate the problem of abusive technology in one fell swoop, alongside existing laws and our world-leading online safety reforms, it will make a real difference in protecting Australians.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Neo-Nazi Thomas Sewell arrested outside Melbourne court over alleged attack on Indigenous protest site",
      "link": "https://www.theguardian.com/australia-news/2025/sep/02/jacinta-allan-not-afraid-neo-nazi-goons-after-press-conference-gatecrashed-ntwnfb",
      "pub_time_taipei": "2025-09-02T14:52:58+08:00",
      "summary": "<p>Victoria police confirm arrest hours after the neo-Nazi confronted Victorian premier Jacinta Allan at a press conference</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Neo-Nazi Thomas Sewell has been arrested outside a Melbourne court over an alleged <a href=\"https://www.theguardian.com/australia-news/2025/sep/01/neo-nazis-attack-camp-sovereignty-indigenous-site-melbourne-anti-immigration-protest-police-injured-sydney-ntwnfb\">attack on Camp Sovereignty</a>, a sacred Aboriginal burial ground in Kings Domain and longstanding protest site on Sunday.</p><p>Victoria police have confirmed detectives from the Melbourne crime investigation unit arrested Sewell, 32, and two associates – a 23-year-old man from Mooroolbark and a 20-year-old man from Ardeer – outside Melbourne’s magistrates court about 3.20pm on Tuesday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/02/jacinta-allan-not-afraid-neo-nazi-goons-after-press-conference-gatecrashed-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bob Katter distances himself from neo-Nazi group associated with megaphone at anti-immigration protest",
      "link": "https://www.theguardian.com/australia-news/2025/sep/02/bob-katter-distances-himself-from-neo-nazi-group-associated-with-megaphone-at-anti-immigration-protest-ntwnfb",
      "pub_time_taipei": "2025-09-02T14:46:25+08:00",
      "summary": "<p>Separately, Greens call on Queensland MP to ‘apologise or resign’ for verbal altercation with Channel Nine reporter last week</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The federal MP Bob Katter has distanced himself from a neo-Nazi group that claimed ownership of a megaphone he used at a Townsville rally against mass immigration, with the veteran politician claiming he has been the victim of “bullying” in the media.</p><p>The Greens have separately called on Katter, the member for Kennedy, to “apologise or resign” over his <a href=\"https://www.theguardian.com/australia-news/2025/aug/28/bob-katter-threatens-punch-nine-journalist-over-lebanese-heritage-comment\">verbal altercation with a Channel Nine reporter</a> last week, asking the Independent Parliamentary Standards Commission to investigate his conduct.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/02/bob-katter-distances-himself-from-neo-nazi-group-associated-with-megaphone-at-anti-immigration-protest-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sudan landslide kills at least 1,000 people, rebel group says",
      "link": "https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says",
      "pub_time_taipei": "2025-09-02T14:35:21+08:00",
      "summary": "<p>Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor</p><p>More than 1,000 people were killed in a landslide in western Sudan on Sunday, according to a rebel group that controls the area.</p><p>The landslide, which followed heavy rain, destroyed a village in the Marra mountains area of western Sudan and left only one survivor, said the Sudan Liberation Movement/Army (SLM).</p> <a href=\"https://www.theguardian.com/world/2025/sep/02/sudan-landslide-kills-at-least-1000-people-rebel-group-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Twenty missing in Indonesia protests, rights group says",
      "link": "https://www.theguardian.com/world/2025/sep/02/indonesia-protests-twenty-missing-rights-group-says",
      "pub_time_taipei": "2025-09-02T12:59:50+08:00",
      "summary": "<p>Mass protests first erupted last week, prompted by anger over the perks and benefits given to lawmakers, including a controversial housing allowance</p><p>At least 20 people are missing following <a href=\"https://www.theguardian.com/world/2025/sep/02/indonesia-protests-explained-start-how-has-the-government-responded\">violent protests that have gripped cities </a>across Indonesia over the past week, a human rights group has warned.</p><p>Mass protests first erupted on 25 August, prompted by anger over the <a href=\"https://www.theguardian.com/world/2025/sep/01/indonesia-protests-president-prabowo-subianto-scraps-lawmakers-perks\">perks and benefits given to lawmakers</a>, including a controversial housing allowance. Public fury escalated further when a motorcycle taxi driver, 21-year-old Affan Kurniawan, was run over by a police vehicle at a protest site.</p> <a href=\"https://www.theguardian.com/world/2025/sep/02/indonesia-protests-twenty-missing-rights-group-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Palestinian Australian brothers allege racist abuse on Sydney train",
      "link": "https://www.theguardian.com/australia-news/2025/sep/02/palestinian-australian-brothers-shamikh-majed-badra-alleged-attack-sydney-train",
      "pub_time_taipei": "2025-09-02T11:12:19+08:00",
      "summary": "<p>Shamikh and Majed Badra said men shouted abuse at them, allegedly because Majed was wearing a keffiyeh</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Two Palestinian Australian men say they were subjected to racist abuse on a Sydney train on the same day anti-immigration marches took place across Australian cities.</p><p>Film-makers Shamikh and Majed Badra told Guardian Australia they were verbally abused on a train on Sunday afternoon, allegedly because Majed was wearing a keffiyeh.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/02/palestinian-australian-brothers-shamikh-majed-badra-alleged-attack-sydney-train\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "A North Korean defector on why Kim Jong Un has sent troops to Ukraine – podcast",
      "link": "https://www.theguardian.com/news/audio/2025/sep/02/north-korea-opportunity-ukraine-podcast",
      "pub_time_taipei": "2025-09-02T10:00:24+08:00",
      "summary": "<p>What does North Korea’s involvement in Ukraine mean for Kim Jong-un’s geopolitical ambitions? With Jean Lee</p><p>When <strong>Hyun-Seung Lee</strong> was 17 he was conscripted into the North Korean army. Meals were basic and conditions were poor.</p><p>“Most soldiers wash their clothes and bathe in streams or rivers … Soldiers must gather their own firewood from nearby mountains for heating and cooking,” he says.</p> <a href=\"https://www.theguardian.com/news/audio/2025/sep/02/north-korea-opportunity-ukraine-podcast\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hundreds of ‘Workers Over Billionaires’ Labor Day rallies take place across US",
      "link": "https://www.theguardian.com/us-news/2025/sep/01/workers-over-billionaires-labor-day-rallies",
      "pub_time_taipei": "2025-09-02T06:54:22+08:00",
      "summary": "<p>Protests denounce Trump administration’s policies and call for the protection of social safety nets</p><p>As Labor Day rallies took place across the US, the Chicago mayor Brandon Johnson sharply denounced the Trump administration’s threat to deploy federal troops to the city as part of an immigration crackdown.</p><p>“No federal troops in the city of Chicago,” <a href=\"https://www.youtube.com/watch?v=kw7f9kHeDmY\">said</a> Johnson on Monday to a gathered crowd at the “Workers over Billionaires” demonstration in Chicago’s West Loop neighborhood.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/01/workers-over-billionaires-labor-day-rallies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nestlé sacks CEO over ‘undisclosed romantic relationship’",
      "link": "https://www.theguardian.com/business/2025/sep/01/nestle-fires-ceo-after-investigation-into-undisclosed-romantic-relationship",
      "pub_time_taipei": "2025-09-02T02:42:34+08:00",
      "summary": "<p>Swiss multinational finds Laurent Freixe breached code of conduct as it names Philipp Navratil as his replacement</p><p>Nestlé has dismissed its chief executive, Laurent Freixe, after an investigation into an “undisclosed romantic relationship” with a subordinate that was found to have breached its code of business conduct.</p><p>The Swiss-headquartered multinational named Philipp Navratil as his replacement.</p> <a href=\"https://www.theguardian.com/business/2025/sep/01/nestle-fires-ceo-after-investigation-into-undisclosed-romantic-relationship\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Guatemala says it is willing to receive hundreds of deported children from US",
      "link": "https://www.theguardian.com/world/2025/sep/01/guatemala-to-receive-deported-children-from-us",
      "pub_time_taipei": "2025-09-02T01:36:33+08:00",
      "summary": "<p>Announcement comes a day after a US federal judge halted the deportation of 10 unaccompanied Guatemalan minors</p><p>Guatemala is ready and willing to receive about 150 unaccompanied children of all ages each week from the United States, the country’s president has said, a day after a US federal judge halted the deportation of 10 Guatemalan children.</p><p>Those children had already boarded a plane when a court responded to an emergency appeal on Sunday. <a href=\"https://www.theguardian.com/us-news/2025/aug/31/judge-blocks-deportation-guatemalan-children\">They were later returned to the custody of the Office of Refugee Resettlement.</a></p> <a href=\"https://www.theguardian.com/world/2025/sep/01/guatemala-to-receive-deported-children-from-us\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Leaked ‘Gaza Riviera’ plan dismissed as ‘insane’ attempt to cover ethnic cleansing",
      "link": "https://www.theguardian.com/world/2025/sep/01/leaked-gaza-riviera-plan-dismissed-as-insane-attempt-to-cover-ethnic-cleansing",
      "pub_time_taipei": "2025-09-02T01:08:16+08:00",
      "summary": "<p>Prospectus proposes forced displacement of entire population and puts territory into US trusteeship</p><p>A plan circulating in the White House to develop the “Gaza Riviera” as a string of high-tech megacities has been dismissed as an “insane” attempt to provide cover for the large-scale ethnic cleansing of the Palestinian territory’s population.</p><p>On Sunday the Washington Post published a leaked prospectus for the plan, which would involve the forced displacement of Gaza’s entire population of 2 million people and put the territory into a US trusteeship for at least a decade.</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/leaked-gaza-riviera-plan-dismissed-as-insane-attempt-to-cover-ethnic-cleansing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘There is death in every home’, families say, after at least 800 killed in Afghanistan earthquake – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports",
      "pub_time_taipei": "2025-09-02T00:55:07+08:00",
      "summary": "<p>Several villages in Kunar province ‘completely destroyed’, says public health ministry, as rescue operations take place. This live blog is closed</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/01/afghanistan-earthquake-near-jalalabad-magnitude-6-quake-pakistan-border\">Magnitude 6 earthquake hits eastern Afghanistan</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/sep/01/how-have-you-been-affected-by-the-earthquake-in-afghanistan\">How have you been affected by the earthquake?</a></p></li></ul><p>One resident in Afghanistan’s <strong>Nurgal district</strong>, one of the worst-affected areas in Kunar, said almost the entire village had collapsed under the force of the earthquake. <br /><br />\n “Children are under the rubble. The elderly are under the rubble. Young people are under the rubble,” the villager, who did not give his name, told the Associated Press.</p><p>“We need help here,” he pleaded. “We need people to come here and join us. Let us pull out the people who are buried. There is no one who can come and remove dead bodies from under the rubble.”</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Coalition of willing’ to discuss security guarantees for Ukraine in meeting on Thursday – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
      "pub_time_taipei": "2025-09-02T00:10:54+08:00",
      "summary": "<p>Meeting, co-chaired by France’s Emmanuel Macron and UK’s Keir Starmer, will focus on Russia’s refusal to end war. This live blog is closed</p><p>EU transport spokesperson <strong>Anna-Kaisa Itkonen</strong> also offered a bit more detail on the issue of GPS jamming and its impact on operations.</p><p>She said:</p><p><em>“Generally, <strong>we have been seeing a quite a lot of such jamming and spoofing activities, notably in the eastern flank of Europe.</strong></em></p><p><em><strong>Europe is</strong> the most concerned region in the or <strong>most affected region globally</strong>, on this.</em></p><p><em>“We are, of course, aware and used to somehow to the threats and intimidations that are [a] regular component of Russia’s hostile behaviour.</em></p><p><em>Of course, <strong>this will only reinforce even further our unshakable commitment to ramp up defence capabilities and support for Ukraine.</strong>”</em></p><p><em>“This incident actually underlines the urgency of the mission that the President is carrying out in the frontline member states.”</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Climate change kills, Spanish PM tells deniers at launch of plan to tackle crisis",
      "link": "https://www.theguardian.com/world/2025/sep/01/spain-pm-pedro-sanchez-plan-tackle-climate-crisis",
      "pub_time_taipei": "2025-09-01T23:07:23+08:00",
      "summary": "<p>Pedro Sánchez says country’s deadly August wildfires show society needs to mobilise and take immediate action</p><p>Spain’s prime minister, Pedro Sánchez, has announced a 10-point plan to prepare the country for the climate emergency, warning: “If we don’t want to bequeath our children a Spain that’s grey from fire and flames, or a Spain that’s brown from floods, then we need a Spain that’s greener.”</p><p>Sánchez said <a href=\"https://www.theguardian.com/world/2025/aug/19/wildfires-spain-climate-crises-pedro-sanchez\">August’s heatwave-fuelled wildfires</a> – which <a href=\"https://www.theguardian.com/world/2025/aug/18/wildfires-spain-portugal-heat-extreme-temperatures-southern-europe\">killed four people</a>, burned through an area six times the size of Ibiza and required “the biggest human and technical deployment” ever seen in Spain – showed that immediate action must be taken to mitigate the effects of the climate crisis.</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/spain-pm-pedro-sanchez-plan-tackle-climate-crisis\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Berlin police investigate after officer punches Irish activist at protest",
      "link": "https://www.theguardian.com/world/2025/sep/01/berlin-police-investigate-after-irish-activist-struck-by-officer-at-protest",
      "pub_time_taipei": "2025-09-01T22:57:39+08:00",
      "summary": "<p>Ireland’s foreign office conveys ‘concern’ about incident that was captured on videos posted on social media</p><p>Berlin police have opened an internal investigation after videos emerged showing an Irish activist at a pro-Palestinian demonstration being punched in the face twice by an officer, drawing protest from Ireland’s foreign office.</p><p>Footage posted on social media showed the activist, Kitty O’Brien, being struck by a male police officer and dragged away, their face bloodied, from the rally on Thursday in the Mitte district of the German capital.</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/berlin-police-investigate-after-irish-activist-struck-by-officer-at-protest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘The walls collapsed around me’: Afghans describe quake devastation",
      "link": "https://www.theguardian.com/world/2025/sep/01/afghans-describe-quake-devastation",
      "pub_time_taipei": "2025-09-01T22:25:57+08:00",
      "summary": "<p>People tell of losing children and other relatives and of digging their way out of the rubble after the disaster</p><p>It was almost midnight when Hameed Jan was jolted awake in his bed by a deep rumble. Powerful tremors were shaking his small house in Piran village, in Afghanistan’s Kunar region, and he could see the walls beginning to crack.</p><p>“I jumped out of bed and rushed to where my children and parents were sleeping,” Jan said. “I managed to rescue two of my children and brought them outside to safety. I went back inside to save my younger siblings, but as I did the roof and walls collapsed around me.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/afghans-describe-quake-devastation\">Continue reading...</a>"
    }
  ]
}