{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-09T20:40:04.198436+08:00",
  "window_end_taipei": "2025-10-10T20:40:04.198436+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Palestinians begin journey to Gaza’s north as Israel says ceasefire now in effect – live",
      "link": "https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news",
      "pub_time_taipei": "2025-10-10T20:29:22+08:00",
      "summary": "<p>Thousands of Palestinians travel back to the north of the territory after IDF forces retreated to deployment lines</p><p>Israeli military has said that the ceasefire agreement has come into effect, as troops have now retreated to the deployment lines agreed upon.</p><p>In a statement released on Telegram, the IDF says troops “began positioning themselves along the updated deployment lines” from midday local time.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Carmakers brace for big payouts over loans scandal after FCA consultation",
      "link": "https://www.theguardian.com/business/2025/oct/10/carmakers-brace-for-big-payouts-over-loans-scandal-after-fca-consultation",
      "pub_time_taipei": "2025-10-10T20:28:03+08:00",
      "summary": "<p>Financial Conduct Authority proposes manufacturers’ finance arms foot nearly half of £11bn compensation bill</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/10/uk-wage-growth-slows-worker-demand-argentina-rescue-bessent-stock-markets-business-live-news\">Business live – latest updates</a></p></li></ul><p>Carmakers are braced to make big payouts to victims of the motor finance scandal, as the City regulator said firms ranging from Ford to Hyundai could end up footing nearly half of an £11bn compensation bill.</p><p>The Financial Conduct Authority (FCA) has estimated that “captive lenders” – the financial arms of carmakers that issue loans to drivers – will have to cover 47% of the redress to borrowers. That would take their bill to roughly £5.2bn.</p> <a href=\"https://www.theguardian.com/business/2025/oct/10/carmakers-brace-for-big-payouts-over-loans-scandal-after-fca-consultation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Letitia James accuses Donald Trump of ‘weaponizing’ US justice system after her indictment – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
      "pub_time_taipei": "2025-10-10T20:24:30+08:00",
      "summary": "<p>Prosecutor who led civil fraud investigation against Trump in 2023 says charges against her are baseless</p><p><strong>We’ll hear from Donald Trump at 10am E</strong><strong>T today, when he heads to Walter Reed </strong><strong>medical </strong><strong>center for his “semi-annual” physical exam.</strong></p><p>We’ll be keeping an ear out for any reaction he has to the indictment of <strong>Letitia James</strong>, his longtime political adversary.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Moody Blues singer and bassist John Lodge dies aged 82",
      "link": "https://www.theguardian.com/music/2025/oct/10/moody-blues-singer-and-bassist-john-lodge-dies-aged-82",
      "pub_time_taipei": "2025-10-10T20:22:49+08:00",
      "summary": "<p>Musician died peacefully surrounded by sounds of Everly Brothers and Buddy Holly, say family</p><p>The Moody Blues singer and bass guitarist, John Lodge, has died at the age of 82, his family have said.</p><p>A statement read: “It is with the deepest sadness that we have to announce that John Lodge, our darling husband, father, grandfather, father-in-law and brother, has been suddenly and unexpectedly taken from us.</p> <a href=\"https://www.theguardian.com/music/2025/oct/10/moody-blues-singer-and-bassist-john-lodge-dies-aged-82\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Yvette Cooper defends children as young as 13 needing digital ID – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/10/uk-politics-latest-live-news-labour-reform-plaid-cymru-snp-conservatives",
      "pub_time_taipei": "2025-10-10T20:19:52+08:00",
      "summary": "<p>Foreign secretary says it is ‘right way forward’ for young teenagers to have digital ID</p><p>However, it wasn’t such a great night for the Lib Dems (or Labour or the Conservatives either) in the election for the <strong>Skelton East ward</strong> for <strong>Redcar and Cleveland council</strong>, where <strong>Reform UK</strong> set a new vote record with 65.3%, significantly ahead of Labour at 19.2% of the vote and the Conservative party (13.9%). The Lib Dems trailed, with only 1.5% of the vote.</p><p>Reform’s biggest byelection win means they’ve gained a seat from the Tories.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/10/uk-politics-latest-live-news-labour-reform-plaid-cymru-snp-conservatives\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "BBC airing false claim about Euan Blair blamed on young producers ‘marinated in social media’",
      "link": "https://www.theguardian.com/tv-and-radio/2025/oct/10/bbc-false-claim-euan-blair-digital-id-young-producers-marinated-social-media",
      "pub_time_taipei": "2025-10-10T20:18:03+08:00",
      "summary": "<p>Broadcaster apologised after Have I Got News For You falsely said ex-PM’s son’s firm had won digital ID contract</p><p>The arrival of a generation of young producers “marinated in social media” led to a false claim about Euan Blair being broadcast on Have I Got News For You, the production chief behind the show has said.</p><p>The first in a new series of the BBC show featured an incorrect claim that the company run by the son of the former prime minister Tony Blair had been given the contract to <a href=\"https://www.theguardian.com/politics/2025/oct/01/keir-starmer-labour-collapse-public-support-digital-id-cards\">run the government’s new digital ID system</a>.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/oct/10/bbc-false-claim-euan-blair-digital-id-young-producers-marinated-social-media\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Palestinians displaced to southern Gaza begin journey home as ceasefire comes into effect",
      "link": "https://www.theguardian.com/world/2025/oct/10/palestinians-displaced-gaza-home-ceasefire-israel-hamas",
      "pub_time_taipei": "2025-10-10T20:15:24+08:00",
      "summary": "<p>Thousands walk north along coastal road after Israel-Hamas agreement puts stop to fighting for first time in six months</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news\">Gaza ceasefire deal – live updates</a></p></li></ul><p>Thousands of displaced Palestinians have begun to return home from southern Gaza after a ceasefire came into effect and Israeli troops withdrew to an agreed-upon re-deployment line – the first time that fighting has stopped in the devastated territory since March.</p><p>The Israeli military said the ceasefire agreement – which was approved by the Israeli cabinet on Thursday night and begins <a href=\"https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-and-hamas\">the first phase of a US-drafted plan</a> to end the war in Gaza – had been activated at noon local time (0900 GMT) on Friday. Under the terms of the plan Hamas is expected to release the 20 living Israeli hostages within 72 hours, after which Israel will release 250 Palestinians serving long terms in Israeli prisons, as well as 1,700 others detained in Gaza during the war.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/palestinians-displaced-gaza-home-ceasefire-israel-hamas\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: Hamas and Israel implement ceasefire",
      "link": "https://www.theguardian.com/us-news/2025/oct/10/first-thing-hamas-and-israel-implement-ceasefire",
      "pub_time_taipei": "2025-10-10T20:01:10+08:00",
      "summary": "<p>Israeli troops begin pulling back from parts of Gaza. Plus, stories from survivors who were trapped on Everest</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>Thousands of displaced Palestinians headed back towards their abandoned homes on Friday after a ceasefire between Israel and Hamas came into effect and Israeli troops began pulling back from parts of Gaza.</p><p><strong>How was the ceasefire deal done? </strong>The turning point was a meeting in New York on the sidelines of the UN general assembly chaired by Donald Trump, soon after his baroque speech to the gathering. Trump described the sidelines conversation as his most important meeting at the UN. In the encounter organised by the United Arab Emirates, he set out for the first time his then 20-point plan for peace in front of a group of Arab and Muslim states that could form the backbone of any stabilisation force that entered Gaza in the event of a ceasefire. <a href=\"https://www.theguardian.com/world/2025/oct/09/how-the-gaza-ceasefire-deal-was-done-donald-trump\">Read more</a>.</p><p><strong><a href=\"https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news\">Follow our live coverage here</a>.</strong></p><p><strong>What did the committee say about Trump’s lobbying effort to win the prize?</strong> Nobel committee chair, Jørgen Watne Frydnes, the leader of the Norwegian Nobel Committee said the committee receives thousands of letters every year and makes its decision in a room “filled with both courage and integrity”.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/10/first-thing-hamas-and-israel-implement-ceasefire\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The £1m man: why did Boris Johnson take his donor to Ukraine?",
      "link": "https://www.theguardian.com/politics/2025/oct/10/the-1m-man-why-did-boris-johnson-take-his-donor-to-ukraine",
      "pub_time_taipei": "2025-10-10T20:00:53+08:00",
      "summary": "<p>Exclusive: Leaked files offer a glimpse of the ex-prime minister’s relationship with Christopher Harborne</p><p>As he boarded the night train to Ukraine, Boris Johnson had the usual entourage of aides and bodyguards – plus the man who had given him £1m.</p><p>Less than a year had passed since Johnson accepted what is thought to be the largest donation ever to an individual MP. It was from Christopher Harborne, one of the UK’s biggest and most private political donors.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/10/the-1m-man-why-did-boris-johnson-take-his-donor-to-ukraine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US farmers caught in Trump-China trade war – who’ll buy the soybeans?",
      "link": "https://www.theguardian.com/us-news/2025/oct/10/trump-china-trade-war-soybeans",
      "pub_time_taipei": "2025-10-10T20:00:52+08:00",
      "summary": "<p>Tariffs have caused a Chinese exit from the soybean market – and midwestern farmers are waiting on a solution</p><p>At the Purfeerst farm in southern Minnesota, the soybean harvest just wrapped up for the season. The silver grain bins are full of about 100,000 bushels of soybeans, which grab about $10 a piece.</p><p>This year, though, the fate of the soybeans, and the people whose livelihoods depend on selling them, is up in the air: America’s soybean farmers are stuck in the middle of a trade war between the US and China, the biggest purchaser of soybean exports, used to feed China’s pigs.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/10/trump-china-trade-war-soybeans\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Very significant’ Jack Kerouac story discovered after mafia boss auction",
      "link": "https://www.theguardian.com/books/2025/oct/10/very-significant-jack-kerouac-story-discovered-after-mafia-boss-auction",
      "pub_time_taipei": "2025-10-10T20:00:03+08:00",
      "summary": "<p>Exclusive: Two-page 1957 manuscript signed by author linked to his classic of beat literature, On the Road</p><p>A “very significant” unpublished story by Jack Kerouac described as “a lost chapter of the On the Road saga” has been discovered after languishing in the files of an assassinated Mafia crime boss for at least 40 years.</p><p>The two-page typewritten manuscript signed by Kerouac in green ink is titled The Holy, Beat, and Crazy Next Thing and is dated 15 April 1957, five months before his classic of beat literature, On the Road, was published.</p> <a href=\"https://www.theguardian.com/books/2025/oct/10/very-significant-jack-kerouac-story-discovered-after-mafia-boss-auction\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "María Corina Machado, Venezuelan opposition leader, wins Nobel Peace Prize",
      "link": "https://www.washingtonpost.com/world/2025/10/10/maria-machado-nobel-peace-prize-venezuela/",
      "pub_time_taipei": "2025-10-10T19:59:55+08:00",
      "summary": "The prize honored Machado, who is in hiding, for keeping “the flame of democracy burning” but the White House accused the Nobel jury of “placing politics over peace.”"
    },
    {
      "source": "華盛頓郵報",
      "title": "Powerful 7.4-magnitude earthquake rocks southern Philippines",
      "link": "https://www.washingtonpost.com/world/2025/10/10/powerful-quake-hits-philippines-davao/",
      "pub_time_taipei": "2025-10-10T19:03:42+08:00",
      "summary": "The quake, centered off the coast of Mindanao, struck at 9:43 a.m. local time but the extent of the damage was not immediately clear."
    },
    {
      "source": "衛報",
      "title": "US professors facing threats, firings and harassment over Charlie Kirk posts",
      "link": "https://www.theguardian.com/us-news/2025/oct/10/academics-professors-charlie-kirk",
      "pub_time_taipei": "2025-10-10T19:00:52+08:00",
      "summary": "<p>As many as 40 academics have been dismissed in aftermath of shooting, allegedly without due process</p><p>A “climate of fear” is still shrouding college campuses across the US, academics have warned, after a string of professors were fired or punished for their comments after Charlie Kirk’s assassination.</p><p>As many as 40 academics have been dismissed in recent weeks, according to the American Association of University Professors. Many were targeted by rightwing campaigners, who seized on remarks they wrote or shared, and pressured their employers to take action.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/10/academics-professors-charlie-kirk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Power returns after Kyiv plunged into darkness by ‘massive’ Russian attack on Ukraine energy sector – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/10/kyiv-ukraine-russia-france-europe-latest-live-news-updates",
      "pub_time_taipei": "2025-10-10T18:59:03+08:00",
      "summary": "<p>Ukrainian president Volodymyr Zelenskyy said Russia used over 450 drones and 30 missiles in a country-wide attack. This live blog is now closed</p><p><strong>Power has been restored to 270,000 consumers in Kyiv after Russian overnight attacks knocked it out, Ukraine’s energy minister Svitlana Hrynchuk wrote on Facebook on Friday.</strong></p><p>Kyiv residents heard blasts throughout the night and many woke up without power after a vast overnight air attack which targeted Ukraine’s energy system, Reuters reports.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/10/kyiv-ukraine-russia-france-europe-latest-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Massive’ Russian attack on Ukraine capital causes widespread blackout",
      "link": "https://www.theguardian.com/world/2025/oct/10/russian-attack-kyiv-ukraine-capital-blackouts-sets-high-rise-alight",
      "pub_time_taipei": "2025-10-10T18:01:56+08:00",
      "summary": "<p>At least 20 injured after hundreds of drones and dozens of missiles target energy infrastructure in Kyiv</p><p>A “massive” Russian drone and missile strike has wounded at least 20 people in Kyiv, plunging Ukraine’s capital into darkness early on Friday in what Volodomyr Zelenskyy condemned as a “cynical and calculated” attack.</p><p>Kyiv’s mayor, Vitali Klitschko, said Russian forces had targeted “critical infrastructure”, and fragments from downed drones struck several parts of the city. Images posted online showed firefighters working to tackle burning blocks of flats.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/russian-attack-kyiv-ukraine-capital-blackouts-sets-high-rise-alight\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nobel peace prize 2025: María Corina Machado wins for work promoting democratic rights in Venezuela – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/10/nobel-peace-prize-2025-live-latest-news-updates",
      "pub_time_taipei": "2025-10-10T17:58:39+08:00",
      "summary": "<p>US president had been conducting campaign to influence prize committee. This live blog is closed</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/10/venezuelan-politician-maria-corina-machado-wins-nobel-peace-prize\">Full story: María Corina Machado wins Nobel peace prize</a></p></li></ul><p>Venezuela’s most influential opposition leader receives the award.</p><p>Here it comes. Chair of the Norwegian Nobel Committee, <strong>Jørgen Watne Frydnes</strong>, is walking up to the podium.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/10/nobel-peace-prize-2025-live-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "DRC says EU’s minerals deal with Rwanda is ‘obvious double standard’",
      "link": "https://www.theguardian.com/world/2025/oct/10/drc-calls-eu-minerals-deal-rwanda-obvious-double-standard",
      "pub_time_taipei": "2025-10-10T17:54:03+08:00",
      "summary": "<p>Brussels urged to impose stronger sanctions against Rwanda, as it has in response to Russia for its war in Ukraine</p><p>The Democratic Republic of the Congo has accused the EU of “an obvious double standard” for maintaining a minerals deal with Rwanda to supply Europe’s hi-tech industries when it deployed a far-wider sanctions regime in response to the war in Ukraine.</p><p>Thérèse Kayikwamba Wagner, the DRC foreign minister, urged the EU to levy much stronger sanctions against Rwanda, which has fuelled the conflict in eastern DRC, describing the bloc’s response to violations of DRC territory as “very timid”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/drc-calls-eu-minerals-deal-rwanda-obvious-double-standard\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Former British diplomat challenges Palestine Action ban in Scotland",
      "link": "https://www.theguardian.com/uk-news/2025/oct/10/former-british-diplomat-craig-murray-challenges-palestine-action-ban-scotland",
      "pub_time_taipei": "2025-10-10T17:30:50+08:00",
      "summary": "<p>Craig Murray argues proscription order contravenes rights to freedom of speech under European convention of human rights</p><p>A former British diplomat has served a petition challenging the ban on Palestine Action in Scotland.</p><p>The case, brought by Craig Murray, is separate to the judicial review of the proscription decision <a href=\"https://www.theguardian.com/uk-news/2025/jul/30/palestine-action-co-founder-wins-permission-to-challenge-ban\">being brought at the high court in London</a> and could lead to a situation whereby the ban is ruled unlawful in Scotland but not in England and Wales.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/10/former-british-diplomat-craig-murray-challenges-palestine-action-ban-scotland\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Venezuelan politician María Corina Machado wins Nobel peace prize",
      "link": "https://www.theguardian.com/world/2025/oct/10/venezuelan-politician-maria-corina-machado-wins-nobel-peace-prize",
      "pub_time_taipei": "2025-10-10T17:24:08+08:00",
      "summary": "<p>Opponent of Maduro regime receives award and praise for keeping ‘flame of democracy burning’</p><p>The Venezuelan opposition politician María Corina Machado has won the Nobel peace prize for her dogged struggle to rescue the South American country from its fate as “a brutal, authoritarian state”.</p><p>Machado, 58, a conservative often described as Venezuela’s Iron Lady, has spent the last year living in hiding after her political movement was widely believed to have <a href=\"https://www.theguardian.com/world/article/2024/sep/09/edmundo-gonzalez-exile-spain-venezuela-opposition-nicolas-maduro\">beaten the country’s president, Nicolás Maduro</a>, in the July 2024 presidential election.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/venezuelan-politician-maria-corina-machado-wins-nobel-peace-prize\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russian attacks plunge Ukrainian cities into cold and darkness",
      "link": "https://www.washingtonpost.com/world/2025/10/09/ukraine-russia-gas-infrastructure-bombing-winter/",
      "pub_time_taipei": "2025-10-10T16:33:31+08:00",
      "summary": "Russia shifted its focus from destroying power plants to the natural gas facilities used to heat homes during the cold winter months."
    },
    {
      "source": "衛報",
      "title": "Rebel Wilson using US court proceedings to ‘harass and intimidate’ star of The Deb, court told",
      "link": "https://www.theguardian.com/film/2025/oct/10/rebel-wilson-using-us-court-proceedings-to-harass-and-intimidate-star-of-the-deb-court-told-ntwnfb",
      "pub_time_taipei": "2025-10-10T16:24:02+08:00",
      "summary": "<p><strong>Exclusive:</strong> The film’s producers are seeking an injunction in a Sydney court to stop Wilson pursuing a countersuit in California</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Australian actor Rebel Wilson has been accused of using US court proceedings to harass and intimidate the lead actor in her directorial debut, The Deb.</p><p>The New South Wales supreme court heard on Friday that earlier this month the star of The Deb,<strong> </strong>Charlotte MacInnes, was served a deposition in the UK, demanding she appear before a hearing in California later this month.</p> <a href=\"https://www.theguardian.com/film/2025/oct/10/rebel-wilson-using-us-court-proceedings-to-harass-and-intimidate-star-of-the-deb-court-told-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: South-east China swelters in summer-like heat",
      "link": "https://www.theguardian.com/environment/2025/oct/10/weather-tracker-south-east-china-swelters-summer-like-heat",
      "pub_time_taipei": "2025-10-10T16:12:26+08:00",
      "summary": "<p>Inland areas have neared 40C, while in northern China a cold air mass clashed with warmth to produce heavy rain</p><p>While northern parts of China felt their first autumnal chill under persistent heavy rain this week, large areas farther south have continued to swelter in summer-like heat. In south-east China, temperatures have climbed steadily since late September under the influence of higher than average pressure to the north-east, reaching the mid-to-high 30Cs during a period when conditions would normally be cooling from about 30C to the mid-20s. Inland areas have neared 40C (104F), with Xiushui, in Jiangxi province, recording 38.9C on Wednesday, about 13C above average for early October.</p><p>Overnight warmth has also persisted. In Hong Kong, further heat on Wednesday brought October’s tally of “very hot days” – defined by temperatures remaining above 28C throughout the day – to four, the highest ever recorded for the month. Models suggest the unusual heat across south-east China will last for another eight to 10 days, before colder air pushes in from the north.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/10/weather-tracker-south-east-china-swelters-summer-like-heat\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Independent Sophie Scamps quits parliamentary sports club after Pocock ban – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb",
      "pub_time_taipei": "2025-10-10T15:46:28+08:00",
      "summary": "<p>This blog is now closed.</p><p><strong>We’re still talking about superannuation tax concessions?</strong></p><p>We can’t seem to stop hearing about the government’s plan to increase tax on superannuation balances over $3m … yes that’s right, we’re still talking about it.</p><p>There have been some conversations with the prime minister’s office … It’s probably not unusual for that to occur from time to time.</p><p>This is too often what happens when you get a government that has such a large majority that they don’t take people along on key policy issues.</p><p>People have been planning for decades for how they save for retirement and structure those investments. So any changes that are made to super need to be considered and provide people looking to retire with plenty of warning.</p><p>I don’t think there are high risks to this first phase. The ceasefire, the release of the living hostages, the rapid identification and turnover of those bodies that can be found, and the introduction of humanitarian assistance, coupled with that, first of all steps, the Israeli withdrawal to the agreed initial line. I think that will happen. The problematic and hard to negotiate issues are what follows. This phase one is, if you will, the opening of the door.</p><p>An armed Hamas is a Hamas which will retain the ability to assert, albeit clandestinely, effective governance. Disarmament must be in parallel to the process of shifting Hamas out of that effective governance role. And so the question that has to be raised here is what pressures can be brought to bear upon Hamas in order to affect that goal.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Highly potent synthetic opioids found in teddy bear-shaped pills linked to a death in Queensland",
      "link": "https://www.theguardian.com/australia-news/2025/oct/10/highly-potent-synthetic-opioids-found-in-teddy-bear-shaped-pills-linked-to-a-death-in-queensland",
      "pub_time_taipei": "2025-10-10T15:41:10+08:00",
      "summary": "<p>Public health warning issued after drugs known as nitazenes detected amid move to ban pill testing</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Teddy bear-shaped pills laced with synthetic opioids have been linked to a death in Queensland, triggering a public health warning about a group of <a href=\"https://www.theguardian.com/society/2025/mar/19/nitazenes-detected-australian-wastewater-synthetic-opioid-ntwnfb\">highly potent illicit drugs called nitazenes</a>.</p><p>N-pyrrolidino-protonitazene and protonitazene were detected in toxicology and samples taken from pale yellow pills marked with the letter “Y” in the state’s south-east.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/10/highly-potent-synthetic-opioids-found-in-teddy-bear-shaped-pills-linked-to-a-death-in-queensland\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "JP Morgan staff told they must share biometric data to access headquarters",
      "link": "https://www.theguardian.com/business/2025/oct/10/jp-morgan-staff-told-they-must-share-biometric-data-to-access-headquarters",
      "pub_time_taipei": "2025-10-10T15:23:34+08:00",
      "summary": "<p>Investment bank had previously planned for such information from New York workers to be voluntary</p><p>JP Morgan Chase has told staff moving into its new headquarters in New York that they must share their biometric data to access the multibillion-dollar building.</p><p>The investment bank had previously planned for the registering of biometric data by employees at its new Manhattan skyscraper to be voluntary.</p> <a href=\"https://www.theguardian.com/business/2025/oct/10/jp-morgan-staff-told-they-must-share-biometric-data-to-access-headquarters\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australian woman on pro-Palestinian aid flotilla will be ‘indefinitely detained’ by Israel unless she signs waiver",
      "link": "https://www.theguardian.com/world/2025/oct/10/australian-woman-on-pro-palestinian-aid-flotilla-will-be-indefinitely-detained-by-israel-unless-she-signs-waiver",
      "pub_time_taipei": "2025-10-10T14:58:52+08:00",
      "summary": "<p>Madeleine Habib, captain of the Conscience vessel, was arrested by Israeli forces on 8 October and detained in Israel’s Ketziot prison</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A Tasmanian woman aboard a second pro-Palestinian aid flotilla <a href=\"https://www.theguardian.com/world/2025/oct/08/israel-intercepts-another-gaza-aid-flotilla-amid-criticism-over-treatment-of-activists\">intercepted by Israel</a> will be “indefinitely detained” in an Israeli prison unless she agrees to sign a waiver.</p><p>Madeleine Habib, who captained the Conscience vessel, was arrested by Israeli forces on 8 October and detained in Israel’s Ketziot prison for “illegally seeking to break Israel’s naval blockade on Gaza”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/australian-woman-on-pro-palestinian-aid-flotilla-will-be-indefinitely-detained-by-israel-unless-she-signs-waiver\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Peru lawmakers vote to oust president Dina Boluarte over crime crisis",
      "link": "https://www.theguardian.com/world/2025/oct/10/peru-congress-vote-oust-president-dina-boluarte-gang-violence",
      "pub_time_taipei": "2025-10-10T14:51:03+08:00",
      "summary": "<p>Congress leader José Jerí sworn in as interim president as majority of lawmakers initiate impeachment against Boluarte</p><p>Lawmakers in Peru have voted to remove the president, Dina Boluarte, whose term has been marked by protests and accusations of failing to stem crime.</p><p>Boluarte refused to appear before Congress on Friday for an overnight hearing after a majority of lawmakers, including some once loyal to her, voted to initiate impeachment proceedings.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/peru-congress-vote-oust-president-dina-boluarte-gang-violence\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Queensland to run its coal plants up to a decade longer than previously planned",
      "link": "https://www.theguardian.com/australia-news/2025/oct/10/queensland-coal-plants-decade-longer-than-planned",
      "pub_time_taipei": "2025-10-10T13:57:08+08:00",
      "summary": "<p>Chris Bowen calls move ‘disappointing’ as energy expert says government ‘has delivered a cul de sac not a roadmap’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li></ul><p>The Queensland government will keep its state-owned coal plants running for up to a decade longer than previous plans, in a move that will put pressure on national climate targets.</p><p>The Queensland treasurer and energy minister, David Janetzki, revealed an “energy roadmap” on Friday and said some state-owned coal assets would run until at least 2046, “meaning coal will be part of the state’s generation mix for decades”.</p><p><strong><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=copyembed\">Sign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/10/queensland-coal-plants-decade-longer-than-planned\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tsunami threat lifted after Philippine earthquake – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/10/philippines-earthquake-tsunami-warning-issued-after-7-quake-hits-mindanao",
      "pub_time_taipei": "2025-10-10T13:45:58+08:00",
      "summary": "<p>Reports of panic and damaged buildings as strong quake hits Philippines</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/10/tsunami-warning-philippines-indonesia-earthquake-mindanao\">Full report: prayers as strong shaking hits the Philippines</a></p></li></ul><p><strong>Philippines president directs agencies to aid evacuations and provide help to ‘everyone who needs it’</strong></p><p><strong>Ferdinand Marcos</strong>, the president of the Philippines, said the government was working “round the clock” to ensure help reaches “everyone who needs it”.</p><p>We are now assessing the situation on the ground and ensuring that everyone is safe. … Search, rescue, and relief operations are already being prepared and will be deployed as soon as it is safe to do so.</p><p>Let us continue to look out for one another and pray for the safety of all our countrymen.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/10/philippines-earthquake-tsunami-warning-issued-after-7-quake-hits-mindanao\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Philippines rocked by damaging 7.6-magnitude earthquake",
      "link": "https://www.theguardian.com/world/2025/oct/10/tsunami-warning-philippines-indonesia-earthquake-mindanao",
      "pub_time_taipei": "2025-10-10T12:25:19+08:00",
      "summary": "<p>Philippine president Ferdinand Marcos Jr. said authorities were assessing the situation on the ground and search and rescue efforts were being prepared</p><p>The southern Philippines was rocked by a powerful 7.6-magnitude earthquake that struck in the region of Mindanao on Friday, initially triggering a tsunami warning that was later lifted.</p><p>The Philippine seismology agency issued a tsunami warning, saying hazardous tsunami waves were possible for coasts located within 300km (186 miles) of the earthquake’s epicentre. Hours later the Pacific Tsunami Warning Center said the tsunami threat had passed.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/tsunami-warning-philippines-indonesia-earthquake-mindanao\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How much credit does Trump deserve for Gaza ‘peace’ deal?",
      "link": "https://www.washingtonpost.com/world/2025/10/10/trump-nobel-peace-prize-ceasefire-gaza/",
      "pub_time_taipei": "2025-10-10T12:00:00+08:00",
      "summary": "What happens in the coming weeks will be much more defining of Trump’s legacy than the victory lap he’ll take this weekend."
    },
    {
      "source": "華盛頓郵報",
      "title": "What to know about the Gaza ceasefire deal",
      "link": "https://www.washingtonpost.com/world/2025/10/08/gaza-peace-talks-trump-plan-ceasefire-israel-hamas-egypt/",
      "pub_time_taipei": "2025-10-10T10:40:58+08:00",
      "summary": "Trump’s framework to end the war in Gaza is the basis for an initial agreement between Israel and Hamas."
    },
    {
      "source": "衛報",
      "title": "Israel’s government approves hostage and ceasefire deal – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
      "pub_time_taipei": "2025-10-10T08:42:45+08:00",
      "summary": "<p>This live blog is now closed, you can read our latest report <a href=\"https://www.theguardian.com/world/2025/oct/09/joy-and-anxiety-as-hamas-and-israel-prepare-to-implement-ceasefire-deal\">here</a>.</p><p>Families of Israelis held hostage in Gaza gathered in what has come to be known as Hostage Square in Tel Aviv after the announcement.</p><p>“President Trump, thank you very much. We thank him, our children will not have returned home without him,” said <strong>Hatan Angrest</strong>, whose son Matan is among the hostages.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Judge blocks Trump from deploying troops in Illinois for now",
      "link": "https://www.washingtonpost.com/politics/2025/10/09/trump-portland-chicago-national-guard-appeal/",
      "pub_time_taipei": "2025-10-10T08:07:22+08:00",
      "summary": "Officials in Oregon and Illinois had challenged the Trump administration’s push to dispatch the National Guard in both states."
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel’s cabinet approves ceasefire deal, advancing hostage release timeline",
      "link": "https://www.washingtonpost.com/world/2025/10/09/israel-hamas-gaza-deal-ceasefire-live/",
      "pub_time_taipei": "2025-10-10T07:30:11+08:00",
      "summary": "The ceasefire deal’s initial phase, if implemented, would halt fighting in Gaza to release hostages in exchange for Israel’s release of Palestinian prisoners."
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli ministers approve Gaza ceasefire, but tougher talks loom",
      "link": "https://www.washingtonpost.com/world/2025/10/09/israel-approves-hamas-gaza-ceasefire-deal-hostages/",
      "pub_time_taipei": "2025-10-10T07:27:15+08:00",
      "summary": "U.S. forces plan a “civil military coordination center” in Israel to provide humanitarian, logistical and security assistance, an official said, but will not deploy to Gaza."
    },
    {
      "source": "衛報",
      "title": "Hamas and Israel prepare to implement ceasefire as Netanyahu says deal approved by government",
      "link": "https://www.theguardian.com/world/2025/oct/09/joy-and-anxiety-as-hamas-and-israel-prepare-to-implement-ceasefire-deal",
      "pub_time_taipei": "2025-10-10T06:36:17+08:00",
      "summary": "<p>Israel’s government ratified the ceasefire and hostage deal on Friday, clearing the way to suspend hostilities in Gaza within 24 hours</p><p>• <a href=\"https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news\">Gaza ceasefire – live updates</a></p><p>Israelis and Palestinians celebrated on Thursday night as Hamas and Israel’s government began preparations to implement a <a href=\"https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-and-hamas\">ceasefire deal</a> that promises a durable end to a bloody two-year conflict that has killed tens of thousands, destabilised much of the Middle East and prompted protests around the world.</p><p>In Gaza, there was joy but much anxiety. Many expressed the fear that the new deal would collapse, bringing more suffering to the devastated territory. Though crowds gathered in some places to dance and sing, in many places witnesses reported muted reaction amid loud overflights by warplanes and drones.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/joy-and-anxiety-as-hamas-and-israel-prepare-to-implement-ceasefire-deal\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. Central Command is establishing a “civil military coordination center” in Israel to support the Gaza...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T06:36:11+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Ben Gvir and Smotrich say they oppose Gaza ceasefire deal",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T06:27:45+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "President Donald Trump’s special envoy to the Middle East Steve Witkoff and Trump’s son-in-law Jared Kushner...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T06:22:59+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "What we know — and don’t know — about the ceasefire deal so far",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T06:18:03+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Much of President Donald Trump’s 20-point plan had been drafted a year earlier under the previous...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T06:12:33+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "The Rev. Gabriel Romanelli of Gaza said in a statement that his flock was happy to...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T06:07:19+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "President Petro accuses US of killing Colombians in attacks on ‘narco-boats’",
      "link": "https://www.theguardian.com/world/2025/oct/09/gustavo-petro-colombia-boats-us-military",
      "pub_time_taipei": "2025-10-10T05:28:51+08:00",
      "summary": "<p>Gustavo Petro demands US release names of victims: ‘A new theatre of war has opened up: the Caribbean’</p><p>Colombia’s president has drawn Washington’s ire after accusing the US of killing Colombian citizens during a recent boat strike in the Caribbean Sea.</p><p>“A new theatre of war has opened up: the Caribbean,” Gustavo Petro wrote on his official X account on Wednesday night.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/gustavo-petro-colombia-boats-us-military\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S.- and Israeli-backed Gaza Humanitarian Fund is preparing new aid site",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T05:15:13+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Up until Tuesday evening, mediators thought they still had a few more days of work to...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T05:10:16+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Najwa Al-Halabi — who is from Gaza City and is currently in Cairo — felt relieved...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T04:47:46+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Father of American hostage describes ‘mixed bag of emotions’ over ceasefire",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T04:22:15+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "U.N. ‘ready to roll’ on aid deliveries to Gaza",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T04:19:21+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "President Donald Trump said nobody would be forced to leave Gaza as part of his 20-point...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T04:00:40+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "North Korea to flaunt nuclear arsenal at military parade in challenge to West",
      "link": "https://www.washingtonpost.com/world/2025/10/09/north-korea-kim-jong-un-military-parade/",
      "pub_time_taipei": "2025-10-10T03:46:54+08:00",
      "summary": "Kim Jong Un is likely to show off new weapons systems at a parade in Pyongyang, with Chinese and Russian guests of honor, in their latest display of solidarity."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. Sen. Chris Van Hollen (D-Maryland) praised the ceasefire deal on Thursday, calling the agreement between...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T03:32:01+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas received guarantee that war was ‘fully and completely ended,’ official says",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T02:52:31+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Gaza ceasefire plan: how much credit does Trump deserve? – podcast",
      "link": "https://www.theguardian.com/politics/audio/2025/oct/09/gaza-ceasefire-plan-how-much-credit-does-trump-deserve-podcast",
      "pub_time_taipei": "2025-10-10T02:49:01+08:00",
      "summary": "<p>Donald Trump posted on Truth Social on Wednesday night that Israel and Hamas had agreed the <a href=\"https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-and-hamas\">first phase of a new ceasefire deal</a> in Gaza. We’ve been here before, but is it different this time? Has Trump proved the doubters wrong?</p><p>Jonathan Freedland speaks to Julian Borger about the prospect for peace in the Middle East and the US president’s role in getting to this point</p><p><em>Archive: PBS Newshour</em></p> <a href=\"https://www.theguardian.com/politics/audio/2025/oct/09/gaza-ceasefire-plan-how-much-credit-does-trump-deserve-podcast\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. envoy Steve Witkoff and Trump’s son-in-law Jared Kushner landed in Israel as the country’s security...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T02:41:10+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "For parents of U.S. hostage Omer Neutra, relief and dread",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T02:38:20+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Belgian PM reported to be among targets of ‘jihad-inspired’ drone plot",
      "link": "https://www.theguardian.com/world/2025/oct/09/belgian-police-arrest-suspects-plotting-jihadist-inspired-drone-attack-on-prime-minister",
      "pub_time_taipei": "2025-10-10T02:33:37+08:00",
      "summary": "<p>Officers in Antwerp arrest three suspects and recover an improvised explosive device  </p><p>Police in Belgium have arrested three young adults suspected of plotting a jihadist-inspired attack using drone-mounted explosives, with the Belgian prime minister reported to be among the politicians targeted.</p><p>The arrests were made in the northern city of Antwerp as part of an investigation into “attempted terrorist murder and participation in the activities of a terrorist group”, the federal prosecutor Ann Fransen told a news conference.</p> <a href=\"https://www.theguardian.com/world/2025/oct/09/belgian-police-arrest-suspects-plotting-jihadist-inspired-drone-attack-on-prime-minister\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Palestinian Authority President Mahmoud Abbas met with a delegation of Israeli and Palestinian peace activists in...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T02:11:36+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Attacks, while slowed, continue in Gaza with deal not yet in force",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T02:02:01+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Witkoff and Kushner meet with Egyptian president",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T01:24:12+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli Defense Minister Israel Katz directed the Israel Defense Forces to “respond with great force” to...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T01:17:47+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Gazan detainees set for release endured abuse, Israeli rights group says",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T01:15:46+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "At a Cabinet meeting Thursday, Secretary of State Marco Rubio said that a month ago, he...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T01:00:38+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump says he’ll travel to Mideast for ceasefire signing ceremony",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T00:37:49+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli security cabinet meeting to discuss deal is underway",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-10T00:13:02+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Video: What we know about the Israel-Hamas ceasefire deal so far",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T23:40:49+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "As part of ceasefire talks, Israel rejected the release of Marwan Barghouti, a  Palestinian Political...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T23:34:25+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S., mediators guaranteed Israel will not resume war after Hamas release, official says",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T23:09:23+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Meeting on Gaza’s post-war transition convenes in Paris, drawing top officials",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T22:38:45+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Netanyahu’s office lays out timeline for hostage releases, IDF pullback",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T21:40:13+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Gazans express cautious optimism, say they have been here before",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T20:40:31+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli medical facilities are preparing to provide care to the remaining living hostages once freed.",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-10-09T20:40:19+08:00",
      "summary": ""
    }
  ]
}