{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-30T20:40:07.481664+08:00",
  "window_end_taipei": "2025-10-31T20:40:07.481664+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Trump calls for Senate to scrap filibuster in order to force end to month-long government shutdown – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
      "pub_time_taipei": "2025-10-31T20:22:10+08:00",
      "summary": "<p>Snap food benefits are set to run out this weekend as shutdown comes close to matching the record of 2018-2019</p><p>House Republicans are increasingly expressing frustration with the chamber’s moribund activity and the legislative backlog piling up as speaker Mike Johnson of Louisiana keeps Congress out of session during the government shutdown.</p><p>Rep. Marjorie Taylor Greene (R-Ga.) confronted speaker the speaker during a House GOP conference call to criticize his tactics to negotiate the shutdown, according to a piece in <a href=\"https://thehill.com/homenews/house/5582283-republicans-house-shutdown-recess-johnson/\">The Hill</a> today.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Worries about immigration are ‘manufactured panic’ says charity as poll shows issue not a local concern – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/31/uk-politics-prince-andrew-latest-news-updates-labour-conservatives-keir-starmer-rachel-reeves",
      "pub_time_taipei": "2025-10-31T20:12:47+08:00",
      "summary": "<p>YouGov poll say only 26% of people say immigration is an issue locally but more than half believe it to be a national issue</p><p>There were six council byelections yesterday. Here are the results, from Election Maps UK.</p><p><strong>Reform gained two seats,</strong> <strong>from Labour and from an independent group.</strong></p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/31/uk-politics-prince-andrew-latest-news-updates-labour-conservatives-keir-starmer-rachel-reeves\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ex-prince Andrew should answer US questions on Epstein if asked, UK minister says",
      "link": "https://www.theguardian.com/uk-news/2025/oct/31/ex-prince-andrew-should-answer-us-questions-on-epstein-if-asked-uk-minister-says",
      "pub_time_taipei": "2025-10-31T20:07:02+08:00",
      "summary": "<p>Chris Bryant says government welcomes king’s decision on his brother, who is now ‘ordinary member of the public’</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/oct/31/uk-politics-prince-andrew-latest-news-updates-labour-conservatives-keir-starmer-rachel-reeves\">UK politics live – latest updates</a></p></li></ul><p>Andrew Mountbatten Windsor should go to the US to answer questions on Jeffery Epstein if asked to do so, a UK government minister has said, as it emerged that the former prince’s name has already been struck from the official <a href=\"https://www.college-of-arms.gov.uk/resources/roll-of-the-peerage\">roll of the peerage</a>.</p><p>Hours after the dramatic statement that King Charles had formally stripped his brother of all titles, including Duke of York, his HRH style and honours, Buckingham Palace said Andrew’s name had been removed from the roll, a move that in effect ends his public life.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/31/ex-prince-andrew-should-answer-us-questions-on-epstein-if-asked-uk-minister-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Dutch media report centrist D66 party has won most votes in Netherlands election – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates",
      "pub_time_taipei": "2025-10-31T19:57:39+08:00",
      "summary": "<p>Although final results are yet to be determined, analysis by the Netherlands news agency ANP suggests Rob Jetten’s party has unassailable lead over Geert Wilders’ far-right PVV</p><p><strong>Centrist party D66, led by charismatic 38-year-old Rob Jetten, has won the most votes in this week’s Dutch parliamentary election,</strong> the country’s news agency ANP said.</p><p>The agency collects the results from all municipalities in the Netherlands, and <strong>its provisional figures show that D66 now has an unassailable lead over Geert Wilders’s far-right PVV party</strong>, <a href=\"https://www.telegraaf.nl/binnenland/d66-wint-verkiezingen-partij-van-rob-jetten-niet-meer-in-te-halen-door-pvv/101551173.html\">AD and De Telegraaf reported.</a></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Digested week: Sometimes it feels the clocks do nothing else but go back | Lucy Mangan",
      "link": "https://www.theguardian.com/uk-news/2025/oct/31/digested-week-sometimes-it-feels-the-clocks-do-nothing-else-but-go-back",
      "pub_time_taipei": "2025-10-31T19:37:06+08:00",
      "summary": "<p>Women need exclamation marks for good reason!! Plus, Andrew is losing everything he holds dear, including his house full of memories</p><p>The clocks have gone back. Which is to say, something happened overnight for reasons that I am no closer to understanding now than I was half a century ago as a newborn babe.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/31/digested-week-sometimes-it-feels-the-clocks-do-nothing-else-but-go-back\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza risks sliding into deadly limbo of ‘no war, no peace’, top Qatari diplomat warns",
      "link": "https://www.theguardian.com/world/2025/oct/31/gaza-no-war-no-peace-qatari-diplomat-majed-al-ansar-international-force-israeli-withdrawal",
      "pub_time_taipei": "2025-10-31T19:25:45+08:00",
      "summary": "<p>Majed al-Ansari calls for international force to be  set up urgently to pave way for Israeli withdrawal</p><p>Gaza risks sliding towards a deadly limbo where a ceasefire is nominally in place but killing continues, a top Qatari diplomat has warned, calling for rapid progress in setting up the international security force and administration to pave the way for full Israeli withdrawal.</p><p>“We don’t want to reach a situation of no war, no peace,” said Majed al-Ansari, adviser to Qatar’s prime minister and spokesperson for the foreign ministry.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/gaza-no-war-no-peace-qatari-diplomat-majed-al-ansar-international-force-israeli-withdrawal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tinned tuna maker Princes floats at nearly £1.2bn in boost for London",
      "link": "https://www.theguardian.com/business/2025/oct/31/tinned-tuna-firm-princes-for-london-market-ipo-stock",
      "pub_time_taipei": "2025-10-31T19:15:13+08:00",
      "summary": "<p>Business secretary calls IPO ‘huge vote of confidence’ but shares are launched at bottom end of target range</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/31/uk-house-prices-rise-asian-stocks-mixed-tech-earnings-business-live-news\">Business live – latest updates</a></p></li></ul><p>The tinned tuna maker Princes Group has kicked off a float with a valuation of nearly £1.2bn in a boost for the London stock market.</p><p>The debut of the shares in the almost 150-year-old company, which is <a href=\"https://www.theguardian.com/business/2025/oct/03/lse-boost-as-beauty-group-lists-and-tinned-fish-brand-confirms-plans-for-ipo\">best known for its Princes tinned tuna and Napolina tinned tomatoes</a>, olive oil and pasta, marks a rare bright spot in the UK’s lacklustre market for flotations.</p> <a href=\"https://www.theguardian.com/business/2025/oct/31/tinned-tuna-firm-princes-for-london-market-ipo-stock\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Six arrested after €12m armed raid on gold refining lab in France",
      "link": "https://www.theguardian.com/world/2025/oct/31/six-arrested-after-armed-raid-on-gold-refining-lab-in-france",
      "pub_time_taipei": "2025-10-31T18:52:26+08:00",
      "summary": "<p>Robbery in Lyon left five employees slightly injured after explosion in latest high-profile incident to hit country </p><p>Six people armed with military-grade weapons have used explosives to break into a gold refining laboratory in Lyon, slightly injuring five employees in the latest high-profile daytime heist to hit France.</p><p>The audacious raid took place on Thursday afternoon, with police quickly arresting the suspected perpetrators and recovering the loot estimated to be worth €12m (£10.5m), officials said.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/six-arrested-after-armed-raid-on-gold-refining-lab-in-france\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: US to limit refugee numbers to 7,500 with priority for white South Africans",
      "link": "https://www.theguardian.com/us-news/2025/oct/31/first-thing-us-to-limit-refugee-numbers-to-7500-with-priority-for-white-south-africans",
      "pub_time_taipei": "2025-10-31T18:16:34+08:00",
      "summary": "<p>US refugee groups say move ‘lowers our moral standing.’ Plus, unionized Starbucks workers to vote on strikes over pay and conditions</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>The Trump administration is going to <a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-refugee-restrictions-white-south-africans\">restrict the number of refugees</a> it admits into the US next year to the token level of just 7,500 – and those spots will mostly be filled by white South Africans.</p><p><strong>What reason has been given for prioritizing white South Africans?</strong> The Trump administration has repeatedly claimed that the South African government is implementing anti-white policies through a new land expropriation law. The South African government has called the claims false.</p><p><strong>What was the other shooting by ICE agents in LA recently?</strong> Last week, federal agents shot an LA man who livestreams immigration enforcement operations on social media. Officials said at the time that Carlitos Ricardo Parias, a TikTok creator with a large following, had attempted to ram federal agents’ vehicles after agents surrounded him and boxed in his car.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/31/first-thing-us-to-limit-refugee-numbers-to-7500-with-priority-for-white-south-africans\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sudan’s brutal civil war – what has happened in El Fasher?",
      "link": "https://www.theguardian.com/world/2025/oct/31/sudan-civil-war-el-fasher-explained",
      "pub_time_taipei": "2025-10-31T18:14:32+08:00",
      "summary": "<p>Paramilitary Rapid Support Forces captured the city from the army after an 18-month siege – but who are they and what do they want?</p><p>Another devastating chapter in Sudan’s brutal civil war has taken place as the paramilitary Rapid Support Forces <a href=\"https://www.theguardian.com/world/2025/oct/27/fears-civilians-sudan-paramilitary-rsf-capture-el-fasher\">captured El Fasher from the army</a> after an 18-month siege that trapped tens of thousands of civilians in the city in Darfur. The RSF now controls all major urban centres in Darfur, a development that raises the possibility the country could face partition.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/sudan-civil-war-el-fasher-explained\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "How Stephen Miller is turning the US state department into an ‘anti-immigration machine’",
      "link": "https://www.theguardian.com/us-news/2025/oct/31/stephen-miller-immigration-trump",
      "pub_time_taipei": "2025-10-31T18:02:42+08:00",
      "summary": "<p>Miller is one of the most powerful officials in Trump’s White House, illustrating how it has sought to overcome a ‘deep state’ of professional diplomats</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates\">US politics live – latest updates</a></p></li></ul><p>The historic shifts in US immigration under <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> have been dictated by a relentless voice over a telephone line: Stephen Miller, the president’s <a href=\"https://www.theguardian.com/us-news/usimmigration\">immigration</a> czar, who in recent months has turned the state department’s visa and refugee operations into what some current and former diplomats have described as a personal fiefdom.</p><p>Each morning, usually at 10am, a small circle of conservative diplomats allied with Miller, including those who have assumed control of the state department’s consular and refugee operations, dial in for what some have termed the “Stephen Miller call”, an interagency discussion of immigration measures led by Miller, the White House’s homeland security adviser.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/31/stephen-miller-immigration-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Starbucks workers hold strike vote and plan for pickets to force first contract",
      "link": "https://www.theguardian.com/business/2025/oct/31/starbucks-workers-strike-vote",
      "pub_time_taipei": "2025-10-31T18:00:24+08:00",
      "summary": "<p>Union says world’s largest coffee chain engaged in bad faith bargaining and stonewalled over contract</p><p>Unionized <a href=\"https://www.theguardian.com/business/starbucks\">Starbucks</a> workers across the US are casting their votes on whether to hold a strike amid anger over pay and conditions at the world’s largest coffee chain, and <a href=\"https://www.americanprogress.org/article/the-fight-to-unionize-starbucks-by-the-numbers/\">allegations</a> it breached labor laws by engaging in bad faith bargaining.</p><p>Starbucks has faced a rapid wave of mobilization since 2021. Starbucks Workers United, a union representing baristas at the chain, has won elections at <a href=\"https://unionelections.org/data/starbucks/\">more than 650</a> of its locations in 45 states and the District of Columbia, representing more than 12,000 workers.</p> <a href=\"https://www.theguardian.com/business/2025/oct/31/starbucks-workers-strike-vote\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Harrison Ford says Trump’s assault on climate policy ‘scares the shit out of me’",
      "link": "https://www.theguardian.com/environment/2025/oct/31/harrison-ford-donald-trump-climate-crisis",
      "pub_time_taipei": "2025-10-31T18:00:23+08:00",
      "summary": "<p>Indiana Jones star calls US president one of history’s greatest criminals for attacks on science and boosting of fossil fuels</p><p><a href=\"https://www.theguardian.com/film/harrisonford\">Harrison Ford</a> has said that <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s assault upon measures to address the climate crisis “scares the shit out of me” and makes the US president among the worst criminals in history.</p><p>In a blistering attack upon the president, Ford told the Guardian that Trump “doesn’t have any policies, he has whims. It scares the shit out of me. The ignorance, the hubris, the lies, the perfidy. [Trump] knows better, but he’s an instrument of the status quo and he’s making money, hand over fist, while the world goes to hell in a handbasket.”</p> <a href=\"https://www.theguardian.com/environment/2025/oct/31/harrison-ford-donald-trump-climate-crisis\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Era of free trade and investment is over, Canada’s PM tells Apec summit",
      "link": "https://www.theguardian.com/world/2025/oct/31/era-of-free-trade-and-investment-over-canada-pm-mark-carney-apec-summit-korea",
      "pub_time_taipei": "2025-10-31T17:13:54+08:00",
      "summary": "<p>Mark Carney warns Asia-Pacific leaders global economy undergoing profound change, as China’s president mounts defence of free trade</p><p>The Canadian prime minister, Mark Carney, has warned that the era of free trade and investment that formed the foundations of the postwar global economy has ended.</p><p>In a stark message to Asia-Pacific leaders at the <a href=\"https://www.theguardian.com/world/2025/oct/30/apec-asia-pacific-economic-cooperation-explained\">Apec</a> summit in South Korea on Friday, Carney said rules-based open trade no longer worked in a global economy that was undergoing one of its most profound periods of change since the fall of the Berlin Wall in 1989.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/era-of-free-trade-and-investment-over-canada-pm-mark-carney-apec-summit-korea\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. boat strikes spread fear across the Caribbean",
      "link": "https://www.washingtonpost.com/world/2025/10/31/united-states-boat-strikes-caribbean-trinidad/",
      "pub_time_taipei": "2025-10-31T17:00:00+08:00",
      "summary": "The attacks, which have killed at least 61 people, are threatening the region’s fishing, shipping and tourism industries and exposing differences among leaders."
    },
    {
      "source": "衛報",
      "title": "Zarah Sultana sets sights on replacing Labour and gaining power",
      "link": "https://www.theguardian.com/politics/2025/oct/31/zarah-sultana-sets-sights-on-replacing-labour-your-party-jeremy-corbyn",
      "pub_time_taipei": "2025-10-31T16:45:48+08:00",
      "summary": "<p>MP who left Labour in July to form leftwing grouping with Jeremy Corbyn, says party is not just one of protest</p><p>The MP Zarah Sultana has said she hopes her new political party will ultimately replace Labour as she revealed she was committed to winning power.</p><p>Sultana left the Labour party in July to form the new group, operating under the temporary name Your Party.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/31/zarah-sultana-sets-sights-on-replacing-labour-your-party-jeremy-corbyn\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australian man dies while attempting to climb Himalayan mountain",
      "link": "https://www.theguardian.com/australia-news/2025/oct/31/australian-man-dies-while-attempting-to-climb-himalayan-mountain-himlung-himal-nepal",
      "pub_time_taipei": "2025-10-31T16:13:20+08:00",
      "summary": "<p>Chin Tark Chan died on Wednesday while climbing Himlung Himal in Nepal after he was first reported ill on Monday</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>An Australian man has died after becoming ill 300 metres from the summit of a mountain in Nepal.</p><p>Chin Tark Chan died on Wednesday during an attempt to climb 7,100-metre high Himlung Himal after he was first reported ill on Monday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/31/australian-man-dies-while-attempting-to-climb-himalayan-mountain-himlung-himal-nepal\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "What’s next for Andrew after losing his royal title over Epstein scandal?",
      "link": "https://www.washingtonpost.com/world/2025/10/31/prince-andrew-stripped-titles-epstein/",
      "pub_time_taipei": "2025-10-31T16:07:30+08:00",
      "summary": "Andrew, 65, was stripped of the title “prince” over links to convicted sex offender Jeffrey Epstein. He will now be known as Andrew Mountbatten Windsor."
    },
    {
      "source": "衛報",
      "title": "Weather tracker: Hurricane Melissa leaves trail of destruction across Caribbean",
      "link": "https://www.theguardian.com/environment/2025/oct/31/weather-tracker-hurricane-melissa-caribbean-jamaica-haiti-cuba",
      "pub_time_taipei": "2025-10-31T15:50:21+08:00",
      "summary": "<p>Category 5 storm is most powerful to strike Jamaica and has caused death and destruction in Cuba and Haiti</p><p>Hurricane Melissa has wreaked havoc across parts of the Caribbean in recent days, after first making landfall in Jamaica on Tuesday night as a category 5 storm – the highest strength. This was the most powerful storm to strike the island nation, packing winds of up to 185mph at its peak.</p><p>Western parts of Jamaica were worst hit, with 90% of homes in the town of Black River losing their roof or being destroyed entirely. Roughly three-quarters of the country lost electricity, with at least 19 people known to have lost their lives at the time of publication. The cleanup operation was hampered by thunderstorms even after Melissa cleared to the north. The hurricane continued northwards, but was a slightly weakened category 3 storm by the time it made landfall in Cuba. Nonetheless, the storm continued to bring winds of up to 120mph and torrential rains.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/31/weather-tracker-hurricane-melissa-caribbean-jamaica-haiti-cuba\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "After a year of street protests, Serbia’s students split on what should come next",
      "link": "https://www.theguardian.com/world/2025/oct/31/serbia-street-protests-students-split-elections",
      "pub_time_taipei": "2025-10-31T15:31:04+08:00",
      "summary": "<p>As a radicalised generation presses its calls for political change, a debate has opened up over whether to join battle by the ballot box</p><p>Midway through a 16-day, 250-mile (400km) march from Novi Pazar to Novi Sad, Inas Hodžić was still remarkably energetic. Like thousands of other Serbian students, he was making his way to the city which, last autumn, become the scene of national tragedy.</p><p>Sixteen people were killed when the newly renovated canopy of Novi Sad’s main railway station <a href=\"https://www.theguardian.com/world/2024/nov/01/roof-collapse-serbia-train-station-novi-sad\">collapsed</a> on 1 November 2024, a disaster that critics say exposed much more than faulty construction and sparked Serbia’s largest youth-led protest movement since the fall of Slobodan Milošević.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/serbia-street-protests-students-split-elections\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN leaders condemn ‘horrifying’ mass killings in Sudan",
      "link": "https://www.theguardian.com/world/2025/oct/30/un-leaders-condemn-horrifying-mass-killings-in-sudan",
      "pub_time_taipei": "2025-10-31T15:20:53+08:00",
      "summary": "<p>Emergency security council session criticises killings of civilians in El Fasher and external supply of arms to RSF</p><p>Diplomats and senior UN figures speaking at the UN security council have condemned mass killings by the Rapid Support Forces in El Fasher after the Sudanese city “descended into an even darker hell” following the paramilitary group’s <a href=\"https://www.theguardian.com/world/2025/oct/27/fears-civilians-sudan-paramilitary-rsf-capture-el-fasher\">takeover at the weekend</a>.</p><p>Widespread reports of ethnically targeted killings in recent days prompted the UK, as the UN penholder on Sudan, to call an emergency session of the security council in New York on Thursday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/30/un-leaders-condemn-horrifying-mass-killings-in-sudan\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Liberals hold cordial party room after public brawling but chasm on net zero remains",
      "link": "https://www.theguardian.com/australia-news/2025/oct/31/liberals-sussan-ley-party-room-chasm-on-net-zero-remains",
      "pub_time_taipei": "2025-10-31T15:06:36+08:00",
      "summary": "<p>Regional and metropolitan MPs at loggerheads as members warned not to ‘verbal’ each other over the issue</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>After months of public and private brawling, the Liberals had what many described as a respectful, cordial and constructive meeting about net zero.</p><p>Some participants joked that was almost news in itself.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/31/liberals-sussan-ley-party-room-chasm-on-net-zero-remains\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Warren Tredrea removed from Port Adelaide board after podcast controversy",
      "link": "https://www.theguardian.com/sport/2025/oct/31/warren-tredrea-removed-from-port-adelaide-board-after-podcast-controversy",
      "pub_time_taipei": "2025-10-31T14:29:01+08:00",
      "summary": "<ul><li><p>AFL club says it is not in its ‘best interests’ for former player to remain</p></li><li><p>Tredrea had refused to apologise for podcast guest’s comments</p></li></ul><p>Port Adelaide has removed Warren Tredrea from its board after the former club great refused to apologise for comments made by a guest on his podcast.</p><p>An interview published in May with a former British Army veteran drew criticism from the Jewish Council of Australia, accusing it of amplifying far-right antisemitic conspiracy theories, prompting the AFL club to commence a governance review.</p> <a href=\"https://www.theguardian.com/sport/2025/oct/31/warren-tredrea-removed-from-port-adelaide-board-after-podcast-controversy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "BoM to revert to former rain radar colour scheme after backlash – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
      "pub_time_taipei": "2025-10-31T14:05:58+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/media/2025/oct/31/abc-executive-who-sacked-antoinette-lattouf-paid-836000-for-eight-month-employment-annual-report-shows\">ABC executive who sacked Antoinette Lattouf paid $836,000 for eight-month employment, annual report shows</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>National children’s commissioner says work still needed to fix ‘accountability gaps that are obvious wherever we look’</strong></p><p><strong>Anne Hollonds</strong>, the national children’s commissioner, spoke to RN Breakfast this morning on the eve of finishing her five-year term in the role.</p><p>I think there’s a growing recognition that the old ways of thinking about how we deal with child safety and wellbeing is no longer working and that we need to work together across the federation.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hurricane Melissa death toll nears 50 as Jamaica relief efforts intensify and storm heads north",
      "link": "https://www.theguardian.com/world/2025/oct/30/hurricane-melissa-bermuda-leaving-devastation-jamaica",
      "pub_time_taipei": "2025-10-31T13:31:23+08:00",
      "summary": "<p>Haiti death toll reaches 30, and 19 in Jamaica, as Bermuda weathers tropical storm conditions on Thursday night</p><p>The death toll from Hurricane Melissa has reached 49 as the storm continued to tear through the Caribbean, heading past Bermuda, and workers in Jamaica ramped up efforts to clear roads and reach people in isolated and cut-off areas.</p><p>In Haiti, the death toll has risen to 30, with another 20 missing, the civil defence agency said on Thursday. A further 20 people were injured, it added.</p> <a href=\"https://www.theguardian.com/world/2025/oct/30/hurricane-melissa-bermuda-leaving-devastation-jamaica\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Egypt’s vast $1bn museum to open in Cairo after two-decade build",
      "link": "https://www.theguardian.com/world/2025/oct/31/egypts-vast-1bn-museum-to-open-in-cairo-after-two-decade-build",
      "pub_time_taipei": "2025-10-31T13:00:16+08:00",
      "summary": "<p>Grand Egyptian Museum next to pyramids of Giza billed as world’s largest archaeological facility for single civilisation</p><p>A vast $1bn museum billed as the world’s largest archaeological facility dedicated to a single civilisation will open outside Cairo on Saturday, after countless delays over the course of its two-decade construction.</p><p>The Grand Egyptian Museum, located a mile away from the pyramids of Giza, covers an area of 470,000 sq metres. The complex was announced in 1992 but it was not until 2005 that construction began. Some areas of the museum opened in a soft launch in 2024.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/egypts-vast-1bn-museum-to-open-in-cairo-after-two-decade-build\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nurse banned over relationship with mental health patient she kissed and took to Canberra escape room",
      "link": "https://www.theguardian.com/australia-news/2025/oct/31/nurse-banned-over-relationship-with-mental-health-patient-she-kissed-and-took-to-escape-room",
      "pub_time_taipei": "2025-10-31T12:44:19+08:00",
      "summary": "<p>Dilnoor Kang exchanged up to 5,000 messages and calls with vulnerable young patient over just one year </p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A nurse has been banned over an intimate relationship with a vulnerable mental health patient, after taking him to an escape room, exchanging thousands of calls and texts and being seen kissing him.</p><p>Dilnoor Kang, who was a nurse at Wagga Wagga’s mental health unit in regional NSW, was on Friday found guilty of professional misconduct over the years-long relationship and for lying to various health authorities about it.</p><p><em>In Australia, the crisis support service Lifeline is 13 11 14. In the US, the National Suicide Prevention Lifeline is 1-800-273-8255. In the UK, Samaritans can be contacted on 116 123.<strong> </strong>Other international suicide helplines can be found at <a href=\"https://www.befrienders.org/\">befrienders.org</a></em></p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/31/nurse-banned-over-relationship-with-mental-health-patient-she-kissed-and-took-to-escape-room\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Sudan’s war takes horrific turn, as Trump looks away",
      "link": "https://www.washingtonpost.com/world/2025/10/31/sudan-war-trump-white-house/",
      "pub_time_taipei": "2025-10-31T12:00:00+08:00",
      "summary": "The White House loves quick deals and photo-ops, but there’s no simple solution to ending the war in Sudan."
    },
    {
      "source": "華盛頓郵報",
      "title": "At least 40 dead in Hurricane Melissa as it heads toward Bermuda",
      "link": "https://www.washingtonpost.com/world/2025/10/30/melissa-hurricane-northeast-us-bermuda/",
      "pub_time_taipei": "2025-10-31T09:40:30+08:00",
      "summary": "Melissa will bring heavy rain from the Mid-Atlantic to New England as it heads toward Bermuda and Canada. It leaves a trail of destruction in the Caribbean."
    },
    {
      "source": "衛報",
      "title": "Radio Free Asia suspends news operations amid cuts and US government shutdown",
      "link": "https://www.theguardian.com/us-news/2025/oct/31/radio-free-asia-suspends-news-operations-amid-cuts-us-government-shutdown",
      "pub_time_taipei": "2025-10-31T09:13:30+08:00",
      "summary": "<p>RFA will begin closing overseas bureaus, as well as laying off and paying severance to staff members, with the hope that it could return in the future</p><p>Radio Free Asia (RFA) has said it is <a href=\"https://www.rfa.org/english/about/releases/2025/10/29/rfa-suspends-remaining-editorial-operations/\">suspending its news operations</a> due to the US government shutdown and the Trump administration’s <a href=\"https://www.theguardian.com/media/2025/mar/18/chinese-state-media-celebrates-trumps-cuts-to-voice-of-america-and-radio-free-asia\">cuts to government-funded news services</a>.</p><p>“RFA has been forced to suspend all remaining news content production – for the first time in its 29 years of existence,” said Bay Fang, RFA’s president and CEO, in a statement.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/31/radio-free-asia-suspends-news-operations-amid-cuts-us-government-shutdown\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "King Charles strips brother Andrew of prince title over Epstein scandal",
      "link": "https://www.washingtonpost.com/world/2025/10/30/andrew-title-prince-charles-epstein/",
      "pub_time_taipei": "2025-10-31T07:22:26+08:00",
      "summary": "The move marks the latest setback for the king’s brother as the scandal over his ties to the convicted American sex offender Jeffrey Epstein continues to cast a long shadow."
    },
    {
      "source": "衛報",
      "title": "Hamas hands over bodies of two Israeli hostages amid fragile Gaza truce",
      "link": "https://www.theguardian.com/world/2025/oct/30/hamas-hands-over-bodies-of-two-israeli-hostages-amid-fragile-gaza-truce",
      "pub_time_taipei": "2025-10-31T07:00:20+08:00",
      "summary": "<p>Remains of Amiram Cooper and Sahar Baruch returned to Israel for burial after identification process, Israeli military said</p><p>Hamas handed over two bodies of deceased Israeli hostages on Thursday, a day after <a href=\"https://www.theguardian.com/world/2025/oct/19/palestinians-in-gaza-fear-ceasefire-could-collapse-at-any-moment\">the tenuous Gaza ceasefire</a> was shaken by deadly Israeli strikes across the strip.</p><p>The bodies of the hostages Amiram Cooper and Sahar Baruch were returned to Israel for burial after an identification process was completed, the Israeli military said late on Thursday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/30/hamas-hands-over-bodies-of-two-israeli-hostages-amid-fragile-gaza-truce\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Senate passes bill to nullify Trump’s sweeping global tariffs on more than 100 nations – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
      "pub_time_taipei": "2025-10-31T05:28:47+08:00",
      "summary": "<p>This live blog is now closed.</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-news-at-a-glance-latest-updates-news-today\">Trump news at a glance: Four Senate Republicans join Democrats to reject global tariffs</a></p></li></ul><p>In the days leading up to the Trump-Xi meeting, American officials signalled that the US president did not intend to make good on a recent threat to impose an additional 100% import tax on Chinese goods.</p><p>Also that China had shown signs it is willing to relax its export controls on rare earths as well as revive buying soybeans from the US.</p><p>The relationship with China is very good.</p><p>Because of the tremendous destructive power, I HATED to do it, but had no choice! Russia is second, and China is a distant third, but will be even within 5 years.</p><p>Because of other countries testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis. That process will begin immediately.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Classified U.S. report finds backlog of hundreds of possible Israeli human rights violations",
      "link": "https://www.washingtonpost.com/national-security/2025/10/30/state-department-report-israel-gaza-human-rights-violations/",
      "pub_time_taipei": "2025-10-31T04:27:46+08:00",
      "summary": "The report found “hundreds” of possible Israeli human rights violations, further complicating a process to review credible allegations against IDF military units in Gaza."
    },
    {
      "source": "華盛頓郵報",
      "title": "See the devastating effects of Melissa’s deadly path through the Caribbean",
      "link": "https://www.washingtonpost.com/world/interactive/2025/hurricane-melissa-jamaica-photos-videos/",
      "pub_time_taipei": "2025-10-31T02:35:44+08:00",
      "summary": "The storm is heading toward Bermuda after causing widespread devastation in Jamaica, Cuba, Haiti and the Bahamas"
    },
    {
      "source": "衛報",
      "title": "Four feet higher and rising: Barcelona’s Sagrada Familia becomes world’s tallest church",
      "link": "https://www.theguardian.com/world/2025/oct/30/barcelona-sagrada-familia-world-tallest-church",
      "pub_time_taipei": "2025-10-31T02:06:24+08:00",
      "summary": "<p>Antoni Gaudí’s masterwork is still under construction but now stands taller than Ulm Minster in southern Germany</p><p>Barcelona’s Sagrada Familia basilica became the world’s tallest church on Thursday after a part of its central tower was lifted into place.</p><p>The masterwork of the architect Antoni Gaudí now rises to 162.91 metres (534ft 8in) above the city, the church said in a statement. That beats the spire of Ulm Minster in Germany, which tops out at 161.53 metres.</p> <a href=\"https://www.theguardian.com/world/2025/oct/30/barcelona-sagrada-familia-world-tallest-church\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Dutch centrists D66 back in lead in election vote count, edging past far-right PVV – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/30/dutch-election-results-netherlands-geert-wilders-rob-jetten-france-louvre-russia-poland-ukraine-latest-news-updates",
      "pub_time_taipei": "2025-10-31T00:06:21+08:00",
      "summary": "<p>Rob Jetten’s party now leading by 15,122 votes, putting it back in the pole position to lead the talks on forming the next government</p><p>In terms of <strong>managing our expectations as to when the new Dutch government could be formed</strong>, <strong>Joost Eerdmans</strong> of the right-wing <strong>JA21</strong> party – a potential coalition partner in the new administration – has <strong>offered a bit of guidance on timing.</strong></p><p>Speaking to reporters earlier today, he <a href=\"https://nos.nl/liveblog/2588474-pvv-haalt-d66-in-als-grootste-partij-verschil-nu-1269-stemmen#UPDATE-89879346\">confirmed</a> the party “can definitely do business” with other parties, but insisted that he would <strong>“rather have a stable cabinet in a few months than a messy cabinet before Christmas.”</strong></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/30/dutch-election-results-netherlands-geert-wilders-rob-jetten-france-louvre-russia-poland-ukraine-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Xi-Trump meeting: America has discovered that bullies can be bullied back",
      "link": "https://www.theguardian.com/us-news/2025/oct/30/trump-xi-jinping-meeting-us-china-price-confrontation",
      "pub_time_taipei": "2025-10-30T22:30:28+08:00",
      "summary": "<p>Outcome appears closer to truce than durable peace but outline of broader diplomatic relationship is visible</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/30/five-key-takeaways-donald-trump-meeting-xi-jinping-china-us-trade-talks\">Five key takeaways from Trump-Xi meeting</a></p></li></ul><p>When Donald Trump launched his trade war against China in April, threatening tariffs as high as 145%, the Chinese government said it would never bow to blackmail and vowed to “fight to the end”.</p><p>The question now is whether the <a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade\">consensus reached between Trump and Xi Jinping</a> in Busan, South Korea, on Thursday means that the fight really has come to an end, and if so on whose terms.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/30/trump-xi-jinping-meeting-us-china-price-confrontation\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Dutch voters deliver rebuke to the far right in knife-edge election",
      "link": "https://www.washingtonpost.com/world/2025/10/30/netherlands-election-results-geert-wilders-rob-jetten/",
      "pub_time_taipei": "2025-10-30T22:23:31+08:00",
      "summary": "The centrist D66 party nearly tripled its seats, while Geert Wilders’s right-wing party suffered a drop from its shocking first-place finish in 2023."
    },
    {
      "source": "衛報",
      "title": "Lebanese president orders army to confront Israeli incursions after deadly raid",
      "link": "https://www.theguardian.com/world/2025/oct/30/lebanese-president-orders-army-to-confront-israeli-soldiers-after-municipal-worker-killed-in-raid",
      "pub_time_taipei": "2025-10-30T22:11:32+08:00",
      "summary": "<p>IDF says it was attacking Hezbollah infrastructure when it fired at a ‘suspect’ and the incident is under review</p><p>Israeli troops have killed a Lebanese municipal worker while carrying out a raid in the south of the country, prompting Lebanon’s president to order the army to confront future incursions.</p><p>Lebanese state media identified the slain man as Ibrahim Salameh, an employee of the Blida municipality, a village near the border with Israel. The Israeli military confirmed the raid and said it was attacking Hezbollah infrastructure when it fired at a “suspect”. It said the incident was under review.</p> <a href=\"https://www.theguardian.com/world/2025/oct/30/lebanese-president-orders-army-to-confront-israeli-soldiers-after-municipal-worker-killed-in-raid\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump cuts tariffs on China after ‘truly great’ meeting with Xi",
      "link": "https://www.washingtonpost.com/politics/2025/10/30/trump-xi-meeting-tariff-cuts/",
      "pub_time_taipei": "2025-10-30T21:36:51+08:00",
      "summary": "China’s leader agreed to delay restrictions on rare earth minerals for a year and buy more soybeans, Trump said after a meeting designed to calm trade tensions."
    }
  ]
}