{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-05T20:40:07.543982+08:00",
  "window_end_taipei": "2025-10-06T20:40:07.543982+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "‘First job bonus’ worth £5k planned for young people, Stride tells Tory conference – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/06/conservative-tory-party-conference-spending-welfare-immigration-labour-starmer-reform-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-10-06T20:33:21+08:00",
      "summary": "<p>Shadow chancellor sets out spending plans as party conference continues in Manchester</p><p><strong>Mel Stride</strong>, the shadow chancellor, was doing an interview round for the Conservatives this morning, and <strong>Miatta Fahnbulleh</strong>, the faith and communities minister, was on the air on behalf of the government. They were both asked about the latest development in the flag phenomenon – the former footballer turned property developer <strong>Gary Neville</strong> saying that he took down a union flag flying at one of his building sites because he felt it was being used in a “negative fashion”.</p><p>Asked if Neville (a Labour supporter) had a point, <strong>Fahnbulleh</strong> told ITV’s Good Morning Britain:</p><p>I think he’s really right, that there are people who are trying to divide us at the moment …</p><p>I spent a lot of time going around our communities, talking to people. People are ground down. We’ve had a decade-and-a-half in which living standards haven’t budged and people have seen their communities held down. And you will get people trying to stoke division, trying to blame others, trying to stoke tension.</p><p>I think people that put up flags, the vast majority of people that do, do so for perfectly reasonable patriotic reasons. And I think reclaiming our flag as a flag of unity and decency and tolerance, which is the way most people see our flag, is a very positive thing.</p><p>So I’m afraid I really cannot agree with the comments that he’s made.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/06/conservative-tory-party-conference-spending-welfare-immigration-labour-starmer-reform-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Neighbours of Manchester attacker say they reported concerns to police",
      "link": "https://www.theguardian.com/uk-news/2025/oct/06/neighbours-manchester-synagogue-attacker-concerns-police-jihad-al-shamie",
      "pub_time_taipei": "2025-10-06T20:30:05+08:00",
      "summary": "<p>Exclusive: Concerns about apparently fanatical interest in Islam shown by Jihad al-Shamie and another family member were reported, Guardian told</p><p>Neighbours of the Manchester synagogue attacker reported concerns to police about him and a family member being “radicalised” and attempting to “preach” the Qur’an to local children, the Guardian has been told.</p><p>Police have said Jihad al-Shamie, 35, did not appear to be known to counter-terrorism officials before he attacked a Heaton Park synagogue leading to the deaths of two worshippers on Yom Kippur.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/06/neighbours-manchester-synagogue-attacker-concerns-police-jihad-al-shamie\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Greta Thunberg among 171 Gaza flotilla activists deported by Israel; ceasefire negotiations due to begin in Egypt – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/oct/06/gaza-ceasefire-peace-talks-hamas-israel-trump-egypt-middle-east-crisis-live-news-updates",
      "pub_time_taipei": "2025-10-06T20:29:06+08:00",
      "summary": "<p>Activists deported to Greece and Slovakia; negotiators from the US, Israel and Hamas are set to begin talks</p><p>Iran signalled its support for Trump’s Gaza plan, with the country’s foreign ministry saying it supports any initiative that brings an end to the genocide of Palestinian people.</p><p>Iran’s foreign ministry wrote <a href=\"https://x.com/IRIMFA_EN/status/1975088112893038839\">in a post on X</a>:</p><p><em>Taking into account the dangerous dimensions and aspects of this proposal, and while reiterating its warning about the repeated breaches and obstructionism by the Zionist regime in fulfilling its promises, especially in light of its expansionist and racist plans, the Islamic Republic of Iran considers any decision in this regard to be within the authority of the Palestinian people and resistance.</em></p><p><em>It welcomes any decision by them that guarantees halting the genocide of Palestinians, the withdrawal of the occupying Zionist army from Gaza, respect for the Palestinian people’s right to self-determination, the entry of humanitarian aid, and the reconstruction of Gaza.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/06/gaza-ceasefire-peace-talks-hamas-israel-trump-egypt-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Lecornu bemoans lack of compromise across political spectrum as he resigns as French PM – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/06/france-pm-resigns-lecornu-macron-europe-live-news-updates",
      "pub_time_taipei": "2025-10-06T20:28:54+08:00",
      "summary": "<p>Departure after less than a month follows fierce criticism of Macron’s new cabinet</p><p>Just as most across France were starting their workday, news broke that the country’s prime minister, Sébastien Lecornu, had resigned.</p><p>The swift, unexpected resignation came after allies and foes alike threatened to topple the new government, leaving Lecornu blaming the “egos” of opposition politicians.</p><p>Lecornu was President Emmanuel Macron’s fifth prime minister in two years. He stayed in the job for only 27 days and his government lasted 14 hours.</p><p>The resignation deepens the political crisis that has gripped France for more than a year, after Macron called legislative elections in the summer of 2024 which ended in a hung parliament.</p><p>Macron’s opponents immediately seized on the moment. The far-right National Rally called on him to either call for new snap elections or resign while across the spectrum on the left, France Unbowed also called for Macron’s departure.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/06/france-pm-resigns-lecornu-macron-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gisèle Pelicot returns to court to face one of men convicted of raping her",
      "link": "https://www.theguardian.com/world/2025/oct/06/gisele-pelicot-returns-court-face-one-men-convicted-raping-her-husamettin-dogan-appeal",
      "pub_time_taipei": "2025-10-06T20:28:43+08:00",
      "summary": "<p>The 72-year-old arrives for trial in Nîmes as Husamettin Dogan becomes only man out of 51 to appeal against verdict</p><p>Gisèle Pelicot, who survived almost a <a href=\"https://www.theguardian.com/world/2024/sep/17/dominique-pelicot-france-rape-trial-testimony\">decade of rape</a> involving dozens of men after she was drugged by her ex-husband, has arrived at a court in France for the appeal trial of one of the men convicted of raping her.</p><p>Pelicot became a feminist hero after she decided to waive her right to anonymity in the trial of her former husband and <a href=\"https://www.theguardian.com/world/2024/dec/19/who-are-the-men-convicted-over-rape-and-assault-of-gisele-pelicot-\">50 other men</a> last year.</p> <a href=\"https://www.theguardian.com/world/2025/oct/06/gisele-pelicot-returns-court-face-one-men-convicted-raping-her-husamettin-dogan-appeal\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Gaza ceasefire talks to begin in Egypt, as Israel strikes enclave",
      "link": "https://www.washingtonpost.com/world/2025/10/06/gaza-ceasefire-talks-israel-hamas/",
      "pub_time_taipei": "2025-10-06T20:24:19+08:00",
      "summary": "Israel and Hamas are set to gather in Egypt for indirect talks over a U.S.-backed plan to end the Gaza war after months of deadlock."
    },
    {
      "source": "衛報",
      "title": "Judge blocks Trump’s bid to deploy national guard to Oregon – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
      "pub_time_taipei": "2025-10-06T20:08:50+08:00",
      "summary": "<p>Ruling by US District Judge Karin Immergut blocks any deployment to Portland for two weeks as legal wrangling continues</p><p><strong>Donald Trump</strong> doesn’t have any public events scheduled today, per the White House.</p><p>However, press secretary <strong>Karoline Leavitt</strong> will hold a briefing for reporters at 1pm EST.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Prime minister of France resigns hours after naming new government",
      "link": "https://www.washingtonpost.com/world/2025/10/06/france-prime-minister-sebastien-lecornu-resigns/",
      "pub_time_taipei": "2025-10-06T19:59:27+08:00",
      "summary": "Sébastien Lecornu, a former defense minister, was in the job less than a month. He was appointed after a no-confidence vote toppled his predecessor."
    },
    {
      "source": "衛報",
      "title": "Nobel prize in medicine awarded to scientists for immune system research",
      "link": "https://www.theguardian.com/science/2025/oct/06/nobel-prize-medicine-awarded-scientists-immune-system-research",
      "pub_time_taipei": "2025-10-06T19:56:08+08:00",
      "summary": "<p>Mary E Brunkow, Fred Ramsdell and Shimon Sakaguchi win for work on preventing immune system harming body</p><p>The Nobel prize in physiology or medicine 2025 has been awarded to three scientists for their work on how the immune system is prevented from attacking the body.</p><p>Mary E Brunkow, now at the Institute for Systems Biology in<br />\n Seattle, Fred Ramsdell, now at Sonoma Biotherapeutics in<br />\n San Francisco, and Shimon Sakaguchi, now at Osaka University in Japan, have been awarded the prize “for their discoveries concerning peripheral immune tolerance”.</p> <a href=\"https://www.theguardian.com/science/2025/oct/06/nobel-prize-medicine-awarded-scientists-immune-system-research\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Open-minded’ dating app Feeld’s profits jump amid influx of ‘vanilla’ users",
      "link": "https://www.theguardian.com/business/2025/oct/06/dating-app-feelds-profits-users-sales",
      "pub_time_taipei": "2025-10-06T19:40:48+08:00",
      "summary": "<p>Sales rose 26% last year at the app, whose core market is people in open relationships and kink enthusiasts</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/06/yen-slumps-nikkei-record-sanae-takaichi-wins-election-gold-nears-4000-rally-continues-business-live-news\">Business live – latest updates</a></p></li></ul><p>An influx of “vanilla” users helped the unconventional dating app Feeld post a jump in profits, as the company expanded its customer base beyond its original target market of people in open relationships and kink enthusiasts.</p><p>Growth outside the UK, where Feeld was founded, helped increase sales by 26% to £48.9m in 2024, according to accounts filed at Companies House.</p> <a href=\"https://www.theguardian.com/business/2025/oct/06/dating-app-feelds-profits-users-sales\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump urges negotiators to ‘move fast’ in run-up to Gaza ceasefire talks | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/oct/06/first-thing-trump-move-fast-gaza-ceasefire-talks-egypt",
      "pub_time_taipei": "2025-10-06T19:15:14+08:00",
      "summary": "<p>Discussions in Egypt expected to focus on path to peace and release of hostages, after Israel killed dozens of people in just over 24 hours. Plus, why are young Americans eating so early?</p><p>Good morning.</p><p>Donald Trump has urged negotiators to “move fast” in talks focused on the release of hostages held by Hamas in Gaza and a broader end to the war, as representatives arrived in Egypt for <a href=\"https://www.theguardian.com/world/2025/oct/05/israel-continues-gaza-bombardment-trump-plan-negotiators-arrive-in-cairo\">discussions today</a>.</p><p><strong>What’s happening today?</strong> The US envoy Steve Witkoff is expected to join the talks in Sharm el-Sheikh, according to Israeli media, in addition to Israel’s negotiators and a Palestinian delegation headed by Khalil al-Hayya, the deputy head of the political bureau of Hamas.</p><p><strong>This is a live story. <a href=\"https://www.theguardian.com/world/live/2025/oct/06/gaza-ceasefire-peace-talks-hamas-israel-trump-egypt-middle-east-crisis-live-news-updates\">Follow updates here</a>.</strong></p><p><strong>How long will the ruling last?</strong> Immergut’s ruling on Sunday, which will remain in effect until at least 19 October, blocks the Trump administration from sending national guard troops to Portland while Oregon and California seek a longer-term ruling in court.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/06/first-thing-trump-move-fast-gaza-ceasefire-talks-egypt\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We want justice’: workers at Amazon warehouses in Saudi Arabia still waiting on financial redress",
      "link": "https://www.theguardian.com/technology/2025/oct/06/amazon-workers-saudi-arabia",
      "pub_time_taipei": "2025-10-06T19:00:12+08:00",
      "summary": "<p>Asian migrant laborers who paid predatory recruiting fees say global mega-corporation has not kept its promise to pay them restitution</p><p>Warehouse laborers from Asia say the world’s second largest employer, <a href=\"https://www.theguardian.com/technology/amazon\">Amazon</a>, has failed to live up to its promises to compensate them for <a href=\"https://www.theguardian.com/technology/2023/oct/10/amazon-trafficking-links-claims-saudi-arabia-workers-abuses\">financial abuses</a> tied to their work for the online retailer in <a href=\"https://www.theguardian.com/world/saudiarabia\">Saudi Arabia</a>.</p><p>In 2023, Amazon promised to reimburse recruitment fees to its contract workers from Asia who had been forced to pay large sums to secure jobs at the company’s warehouses in Saudi Arabia. Since then, Amazon has paid more than $2.6m in compensation to roughly 950 workers from multiple countries.</p> <a href=\"https://www.theguardian.com/technology/2025/oct/06/amazon-workers-saudi-arabia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Outcry as Trump plots more roads and logging in US forests: ‘You can almost hear the chainsaws’",
      "link": "https://www.theguardian.com/us-news/2025/oct/06/trump-logging-forests",
      "pub_time_taipei": "2025-10-06T19:00:11+08:00",
      "summary": "<p>Critics say move to axe Bill Clinton’s ‘roadless rule’ that protected key old-growth forests will be devastating to environment</p><p>In 1999, Bill Clinton ascended one of the highest summits in Virginia to announce that “the last, best unprotected wild lands anywhere in our nation” would be shielded by a new rule that banned roads, drilling and other disturbances within America’s most prized forests.</p><p>But today, this site in George Washington national forest, along with other near-pristine forests across the US that amount to 58m acres, equivalent to the size of the UK, could soon see chainsaws whir and logging trucks rumble through them amid a push by Donald Trump to raze these ecosystems for timber.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/06/trump-logging-forests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Boom time for US billionaires: why the system perpetuates wealth inequality",
      "link": "https://www.theguardian.com/news/2025/oct/06/billionaire-class-us-inequality",
      "pub_time_taipei": "2025-10-06T19:00:11+08:00",
      "summary": "<p>As the super rich grow even richer, inequality expert Chuck Collins says the system is broken – but it can be fixed</p><p>To many Americans, the economy of the past five years has been rough. Prices have soared yet pay remains stagnant. High mortgage rates have made buying a home a dismal prospect. The unemployment rate has been creeping up.</p><p>Most people have <a href=\"https://www.theguardian.com/business/2025/may/12/americans-economy-trump-poll\">indicated</a> they’re delaying major life decisions, including having kids or switching jobs, because of the instability. But for a very small group of people, the last five years couldn’t have been any better.</p> <a href=\"https://www.theguardian.com/news/2025/oct/06/billionaire-class-us-inequality\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Aston Martin warns on profits amid US tariffs and seeks ‘proactive support’",
      "link": "https://www.theguardian.com/business/2025/oct/06/aston-martin-profit-trump-tariffs-us-jaguar-land-rover-cyber-attack",
      "pub_time_taipei": "2025-10-06T18:52:23+08:00",
      "summary": "<p>Carmaker blames weaker demand on Trump policies amid supply chain pressures after Jaguar Land Rover cyber-attack</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/06/yen-slumps-nikkei-record-sanae-takaichi-wins-election-gold-nears-4000-rally-continues-business-live-news\">Business live – latest updates</a></p></li></ul><p>Aston Martin has blamed Donald Trump’s tariffs for a profit warning, as the carmaker urged the UK government to offer more “proactive support”.</p><p>The company, which manufactures its cars in factories in Warwickshire and south Wales, downgraded its profit outlook on Monday for the <a href=\"https://www.theguardian.com/business/2025/jul/30/aston-martin-24-hour-scramble-lower-us-tariffs-pays-off\">second time this year</a>. It said that it now expects to make a larger loss than the £110m loss that was the lower end of its profit forecasts.</p> <a href=\"https://www.theguardian.com/business/2025/oct/06/aston-martin-profit-trump-tariffs-us-jaguar-land-rover-cyber-attack\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fianna Fáil’s Jim Gavin withdraws from Irish presidential race",
      "link": "https://www.theguardian.com/world/2025/oct/06/fianna-fail-jim-gavin-withdraws-ireland-presidential-election-race",
      "pub_time_taipei": "2025-10-06T18:15:42+08:00",
      "summary": "<p>Election becomes unpredictable two-horse contest after political novice quits over debt revelations</p><p>One of the three main candidates in Ireland’s presidential election has quit the race in a bombshell announcement that has <a href=\"https://www.theguardian.com/world/2025/sep/24/irish-presidential-candidates-confirmed-as-three-way-race-begins\">upended the contest</a>.</p><p>Fianna Fáil’s Jim Gavin withdrew on Sunday night after revelations about an unpaid debt to a former tenant, turning the election into an unpredictable two-horse race between a centre-right former government minister and an independent leftwing member of parliament.</p> <a href=\"https://www.theguardian.com/world/2025/oct/06/fianna-fail-jim-gavin-withdraws-ireland-presidential-election-race\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US to deport 11 more people to Eswatini in deal criticised by lawyers and NGOs",
      "link": "https://www.theguardian.com/world/2025/oct/06/us-deportees-eswatini-lawyers-ngos",
      "pub_time_taipei": "2025-10-06T18:08:47+08:00",
      "summary": "<p>African kingdom says migrants will be ‘kept in a secured area’ and returned to countries of origin, despite human rights concerns</p><p>Eswatini will receive 11 people deported by the US later this month, the government has said, the second group of third-country deportees to be sent to the southern African kingdom by the Trump administration in what lawyers and NGOs have described as violations of the migrants’ human rights.</p><p>A <a href=\"https://web.facebook.com/photo?fbid=1105283305128338&amp;set=a.222496890073655\">statement</a> by the Eswatini government posted on social media said: “The individuals will be kept in a secured area separate from the public, while arrangements are made for their return to their countries of origin.”</p> <a href=\"https://www.theguardian.com/world/2025/oct/06/us-deportees-eswatini-lawyers-ngos\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "A Venezuelan singer won asylum. ICE detained him for two more months.",
      "link": "https://www.washingtonpost.com/immigration/2025/10/03/asylum-venezuelan-singer-ice-detention/",
      "pub_time_taipei": "2025-10-06T18:00:18+08:00",
      "summary": "The singer known online as Davicito59 won his asylum case in July. Still, ICE kept him in custody for two more months — a holdup several experts called unlawful."
    },
    {
      "source": "衛報",
      "title": "US supreme court begins new term with nation’s democratic governance at stake",
      "link": "https://www.theguardian.com/us-news/2025/oct/06/us-supreme-court-new-term",
      "pub_time_taipei": "2025-10-06T18:00:08+08:00",
      "summary": "<p>Scrutiny on the nine justices is about to reach a new level of intensity as Trump aggressively asserts executive power</p><p>Context may be everything in the precedent-shattering era of the current US supreme court.</p><p>For several years – since conservatives, gained a six-three majority on the bench thanks to <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump’s</a> nominations during his first presidency – the court has been delivering transformative rulings that have reverberated across the social and political landscape.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/06/us-supreme-court-new-term\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jilly Cooper, author of Rivals and Riders, dies aged 88",
      "link": "https://www.theguardian.com/books/2025/oct/06/jilly-cooper-dies-riders-rivals",
      "pub_time_taipei": "2025-10-06T17:49:14+08:00",
      "summary": "<p>The author of 18 ‘bonkbuster’ novels including Riders, Rivals and Bella has died following a fall</p><p><a href=\"https://www.theguardian.com/global/2025/oct/06/share-your-tributes-and-memories-of-rivals-author-jilly-cooper\">Share your memories of Jilly Cooper</a></p><p>Jilly Cooper has died at the age of 88, her agent has confirmed.</p><p>The author, whose 18 novels include Riders and Rivals, “defined culture, writing and conversation since she was first published over 50 years ago,” said her agent Felicity Blunt. “You wouldn’t expect books categorised as bonkbusters to have so emphatically stood the test of time but Jilly wrote with acuity and insight about all things – class, sex, marriage, rivalry, grief and fertility.”</p> <a href=\"https://www.theguardian.com/books/2025/oct/06/jilly-cooper-dies-riders-rivals\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "VIP appearances, books and beer: what Valerie the dachshund is up to after her Kangaroo Island adventure",
      "link": "https://www.theguardian.com/australia-news/2025/oct/06/valerie-the-dachshund-kangaroo-island-lost-dog-vip-appearances",
      "pub_time_taipei": "2025-10-06T17:30:03+08:00",
      "summary": "<p>‘Australia’s bravest sausage dog’, who was lost in the wild for more than 500 days, now has an ambassadorial role, merchandise and an Australian Story episode</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>World-famous dachshund Valerie, who was lost in the wild for more than 500 days, now has merchandise, an ambassadorial role, a public relations representative and a spot on Australian Story.</p><p>In November 2023 Valerie’s owners, Georgia Gardner and Josh Fishlock, were visiting Kangaroo Island in South Australia with Valerie in tow. But she <a href=\"https://www.theguardian.com/australia-news/2025/mar/26/miniature-dachshund-valerie-lost-kangaroo-island-south-australia-found-alive\">escaped from her pen</a> and bolted.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/06/valerie-the-dachshund-kangaroo-island-lost-dog-vip-appearances\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Europe’s high quality of life is getting hard to afford. Just ask France.",
      "link": "https://www.washingtonpost.com/world/2025/10/06/europe-unaffordable-high-living-standards/",
      "pub_time_taipei": "2025-10-06T17:00:14+08:00",
      "summary": "The cost of Europe’s way of life — health care, affordable education and a dignified retirement for all, through high social spending — is becoming unbearably high."
    },
    {
      "source": "衛報",
      "title": "France’s PM resigns after less than a month amid widespread criticism of new cabinet",
      "link": "https://www.theguardian.com/world/2025/oct/06/france-pm-sebastien-lecornu-resigns",
      "pub_time_taipei": "2025-10-06T16:50:34+08:00",
      "summary": "<p>Sébastien Lecornu quits, blaming political “egos”, after Emmanuel Macron unveiled largely unchanged cabinet lineup</p><p>France’s political crisis has deepened after the new prime minister dramatically resigned within hours of appointing a government.</p><p>Sébastien Lecornu was the third French prime minister in a year, as the country continued to lurch from one political crisis to another. He quit hours before his first cabinet meeting on Monday afternoon. Macron accepted Lecornu’s resignation on Monday morning.</p> <a href=\"https://www.theguardian.com/world/2025/oct/06/france-pm-sebastien-lecornu-resigns\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mount Everest hikers describe ‘extreme’ conditions as huge rescue effort continues",
      "link": "https://www.theguardian.com/world/2025/oct/06/mount-everest-hikers-describe-extreme-conditions-as-huge-rescue-effort-continues",
      "pub_time_taipei": "2025-10-06T16:49:00+08:00",
      "summary": "<p>At least 200 people still stranded after unseasonally heavy snowfall during China’s Golden Week holiday</p><p>Trekkers have described facing “extreme” conditions after an unseasonable snowstorm during one of China’s busiest holiday weekends stranded hundreds of people on Mount Everest, prompting a massive rescue effort.</p><p>Chinese authorities said about 350 people had made their way down but at least 200 remained stranded at the Everest Scenic Area, to the east of the mountain, on the Tibetan side of the border.</p> <a href=\"https://www.theguardian.com/world/2025/oct/06/mount-everest-hikers-describe-extreme-conditions-as-huge-rescue-effort-continues\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Cause of Gold Coast mass fish kill unknown with marine heatwave most likely culprit, scientists say",
      "link": "https://www.theguardian.com/australia-news/2025/oct/06/cause-of-gold-coast-mass-fish-kill-unknown-with-marine-heatwave-most-likely-culprit-say-scientists",
      "pub_time_taipei": "2025-10-06T15:07:58+08:00",
      "summary": "<p>Local community group says whatever the cause ‘kids shouldn’t be in the water’ with dead fish</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shooting-sydney-anthony-albanese-sussan-ley-andrew-hastie-labor-liberal-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Queensland authorities are investigating the deaths of thousands of fish that washed up on a popular Gold Coast beach.</p><p>The state environment department said dead baitfish had been observed at The Spit, at the northern end of the Gold Coast since last Wednesday, but no obvious source of pollution had been found.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/06/cause-of-gold-coast-mass-fish-kill-unknown-with-marine-heatwave-most-likely-culprit-say-scientists\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Victorian DPP confirms it will appeal Erin Patterson’s sentence on the basis it ‘is manifestly inadequate’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shooting-sydney-anthony-albanese-sussan-ley-andrew-hastie-labor-liberal-ntwnfb",
      "pub_time_taipei": "2025-10-06T14:57:21+08:00",
      "summary": "<p>This blog is now closed.</p><p>An Australian has won an award at this year’s <a href=\"https://www.goldenspurtle.com/\">Golden Spurtle World Porridge Making Championship</a>.</p><p><strong>Caroline Velik</strong> was named Speciality Dish winner for her porridge jaffles – a yoghurt flatbread filled with rum bananas, made with her mother’s recipe, which included Bundaberg banana toffee rum liqueur, bananas, oatmeal and wattle seeds, tossed in Davidson plum sugar.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shooting-sydney-anthony-albanese-sussan-ley-andrew-hastie-labor-liberal-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Erin Patterson: prosecutors to appeal ‘manifestly inadequate’ sentence for triple murderer",
      "link": "https://www.theguardian.com/australia-news/2025/oct/06/erin-patterson-prosecutors-to-appeal-manifestively-inadequate-sentence-for-triple-murderer-ntwnfb",
      "pub_time_taipei": "2025-10-06T14:55:52+08:00",
      "summary": "<p>Victoria’s director of public prosecutions seeking longer prison sentence for mushroom murderer</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Victorian director of public prosecutions will appeal against the sentence handed down to triple murderer Erin Patterson, arguing it is manifestly inadequate.</p><p>On Monday afternoon – the deadline for an appeal – the DPP confirmed in a statement that the appeal had been lodged, after Patterson was sentenced to life imprisonment with a non-parole period of 33 years.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/06/erin-patterson-prosecutors-to-appeal-manifestively-inadequate-sentence-for-triple-murderer-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Deloitte to pay money back to Albanese government after using AI in $440,000 report",
      "link": "https://www.theguardian.com/australia-news/2025/oct/06/deloitte-to-pay-money-back-to-albanese-government-after-using-ai-in-440000-report",
      "pub_time_taipei": "2025-10-06T14:46:24+08:00",
      "summary": "<p>Partial refund to be issued after several errors were found in a report into a department’s compliance framework</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Deloitte will provide a partial refund to the federal government over a $440,000 report that contained several errors, after admitting it used generative artificial intelligence to help produce it.</p><p>The Department of Employment and Workplace Relations (DEWR) confirmed Deloitte would repay the final instalment under its contract, which will be made public after the transaction is finalised. It comes as one Labor senator accused the consultancy firm of having a “human intelligence problem”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/06/deloitte-to-pay-money-back-to-albanese-government-after-using-ai-in-440000-report\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: Typhoon Matmo batters southern China",
      "link": "https://www.theguardian.com/environment/2025/oct/06/weather-tracker-typhoon-matmo-batters-southern-china",
      "pub_time_taipei": "2025-10-06T14:42:06+08:00",
      "summary": "<p>About 350,000 flee homes as heavy rain and winds sweep region, while Hurricane Priscilla forms near Mexico</p><p>Typhoon Matmo made landfall on the southern coast of China on Sunday afternoon, shortly after sweeping across the island province of Hainan. The powerful storm forced the evacuation of about 350,000 people, bringing torrential rain and damaging winds, especially between Wuchuan in Guangdong and Wenchang in Hainan. Ferry services were suspended and flights cancelled at Haikou Meilan airport.</p><p>Matmo, the 21st typhoon of the year, had sustained wind speeds of 94mph (151km/h) and dumped more than 50mm of rainfall in six hours in Chongzou and Qinzhou. The city of Nanning also had high rainfall totals.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/06/weather-tracker-typhoon-matmo-batters-southern-china\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump urges negotiators to ‘move fast’ as Gaza ceasefire talks set to begin in Egypt",
      "link": "https://www.theguardian.com/world/2025/oct/05/israel-continues-gaza-bombardment-trump-plan-negotiators-arrive-in-cairo",
      "pub_time_taipei": "2025-10-06T13:31:51+08:00",
      "summary": "<p>Talks on Monday expected to focus on release of hostages and end to war, after Israel kills 63 people in Gaza in past day</p><p>Donald Trump has urged negotiators to “move fast” in talks focused on the release of hostages held by Hamas in Gaza and a broader end to the war, as representatives arrived in Egypt for discussions set to begin on Monday.</p><p>The talks will focus on the first phase of <a href=\"https://www.theguardian.com/us-news/2025/oct/05/how-likely-trump-gaza-plan-work\">Trump’s plan to end the war in Gaza</a>, the Egyptian foreign ministry said, which is the release of the remaining 48 hostages held by Hamas in return for Palestinian prisoners held in Israel.</p> <a href=\"https://www.theguardian.com/world/2025/oct/05/israel-continues-gaza-bombardment-trump-plan-negotiators-arrive-in-cairo\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza flotilla passengers allege poor conditions in detention as Israel prepares to deport dozens of activists",
      "link": "https://www.theguardian.com/world/2025/oct/06/gaza-flotilla-passengers-allege-poor-conditions-in-detention-as-israel-prepares-to-deport-dozens-of-activists",
      "pub_time_taipei": "2025-10-06T12:09:59+08:00",
      "summary": "<p>Families of some aboard the Global Sumud Flotilla say they are being held without access to clean water or legal representation</p><p>Activists from New Zealand detained in Israel after they were removed from vessels carrying aid to Gaza are being held in poor conditions without access to water and legal representation, their families have said, as dozens more passengers from the Global Sumud Flotilla were set to be deported.</p><p>Rana Hamida, Youssef Sammour and Samuel Leason were among 437 activists, parliamentarians and lawyers travelling aboard the flotilla, a coalition of more than 40 vessels carrying humanitarian aid whose goal was to breach Israel’s 16-year maritime blockade of <a href=\"https://www.theguardian.com/world/gaza\">Gaza</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/06/gaza-flotilla-passengers-allege-poor-conditions-in-detention-as-israel-prepares-to-deport-dozens-of-activists\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Louis CK defends decision to perform at Riyadh comedy festival as ‘a good opportunity’",
      "link": "https://www.theguardian.com/culture/2025/oct/06/louis-ck-defends-riyadh-comedy-festival-performance-good-opportunity",
      "pub_time_taipei": "2025-10-06T09:09:01+08:00",
      "summary": "<p>Comedian admits to mixed feelings but says event is a ‘positive thing’ despite human rights abuses in Saudi Arabia</p><p>Louis CK has defended his decision to perform at the <a href=\"https://variety.com/t/riyadh-comedy-festival/\">Riyadh comedy festival</a> in Saudi Arabia after <a href=\"https://www.theguardian.com/culture/2025/sep/30/riyadh-comedy-festival-saudi-arabia\">fellow comedians criticised the big names taking part</a> as whitewashing a regime guilty of human rights abuses.</p><p>Speaking on Real Time With Bill Maher, CK, who is co-headlining the festival with the British comedian Jimmy Carr on Monday night local time, said other comedians had been “really surprised” by the response from audiences in Riyadh so far.</p> <a href=\"https://www.theguardian.com/culture/2025/oct/06/louis-ck-defends-riyadh-comedy-festival-performance-good-opportunity\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Indonesia school collapse death toll reaches 54 as search for missing students continues",
      "link": "https://www.theguardian.com/world/2025/oct/06/indonesia-school-collapse-death-toll-rises-as-search-for-missing-students-continues",
      "pub_time_taipei": "2025-10-06T09:08:46+08:00",
      "summary": "<p>Excavators used to remove rubble while 14 people reportedly still unaccounted for and police allege building work was being carried out without a permit</p><p>Indonesian rescuers searching for missing students after a prayer hall at an <a href=\"https://www.theguardian.com/world/2025/oct/04/indonesian-school-collapse-death-toll-rises-to-14-as-crews-pull-more-bodies-from-rubble\">Islamic boarding school collapsed</a> last week recovered the bodies of dozens of students over the weekend, bringing the confirmed death toll to 54.</p><p>Using heavy excavators equipped with jackhammers, circular saws and sometimes their bare hands, <a href=\"https://www.theguardian.com/world/2025/oct/01/indonesia-school-collapse-rescue-search-update-al-khoziny-building-sidoarjo\">rescue teams removed tons of rubble</a> in an attempt to find the 14 students reportedly still missing. Rescuers found 35 bodies over the weekend alone, the National Disaster Mitigation Agency said.</p> <a href=\"https://www.theguardian.com/world/2025/oct/06/indonesia-school-collapse-death-toll-rises-as-search-for-missing-students-continues\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US struck another boat illegally carrying drugs off Venezuela coast, Trump says",
      "link": "https://www.theguardian.com/us-news/2025/oct/05/trump-drug-boat-strike-venezuela",
      "pub_time_taipei": "2025-10-06T06:12:18+08:00",
      "summary": "<p>President said US would turn attention to drug trafficking happening on land during speech at navy ceremony</p><p>US forces on Saturday evening struck another vessel illegally carrying drugs off the coast of <a href=\"https://www.theguardian.com/world/venezuela\">Venezuela</a>, <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> said on Sunday to thousands of sailors at a ceremony celebrating the US navy’s 250th anniversary. He added that the US would also start looking at drug trafficking happening on land.</p><p>Trump made the comment during a speech at Naval Station Norfolk in Virginia, next to the Harry S Truman aircraft carrier. It was not immediately clear if he was referencing a <a href=\"https://www.theguardian.com/us-news/2025/oct/03/hegseth-venezuela-deadly-boat-strike\">strike announced on Friday</a> by defense secretary Pete Hegseth.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/05/trump-drug-boat-strike-venezuela\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mount Everest rescue under way after snowstorm traps nearly 1,000 people",
      "link": "https://www.theguardian.com/world/2025/oct/05/mount-everest-rescue-underway-as-snowstorm-traps-nearly-1000-people",
      "pub_time_taipei": "2025-10-06T02:35:47+08:00",
      "summary": "<p>Hundreds of trekkers stranded by blizzard on eastern face of mountain in Tibet already guided to safety by rescuers</p><p>Rescue efforts are under way on Mount Everest after a snowstorm trapped nearly 1,000 people in campsites on the eastern side of the mountain, according to Chinese state media.</p><p>Hundreds of trekkers stranded by a blizzard near the eastern face of the mountain in Tibet were guided to safety by rescuers on Sunday, as unusually heavy precipitation including rain pummelled the Himalayas.</p> <a href=\"https://www.theguardian.com/world/2025/oct/05/mount-everest-rescue-underway-as-snowstorm-traps-nearly-1000-people\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "China threatened to retaliate against UK over foreign influence rules",
      "link": "https://www.theguardian.com/uk-news/2025/oct/05/china-threatened-to-retaliate-against-uk-over-foreign-influence-rules",
      "pub_time_taipei": "2025-10-06T02:23:51+08:00",
      "summary": "<p>Exclusive: Chinese officials warned that targeting its security apparatus would negatively affect relations</p><p>China threatened to retaliate against the UK government if ministers targeted parts of its security apparatus under foreign influence rules, the Guardian can disclose.</p><p>Chinese officials warned the Foreign Office that the move would have negative consequences for relations soon <a href=\"https://www.theguardian.com/uk-news/2025/apr/13/uk-could-target-parts-of-chinese-state-under-new-foreign-influence-rules\">after the Guardian reported it was under consideration</a>, according to two government sources with knowledge of the discussions.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/05/china-threatened-to-retaliate-against-uk-over-foreign-influence-rules\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Syria holds first elections since fall of Bashar al-Assad",
      "link": "https://www.theguardian.com/world/2025/oct/05/syria-holds-first-elections-since-fall-of-bashar-al-assad",
      "pub_time_taipei": "2025-10-06T01:30:32+08:00",
      "summary": "<p>After more than a decade of civil war, committee members will choose transitional parliament</p><p>Syria is holding its first parliamentary elections since the fall of its longtime ruler Bashar al-Assad, in a tentative step towards democratic polls that have been criticised as biased in favour of the country’s interim leaders.</p><p>As the battle-ravaged country moves through its post-Assad political transition after more than a decade of civil war, members of local committees are beginning the significant milestone of selecting a transitional parliament.</p> <a href=\"https://www.theguardian.com/world/2025/oct/05/syria-holds-first-elections-since-fall-of-bashar-al-assad\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russian air attack across Ukraine damages energy networks, kills five",
      "link": "https://www.washingtonpost.com/world/2025/10/05/ukraine-russia-energy-attack/",
      "pub_time_taipei": "2025-10-05T22:17:52+08:00",
      "summary": "The drone and missile assault hit nine regions and left tens of thousands without electricity as Russia ramps up its energy war ahead of winter in Ukraine."
    }
  ]
}