{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-31T20:40:06.387809+08:00",
  "window_end_taipei": "2025-11-01T20:40:06.387809+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "More than 50 child asylum seekers still missing after disappearing from Kent care",
      "link": "https://www.theguardian.com/uk-news/2025/nov/01/more-than-50-child-asylum-seekers-still-missing-after-disappearing-from-kent-care",
      "pub_time_taipei": "2025-11-01T20:00:35+08:00",
      "summary": "<p>Council data obtained by the Guardian shows 345 children have gone missing in recent years, many probably taken by traffickers</p><p>More than 50 lone child asylum seekers who disappeared soon after arriving in the UK and while in the care of the authorities are still missing, according to data obtained by the Guardian.</p><p>Many of the missing children arrived in small boats or hidden in the backs of lorries and are thought to have been taken by traffickers. Kent is often the place where they arrive.</p> <a href=\"https://www.theguardian.com/uk-news/2025/nov/01/more-than-50-child-asylum-seekers-still-missing-after-disappearing-from-kent-care\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "DeSantis accused of playing politics as Florida shatters executions record",
      "link": "https://www.theguardian.com/us-news/2025/nov/01/florida-death-penalty-ron-desantis",
      "pub_time_taipei": "2025-11-01T20:00:34+08:00",
      "summary": "<p>The state has killed 15 people this year with two more scheduled this month as death penalty in decline across US</p><p>Death penalty opponents have decried an unprecedented surge in executions ordered by Florida’s Republican governor, Ron DeSantis, after the state maintained a record pace with last week’s killing of a military veteran.</p><p>Norman Mearle Grim, who was convicted of the 1998 murder and rape of a neighbor, became the <a href=\"https://www.alligator.org/article/2025/10/florida-man-executed-for-1998-murder-and-sexual-battery-of-next-door-neighbor\">15th person put to death</a> this year, by lethal injection, at the Florida state prison in Starke on Wednesday.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/01/florida-death-penalty-ron-desantis\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Spain expresses regret over ‘injustice’ suffered by Mexico’s Indigenous people during conquest",
      "link": "https://www.theguardian.com/world/2025/nov/01/spain-expresses-regret-over-injustice-suffered-by-mexicos-indigenous-people-during-conquest",
      "pub_time_taipei": "2025-11-01T19:31:02+08:00",
      "summary": "<p>Acknowledgment shows shift in tone after six years of diplomatic spats over colonial-era abuses</p><p>Spain has acknowledged and expressed regret over the “pain and injustice” suffered by the Indigenous people of Mexico during its conquest of the Americas, heralding a shift in tone after six years of diplomatic spats over the abuses of the colonial period.</p><p>In March 2019, Mexico’s then president, <a href=\"https://www.theguardian.com/world/andres-manuel-lopez-obrador\">Andrés Manuel López Obrador</a> wrote to King Felipe VI and Pope Francis, who was then the leader of the world’s Roman Catholics, <a href=\"https://www.theguardian.com/world/2019/mar/25/mexico-demands-spain-apology-colonialism-obrador\">urging them to apologise</a> for the “massacres and oppression” of colonialism and the conquest.</p> <a href=\"https://www.theguardian.com/world/2025/nov/01/spain-expresses-regret-over-injustice-suffered-by-mexicos-indigenous-people-during-conquest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "HMRC likely to have breached privacy laws in stopping child benefit – experts",
      "link": "https://www.theguardian.com/politics/2025/nov/01/hmrc-likely-to-have-breached-privacy-laws-in-stopping-child-benefit-experts",
      "pub_time_taipei": "2025-11-01T19:00:34+08:00",
      "summary": "<p>Watchdog contacts tax authority after families’ payments stopped based on flawed travel data</p><p>Ministers may have breached privacy laws when they suspended the child benefit of thousands of families on the basis of flawed Home Office information, legal experts have said.</p><p>At the same time, the UK’s data watchdog, the Information Commissioner’s Office, has contacted the national tax authority, HMRC, over the issues raised.</p> <a href=\"https://www.theguardian.com/politics/2025/nov/01/hmrc-likely-to-have-breached-privacy-laws-in-stopping-child-benefit-experts\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "What the New York mayor’s race will reveal about the Democratic party",
      "link": "https://www.theguardian.com/us-news/2025/nov/01/new-york-mayoral-race-democratic-party",
      "pub_time_taipei": "2025-11-01T19:00:34+08:00",
      "summary": "<p>The political differences between the two main candidates could have major implications for next year’s midterms</p><p>New Yorkers will find out the identity of their next mayor on Tuesday, in a race that will decide who will run, and defend, the US’s largest city at a time when <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has threatened to send military troops there.</p><p>Against that backdrop, New York has seen a mayoral election that has pitted two very different Democrats against one another. The race has become an increasingly bitter face-off, laced with alleged racism and Islamophobia, but it is the political differences between the two main candidates that could have major implications for how the Democratic party performs in next year’s midterm elections.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/01/new-york-mayoral-race-democratic-party\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Reform councillor defects to Tories after party’s policies left him ‘uncomfortable’",
      "link": "https://www.theguardian.com/politics/2025/nov/01/reform-councillor-defects-to-tories-after-partys-policies-left-him-uncomfortable",
      "pub_time_taipei": "2025-11-01T18:13:35+08:00",
      "summary": "<p>Dartford representative James Buchan says ‘devastating’ immigration plans had created a lot of fear and anxiety</p><p>A Reform UK councillor has defected to the Conservatives, saying he became uncomfortable in Nigel Farage’s party.</p><p>James Buchan, who sits in the south-east London borough of Dartford, said he had struggled with the idea of facing his relatives while a member of a party whose anti-immigration policies spread fear.</p> <a href=\"https://www.theguardian.com/politics/2025/nov/01/reform-councillor-defects-to-tories-after-partys-policies-left-him-uncomfortable\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bridget Phillipson ‘ready to take on unions’ over year 8 reading tests",
      "link": "https://www.theguardian.com/politics/2025/nov/01/bridget-phillipson-unions-oppose-reading-tests-year-8s",
      "pub_time_taipei": "2025-11-01T17:00:29+08:00",
      "summary": "<p>Education secretary says mandatory test needed to tackle ‘shocking outcomes’ for many working-class children</p><p></p><p>Bridget Phillipson has said she is ready to take on the unions in a battle over compulsory reading tests for 13-year-olds and more extracurricular activities for all children to prevent them becoming “stuck in a doom loop of detachment” from school.</p><p>The education secretary said that teaching unions, who have argued the tests were “unnecessary and distracting”, should “really think carefully” about whether they could justify standing in the way of tackling the “shocking outcomes” that exist for many working-class children.</p> <a href=\"https://www.theguardian.com/politics/2025/nov/01/bridget-phillipson-unions-oppose-reading-tests-year-8s\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Families shot down, held at ransom as they flee Darfur’s killing fields",
      "link": "https://www.washingtonpost.com/world/2025/11/01/sudan-darfur-el-fashir-rsf-genocide/",
      "pub_time_taipei": "2025-11-01T17:00:02+08:00",
      "summary": "Sudan’s RSF paramilitary and its allies have carried out mass ethnic killings and hostage taking in the captured city of El Fashir, survivors told The Post."
    },
    {
      "source": "華盛頓郵報",
      "title": "These are the U.S. ships and aircraft massing off Venezuela",
      "link": "https://www.washingtonpost.com/world/2025/11/01/venezuela-us-militarty-aircraft-carrier-ships-strikes-caribbean-trump-maduro/",
      "pub_time_taipei": "2025-11-01T16:00:39+08:00",
      "summary": "The large-scale buildup of U.S. military forces and assets in the Caribbean suggests that the Trump administration is preparing to expand operations."
    },
    {
      "source": "衛報",
      "title": "Britain’s canals and rivers face lack of funds amid climate pressures, campaigners warn",
      "link": "https://www.theguardian.com/environment/2025/nov/01/britain-canals-rivers-funding-climate-campaign",
      "pub_time_taipei": "2025-11-01T16:00:29+08:00",
      "summary": "<p>Many waterways vulnerable to breaches and closures and face mounting maintenance costs, charity says</p><p>Britain’s network of canals and rivers is under strain from funding shortfalls and growing climate pressures, campaigners warn.</p><p>Three-quarters of the country’s waterways face financial peril, according to the Inland Waterways Association (IWA), an independent charity advocating for Britain’s canals and rivers, as the country braces for heavier winter rainfall and intensifying summer droughts.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/01/britain-canals-rivers-funding-climate-campaign\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Britain’s 300-year tradition of wearing wigs in court gets a trim",
      "link": "https://www.washingtonpost.com/world/2025/11/01/britain-courtroom-wigs-lawyers-tradition/",
      "pub_time_taipei": "2025-11-01T16:00:09+08:00",
      "summary": "Updated guidelines allow lawyers to dispense with the curly horsehair wigs, while traditionalists fear a loss of courtroom decorum."
    },
    {
      "source": "華盛頓郵報",
      "title": "Maduro braces for a U.S. attack; Venezuelans worry more about dinner",
      "link": "https://www.washingtonpost.com/world/2025/11/01/maduro-venezuela-attack-economy/",
      "pub_time_taipei": "2025-11-01T16:00:00+08:00",
      "summary": "The government is urging civilians to prepare for the worst. Ordinary Venezuelans say they have more pressing concerns."
    },
    {
      "source": "華盛頓郵報",
      "title": "Tanzania’s President Hassan wins disputed election amid deadly protests",
      "link": "https://www.washingtonpost.com/world/2025/10/31/tanzania-election-protests-dead-injured/",
      "pub_time_taipei": "2025-11-01T15:04:29+08:00",
      "summary": "Rights groups warned of growing violence against demonstrators after the election in which the country’s president barred her two main opponents from running."
    },
    {
      "source": "衛報",
      "title": "UN expert urged to investigate Lebanon over alleged torture of Egyptian-Turkish poet",
      "link": "https://www.theguardian.com/world/2025/nov/01/un-torture-expert-investigate-lebanon-egyptian-turkish-poet",
      "pub_time_taipei": "2025-11-01T15:00:32+08:00",
      "summary": "<p>Abdulrahman al-Qaradawi has been imprisoned in the UAE for almost a year for criticising Emirati, Egyptian and Saudi governments</p><p>The UN special rapporteur on torture is being urged to investigate Lebanon’s role in the treatment of the Egyptian-Turkish poet and activist Abdulrahman al-Qaradawi, a dissident who has been imprisoned in the United Arab Emirates for more than 10 months over a post he made on social media.</p><p>Legal counsel representing Qaradawi filed a complaint to the UN rapporteur on Thursday, asking it to examine the situation.</p> <a href=\"https://www.theguardian.com/world/2025/nov/01/un-torture-expert-investigate-lebanon-egyptian-turkish-poet\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tanzania’s Hassan declared landslide winner in election that triggered violent protests",
      "link": "https://www.theguardian.com/world/2025/nov/01/tanzanias-hassan-declared-landslide-winner-in-election-that-triggered-violent-protests",
      "pub_time_taipei": "2025-11-01T14:51:37+08:00",
      "summary": "<p>The result hands Hassan, who took power in 2021, a five-year term following opposition repression</p><p>Tanzania’s president, Samia Suluhu Hassan, has been declared the winner of the country’s disputed election with more than 97% of the vote following violent protests across the country earlier in the week.</p><p>The landslide result announced by Tanzania’s electoral commission hands Hassan, who took power in 2021 after the death in office of her predecessor, a five-year term to govern the east African country of 68 million people.</p> <a href=\"https://www.theguardian.com/world/2025/nov/01/tanzanias-hassan-declared-landslide-winner-in-election-that-triggered-violent-protests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Reform UK, the Russian spy and rolls of Kremlin cash: the inside story of Nathan Gill",
      "link": "https://www.theguardian.com/news/ng-interactive/2025/nov/01/reform-a-russian-spy-and-the-bribes-the-inside-story-of-nathan-gill",
      "pub_time_taipei": "2025-11-01T14:00:28+08:00",
      "summary": "<p>How did a former Mormon bishop end up pleading guilty to taking bribes to make statements in favour of Russia in the European parliament?</p><p>The first thing most people recall about Nathan Gill is his imposing height.</p><p>At 193cm (6ft 4in), the one-time Reform UK leader in Wales towered over colleagues and opponents – and he was taller still in his favourite cowboy boots.</p> <a href=\"https://www.theguardian.com/news/ng-interactive/2025/nov/01/reform-a-russian-spy-and-the-bribes-the-inside-story-of-nathan-gill\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "What we know about the Poseidon, Russia’s new super torpedo",
      "link": "https://www.washingtonpost.com/world/2025/11/01/russia-poseidon-skyfall-super-torpedo-tsunami/",
      "pub_time_taipei": "2025-11-01T14:00:21+08:00",
      "summary": "Poseidon is part of Russia’s line up of “super weapons” meant to gain military parity with the West and it can supposedly drown coastal cities."
    },
    {
      "source": "衛報",
      "title": "Luxury cruise cancelled after 80-year-old left behind on Lizard Island dies alone",
      "link": "https://www.theguardian.com/australia-news/2025/nov/01/luxury-cruise-cancelled-after-80-year-old-left-behind-on-lizard-island-dies-alone",
      "pub_time_taipei": "2025-11-01T13:49:19+08:00",
      "summary": "<p>The Coral Adventurer will return to Cairns, as investigations into Suzanne Rees’ death continue</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/31/suzanne-rees-lizard-island-death-cruise-ship-coral-adventurer\">How luxury cruise ship passenger Suzanne Rees was left to die alone on Lizard island</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p></p><p>The luxury Coral Adventurer cruise has been cancelled in the wake of the death of passenger Suzanne Rees, who was left on the Great Barrier Reef’s Lizard Island and wasn’t found until the next day.</p><p>It will now return to Cairns, as investigations into Rees’ death continue.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/01/luxury-cruise-cancelled-after-80-year-old-left-behind-on-lizard-island-dies-alone\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather bureau warns of hail, flash floods and tornadoes as storms hit Queensland and northern NSW",
      "link": "https://www.theguardian.com/australia-news/2025/nov/01/weather-bureau-warns-of-hail-flash-floods-and-tornadoes-as-storms-hit-queensland-and-northern-nsw",
      "pub_time_taipei": "2025-11-01T13:05:07+08:00",
      "summary": "<p>Bureau of Meteorology says band of severe thunderstorms bearing down on Australia’s east coast</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Destructive winds, giant hail, flash floods and tornadoes could wreak havoc on southern Queensland and northern New South Wales, the Bureau of Meteorology has warned.</p><p>A major band of severe thunderstorms was bearing down on Australia’s east coast on Saturday, senior BoM forecaster Angus Hines said.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/01/weather-bureau-warns-of-hail-flash-floods-and-tornadoes-as-storms-hit-queensland-and-northern-nsw\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gumnuts, baby! How two abseiling horticulturalists rescued specimens from an endangered tree",
      "link": "https://www.theguardian.com/environment/2025/nov/01/gumnuts-baby-how-two-abseiling-horticulturalists-rescued-specimens-from-an-endangered-tree",
      "pub_time_taipei": "2025-11-01T12:00:23+08:00",
      "summary": "<p>The threatened Jillaga Ash (<em>Eucalyptus stenostoma</em>) was spotted 90m down a cliff in Wadbilliga national park, in southern New South Wales</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Two horticulturalists have undertaken a daring abseiling mission to rescue gumnuts from an endangered tree on a 300m cliff face.</p><p>Stan Wawrzyczek, a threatened flora ecologist at the Threatened Species Conservancy, spotted an endangered tree, <em>Eucalyptus stenostoma</em> (Jillaga Ash), 90m down the cliff in Wadbilliga national park in southern New South Wales.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/01/gumnuts-baby-how-two-abseiling-horticulturalists-rescued-specimens-from-an-endangered-tree\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nationals members vote to ditch net zero target from party platform",
      "link": "https://www.theguardian.com/australia-news/2025/nov/01/nationals-members-vote-to-ditch-net-zero-target-from-party-platform",
      "pub_time_taipei": "2025-11-01T10:45:15+08:00",
      "summary": "<p>Policy position diverging from senior Coalition partner expected to be formalised at Nationals partyroom meeting on Sunday morning</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Nationals’ grassroots members have voted to ditch net zero, setting the scene to formally scrap the target at a meeting on Sunday morning.</p><p>“We believe in reducing emissions, but not at any cost,” the Nationals leader, David Littleproud, told the party’s federal council on Saturday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/01/nationals-members-vote-to-ditch-net-zero-target-from-party-platform\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump administration blocked from suspending Snap benefits for millions of Americans",
      "link": "https://www.theguardian.com/us-news/2025/oct/31/judge-blocks-trump-snap-suspension",
      "pub_time_taipei": "2025-11-01T07:08:36+08:00",
      "summary": "<p>One judge issued temporary restraining order while another judge ruled the government must continue to fund program that helps low-income households</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates\">US politics live – latest updates</a></p></li></ul><p>Two federal judges issued back-to-back rulings on Friday in separate cases ordering the Trump administration to use contingency funds to continue paying for food stamps during the government shutdown.</p><p>A federal judge in <a href=\"https://www.theguardian.com/us-news/rhode-island\">Rhode Island</a> on Friday afternoon blocked the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> from suspending all food aid for millions of Americans, in a case brought by a group of US cities, non-profit organizations and a trade union.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/31/judge-blocks-trump-snap-suspension\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pro-Israel activist suing Sydney restaurant claims he was shunned and vilified after News Corp stunt",
      "link": "https://www.theguardian.com/australia-news/2025/nov/01/pro-israel-activist-suing-sydney-restaurant-claims-he-was-shunned-and-vilified-after-news-corp-stunt",
      "pub_time_taipei": "2025-11-01T07:00:19+08:00",
      "summary": "<p>Ofir Birenbaum is suing for defamation after deleted and retracted social media posts by Cairo Takeaway inferred he visited the restaurant with reporters to ‘stir up controversy’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A pro-Israel activist who visited a pro-Palestinian Sydney restaurant with News Corp reporters claims he was vilified and subject to an investigation by his employer after the restaurant allegedly implied he attempted to manufacture an “antisemitic incident”.</p><p>Ofir Birenbaum went to Cairo Takeaway, a popular restaurant in Sydney’s Newtown, in February wearing a Star of David cap and necklace alongside reporters from the Daily Telegraph. The undercover operation, <a href=\"https://www.theguardian.com/media/commentisfree/2025/feb/28/daily-telegraph-takes-action-after-mind-blowingly-stupid-stunt-by-tracking-down-leaker-ntwnfb\">later revealed to be dubbed internally by the paper as “undercover Jew”</a>, made international headlines after it backfired.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/01/pro-israel-activist-suing-sydney-restaurant-claims-he-was-shunned-and-vilified-after-news-corp-stunt\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Judge rules Trump can’t require citizenship proof on federal voting form – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
      "pub_time_taipei": "2025-11-01T05:54:21+08:00",
      "summary": "<ul><li><p>This live blog is now closed.</p></li></ul><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/31/trump-administration-news-updates-today\">Trump news at a glance: Friday rulings hamper administration on food stamps, voting access</a></p></li></ul><p>US House Speaker Mike Johnson reiterated this morning that he will not bring the chamber back into session until the government shutdown ends.</p><p><a href=\"https://bsky.app/profile/atrupar.com/post/3m4iico77ou2p\">Speaking </a>to Fox News on Friday, Johnson said: “We are anxious to get the house back to regular legislative session, but we have to get the lights turned back on. Chuck Schumer and the Democrats in the Senate have got to reopen the government. Again, it’s the most fundamental responsibility of congress is to have the government operate and work for the people. That’s the number one priority right now and we cannot deviate from that.”</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Maine mother whose daughter died of leukemia wins $25m in wrongful death suit",
      "link": "https://www.theguardian.com/us-news/2025/oct/31/maine-mother-daughter-wrongful-death-lawsuit",
      "pub_time_taipei": "2025-11-01T05:27:10+08:00",
      "summary": "<p>Verdict delivered in favor of Lyndsey Sutherland over death of daughter ‘Jazzy’ after doctors failed to identify condition</p><p>A civil jury in <a href=\"https://www.theguardian.com/us-news/maine\">Maine</a> has awarded $25m to a woman whose teenage daughter died from leukemia after being misdiagnosed with a condition linked to steroid-using men.</p><p>The hefty verdict delivered in favor of Lyndsey Sutherland on Thursday called for her to receive $10m for the wrongful 2021 death of 15-year-old Jasmine “Jazzy” Vincent as well as $15m for pain and suffering, said her attorney, Meryl Poulin.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/31/maine-mother-daughter-wrongful-death-lawsuit\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN approves resolution supporting Morocco’s claim to Western Sahara",
      "link": "https://www.theguardian.com/world/2025/oct/31/un-approves-resolution-supporting-moroccos-claim-to-western-sahara",
      "pub_time_taipei": "2025-11-01T05:26:07+08:00",
      "summary": "<p>Move is strongest endorsement yet for retained rule over disputed territory, despite fierce opposition from Algeria</p><p>The UN security council has approved a US-backed resolution supporting Morocco’s claim to the disputed Western Sahara, despite fierce opposition from Algeria.</p><p>Although Friday’s vote was divided, the resolution offers the strongest endorsement yet for Morocco’s plan to keep sovereignty over the territory, which also has backing from most European Union members and a growing number of African allies.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/un-approves-resolution-supporting-moroccos-claim-to-western-sahara\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russia link suspected as Bulgarians jailed for vandalising Paris Jewish memorial",
      "link": "https://www.theguardian.com/world/2025/oct/31/russia-link-suspected-as-bulgarians-jailed-for-vandalising-paris-jewish-memorial",
      "pub_time_taipei": "2025-11-01T05:04:44+08:00",
      "summary": "<p>Four men given prison terms for desecration that was possibly ‘orchestrated by Russian intelligence services’</p><p>A French court on Friday jailed four Bulgarians for desecrating a Jewish memorial with red handprints last year, in what prosecutors think may have been foreign interference linked to Russia.</p><p>The Paris criminal court gave two-year sentences to Georgi Filipov and Kiril Milushev, described as the perpetrators, and four years and three years respectively to Nikolay Ivanov and Mircho Angelov, considered the operation’s “masterminds”. Angelov is still at large.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/russia-link-suspected-as-bulgarians-jailed-for-vandalising-paris-jewish-memorial\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Five times the British royal family has been ruthless with its own",
      "link": "https://www.washingtonpost.com/world/2025/10/31/britain-royal-family-ruthless-prince-andrew/",
      "pub_time_taipei": "2025-11-01T02:27:10+08:00",
      "summary": "The royal family can move quite swiftly against its members if it feels under threat."
    },
    {
      "source": "衛報",
      "title": "Nexperia halts chip supplies to China in threat to global car production",
      "link": "https://www.theguardian.com/business/2025/oct/31/nexperia-halts-chip-supples-china-threat-car-production",
      "pub_time_taipei": "2025-11-01T02:20:25+08:00",
      "summary": "<p>Dutch-controlled company informs customers about suspension but is said to want to de-escalate trade war</p><p>Nexperia, the EU-based automotive chipmaker at the centre of a geopolitical dispute, has suspended supplies to its Chinese factory, stepping up a <a href=\"https://www.theguardian.com/business/2025/oct/29/europe-carmakers-china-computer-chip\">trade war that threatens to halt production</a> at carmakers around the world.</p><p>The company wrote to customers this week informing them all supplies to a Chinese plant had been suspended.</p> <a href=\"https://www.theguardian.com/business/2025/oct/31/nexperia-halts-chip-supples-china-threat-car-production\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As U.S. ramps up pressure, Venezuela pleads with Moscow and Beijing for help",
      "link": "https://www.washingtonpost.com/world/2025/10/31/russia-venezuela-oil-trump/",
      "pub_time_taipei": "2025-11-01T02:16:37+08:00",
      "summary": "Documents show Venezuela’s Nicolás Maduro drafted a letter asking Russia for missiles, radars and upgraded aircraft as U.S. forces amass in the Caribbean."
    },
    {
      "source": "衛報",
      "title": "‘How do you rebuild all this?’ Black River residents assess damage after Hurricane Melissa",
      "link": "https://www.theguardian.com/world/2025/oct/31/black-river-jamaica-residents-assess-damage-after-hurricane-melissa",
      "pub_time_taipei": "2025-11-01T01:59:01+08:00",
      "summary": "<p>People of Jamaican coastal town described as storm’s ground zero are traumatised and desperate for help</p><p>It is a treacherous journey to Black River, a coastal town in Jamaica’s southwestern parish of St Elizabeth, which this week bore the brunt of Hurricane Melissa, one of the strongest Atlantic hurricanes on record.</p><p>Uprooted trees and lamp-posts, rubble from landslides, huge potholes and miles of thick, slippery silt from severe flooding have turned the route into a dangerous obstacle course.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/black-river-jamaica-residents-assess-damage-after-hurricane-melissa\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sudan’s RSF accused of ‘PR stunt’ after arresting fighters behind civilian killings",
      "link": "https://www.theguardian.com/world/2025/oct/31/sudan-rsf-accused-pr-stunt-after-arresting-fighters-behind-civilian-killings",
      "pub_time_taipei": "2025-11-01T01:17:23+08:00",
      "summary": "<p>Reports of indiscriminate violence and ethnic targeting in El Fasher have led to growing global outrage</p><p>Sudan’s paramilitary Rapid Support Forces claim to have arrested several of their fighters after outrage over the <a href=\"https://www.theguardian.com/global-development/2025/oct/30/they-killed-civilians-in-their-beds-chaos-and-brutality-reign-after-fall-of-el-fasher\">extent of killing in the city of El Fasher</a> continues to build.</p><p>But the paramilitary group’s move has been greeted with scepticism from human rights campaigners and Sudanese people, who see it as an attempt to temper criticism over the violence.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/sudan-rsf-accused-pr-stunt-after-arresting-fighters-behind-civilian-killings\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Madrid regional government co-funding Woody Allen’s new film – but it must feature ‘Madrid’ in the title",
      "link": "https://www.theguardian.com/film/2025/oct/31/spanish-government-co-funding-woody-allen-new-film-madrid-title",
      "pub_time_taipei": "2025-11-01T00:09:54+08:00",
      "summary": "<p>Regional authority is investing €1.5m in the project but has stipulations about featuring ‘identifiable locations’ on screen and the film premiering at an international film festival</p><p>The Madrid regional government is hoping to harness the power of film tourism by investing €1.5m (£1.3m) in a new Woody Allen movie that will be shot in and around the Spanish capital and which will be contractually obliged to feature the word “Madrid” in its title.</p><p>Regional authorities are confident the 89-year-old film-maker’s next project could do for Madrid what Roman Holiday did for Rome tourism in the early 1950s, and what Sex and the City and Emily in Paris have more recently done to increase visitor numbers to New York and the French capital.</p> <a href=\"https://www.theguardian.com/film/2025/oct/31/spanish-government-co-funding-woody-allen-new-film-madrid-title\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "D66 has shown the world populists can be beaten, says Jetten, as party is projected to win Dutch election – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates",
      "pub_time_taipei": "2025-11-01T00:07:54+08:00",
      "summary": "<p>This blog has now closed. <a href=\"https://www.theguardian.com/world/europe-news\">You can see the rest of our Europe coverage here</a></p><p>The ANP news agency offered <strong>a bit more colour on how they reached their conclusion</strong>, via <a href=\"https://www.telegraaf.nl/binnenland/d66-wint-verkiezingen-partij-van-rob-jetten-niet-meer-in-te-halen-door-pvv/101551173.html\">De Telegraaf.</a></p><p>The agency looked at various scenarios of what could happen with the outstanding votes – in Venray and from overseas postal voters – and concluded that, accounting for historical patterns, the PVV could no longer catch up D66, which currently leads by just over 15,000 votes.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Dutch voters deliver rebuke to the far right in knife-edge election",
      "link": "https://www.washingtonpost.com/world/2025/10/30/netherlands-election-results-geert-wilders-rob-jetten/",
      "pub_time_taipei": "2025-10-31T23:45:04+08:00",
      "summary": "The centrist D66 party nearly tripled its seats, while Geert Wilders’s right-wing party suffered a drop from its shocking first-place finish in 2023."
    },
    {
      "source": "衛報",
      "title": "Bonus episode: Searching for the spirit of Pan-Africanism – podcast",
      "link": "https://www.theguardian.com/news/audio/2025/oct/31/searching-for-the-spirit-of-pan-africanism-podcast-bonus-episode",
      "pub_time_taipei": "2025-10-31T23:08:48+08:00",
      "summary": "<p>In this bonus episode, the Guardian journalist Chris Osuh explores whether we are living through a Pan-African moment 80 years on from Manchester’s groundbreaking 1945 Pan-African Congress</p><ul><li><p><a href=\"https://www.theguardian.com/news/2025/oct/31/80-years-pan-african-congress-manchester-black-history\">‘A sense of freedom’: 80 years on from the Pan-African Congress in Manchester</a></p></li></ul><p>In this bonus episode, the Guardian journalist Chris Osuh looks at the idea of Pan-Africanism in 2025 – the belief that all Black people, whether on the continent or in the diaspora, are united in a shared struggle for liberation.</p><p>As Manchester gears up to celebrate the 80th anniversary of the landmark 1945 Pan-African Congress, Chris speaks to <strong>Ntombizodwa Nyoni</strong>, the writer of the play Liberation that recently brought the event back to life. The pair discusses how congress delegates drove the wave of the African independence movements that followed, the parallels between 1945 and 2025, and what Pan-African activists today can learn from the experiences of those at the talks.</p> <a href=\"https://www.theguardian.com/news/audio/2025/oct/31/searching-for-the-spirit-of-pan-africanism-podcast-bonus-episode\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Liberal-progressive party D66 wins election, Dutch media report",
      "link": "https://www.theguardian.com/world/2025/oct/31/netherlands-election-d66-rob-jetten-politics",
      "pub_time_taipei": "2025-10-31T23:05:40+08:00",
      "summary": "<p>Party will take lead in first round of talks to form coalition government after securing most votes</p><p>The Dutch liberal-progressive party D66 won the most votes in Wednesday’s general election, the news agency ANP has reported, putting its 38-year-old leader, Rob Jetten, on course to become the youngest prime minister in the Netherlands.</p><p>While the last few thousand votes are still being counted, Dutch media reported on Friday that Geert Wilders’ anti-immigration, anti-Islam Party for Freedom (PVV) could no longer win.</p> <a href=\"https://www.theguardian.com/world/2025/oct/31/netherlands-election-d66-rob-jetten-politics\">Continue reading...</a>"
    }
  ]
}