{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-06T20:40:05.569083+08:00",
  "window_end_taipei": "2025-09-07T20:40:05.569083+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Cod digits and striped equids: new book celebrates media staple ‘the second mention’",
      "link": "https://www.theguardian.com/media/2025/sep/07/cod-digits-and-striped-equids-new-book-celebrates-media-staple-the-second-mention",
      "pub_time_taipei": "2025-09-07T20:00:21+08:00",
      "summary": "<p>Married monographers have collated sometimes absurd word choices through which journalists avoid repetition</p><p>What would you do with “cod digits”? Can you identify a “monochrome mammal”? And what on earth is an “unfortunate ungulate”? They are all attempts by journalists – either elegant or absurd, depending on your outlook – to avoid repeating a noun already featured in an article. In the cases above, they are genuine journalistic attempts to describe fish fingers, a panda and a sheep stuck in a car.</p><p>Spotting examples of eye-catching “second mentions” became a hobby for couple Juliet and Matthew Maguire. They began collecting examples after Juliet encountered them during her journalism training. Their interest grew into a social media account, which became a lively exchange of the distinctive descriptors.</p> <a href=\"https://www.theguardian.com/media/2025/sep/07/cod-digits-and-striped-equids-new-book-celebrates-media-staple-the-second-mention\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Blackwater founder and Maga disciple Erik Prince pitching services in Ukraine",
      "link": "https://www.theguardian.com/world/2025/sep/07/erik-prince-blackwater-ukraine",
      "pub_time_taipei": "2025-09-07T20:00:20+08:00",
      "summary": "<p>Sources say Prince, whose firm’s contractors committed 2007 Iraq massacre, eager to get into valuable drone sector</p><p>Amid reports that Donald Trump’s administration is considering using US private military contractors in <a href=\"https://www.kyivpost.com/post/59188\">a postwar Ukraine</a>, multiple sources tell the Guardian one high-profile and controversial American from the “war on terror” era is already circling for business.</p><p>In the streets of Kyiv, military hawks and defense privateers have described how <a href=\"https://www.theguardian.com/us-news/2025/mar/16/erik-prince-trump-immigration-enforcement\">Erik Prince</a>, Maga disciple and founder of the now-defunct mercenary company Blackwater, has been aggressively pitching his services and looking to buy.</p> <a href=\"https://www.theguardian.com/world/2025/sep/07/erik-prince-blackwater-ukraine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Texas attorney general wants students to pray in school – unless they’re Muslim",
      "link": "https://www.theguardian.com/us-news/2025/sep/07/texas-ken-paxton-christians-muslims",
      "pub_time_taipei": "2025-09-07T20:00:20+08:00",
      "summary": "<p>Ken Paxton, who is running for US Senate, is urging schools to say the Lord’s Prayer as a Republican law goes into effect</p><p>Ken Paxton, the Texas attorney general running for US Senate, has long believed in school prayer. Now, he’s prescribing precisely what type of prayer he wants the state’s 6 million public school students to recite.</p><p>“In Texas classrooms, we want the Word of God opened, the Ten Commandments displayed, and prayers lifted up,” Paxton said in a <a href=\"https://www.oag.state.tx.us/news/releases/attorney-general-ken-paxton-encourages-texas-schools-begin-legal-process-putting-prayer-back#:~:text=Attorney%20General%20Ken%20Paxton%20encourages%20all%20Texas%20schools%20to%20implement,11%20on%20September%201%2C%202025\">statement </a>on Tuesday, encouraging students to say “the Lord’s Prayer, as taught by Jesus Christ”.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/07/texas-ken-paxton-christians-muslims\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labour is dead, says Zarah Sultana as she calls for patience over party launch",
      "link": "https://www.theguardian.com/politics/2025/sep/07/labour-is-dead-zarah-sultana-your-party-launch",
      "pub_time_taipei": "2025-09-07T19:49:11+08:00",
      "summary": "<p>Co-leader of nascent leftwing party says more than 750,000 people have registered their interest</p><p>“Labour is dead” after failing to deliver for working people, Zarah Sultana said as she urged supporters of a new leftwing party she is creating to be patient and “watch this space”.</p><p>Sultana, the independent MP for Coventry South who <a href=\"https://www.theguardian.com/politics/2025/jul/03/jeremy-corbyn-hints-at-launch-of-new-party-as-leftwing-alternative-to-labour\">quit Labour</a> after losing the whip for backing a move to scrap the two-child benefit cap, is co-leader of a nascent party with Jeremy Corbyn.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/07/labour-is-dead-zarah-sultana-your-party-launch\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Andy Burnham says government needs ‘reset’ to become more decisive",
      "link": "https://www.theguardian.com/politics/2025/sep/07/andy-burnham-says-government-needs-reset-to-become-more-decisive",
      "pub_time_taipei": "2025-09-07T19:43:16+08:00",
      "summary": "<p>Greater Manchester mayor also suggests the cabinet needs to more ‘pluralistic’ and less London-centric</p><p>The Labour government needs a reset to become more decisive and listen more to its MPs, Andy Burnham, the Greater Manchester mayor and former cabinet minister, has said.</p><p>Burnham, who is touted as a potential future leader, said he was concerned about the balance of the cabinet after the reshuffle and wanted the government to be more “pluralistic”.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/07/andy-burnham-says-government-needs-reset-to-become-more-decisive\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Farage rows back on promise to stop small boats within two weeks if he becomes PM – as it happened",
      "link": "https://www.theguardian.com/politics/live/2025/sep/07/latest-live-uk-politics-news-updates-keir-starmer-labour-nigel-farage-kemi-badenoch-angela-rayner-updates",
      "pub_time_taipei": "2025-09-07T19:29:34+08:00",
      "summary": "<p>Reform UK leader clarifies that, if he wins election, he will have to wait until law passed to deport people more quickly, which could take months. This live blog is closed</p><ul><li><p><a href=\"https://www.theguardian.com/politics/2025/sep/07/military-sites-house-asylum-seekers-labour\">Military sites may be used to house asylum seekers</a></p></li></ul><p><strong>Zack Polanski</strong> spoke to the Guardian’s senior political correspondent, <a href=\"https://www.theguardian.com/profile/peterwalker\">Peter Walker</a>, following his victory. Here is some of <a href=\"https://www.theguardian.com/politics/2025/sep/03/green-party-leader-zack-polanski-distances-corbyn-electoral-pact\">the write up of the interview</a>:</p><p>Asked if the Greens might hypothetically stand down candidates in a pact with the new party, he said: “It’s not my starting point, because at the moment I’m not quite sure what Zarah Sultana’s and Jeremy Corbyn’s platform is going to be.”</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/07/latest-live-uk-politics-news-updates-keir-starmer-labour-nigel-farage-kemi-badenoch-angela-rayner-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Japanese leader Ishiba announces resignation after electoral defeats",
      "link": "https://www.washingtonpost.com/world/2025/09/07/shigeru-ishiba-japan-resignation/",
      "pub_time_taipei": "2025-09-07T19:21:14+08:00",
      "summary": "Shigeru Ishiba’s move comes after his Liberal Democratic Party lost two elections, exacerbating an unusual period of political uncertainty in Japan."
    },
    {
      "source": "衛報",
      "title": "‘No outreach’ to Epstein victims despite Trump’s vow to investigate, lawyers say",
      "link": "https://www.theguardian.com/us-news/2025/sep/07/epstein-files-survivors-trump-justice-department",
      "pub_time_taipei": "2025-09-07T19:00:19+08:00",
      "summary": "<p>Nine attorneys tell Guardian they have not been contacted by justice department – state of affairs they call ‘atrocious’</p><p>For more than six months, <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> and his justice department have insisted they would get to the bottom of <a href=\"https://www.theguardian.com/us-news/jeffrey-epstein\">Jeffrey Epstein</a>’s crimes, but nine attorneys – who have represented approximately 50 Epstein survivors – told the Guardian they have not been recently contacted by the justice department.</p><p>The revelation casts doubt on the effort by the Trump administration to fully investigate Epstein’s crimes and activities and reveal everything that the government knows about him. It comes as Trump faces intense political pressure, including from his own base, over his social ties to Epstein, who was famed for courting rich and powerful figures into his circle.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/07/epstein-files-survivors-trump-justice-department\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Carlo Acutis, ‘God’s influencer’ who died aged 15, declared a saint by Pope Leo",
      "link": "https://www.theguardian.com/world/2025/sep/07/pope-leo-xiv-declares-15-year-old-computer-whiz-carlo-acutis-gods-influencer-saint",
      "pub_time_taipei": "2025-09-07T18:30:53+08:00",
      "summary": "<p>London-born Italian, who died in 2006, built websites to spread Catholic teaching and is credited with two miracles</p><p>Pope Leo XIV has declared the London-born Italian Carlo Acutis, who died in 2006 age 15, the Catholic church’s first millennial saint during an open-air mass in a packed St Peter’s Square.</p><p>Carlo, who died of leukaemia, built websites to spread Catholic teaching, earning him the nickname “God’s influencer”. He was canonised alongside Pier Giorgio Frassati, another young Catholic activist, who died a century ago.</p> <a href=\"https://www.theguardian.com/world/2025/sep/07/pope-leo-xiv-declares-15-year-old-computer-whiz-carlo-acutis-gods-influencer-saint\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russia’s largest ever drone attack on Ukraine burns Kyiv government building",
      "link": "https://www.washingtonpost.com/world/2025/09/07/ukraine-russia-attacks-missile-kyiv/",
      "pub_time_taipei": "2025-09-07T18:30:16+08:00",
      "summary": "Russia unleashed a massive air assault on Ukraine early Sunday, setting the main government building in Kyiv ablaze for the first time during the war."
    },
    {
      "source": "衛報",
      "title": "Nigel Farage says Reform UK will not make pact with Boris Johnson",
      "link": "https://www.theguardian.com/politics/2025/sep/07/nigel-farage-boris-johnson-not-welcome-reform-pact",
      "pub_time_taipei": "2025-09-07T18:05:13+08:00",
      "summary": "<p>Public will ‘never forgive’ ex-PM for immigration policies, claims Reform leader after Nadine Dorries called for unity</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/07/latest-live-uk-politics-news-updates-keir-starmer-labour-nigel-farage-kemi-badenoch-angela-rayner-updates\">UK politics live – latest updates</a></p></li></ul><p>Nigel Farage has said a pact between Reform and Boris Johnson would never work, after the Conservative defector Nadine Dorries called for the right to unite.</p><p>Farage said the public would “never, ever forgive” Johnson for designing an immigration system that led to an increase of millions of people coming to the UK legally after Brexit, calling it the “Boris wave”.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/07/nigel-farage-boris-johnson-not-welcome-reform-pact\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "LGBTQ+ Americans consider move to Canada to escape Trump: ‘I’m afraid of living here’",
      "link": "https://www.theguardian.com/world/2025/sep/07/trump-lgbtq-americans-canada",
      "pub_time_taipei": "2025-09-07T18:00:17+08:00",
      "summary": "<p>LGBTQ+ people in the US contemplate heading north as they wrestle with the president’s assault on the community</p><p>The number of <a href=\"https://www.theguardian.com/world/lgbt-rights\">LGBTQ+</a> Americans inquiring about moving to <a href=\"https://www.theguardian.com/world/canada\">Canada</a> has soared since Donald Trump’s re-election, campaigners have said, as people across the US wrestle with the fallout of rising anti-gay rhetoric, anti-trans executive orders, and the more than 600 bills targeting LGBTQ+ rights.</p><p>“So much is happening in the US right now and a lot of it is terrifying,” said Latoya Nugent of Rainbow Railroad, a North American charity that helps LGBTQI+ individuals escape violence and persecution in their home countries.</p> <a href=\"https://www.theguardian.com/world/2025/sep/07/trump-lgbtq-americans-canada\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "300 South Koreans detained at Hyundai plant in US to be released, says Seoul",
      "link": "https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul",
      "pub_time_taipei": "2025-09-07T17:45:51+08:00",
      "summary": "<p>Footage of raid by US immigration officials showed detained workers in handcuffs and with chains around their ankles</p><p>South Korea has said negotiations with the US to secure the release of its nationals detained in a raid by US immigration officials on a Hyundai plant in the state of Georgia have been “concluded” and that they would soon be freed and flown home.</p><p>It follows the arrest of more than 300 South Korean workers at a Hyundai-LG battery site being built in the southern US on Thursday.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Japan PM Shigeru Ishiba to resign amid fallout from disastrous elections",
      "link": "https://www.theguardian.com/world/2025/sep/07/japan-pm-shigeru-ishiba-resign",
      "pub_time_taipei": "2025-09-07T17:37:47+08:00",
      "summary": "<p>Public broadcaster says prime minister has made decision to avoid divide within his Liberal Democratic party</p><p><a href=\"https://www.theguardian.com/world/japan\">Japan</a>’s prime minister, <a href=\"https://www.theguardian.com/world/2024/sep/27/who-is-new-japan-prime-minister-shigeru-ishiba\">Shigeru Ishiba</a>, is to resign less than a year after taking office, throwing the country’s politics into turmoil and setting in motion a potentially messy contest to replace him as leader of the ruling Liberal Democratic party (LDP).</p><p>The softly spoken centrist has presided over two disastrous elections since being elected to lead the LDP last autumn. In October, the party and its junior coalition partner Komeito lost their majority in the lower house and met the <a href=\"https://www.theguardian.com/world/2025/jul/20/apan-pm-election-result-exit-polls-predict-loss-of-upper-house\">same fate</a> in upper house elections this July.</p> <a href=\"https://www.theguardian.com/world/2025/sep/07/japan-pm-shigeru-ishiba-resign\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Warsaw opens metro station ‘express’ library to get commuters off their phones",
      "link": "https://www.theguardian.com/world/2025/sep/07/warsaw-opens-metro-station-express-library-smartphones",
      "pub_time_taipei": "2025-09-07T17:36:58+08:00",
      "summary": "<p>Metroteka aims to encourage people to read more in country that lost majority of libraries in second world war</p><p>An “express” library has opened in a new metro station in Warsaw, aiming to provide an appealing cultural space to encourage residents and commuters to forgo smartphones in favour of books and, thanks to fresh herbs growing in a vertical garden, a dash of subterranean greenery too.</p><p>The stylish <a href=\"https://www.multibiblioteka.waw.pl/metroteka/metroteka-otwarta/\">Metroteka</a>, which opened this week in the Kondratowicza M2 line metro station in the Polish capital’s Targówek district, offers two reading areas for adults and children, as well as a space for public readings and events.</p> <a href=\"https://www.theguardian.com/world/2025/sep/07/warsaw-opens-metro-station-express-library-smartphones\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Croatian village breaks world record with 3km strudel chain",
      "link": "https://www.theguardian.com/world/2025/sep/07/croatian-village-breaks-world-record-with-3km-strudel-chain",
      "pub_time_taipei": "2025-09-07T17:33:51+08:00",
      "summary": "<p>People in village of Jaškovo celebrate after reclaiming Guinness world record with line of almost 9,000 baked strudels</p><p>A Croatian village has made it into the record books with a line of nearly 9,000 strudels stretching more than 3km.</p><p>Two tonnes of flour and three tonnes of apples were used for the world’s longest line of <a href=\"https://www.theguardian.com/lifeandstyle/wordofmouth/2011/mar/17/how-cook-perfect-apple-strudel\">strudels</a> in the small village of Jaškovo, organisers said.</p> <a href=\"https://www.theguardian.com/world/2025/sep/07/croatian-village-breaks-world-record-with-3km-strudel-chain\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Germany’s latest preparation for war: A national ravioli reserve",
      "link": "https://www.washingtonpost.com/world/2025/09/07/germany-war-preparation-ravioli-reserve/",
      "pub_time_taipei": "2025-09-07T17:00:36+08:00",
      "summary": "Wary of a warmongering Russia, Germany is refitting its military, buying weapons, recruiting soldiers and also contemplating new strategic reserves of canned food."
    },
    {
      "source": "華盛頓郵報",
      "title": "Pope Leo canonizes Carlo Acutis, the teen deemed ‘God’s Influencer’",
      "link": "https://www.washingtonpost.com/world/2025/09/07/influencer-saint-carlo-acutis-pope-leo/",
      "pub_time_taipei": "2025-09-07T16:24:20+08:00",
      "summary": "He played video games like other teenagers but was also fascinated by the Eucharist and, since his death from leukemia at age 15, is credited with two miracles."
    },
    {
      "source": "衛報",
      "title": "Brainless bodies and pig organs: does science back up Putin and Xi’s longevity claims?",
      "link": "https://www.theguardian.com/science/2025/sep/07/science-putin-xi-longevity-immortality-get-younger-organ-claims",
      "pub_time_taipei": "2025-09-07T16:00:14+08:00",
      "summary": "<p>Russian leader’s claim that people can ‘get younger’ through repeated organ transplants has raised eyebrows</p><p>Perhaps it was the extravagant display of deadly weaponry that prompted Xi Jinping and Vladimir Putin to mull on mortality at this week’s <a href=\"https://www.theguardian.com/world/2025/sep/03/nuclear-triad-robot-wolves-china-weapons-parade\">military parade</a> in Beijing.</p><p>It was more banter than serious discussion, but with both aged 72, the Chinese president and his Russian counterpart may feel the cold hand on the shoulder more than Kim Jong-un, the 41-year-old North Korean leader who strolled beside them.</p> <a href=\"https://www.theguardian.com/science/2025/sep/07/science-putin-xi-longevity-immortality-get-younger-organ-claims\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Keir Starmer has ‘legal duty to stop Gaza genocide’, says Greta Thunberg",
      "link": "https://www.theguardian.com/world/2025/sep/07/keir-starmer-has-legal-duty-to-stop-gaza-genocide-says-greta-thunberg",
      "pub_time_taipei": "2025-09-07T15:48:28+08:00",
      "summary": "<p><strong>Exclusive: </strong>Activist spoke while onboard aid flotilla aiming to deliver food, baby formula and medical supplies to territory</p><p>Keir Starmer must obey his “legal duty to act to prevent a genocide”, Greta Thunberg has told the Guardian while travelling onboard an aid flotilla heading for Gaza.</p><p>The Swedish activist said there was a “huge absence of those whose legal responsibility it is to step up” under international law, and called out the UK prime minister before a potential meeting this week with Israel’s president, Isaac Herzog.</p> <a href=\"https://www.theguardian.com/world/2025/sep/07/keir-starmer-has-legal-duty-to-stop-gaza-genocide-says-greta-thunberg\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russian comedians try for laughs amid dangers of making the wrong joke",
      "link": "https://www.washingtonpost.com/world/2025/09/07/russia-comedians-stand-up-politics/",
      "pub_time_taipei": "2025-09-07T15:00:38+08:00",
      "summary": "The wartime crackdown has all but destroyed the once-vibrant stand-up comedy scene, but some persevere and live in fear of going viral and being denounced."
    },
    {
      "source": "華盛頓郵報",
      "title": "Sanctions on Palestinian rights groups expand Trump’s fight with ICC",
      "link": "https://www.washingtonpost.com/world/2025/09/07/trump-sanctions-palestinian-israel-icc/",
      "pub_time_taipei": "2025-09-07T14:00:03+08:00",
      "summary": "Analysts say the designations of three rights groups could impede the court’s efforts to gather evidence of Israel’s conduct in its war against Hamas in Gaza."
    },
    {
      "source": "衛報",
      "title": "Largest Russian air attack of war sets fire to Ukrainian cabinet building and kills three including child",
      "link": "https://www.theguardian.com/world/2025/sep/07/child-among-three-people-killed-in-russian-attack-on-kyiv-that-also-sparked-fire-at-government-building",
      "pub_time_taipei": "2025-09-07T13:03:13+08:00",
      "summary": "<p>Unclear if fire at main Ukrainian government building the result of a direct strike or falling debris</p><p>Russia’s largest overnight air attack of the war has set the main building of the Ukrainian government in Kyiv on fire and left three people dead, including an infant, Ukrainian officials said on Sunday.</p><p>Russia hit Ukraine’s capital with drones and missiles, injuring 18 people and setting scores of buildings on fire, including .</p> <a href=\"https://www.theguardian.com/world/2025/sep/07/child-among-three-people-killed-in-russian-attack-on-kyiv-that-also-sparked-fire-at-government-building\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We have the people’: Bernie Sanders campaigns with Zohran Mamdani as New York mayoral race enters final stretch",
      "link": "https://www.theguardian.com/us-news/2025/sep/07/we-have-the-people-bernie-sanders-campaigns-with-zohran-mamdani-as-new-york-mayoral-race-enters-final-stretch",
      "pub_time_taipei": "2025-09-07T11:48:53+08:00",
      "summary": "<p>Pair met with thunderous applause at town hall in Brooklyn as part of senator’s Fighting Oligarchy tour</p><p>Zohran Mamdani, the New York City mayoral frontrunner and Democratic nominee, joined the Vermont senator Bernie Sanders in a rousing town hall in Brooklyn on Saturday evening where the two addressed the growing threat of oligarchic control across the US and how to fight it.</p><p>The event, held at Sanders’ alma mater Brooklyn College, drew an audience of about 1,700 people. Mamdani and Sanders co-hosted the town hall as part of <a href=\"https://www.theguardian.com/us-news/2025/mar/25/bernie-sanders-democrats-fight-oligarchy\">Sanders’ Fighting Oligarchy tour</a>, which has included rallies in 20 states. Throughout the tour, the senator has been actively supporting and recruiting progressive candidates to run for office.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/07/we-have-the-people-bernie-sanders-campaigns-with-zohran-mamdani-as-new-york-mayoral-race-enters-final-stretch\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two boys, 12 and 15, killed in Melbourne attacked by eight knife and machete wielding suspects",
      "link": "https://www.theguardian.com/australia-news/2025/sep/07/two-boys-fatally-stabbed-melbourne-ntwnfb",
      "pub_time_taipei": "2025-09-07T11:39:20+08:00",
      "summary": "<p>Fatal stabbing attack on two boys in Cobblebank had ‘the hallmarks of a youth gang crime’, Victoria police say</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/07/australia-news-live-melbourne-stabbing-nsw-koala-national-park-logging-anthony-albanese-sussan-ley-immigration-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A fatal stabbing attack on two boys in Melbourne by eight masked attackers armed with machetes and long edged weapons had “the hallmarks of a youth gang crime”, Victoria police say.</p><p>A 12-year-old and 15-year-old Dau Akueng were found fatally stabbed on separate streets in Cobblebank, in the city’s west, on Saturday night.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/07/two-boys-fatally-stabbed-melbourne-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mexican festivals in Chicago canceled amid Trump plans to deploy troops",
      "link": "https://www.theguardian.com/us-news/2025/sep/06/chicago-mexican-independence-day-trump",
      "pub_time_taipei": "2025-09-07T10:37:01+08:00",
      "summary": "<p>City and suburbs pull local events tied to Mexican Independence Day on 16 September</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s plan to deploy national guard troops and federal immigration agents to Chicago is already having an impact on the city’s Mexican community.</p><p>Organizers have canceled several local events tied to Mexican Independence Day, which occurs on 16 September.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/06/chicago-mexican-independence-day-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "China’s military follows Australian and Canadian warships in Taiwan Strait accusing them of ‘provocation’",
      "link": "https://www.theguardian.com/australia-news/2025/sep/07/chinas-military-follows-australian-and-canadian-warships-in-taiwan-strait-accusing-them-of-provocation",
      "pub_time_taipei": "2025-09-07T09:42:27+08:00",
      "summary": "<p>Strait is considered an international waterway by countries including the US, Canada, Britain and Taiwan</p><p>Australian and Canadian warships sailing through the sensitive Taiwan Strait have been followed and warned by China’s military, with Beijing describing the incident as a provocation.</p><p>The People’s Liberation Army’s Eastern Theatre Command said the Australian guided-missile destroyer Brisbane and the Canadian frigate Ville de Quebec were engaged in “trouble-making and provocation”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/07/chinas-military-follows-australian-and-canadian-warships-in-taiwan-strait-accusing-them-of-provocation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump administration begins new Ice operation in Massachusetts",
      "link": "https://www.theguardian.com/us-news/2025/sep/06/trump-administration-immigration-crackdown-massachusetts",
      "pub_time_taipei": "2025-09-07T07:59:08+08:00",
      "summary": "<p>A Department of Homeland Security official confirmed the action in a statement, blaming mayor’s sanctuary policies</p><p>The <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> has targeted Massachusetts as its next location to begin arresting and deporting immigrants, a Department of Homeland Security official confirmed to NBC News on Saturday.</p><p>DHS and its US Immigration and Customs Enforcement arm are calling the operation Patriot 2.0, modifying the name of a May deportation surge that led to the arrest of 1,500 people in the state, according to the reports.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/06/trump-administration-immigration-crackdown-massachusetts\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "WA museum tells staff ‘almost all of us are guilty’ of burning fossil fuels in email defending Woodside partnership",
      "link": "https://www.theguardian.com/australia-news/2025/sep/07/western-australia-museum-woodside-partnership-staff-email-almost-all-of-us-guilty-burning-fossil-fuels-email-defending",
      "pub_time_taipei": "2025-09-07T04:54:57+08:00",
      "summary": "<p><strong>Exclusive:</strong> Climate advocates reject CEO’s claim he is ‘not qualified’ to comment on risks of gas firm’s plan to extend production to 2070</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/07/australia-news-live-melbourne-stabbing-nsw-koala-national-park-logging-anthony-albanese-sussan-ley-immigration-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The head of the Western Australian Museum has told staff that burning fossil fuels is something “almost all of us are guilty of in one way or another” in an email defending the institution’s renewed research partnership with Woodside.</p><p>The museum’s chief executive, Alec Coles, sent the email to staff before a Woodside-sponsored August open day at the Maritime Museum – one of WA Museum’s seven locations. It came amid <a href=\"https://www.theguardian.com/australia-news/2025/aug/13/wa-museum-partnership-with-woodside-criticised-as-record-breaking-marine-heatwave-decimates-coral-reefs-ntwfb\">public criticism</a> of the extension of the “longstanding collaboration”, in which the gas company supports the museum’s biodiversity research along the WA coastline.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/07/western-australia-museum-woodside-partnership-staff-email-almost-all-of-us-guilty-burning-fossil-fuels-email-defending\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "NSW locks in great koala national park and brings in immediate ban on logging",
      "link": "https://www.theguardian.com/australia-news/2025/sep/07/nsw-locks-in-great-koala-national-park-and-brings-in-immediate-ban-on-logging",
      "pub_time_taipei": "2025-09-07T04:00:03+08:00",
      "summary": "<p>Minns government to create one of the largest national parks in the state as forest advocates welcome ‘historic’ victory</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/sep/07/loss-of-koala-habitat-shows-total-failure-of-nature-laws-conservationists-say\">Loss of koala habitat shows ‘total failure’ of nature laws, conservationists say</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/07/australia-news-live-melbourne-stabbing-nsw-koala-national-park-logging-anthony-albanese-sussan-ley-immigration-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Minns government has confirmed its long-awaited great koala national park, announcing it will add 176,000 hectares of forest to existing reserves in mid-north New South Wales to create one of the largest national parks in the state and protect more than 12,000 koalas.</p><p>The premier, Chris Minns, and environment minister, Penny Sharpe, said the government would put an immediate moratorium on logging within the park’s boundaries and roll out a jobkeeper style support package for workers at affected timber mills in the region.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/07/nsw-locks-in-great-koala-national-park-and-brings-in-immediate-ban-on-logging\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Loss of koala habitat shows ‘total failure’ of nature laws, conservationists say",
      "link": "https://www.theguardian.com/environment/2025/sep/07/loss-of-koala-habitat-shows-total-failure-of-nature-laws-conservationists-say",
      "pub_time_taipei": "2025-09-07T04:00:03+08:00",
      "summary": "<p>More habitat has been given up legally in 2025 so far than any other year since the animals were listed as threatened, analysis shows</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/07/nsw-locks-in-great-koala-national-park-and-brings-in-immediate-ban-on-logging\">NSW locks in great koala national park and brings in immediate ban on logging</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/07/australia-news-live-melbourne-stabbing-nsw-koala-national-park-logging-anthony-albanese-sussan-ley-immigration-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>More clearing of koala habitat has been approved under Australia’s nature laws in 2025 so far than in any other year since the marsupial was listed as a threatened species, according to an analysis by the Australian Conservation Foundation.</p><p>The destruction of 3,958 ha of bush approved across eight projects, including a coalmine in Queensland, equates to about four Sydney airports’ worth of clearing.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/07/loss-of-koala-habitat-shows-total-failure-of-nature-laws-conservationists-say\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Those angry about migration figures are ignoring what happened in Australia during Covid and other key facts",
      "link": "https://www.theguardian.com/australia-news/2025/sep/07/those-angry-about-migration-figures-are-ignoring-what-happened-in-australia-during-covid-and-other-key-facts",
      "pub_time_taipei": "2025-09-07T04:00:01+08:00",
      "summary": "<p>But the lack of a well-reasoned migration plan from Labor is not helping at a time when extremist views are flourishing</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/07/australia-news-live-melbourne-stabbing-nsw-koala-national-park-logging-anthony-albanese-sussan-ley-immigration-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>In a little under two weeks we will get the latest official report on the number of overseas migrants entering and leaving Australia.</p><p>Whatever the number is, <a href=\"https://www.theguardian.com/australia-news/2025/sep/01/anti-immigration-protesters-say-australias-migration-is-at-record-highs-but-the-figures-tell-a-different-story\">some people will be outraged</a>. But they shouldn’t be.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/07/those-angry-about-migration-figures-are-ignoring-what-happened-in-australia-during-covid-and-other-key-facts\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Immigration raid on Hyundai plant tests U.S.-South Korea relations",
      "link": "https://www.washingtonpost.com/world/2025/09/06/hyundai-factory-immigration-georgia-south-korea/",
      "pub_time_taipei": "2025-09-07T01:16:42+08:00",
      "summary": "Officials held an emergency meeting to discuss how to respond to the mass raid on the Georgia plant where they say at least 300 Koreans were arrested."
    },
    {
      "source": "衛報",
      "title": "More than 7,000 under-fives in Gaza put in malnutrition recovery in two-week period",
      "link": "https://www.theguardian.com/world/2025/sep/06/unicef-under-5s-recovery-programmes-acute-malnutrition-gaza",
      "pub_time_taipei": "2025-09-06T22:00:53+08:00",
      "summary": "<p>Total for August may exceed 15,000 new patients, more than seven times February figure</p><p>More than 7,000 children under the age of five were put on recovery programmes for acute malnutrition at clinics run by Unicef in <a href=\"https://www.theguardian.com/world/gaza\">Gaza</a> in just two weeks last month, figures reveal.</p><p>The overall total for August is being compiled by Unicef but is expected to exceed 15,000 new patients, more than seven times the total in February.</p> <a href=\"https://www.theguardian.com/world/2025/sep/06/unicef-under-5s-recovery-programmes-acute-malnutrition-gaza\">Continue reading...</a>"
    }
  ]
}