{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-21T20:40:07.975889+08:00",
  "window_end_taipei": "2025-09-22T20:40:07.975889+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Albanese warns Netanyahu expansion of settlements in West Bank risks putting two-state solution ‘out of reach’",
      "link": "https://www.theguardian.com/australia-news/2025/sep/22/albanese-warns-netanyahu-expansion-of-settlements-in-west-bank-risks-putting-two-state-solution-out-of-reach",
      "pub_time_taipei": "2025-09-22T20:30:00+08:00",
      "summary": "<p>Australian PM will tell major conference in US the trajectory of Gaza conflict is deeply worrying to the international community</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Anthony Albanese is warning Benjamin Netanyahu any move to expand Israeli settlements in the West Bank or annex parts of Palestine risks putting <a href=\"https://www.theguardian.com/australia-news/2025/sep/21/australia-joins-uk-and-canada-in-formally-recognising-palestinian-state\">a two-state solution</a> permanently “beyond reach”.</p><p>As far-right members of Netanyahu’s governing coalition demand Israel annexe some of the territory that would be part of a future Palestinian state, Albanese will tell a major conference in New York the current trajectory of the conflict is deeply worrying to the international community.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/22/albanese-warns-netanyahu-expansion-of-settlements-in-west-bank-risks-putting-two-state-solution-out-of-reach\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump hails Charlie Kirk as ‘a martyr for America’s freedom’ at memorial – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
      "pub_time_taipei": "2025-09-22T20:29:52+08:00",
      "summary": "<p>President’s message that he ‘hates’ his opponents contrasts with Erika Kirk’s forgiveness of the man charged with killing her husband</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/21/thousands-gather-at-charlie-kirk-memorial-in-arizona-where-trump-to-pay-tribute-to-slain-organizer\">Trump says he hates his opponents at Charlie Kirk’s memorial</a></p></li></ul><p>Also today, <strong>Donald Trump</strong> <strong>will make an announcement at 4pm EST in the Roosevelt room</strong>, according to his official schedule.</p><p>On Sunday, the president teased today’s remarks, saying his administration has found “an answer to autism” at Charlie Kirk’s public memorial in Glendale, Arizona.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Farage vows to scrap indefinite leave to remain, placing thousands at risk of deportation",
      "link": "https://www.theguardian.com/politics/2025/sep/22/farage-vows-to-scrap-settled-status-placing-thousands-at-risk-of-deportation",
      "pub_time_taipei": "2025-09-22T20:24:45+08:00",
      "summary": "<p>Reform UK plans to force non-citizens to apply for visas with high salary thresholds and no access to NHS services</p><p>Nigel Farage has pledged to abolish what he called the “grossly unfair” main route for immigrants to gain British citizenship, threatening tens of thousands of people legally living in the UK with deportation unless they meet strict rules.</p><p>The Reform UK leader said his plans would target the “Boriswave” – the <a href=\"https://www.theguardian.com/uk-news/2025/sep/14/what-do-the-immigration-figures-for-the-uk-really-show\">wave of legal immigrants</a> who arrived in the UK under post-Brexit rules established by Boris Johnson – which he described as the “greatest betrayal of democratic wishes certainly in anyone’s living memory”.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/22/farage-vows-to-scrap-settled-status-placing-thousands-at-risk-of-deportation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tiger fatally attacks handler at Oklahoma preserve, officials say",
      "link": "https://www.theguardian.com/us-news/2025/sep/22/tiger-attack-oklahoma-preserve",
      "pub_time_taipei": "2025-09-22T20:14:11+08:00",
      "summary": "<p>Ryan Easley operated Growler Pines preserve, which called accident ‘painful reminder’ of ‘unpredictability’ of nature</p><p>A tiger fatally mauled its handler at a preserve in <a href=\"https://www.theguardian.com/us-news/oklahoma\">Oklahoma</a>, officials at the facility say.</p><p>Ryan Easley, the operator of the Growler Pines Tiger Preserve near Hugo, Oklahoma, was mauled to death on Saturday in what the site portrayed as an “accident” with a tiger under his care.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/22/tiger-attack-oklahoma-preserve\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "European officials warn Israel not to annex parts of West Bank in response to recognition of Palestinian state – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
      "pub_time_taipei": "2025-09-22T20:13:20+08:00",
      "summary": "<p>UK, Australia, Canada and Portugal recognised Palestinian statehood on Sunday with France set to do the same </p><p>The Israeli military, which justifies its assault on Gaza City by saying it wants to “destroy Hamas military infrastructure” hasn’t given a timeline for the ground offensive, but there are indications it could take months.</p><p>Amid this flurry of diplomatic activity, Israel is continuing to launch deadly attacks on Gaza, including on <strong>Gaza City</strong>, the biggest urban centre in the territory.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Insolvent UK recruiter acquired by previous owner who took millions out",
      "link": "https://www.theguardian.com/politics/2025/sep/22/insolvent-uk-recruiter-acquired-by-previous-owner-who-took-millions-out",
      "pub_time_taipei": "2025-09-22T20:10:01+08:00",
      "summary": "<p>Premier Group Recruitment went into administration with debts of £2.9m – including £647,000 owed in tax</p><p>An insolvent UK recruitment company, which owes the UK exchequer hundreds of thousands of pounds, has been acquired for an initial £10,000 by a venture created by the previous owner – despite him receiving millions from the business in its final three years.</p><p>Premier Group Recruitment went into administration this month with debts of £2.9m – including £647,000 owed to HM Revenue and Customs (HMRC), which had commenced enforcement proceedings against the company. The recruiter’s assets were acquired three days later by a new company, PGGBR Ltd, founded by Andrew Woosnam, Premier’s 99% shareholder.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/22/insolvent-uk-recruiter-acquired-by-previous-owner-who-took-millions-out\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Netanyahu vows retaliation ahead of more Palestine recognitions at U.N.",
      "link": "https://www.washingtonpost.com/world/2025/09/22/palestine-state-recognize-un-israel/",
      "pub_time_taipei": "2025-09-22T20:01:17+08:00",
      "summary": "As France and Saudi Arabia convene a summit to renew the push for a two-state solution, the Israeli leader said, “A Palestinian state will not be established.”"
    },
    {
      "source": "衛報",
      "title": "Bailey the support dog freed from Northern Irish prison after public outcry",
      "link": "https://www.theguardian.com/uk-news/2025/sep/22/bailey-support-dog-freed-magilligan-prison-northern-ireland",
      "pub_time_taipei": "2025-09-22T19:59:07+08:00",
      "summary": "<p>Cocker spaniel was being kept full-time in Magilligan prison but is now in family home after ‘free Bailey’ campaign</p><p>The six words that Northern Ireland’s dog-lovers were waiting to hear came on Monday: “Bailey is now out of prison.”</p><p>A vocal campaign to free the cocker spaniel who committed no crime culminated in his release from Magilligan prison and transfer to an undisclosed location to begin a new life.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/22/bailey-support-dog-freed-magilligan-prison-northern-ireland\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Reform branded ‘threat to democracy’ over Farage plan to remove thousands of migrants with leave to be in UK – politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates",
      "pub_time_taipei": "2025-09-22T19:54:36+08:00",
      "summary": "<p>Nigel Farage says Reform UK would scrap the main route that migrants take to gain British citizenship</p><p><strong>Farage </strong>and<strong> Yusuf</strong> are now taking questions.</p><p><em>Q: [From the BBC’s Iain Watson] Will you withdraw the £230bn figure, because it has been withdrawn by the thinktank that produced it?</em></p><p>What we are attempting to do today is to make people realise that large-scale migration into Britain, where 50% at least of those that come, will never work and live off the British state, is actually making this country substantially poorer.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ted Cruz urges Trump to back older retirement age for pilots",
      "link": "https://www.theguardian.com/us-news/2025/sep/22/ted-cruz-trump-pilot-retirement-age",
      "pub_time_taipei": "2025-09-22T19:47:38+08:00",
      "summary": "<p>Worker groups oppose move, citing studies finding health risks and decline in cognitive skills with increase in age</p><p><a href=\"https://www.theguardian.com/us-news/ted-cruz\">Ted Cruz</a>, the Texas Republican who heads the US Senate’s commerce committee, has urged <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> to support international efforts by an airline trade group to raise the mandatory pilot retirement age to 67 – despite opposition from a pilots association, which says such a move could increase travel risks.</p><p>In a letter first reported by Reuters on Sunday, Cruz asked Trump to support efforts the upcoming opening of a United Nations aviation meeting in Montreal.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/22/ted-cruz-trump-pilot-retirement-age\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Climate activists gather in New York for ‘Sun Day’ solar energy and anti-billionaire rallies",
      "link": "https://www.theguardian.com/us-news/2025/sep/22/sun-day-climate-new-york",
      "pub_time_taipei": "2025-09-22T19:34:44+08:00",
      "summary": "<p>Sun Day national action supported renewable energy, day after ‘Make Billionaires Pay’ march ahead of Climate Week</p><p>Hundreds of environmentalists gathered in <a href=\"https://www.theguardian.com/us-news/new-york\">New York City</a>’s Stuyvesant Square Park and a nearby Quaker meeting house on Sunday to rally in support of <a href=\"https://www.theguardian.com/environment/solarpower\">solar power</a> and other forms of renewable energy. The event was part of a national “day of action” billed <a href=\"https://www.sunday.earth/\">Sun Day</a>, founded by veteran environmental activist Bill McKibben and first Earth Day coordinator Denis Hayes.</p><p>“It’s so sad to watch the sun going to waste,” McKibben said at a press conference, standing beside environmentalists and their children. “Every single day, energy from heaven going to waste while we drill down to hell for another dose of the stuff that is wrecking this planet.”</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/22/sun-day-climate-new-york\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Poland will shoot down objects violating its airspace, PM says, as UN security council to meet over Russian provocations – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/22/latest-europe-news-russia-estonia-un-united-nations-security-live-latest-updates",
      "pub_time_taipei": "2025-09-22T19:32:21+08:00",
      "summary": "<p>Donald Tusk says Poland will not hesitate to shoot objects down but cautions against action that could trigger conflict</p><p>Elsewhere, <strong>cities across Italy saw pro-Palestinian protests, strikes and blockades today</strong>, responding to <strong>calls from unions to “denounce the genocide in Gaza”</strong> and <strong>for diplomatic and economic sanctions against Israel, </strong>AFP reported.</p><p>More than <strong>20,000 people gathered in front of Rome’s central station</strong> to protest against the worsening humanitarian crisis in Gaza, AP reported.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/22/latest-europe-news-russia-estonia-un-united-nations-security-live-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN and rights groups condemn reported jailing of Wuhan Covid citizen journalist",
      "link": "https://www.theguardian.com/world/2025/sep/22/un-rights-groups-condemn-reported-jailing-wuhan-covid-citizen-journalist-zhang-zhan",
      "pub_time_taipei": "2025-09-22T19:23:21+08:00",
      "summary": "<p>Zhang Zhan sentenced to four years for second time on charge often used by China to target government critics</p><p>The UN, human rights groups and media freedom watchdogs have condemned reports that <a href=\"https://www.theguardian.com/world/2025/sep/18/zhang-zhan-chinese-citizen-journalist-facing-second-trial\">Zhang Zhan</a>, a Chinese citizen journalist, was sentenced to jail for the second time last week.</p><p>Zhang, 42, is thought to have stood trial in Shanghai on Friday on a charge of “picking quarrels and provoking trouble”, a charge often used in China to target critics of the government. Western diplomats were reportedly turned away from observing the trial.</p> <a href=\"https://www.theguardian.com/world/2025/sep/22/un-rights-groups-condemn-reported-jailing-wuhan-covid-citizen-journalist-zhang-zhan\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Flight delays continue across Europe after weekend cyber-attack",
      "link": "https://www.theguardian.com/world/2025/sep/22/flight-delays-europe-cyber-attack-heathrow-brussels-berlin",
      "pub_time_taipei": "2025-09-22T19:19:09+08:00",
      "summary": "<p>Software provider Collins Aerospace completing updates after Heathrow, Brussels and Berlin hit by problems</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/22/rachel-reeves-gatwick-second-runway-growth-jobs-environmental-disaster-business-live-news\">Business live – latest updates</a></p></li></ul><p>Passengers are facing another day of flight delays across Europe, as big airports continue to grapple with the <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport-delays-cyber-attack-berlin-brussels-cancelled-delays\">aftermath of a cyber-attack </a>on the company behind the software used for check-in and boarding.</p><p>Several of the largest airports in Europe, including London Heathrow, have been <a href=\"https://www.theguardian.com/business/2025/sep/21/delays-continue-at-heathrow-brussels-and-berlin-airports-after-alleged-cyber-attack\">trying to restore normal operations</a> over the past few days after an attack on Friday disrupted automatic check-in and boarding software.</p> <a href=\"https://www.theguardian.com/world/2025/sep/22/flight-delays-europe-cyber-attack-heathrow-brussels-berlin\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK recognises state of Palestine to ‘keep alive’ the possibility of peace",
      "link": "https://www.theguardian.com/uk-news/2025/sep/21/uk-recognises-palestine-as-an-independent-state",
      "pub_time_taipei": "2025-09-22T19:18:12+08:00",
      "summary": "<p>Keir Starmer says announcement shows government’s hopes for a secure Israel alongside a viable Palestine</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/21/netanyahu-uk-palestinian-recogniton-absurd-prize-terrorism\">Netanyahu says recognition is a prize for terrorism</a></p></li></ul><p>The UK has formally recognised Palestine as an independent state, Keir Starmer has said, in a deeply symbolic announcement that the government hopes will show its commitment to peace in the region and ease domestic political tensions.</p><p>In a sign of the global concern over the humanitarian crisis in Gaza, Canada and <a href=\"https://www.theguardian.com/australia-news/2025/sep/21/australia-joins-uk-and-canada-in-formally-recognising-palestinian-state\">Australia</a> also made their own formal declarations recognising Palestine on Sunday ahead of a conference of the UN general assembly in New York.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/21/uk-recognises-palestine-as-an-independent-state\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Arc’teryx fireworks display in Tibet prompts environmental outcry",
      "link": "https://www.theguardian.com/world/2025/sep/22/arcteryx-fireworks-display-tibet-environmental-outcry",
      "pub_time_taipei": "2025-09-22T19:11:19+08:00",
      "summary": "<p>Outdoor brand says the Rising Dragon promotional event was out of line with its values after public criticism</p><p>The outdoor brand Arc’teryx has issued an apology after a promotional fireworks display in the Tibetan plateau led to an outcry over potential environmental damage.</p><p>The promotional Rising Dragon high-altitude show involved long stretches of choreographed pyrotechnics and coloured smoke along snow-topped Himalayan ridgelines in the Tibetan region of Shigatse. The Canadian company, part-owned by China’s Anta Group, had partnered with a Chinese artist, Cai Guo-Qiang, who oversaw similar shows for the 2008 Beijing Olympics.</p> <a href=\"https://www.theguardian.com/world/2025/sep/22/arcteryx-fireworks-display-tibet-environmental-outcry\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As Russia pummels Ukraine’s energy, Kyiv hits back at its oil refineries",
      "link": "https://www.washingtonpost.com/world/2025/09/22/ukraine-russia-energy-attacks-oil-refineries/",
      "pub_time_taipei": "2025-09-22T19:00:37+08:00",
      "summary": "Russia is ramping up attacks on gas networks and power stations but this year, but in the past week Ukraine has set ablaze several Russian oil refineries."
    },
    {
      "source": "衛報",
      "title": "How the billionaire class and wealthy landlords are conspiring against Zohran Mamdani",
      "link": "https://www.theguardian.com/us-news/2025/sep/22/billionaires-wealthy-landlords-zohran-mamdani-andrew-cuomo",
      "pub_time_taipei": "2025-09-22T19:00:07+08:00",
      "summary": "<p>The wealthiest New Yorkers are desperately to rally support – and millions of dollars – for Andrew Cuomo to defeat the democratic socialist</p><p>Zohran Mamdani has had to overcome a lot during his campaign to be New York City’s next mayor.</p><p>His age, relative lack of experience and his self-stated democratic socialism could have held him back. Yet the 33-year-old, a relative unknown 12 months ago, sailed through all challenges as he became the favorite to win the election in November.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/22/billionaires-wealthy-landlords-zohran-mamdani-andrew-cuomo\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mass grave reveals scale of unlawful killings by Egyptian army in Sinai, say campaigners",
      "link": "https://www.theguardian.com/world/2025/sep/22/mass-grave-reveals-scale-of-unlawful-killings-by-egyptian-army-in-sinai-say-campaigners",
      "pub_time_taipei": "2025-09-22T18:25:55+08:00",
      "summary": "<p>Human rights group says hundreds of skeletons found exposed or buried just below ground during research into killings of civilians</p><p>Hundreds of bodies could have been buried at a mass grave discovered in Egypt’s Sinai province by human rights campaigners.</p><p>Bodies lying on the surface and others buried barely 30cm below were found at a burial site near a military outpost by the Sinai Foundation for Human Rights.</p> <a href=\"https://www.theguardian.com/world/2025/sep/22/mass-grave-reveals-scale-of-unlawful-killings-by-egyptian-army-in-sinai-say-campaigners\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Kafkaesque’: teacher in Birmingham fights to clear his name after identity fraud",
      "link": "https://www.theguardian.com/money/2025/sep/22/turned-my-life-into-hell-teacher-fights-to-clear-his-name-after-identity",
      "pub_time_taipei": "2025-09-22T18:08:07+08:00",
      "summary": "<p>Michael Bene is repaying £763 ‘advance’ despite evidence he did not attend face-to-face verification interview</p><p>A special needs teacher has spent almost a year trying to clear his name after a fraudulent universal credit claim was made using his identity, which has left him on the hook for hundreds of pounds in repayments.</p><p>The Department for Work and Pensions (DWP) has refused to acknowledge the fraud, even though Michael Bene has supplied evidence he was in the Scottish Highlands when the claimant attended a face-to-face verification interview in Cheshire.</p> <a href=\"https://www.theguardian.com/money/2025/sep/22/turned-my-life-into-hell-teacher-fights-to-clear-his-name-after-identity\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Sustained protests push Serbia toward a defining choice — democracy or drift",
      "link": "https://www.washingtonpost.com/world/2025/09/22/serbia-protests-vucic-government-corruption/",
      "pub_time_taipei": "2025-09-22T17:24:54+08:00",
      "summary": "Months of student-led protests in Serbia, sparked by a train station disaster, are challenging President Aleksandar Vucic’s government, accusing it of corruption."
    },
    {
      "source": "華盛頓郵報",
      "title": "China is learning to accept alternative modes of work",
      "link": "https://www.washingtonpost.com/world/2025/09/22/china-digital-nomad-communes-rural-revitalization/",
      "pub_time_taipei": "2025-09-22T17:00:00+08:00",
      "summary": "Digital nomads have set up communes across China to opt out of the rat race. Faced with a youth unemployment crisis, Beijing is now backing alternative ways of working."
    },
    {
      "source": "衛報",
      "title": "The government’s promised triple zero ‘custodian’ not yet staffed more than a year after previous Optus outage",
      "link": "https://www.theguardian.com/business/2025/sep/22/optus-outage-government-promised-triple-zero-custodian-not-yet-staffed-more-than-a-year-after-previous",
      "pub_time_taipei": "2025-09-22T16:49:00+08:00",
      "summary": "<p>Consumer advocacy bodies and Greens say Labor failed to act fast enough to prevent last week’s outage linked to multiple deaths</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>An independent manager of the triple-zero emergency system has not yet been staffed by the federal government, despite it being a key recommendation of the review into Optus’s last emergency outage.</p><p>The communications minister, Anika Wells, said she wanted to “fast track” that process and others rising out of the latest debacle from the maligned telco, but consumer advocacy bodies and the Greens are critical the government has not worked quicker. Calls are growing for Optus to face multimillion-dollar fines even higher than the penalties from a similar incident in 2023.</p> <a href=\"https://www.theguardian.com/business/2025/sep/22/optus-outage-government-promised-triple-zero-custodian-not-yet-staffed-more-than-a-year-after-previous\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: Flash floods and landslides wreak havoc in California",
      "link": "https://www.theguardian.com/environment/2025/sep/22/weather-tracker-flash-floods-landslides-havoc-california",
      "pub_time_taipei": "2025-09-22T16:24:55+08:00",
      "summary": "<p>Two-year-old boy dies and homes buried as remnants of Tropical Storm Mario bring downpours and thunder</p><p>Flash flooding and landslides led to the <a href=\"https://www.theguardian.com/us-news/2025/sep/20/two-year-old-drowns-california-mudslides\">death of a two-year-old boy</a> in California in the US last week, after heavy rainfall followed on the heels of Tropical Storm Mario further south. The storm skirted the Pacific coast of Mexico with minimal disruption, eventually dissipating to the west of Baja California on Tuesday, but the remnants went on to cause havoc on Thursday. Residual moist air from the tropical storm was drawn north-east towards California, bringing heavy downpours and thunder to central and southern counties.</p><p>The heaviest rainfall was in the mountains of Riverside and San Bernardino counties, where up to 68mm (2.67in) fell in a few hours. Further north, Death Valley – famously one of the driest places on Earth – received 15mm of rain, triple the average rainfall for September and a full quarter of the yearly average.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/22/weather-tracker-flash-floods-landslides-havoc-california\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australia news live: Optus identifies seven more people unable to call triple zero; Meta to use AI to detect under-18s",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb",
      "pub_time_taipei": "2025-09-22T15:43:33+08:00",
      "summary": "<p>Follow today’s news live</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Any penalties would be financial, not criminal</strong></p><p>The Australian Communications Media Authority said any penalties would largely be financial if imposed, adding the body could also seek enforceable undertakings from Optus.</p><p>Triple zero and emergency call services are a fundamental requirement for all telcos. They are there for people at their most vulnerable and they have devastating effects if they are not in place. We have seen that play out over the last few days.</p><p>We have started that by alerting Optus to the investigation being under way. We will be seeking significant information from Optus. Telco networks are complex much we will need time to dig into what has exactly happened here.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sky News Australia admits editorial failure after guest insults Islam while wearing bacon-covered shirt",
      "link": "https://www.theguardian.com/media/2025/sep/22/sky-news-australia-admits-editorial-failure-after-guest-insults-islam-while-wearing-bacon-covered-shirt",
      "pub_time_taipei": "2025-09-22T15:33:20+08:00",
      "summary": "<p>Host Freya Leach sat silently while Ryan Williams called Muslims terrorists and explained he ‘wore’ bacon to protect himself from alleged threats of beheading</p><ul><li><p><a href=\"https://www.theguardian.com/media/article/2024/aug/28/weekly-beast-email-austrailan-media-diary-free-newsletter-subscribe-sign-up?CMP=cvau_sfl\">Sign up for Guardian Australia’s free weekly media newsletter here</a></p></li></ul><p>Sky News Australia has admitted a failure of editorial process allowed a guest to deliver a highly offensive diatribe against Islam while wearing a shirt festooned with raw bacon rashers.</p><p>Introducing the UK-based man as a “social media sensation”, Sky News host Freya Leach sat mute while Ryan Williams called Muslims terrorists and explained he “wore” bacon to protect himself from alleged threats of beheading.</p><p><strong><a href=\"https://www.theguardian.com/media/article/2024/aug/28/weekly-beast-email-austrailan-media-diary-free-newsletter-subscribe-sign-up?CMP=copyembed\">Sign up to get Guardian Australia’s weekly media diary as a free newsletter</a></strong></p> <a href=\"https://www.theguardian.com/media/2025/sep/22/sky-news-australia-admits-editorial-failure-after-guest-insults-islam-while-wearing-bacon-covered-shirt\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "British art dealer in row over return of Banksy artworks from Italy",
      "link": "https://www.theguardian.com/artanddesign/2025/sep/22/british-art-dealer-in-row-over-return-of-banksy-artworks-from-italy",
      "pub_time_taipei": "2025-09-22T13:00:03+08:00",
      "summary": "<p>Essex-based John Brandler seeking final loan payments as well as three murals from exhibitions company</p><p>A bitter row has broken out between a British art dealer and an Italian exhibitions company over three enormous Banksy murals that were loaned three years ago and which the dealer insured for £15m.</p><p>John Brandler, an Essex-based specialist in work by the graffiti artist, is pursuing legal action after losing patience with Metamorfosi in Rome, which stages temporary touring exhibitions.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/sep/22/british-art-dealer-in-row-over-return-of-banksy-artworks-from-italy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Angelina Jolie says ‘I don’t recognise my country’ now amid threats to freedom of speech in US",
      "link": "https://www.theguardian.com/film/2025/sep/22/angelina-jolie-freedom-of-speech-usa-kimmel-response-says-dont-recognise-my-country",
      "pub_time_taipei": "2025-09-22T11:20:12+08:00",
      "summary": "<p>Oscar winner’s comments come days after suspension of Jimmy Kimmel by ABC and Disney, a decision heavily criticised by major stars including Pedro Pascal and Olivia Rodrigo</p><p>Angelina Jolie has said “I don’t recognise my country” amid the threats to free speech in the US, saying “anything anywhere that divides or limits personal expressions and freedoms from anyone, I think, is very dangerous”.</p><p>At <a href=\"https://variety.com/2025/film/global/angelina-jolie-america-breast-cancer-couture-san-sebastian-1236525650/\">Spain’s San Sebastián film festival on Sunday,</a> the Oscar winning actor was asked by a journalist: “What do you fear as an artist and an American?”</p> <a href=\"https://www.theguardian.com/film/2025/sep/22/angelina-jolie-freedom-of-speech-usa-kimmel-response-says-dont-recognise-my-country\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Optus will face ‘significant consequences’ for triple zero failure linked to deaths, minister says",
      "link": "https://www.theguardian.com/business/2025/sep/22/optus-will-face-significant-consequences-for-triple-zero-failure-linked-to-deaths-federal-government-says",
      "pub_time_taipei": "2025-09-22T09:44:08+08:00",
      "summary": "<p>Communications minister Anika Wells says telco has ‘no excuses here’ after last week’s outage linked to three deaths across two states</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The federal government has promised Optus will “suffer significant consequences” after multiple deaths were recorded during the telco’s triple zero outage, with major financial penalties likely.</p><p>The communications regulator said it wasn’t informed of <a href=\"https://www.theguardian.com/business/2025/sep/19/three-people-died-when-optus-network-upgrade-affected-triple-zero-calls-ceo-confirms\">the outage by Optus</a> until hours after it had been resolved – and that the company had provided “inaccurate” information.</p> <a href=\"https://www.theguardian.com/business/2025/sep/22/optus-will-face-significant-consequences-for-triple-zero-failure-linked-to-deaths-federal-government-says\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.K., Canada, Australia recognize Palestine as a state, breaking with U.S.",
      "link": "https://www.washingtonpost.com/world/2025/09/21/britain-recognizes-palestine-state-israel/",
      "pub_time_taipei": "2025-09-22T04:37:49+08:00",
      "summary": "The three major U.S. allies reversed decades of unwillingness to accept Palestinians as a sovereign nation until their conflict with Israel was settled."
    },
    {
      "source": "衛報",
      "title": "At least 40 killed in Gaza and five in Lebanon in Israeli strikes",
      "link": "https://www.theguardian.com/world/2025/sep/21/at-least-40-killed-in-gaza-and-five-in-lebanon-in-israeli-strikes",
      "pub_time_taipei": "2025-09-22T03:49:05+08:00",
      "summary": "<p>Military steps up Gaza City takeover campaign as high-rise towers targeted and residents ordered to leave</p><p>Israeli strikes killed at least 40 people in Gaza on Sunday, including 19 women and children, as well as five people in Lebanon.</p><p>At least 14 people were killed in a single strike on a residential block in southern Gaza City, health officials at al-Shifa hospital said. Another attack killed at least eight Palestinians in the Bureij refugee camp in central Gaza, according to al-Awda hospital.</p> <a href=\"https://www.theguardian.com/world/2025/sep/21/at-least-40-killed-in-gaza-and-five-in-lebanon-in-israeli-strikes\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brazilians protest in their thousands against granting Bolsonaro amnesty",
      "link": "https://www.theguardian.com/world/2025/sep/21/brazil-protest-against-jair-bolsonaro-amnesty",
      "pub_time_taipei": "2025-09-22T03:44:16+08:00",
      "summary": "<p>Huge crowds pack the streets to oppose endeavours to help ex-president escape jail</p><p>Tens of thousands of Brazilians have taken to the streets to demand no amnesty be granted to their country’s former president Jair Bolsonaro after he was convicted of plotting a coup.</p><p>The far-right populist was <a href=\"https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup\">sentenced to 27 years in prison</a> earlier this month for illegally attempting to cling to power after he lost the 2022 presidential election to his leftwing opponent, Luiz Inácio Lula da Silva.</p> <a href=\"https://www.theguardian.com/world/2025/sep/21/brazil-protest-against-jair-bolsonaro-amnesty\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kenya’s arrest warrant is milestone in Agnes Wanjiru case but lengthy UK process awaits",
      "link": "https://www.theguardian.com/world/2025/sep/21/kenya-issues-arrest-warrant-agnes-wanjiru-uk-must-rule-on-extradition",
      "pub_time_taipei": "2025-09-22T01:39:10+08:00",
      "summary": "<p>After 13 years, warrant has been issued for UK suspect, but Robert James Purkiss would need to be extradited to face charges</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/sep/21/british-soldier-accused-of-murdering-kenyan-woman-agnes-wanjiru-named\">British soldier accused of murdering Agnes Wanjiru named</a></p></li></ul><p>In the spring of 2012, David Cameron was prime minister and British troops were still fighting in Afghanistan under the stewardship of the then defence secretary, Philip Hammond.</p><p>Before deploying, soldiers from the UK would be flown 3,000 miles south-west of Helmand province, to Kenya, for hot weather training. They would train at Batuk, the British army base that still operates today, close to Nanyuki, a poor market town in the east of the country.</p> <a href=\"https://www.theguardian.com/world/2025/sep/21/kenya-issues-arrest-warrant-agnes-wanjiru-uk-must-rule-on-extradition\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Netanyahu calls UK’s Palestine recognition ‘absurd prize for terrorism’",
      "link": "https://www.theguardian.com/world/2025/sep/21/netanyahu-uk-palestinian-recogniton-absurd-prize-terrorism",
      "pub_time_taipei": "2025-09-22T01:17:31+08:00",
      "summary": "<p>Opposition leader Yair Golan blames government’s political recklessness and refusal to end the war in Gaza</p><p>Benjamin Netanyahu, Israel’s prime minister, called the UK’s <a href=\"https://www.theguardian.com/uk-news/2025/sep/21/uk-recognises-palestine-as-an-independent-state\">recognition of Palestine</a> on Sunday “an absurd prize for terrorism”.</p><p>In remarks to ministers released by his office, he said Israel would have “to fight both in the UN and in all the other fronts against the slanderous propaganda aimed at us, and against the calls to create a Palestinian state that will endanger our existence and constitute an absurd prize for terrorism”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/21/netanyahu-uk-palestinian-recogniton-absurd-prize-terrorism\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "German jets scrambled after Russian military plane flies over Baltic Sea",
      "link": "https://www.theguardian.com/world/2025/sep/21/german-jets-scrambled-after-russian-military-plane-flies-over-baltic-sea",
      "pub_time_taipei": "2025-09-22T00:58:53+08:00",
      "summary": "<p>Russian Il-20M reconnaissance plane ignored requests to make contact, in latest of what are seen as provocative acts by Kremlin</p><p>Two German Eurofighter jets <a href=\"https://www.spiegel.de/ausland/ostsee-russisches-militaerflugzeug-loest-alarmstart-von-eurofightern-aus-a-178ec37b-61dc-48b4-805e-d3cb382dd2c4\">were scrambled on Sunday</a> to intercept a Russian military aircraft above the Baltic Sea, as Estonia said it would call an emergency meeting of the UN security council after Russian planes violated its airspace.</p><p>Germany’s air force said the Russian Il-20M reconnaissance plane had switched off its transponders and ignored requests to make contact. The Eurofighters took off from the Rostock-Laage airbase to head off the aircraft as it flew in international airspace.</p> <a href=\"https://www.theguardian.com/world/2025/sep/21/german-jets-scrambled-after-russian-military-plane-flies-over-baltic-sea\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Protesters flood streets of Philippines over state corruption",
      "link": "https://www.theguardian.com/world/2025/sep/21/protests-philippines-corruption-state-flood",
      "pub_time_taipei": "2025-09-22T00:17:31+08:00",
      "summary": "<p>Dozens of police officers injured as anger erupts over billions allegedly spent on bogus relief projects</p><p>Tens of thousands of Filipinos took to the streets on Sunday to protest against government corruption after it was alleged that taxpayers have lost billions of dollars to bogus flood relief projects.</p><p>Students, church groups, celebrities, and citizens from different political camps filled the streets in Manila and other cities.</p> <a href=\"https://www.theguardian.com/world/2025/sep/21/protests-philippines-corruption-state-flood\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "How will recognition of Palestinian statehood be greeted in the UK?",
      "link": "https://www.theguardian.com/politics/2025/sep/21/how-will-recognition-of-palestinian-statehood-be-greeted-in-the-uk",
      "pub_time_taipei": "2025-09-21T23:54:14+08:00",
      "summary": "<p>As well as being deeply symbolic, the move is also a major foreign policy shift for the Labour government</p><p>The UK’s formal recognition of Palestinian statehood is deeply symbolic on the world stage, but the major foreign policy shift is also a significant political step for the Labour government at home. The <a href=\"https://www.theguardian.com/uk-news/2025/sep/21/uk-recognises-palestine-as-an-independent-state\">announcement</a> followed mounting pressure on Keir Starmer from within the Labour party and beyond.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/21/how-will-recognition-of-palestinian-statehood-be-greeted-in-the-uk\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Here are countries that recognize a Palestinian state — or may do so soon",
      "link": "https://www.washingtonpost.com/world/2025/07/31/palestinian-state-recognition-countries-list/",
      "pub_time_taipei": "2025-09-21T23:53:51+08:00",
      "summary": "Anger over Israel’s war in Gaza has left it increasingly isolated, as Britain, Canada and Australia all announced they were recognizing a Palestinian state."
    },
    {
      "source": "衛報",
      "title": "British couple released after detention in Afghanistan say they feared being executed",
      "link": "https://www.theguardian.com/uk-news/2025/sep/21/british-couple-released-after-detention-in-afghanistan-say-they-feared-being-executed",
      "pub_time_taipei": "2025-09-21T21:19:16+08:00",
      "summary": "<p>Barbie Reynolds, 76, and husband Peter, 80, said it was never explained to them why they were imprisoned</p><p>A British couple who were reunited with their family in the UK after being released from almost eight months in detention in Afghanistan have said they feared being executed by the Taliban.</p><p>Peter Reynolds, 80, and his wife, Barbie, 76, who <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/british-couple-detained-by-taliban-in-afghanistan-return-to-uk\">arrived at Heathrow on Saturday</a>, said it was never explained to them why they were imprisoned in Afghanistan after their arrest in February.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/21/british-couple-released-after-detention-in-afghanistan-say-they-feared-being-executed\">Continue reading...</a>"
    }
  ]
}