{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-16T20:40:09.892025+08:00",
  "window_end_taipei": "2025-09-17T20:40:09.892025+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Donald Trump greeted by the king, William and Kate after landing in Windsor – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
      "pub_time_taipei": "2025-09-17T20:28:32+08:00",
      "summary": "<p>On the first full day of his state visit to the UK, the US president will attend various events in Windsor before a state banquet</p><p>Lucy Powell has hit out at the “sexist” framing of her deputy Labour leadership campaign, with people claiming she and her rival, <a href=\"https://www.theguardian.com/politics/bridget-phillipson\">Bridget Phillipson</a>, are standing as “proxies” for two men, <strong>Aletha Adu</strong> reports.</p><p>Most of Donald Trump’s policies horrify progressives and leftwingers in Britain, including Labour party members and supporters, but Keir Starmer has said almost nothing critical about the Trump administration because he has taken a view that maintaining good relations with the White House is in the national interest.</p><p>I understand the UK government’s position of being pragmatic on the international stage and wanting to maintain a good relationship with the leader of the most powerful country in the world. Faced with a revanchist Russia, Europe’s security feels less certain now than at any time since the second world war. And the threat of even higher US tariffs is ever present.</p><p>But it’s also important to ensure our special relationship includes being open and honest with each other. At times, this means being a critical friend and speaking truth to power – and being clear that we reject the politics of fear and division. Showing President Trump why he must back Ukraine, not Putin. Making the case for taking the climate emergency seriously. Urging the president to stop the tariff wars that are tearing global trade apart. And putting pressure on him to do much more to end Israel’s horrific onslaught on Gaza, as only he has the power to bring Israel’s brazen and repeated violations of international law to an end.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel opens ‘temporary’ route for residents to flee as troops and tanks push deeper into Gaza City – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates",
      "pub_time_taipei": "2025-09-17T20:22:35+08:00",
      "summary": "<p>The Israeli military said the route via Salah al-Din street ‘will be open for 48 hours only’ </p><p>The <strong>Israeli</strong> army said it has struck more than 150 targets in <strong>Gaza</strong> <strong>City</strong> since launching a major ground offensive on the <strong>Gaza</strong> <strong>Strip</strong>’s main urban hub early on Tuesday.</p><p>“Over the past two days, the [Israeli air force] and artillery corps troops struck over 150 terror targets throughout Gaza City in support of the manoeuvring troops in the area,” the military said in a statement issued on Wednesday, reports Agence France-Presse (AFP).</p><p>No one can fail to be distressed by the devastating impact the war has had on the children of Gaza, and I cannot imagine the fear and anguish their families have endured. It is a soul-destroying situation that compels us to act.</p><p>Every child deserves the chance to heal, to play, to simply be able to dream again. These young patients have witnessed horrors no child should ever see, but this marks the start of their journey towards recovery.</p><p>In Gaza, where the healthcare system has been decimated and hospitals are no longer functioning, there are severely ill children unable to get the medical care they need to survive.</p><p>As we welcome the first group of children to the UK for urgent treatment, their arrival reflects our determined commitment to humanitarian action and the power of international cooperation.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘A dolphin among sharks’: readers pay tribute to Robert Redford, a great movie star and decent human being",
      "link": "https://www.theguardian.com/film/2025/sep/17/robert-redford-remembered-beautiful-man-decent-human-being",
      "pub_time_taipei": "2025-09-17T20:15:33+08:00",
      "summary": "<p>People remember the human side of the ‘dazzling’ film star, who was kind and wise and lived a dignified life</p><ul><li><p><a href=\"https://www.theguardian.com/film/2025/sep/16/robert-redford-oscar-winning-actor-and-director-dies\"><strong>Robert Redford, giant of American cinema, dies aged 89</strong></a></p></li></ul><p>I met Bob in 1984 after he finished Out of Africa through a mutual friend in Malibu, and subsequently began to work for him and became friends. At that time he was establishing Sundance and distancing himself from Hollywood. He was a dolphin among sharks. He was the most kind and wise person one could ever know in this life.<br /><strong>Lex,</strong><strong> Joshua Tree, CA</strong></p> <a href=\"https://www.theguardian.com/film/2025/sep/17/robert-redford-remembered-beautiful-man-decent-human-being\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Southport killer’s brother asks whether attack could have been prevented",
      "link": "https://www.theguardian.com/uk-news/2025/sep/17/southport-killer-axel-rudakubana-brother-inquiry",
      "pub_time_taipei": "2025-09-17T20:15:03+08:00",
      "summary": "<p>Dion Rudakubana tells inquiry his younger brother, Axel, became ‘progressively more isolated’ after school expulsion </p><p>The brother of the Southport killer Axel Rudakubana has asked a public inquiry to determine whether officials could have stopped his sibling causing “the most immense pain, anguish and grief”.</p><p>In his first public comments since the attack last July, Dion Rudakubana said his younger brother had become “progressively more isolated” after being expelled from school in October 2019.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/17/southport-killer-axel-rudakubana-brother-inquiry\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ben & Jerry’s co-founder quits, accusing Unilever of silencing social mission",
      "link": "https://www.theguardian.com/business/2025/sep/17/ben-jerrys-co-founder-jerry-greenfield-quits-saying-unilever-silenced-social-mission",
      "pub_time_taipei": "2025-09-17T20:14:59+08:00",
      "summary": "<p>Jerry Greenfield says he cannot ‘in good conscience’ continue and says company has lost its independence</p><p>The Ben &amp; Jerry’s co-founder Jerry Greenfield has stepped away from the ice-cream brand after nearly 50 years, claiming it has lost its independence and accusing its parent company, Unilever, of having “silenced” its social mission.</p><p>Greenfield said in a letter posted by his co-founder, Ben Cohen, that he could no longer “in good conscience” remain an employee of a business that he argued had been muzzled by the UK-listed Unilever, despite an agreement protecting its social mission when it was taken over in 2000.</p> <a href=\"https://www.theguardian.com/business/2025/sep/17/ben-jerrys-co-founder-jerry-greenfield-quits-saying-unilever-silenced-social-mission\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Navalny’s widow says new lab evidence proves he was poisoned in prison",
      "link": "https://www.washingtonpost.com/world/2025/09/17/navalny-poisoned-russia-yulia-navalnaya/",
      "pub_time_taipei": "2025-09-17T20:12:17+08:00",
      "summary": "Two labs tested samples from Navalny that had been smuggled out of the country and concluded he had been poisoned, his wife said. Official cause of death cited disease."
    },
    {
      "source": "衛報",
      "title": "‘Radical left media’ is trying to destroy country, claims Trump – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
      "pub_time_taipei": "2025-09-17T20:11:35+08:00",
      "summary": "<p>President boasts of ‘amazing’ feedback on his case against NYT as he embarks on state visit to UK</p><p><strong>Donald Trump has claimed his administration has reached a deal with China to keep TikTok operating in the US, amid uncertainty over what shape the final agreement will take, with suggestions from the Chinese side that Beijing would retain control of the algorithm that powers the site’s video feed.</strong></p><p>“We have a deal on <a href=\"https://www.theguardian.com/technology/tiktok\">TikTok</a> ... We have a group of very big companies that want to buy it,” Trump said on Tuesday, without providing further details.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Suspect sought after car rammed into FBI gate in possible ‘act of terror’",
      "link": "https://www.theguardian.com/us-news/2025/sep/17/fbi-car-gate-suspect-pittsburgh",
      "pub_time_taipei": "2025-09-17T20:10:00+08:00",
      "summary": "<p>Donald Henson allegedly drove at high speed toward main entrance gate of Pittsburgh field office</p><p>A search is under way for a man with a history of mental health issues who allegedly rammed his car into a metal gate at an FBI field office in Pittsburgh early Wednesday in what the agency said it is treating as “an act of terror against the FBI”.</p><p>Donald Henson, of Penn Hills, Pennsylvania, allegedly drove at high speed toward the main entrance gate at about 2.40am, said the FBI special agent in charge of the investigation, Christopher Giordano.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/17/fbi-car-gate-suspect-pittsburgh\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump’s U.K. visit was meant to be cloistered. Protesters have other ideas.",
      "link": "https://www.washingtonpost.com/world/2025/09/17/trump-britain-protests-epstein-visit/",
      "pub_time_taipei": "2025-09-17T20:07:17+08:00",
      "summary": "President Donald Trump’s second state visit to Britain was designed to keep him away from crowds but opponents of the American president made clear they would be heard."
    },
    {
      "source": "衛報",
      "title": "EU’s proposed trade suspension with Israel ‘appropriate and proportionate’ given crisis in Gaza, Šefčovič says – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/17/germany-friedrich-merz-bundestag-afd-ukraine-russia-finland-latvia-europe-news-live-updates",
      "pub_time_taipei": "2025-09-17T20:07:07+08:00",
      "summary": "<p>EU trade commissioner says proposed partial trade suspension is ‘carefully considered response’ to humanitarian crisis in Gaza</p><p><em>Nordic correspondent</em></p><p><strong>Denmark is for the first time to buy long-range precision weapons such as missiles and drones</strong>, <strong>Mette Frederiksen</strong> has abruptly announced, as <strong>she warned “Russia is testing us”.</strong></p><p><em>There is <strong>no doubt that Russia will be a threat to Denmark and Europe</strong> for many years to come.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/17/germany-friedrich-merz-bundestag-afd-ukraine-russia-finland-latvia-europe-news-live-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Royal Etiquette 101: A primer for President Trump’s visit to Britain",
      "link": "https://www.washingtonpost.com/world/2025/09/17/royal-etiquette-101-trump-britain/",
      "pub_time_taipei": "2025-09-17T20:01:33+08:00",
      "summary": "When encountering a British royal, a bow or curtsy is okay, a hug generally is not, and “Your Majesty” or “Your Royal Highness,” is much preferred over saying “Chuck” or “Kate.”"
    },
    {
      "source": "衛報",
      "title": "Sonia Sotomayor says Americans may not know difference between presidents and kings",
      "link": "https://www.theguardian.com/us-news/2025/sep/17/sonia-sotomayor-presidents-kings-difference",
      "pub_time_taipei": "2025-09-17T19:51:55+08:00",
      "summary": "<p>Supreme court justice warns poor quality of civics education may lead to lack of understanding</p><p>The most senior liberal justice on the US supreme court has questioned whether American citizens know the difference between presidents and kings.</p><p>During a conference on civics education in New York on Tuesday, Justice Sonia Sotomayor warned that the poor quality of civics education means Americans may not be entirely clear on what makes a president different to a monarch.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/17/sonia-sotomayor-presidents-kings-difference\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Barratt Redrow warns of budget uncertainty affecting property market",
      "link": "https://www.theguardian.com/business/2025/sep/17/barratt-redrow-warns-of-budget-uncertainty-affecting-property-market",
      "pub_time_taipei": "2025-09-17T19:47:11+08:00",
      "summary": "<p>UK housebuilder reports 33% rise in revenue and 26% increase in profits but says possible tax and duty rises risk unsettling buyers</p><p>Britain’s largest housebuilder Barratt Redrow has warned of a “tough market” and expects little growth in the next 12 months amid uncertainty around property taxes.</p><p>David Thomas, the executive of the company, which was enlarged by <a href=\"https://www.theguardian.com/business/2024/feb/07/uk-biggest-housebuilder-barratt-to-buy-rival-redrow\">Barratt’s £2.5bn acquisition of Redrow</a> last October, cautioned that “the housing market remains challenging and we anticipate limited growth in 2026”.</p> <a href=\"https://www.theguardian.com/business/2025/sep/17/barratt-redrow-warns-of-budget-uncertainty-affecting-property-market\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Temu’s UK operation doubles revenues and pre-tax profits",
      "link": "https://www.theguardian.com/technology/2025/sep/17/temus-uk-operation-doubles-revenues-and-pre-tax-profits",
      "pub_time_taipei": "2025-09-17T19:44:38+08:00",
      "summary": "<p>Super-budget Chinese retailer reports revenues of $63.3m last year, almost double its $32m in 2023</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/17/uk-inflation-steady-38-in-july-official-figures-federal-reserve-interest-rates-donald-trump-state-visit-business-live\">Business live – latest updates</a></p></li></ul><p>The UK operation of the Chinese online marketplace Temu doubled revenues and pre-tax profits last year, as British consumers snapped up products offered by <a href=\"https://www.theguardian.com/world/2023/oct/06/addictive-absurdly-cheap-and-controversial-the-rise-of-chinas-temu-app\">the super-budget retailer</a>.</p><p>Temu UK reported revenues of $63.3m (£46.4m) last year, almost double the $32m in 2023, while pre-tax profits similarly surged from $2m to $3.9m, accounts show.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/17/temus-uk-operation-doubles-revenues-and-pre-tax-profits\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New Orleans church abuse documentary based on Guardian reporting wins top award",
      "link": "https://www.theguardian.com/world/2025/sep/17/new-orleans-clergy-abuse-documentary-god-as-my-witness",
      "pub_time_taipei": "2025-09-17T19:00:33+08:00",
      "summary": "<p>God As My Witness shares survivors’ stories and exposes church cover-ups as it returns to the scandal’s epicenter</p><p>A film examining the <a href=\"https://www.theguardian.com/us-news/new-orleans-clergy-abuse\">Catholic clergy molestation crisis in New Orleans</a> recently won the prize for best documentary at Colorado’s Winter Park film festival and has been chosen to be screened in the city where the scandal has unfolded.</p><p><a href=\"https://www.theguardian.com/us-news/2025/may/20/god-as-my-witness-documentary-raindance-festival\">God As My Witness</a> makes “clear that those who commit these atrocities cannot hide” while giving “a voice to the survivors, justice to the abused and a platform to be heard,” the Winter Park film festival’s director, Connor Nelson, said in a statement.</p> <a href=\"https://www.theguardian.com/world/2025/sep/17/new-orleans-clergy-abuse-documentary-god-as-my-witness\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Main suspect in Madeleine McCann case released from German prison",
      "link": "https://www.theguardian.com/world/2025/sep/17/madeleine-mccann-case-suspect-christian-bruckner-germany-prison-release",
      "pub_time_taipei": "2025-09-17T17:46:24+08:00",
      "summary": "<p>Authorities say they no longer have legal justification to hold Christian Brückner in jail after serving rape sentence</p><p>The main suspect in the disappearance of Madeleine McCann was freed on Wednesday as German authorities said they no longer had legal justification to hold him in jail.</p><p>Christian Brückner, 49, was released from prison in Sehnde, northern Germany, after serving a sentence for the rape of an American woman, then 72 years old, in Portugal in 2005, journalists at the scene reported.</p> <a href=\"https://www.theguardian.com/world/2025/sep/17/madeleine-mccann-case-suspect-christian-bruckner-germany-prison-release\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel’s ground invasion of Gaza City enters second day as more civilians flee",
      "link": "https://www.washingtonpost.com/world/2025/09/17/gaza-city-israel/",
      "pub_time_taipei": "2025-09-17T17:44:17+08:00",
      "summary": "As Israeli troops push into Gaza City, where hundreds of thousands remain, widespread network disruptions left many residents in an communications blackout."
    },
    {
      "source": "衛報",
      "title": "‘One in, one out’ deal will go ahead, says Liz Kendall after last-minute injunction",
      "link": "https://www.theguardian.com/uk-news/2025/sep/17/one-in-one-out-deal-will-go-ahead-says-liz-kendall-after-last-minute-injunction",
      "pub_time_taipei": "2025-09-17T17:32:07+08:00",
      "summary": "<p>Minister insists court ruling that blocked deportation of Eritrean man ‘will not undermine basis’ of deal with France</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer\">UK politics live – latest updates</a></p></li></ul><p>Keir Starmer’s returns deal with France will go ahead, a cabinet minister has insisted, despite a high court ruling that temporarily blocked the deportation of an Eritrean man.</p><p>Liz Kendall, the technology secretary, said the last-minute injunction stopping the 25-year-old from being flown to Paris would not scupper the “one in, one out” scheme for ever.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/17/one-in-one-out-deal-will-go-ahead-says-liz-kendall-after-last-minute-injunction\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Labor, environmental abuses detailed in China’s vast squid harvests",
      "link": "https://www.washingtonpost.com/world/2025/09/17/chinese-squid-fishing-abuses/",
      "pub_time_taipei": "2025-09-17T17:00:00+08:00",
      "summary": "A new Environmental Justice Foundation report exposes violations in the vast Chinese squid-fishing industry, which has supply chain links to the U.S. and Europe."
    },
    {
      "source": "衛報",
      "title": "Latest blow to Labor’s Pacific defence strategy might not be the embarrassment the Coalition claims",
      "link": "https://www.theguardian.com/world/2025/sep/17/png-australia-defence-treaty-delay-blow-for-anthony-albanese",
      "pub_time_taipei": "2025-09-17T16:41:03+08:00",
      "summary": "<p>Anthony Albanese must now save the defence agreement with Papua New Guinea, a week after a similar plan with Vanuatu was delayed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>When Anthony Albanese landed in Papua New Guinea for celebrations marking 50 years of independence this week, he was expecting to sign <a href=\"https://www.theguardian.com/world/2025/sep/17/australia-png-defence-treaty-delayed-anthony-albanese-papua-new-guinea\">a landmark mutual defence agreement</a> and designate the one-time colony as a formal ally of Australia.</p><p>Instead, despite insisting the text of the agreement had been approved, the prime minister left Port Moresby on Wednesday with only a 300-word joint communique signed with his counterpart, James Marape.</p> <a href=\"https://www.theguardian.com/world/2025/sep/17/png-australia-defence-treaty-delay-blow-for-anthony-albanese\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ben Roberts-Smith’s mother emails Coalition MPs saying Andrew Hastie ‘not fit’ to lead Liberals",
      "link": "https://www.theguardian.com/australia-news/2025/sep/17/ben-roberts-smiths-mother-emailed-coalition-mps-objecting-to-andrew-hastie-ever-becoming-leader-ntwnfb",
      "pub_time_taipei": "2025-09-17T16:12:55+08:00",
      "summary": "<p><strong>Exclusive:</strong> Sue Roberts-Smith sends 39-page dossier to two dozen Liberal and National MPs after fresh speculation about Hastie’s possible leadership tilt</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The mother of disgraced former soldier Ben Roberts-Smith has launched an extraordinary character attack on Andrew Hastie, emailing Coalition MPs with accusations that the man who testified in her son’s defamation trial was “not fit” to lead the Liberal party.</p><p>An email was sent from Sue Roberts-Smith’s address to at least two dozen Liberal and National MPs containing a 39-page dossier about Hastie early on Wednesday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/17/ben-roberts-smiths-mother-emailed-coalition-mps-objecting-to-andrew-hastie-ever-becoming-leader-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Conroy says Labor unconcerned by PNG-China discussions – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb",
      "pub_time_taipei": "2025-09-17T15:56:37+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/17/ben-roberts-smiths-mother-emailed-coalition-mps-objecting-to-andrew-hastie-ever-becoming-leader-ntwnfb\">Ben Roberts-Smith’s mother emails Coalition MPs saying Andrew Hastie ‘not fit’ to lead Liberals</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Two charged in Victoria after $14m in cocaine allegedly found inside car driven from NSW</strong></p><p>Victoria police <a href=\"https://www.police.vic.gov.au/two-charged-and-40kg-cocaine-worth-14m-seized-located-inside-vehicle\">charged two men overnight </a>after seizing 40kg of cocaine allegedly found inside a vehicle they were driving from the NSW border back to the state.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "America and Britain were pillars of the world order. The world has changed.",
      "link": "https://www.washingtonpost.com/world/2025/09/16/america-britain-trump-world-order/",
      "pub_time_taipei": "2025-09-17T15:53:47+08:00",
      "summary": "President Trump will meet King Charles III and Prime Minister Keir Starmer on a state visit to Britain, against a backdrop of global division, disarray and destruction."
    },
    {
      "source": "衛報",
      "title": "‘Too big for the site’: Tasmanian AFL stadium should not be built, says independent planning commission",
      "link": "https://www.theguardian.com/australia-news/2025/sep/17/tasmania-afl-stadium-hobart-independent-planning-commission-says-too-big-should-not-be-built",
      "pub_time_taipei": "2025-09-17T14:55:46+08:00",
      "summary": "<p>Proposed Macquarie Point venue a condition for state entering AFL in 2028, but report argues it would cause ‘unacceptable adverse impacts on Hobart’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The push to build a $945m home for the first AFL team in Tasmania has hit a major hurdle, with the proposed stadium condemned by the state’s planning commission as a “monolithic” blot on Hobart’s landscape and cultural heritage.</p><p>The damning report comes as the state’s premier, Jeremy Rockliff, admitted on Wednesday that the cost of the development had blown out by almost 20%, to $1.13bn.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/17/tasmania-afl-stadium-hobart-independent-planning-commission-says-too-big-should-not-be-built\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Almost 30 staff at ANU humanities school stop work after health and safety report warns of ‘serious harm’",
      "link": "https://www.theguardian.com/australia-news/2025/sep/17/almost-30-staff-at-anu-humanities-school-stop-work-after-health-and-safety-report-warns-of-serious-harm",
      "pub_time_taipei": "2025-09-17T14:41:41+08:00",
      "summary": "<p>Workers affected by university restructure advised to ‘remove themselves from the hazardous work environment’ if they believe they are at psychosocial risk</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Almost 30 staff at the Australian National University’s humanities school have stopped work after an internal report warned of psychological hazards in their workplace related to<strong> </strong>the <a href=\"https://www.theguardian.com/australia-news/2025/sep/12/anu-drama-who-will-exit-after-vice-chancellor-genevieve-bell\">institution’s restructure</a><strong>.</strong></p><p>The report was prepared by the health and safety representative (HSR) officer in ANU’s College of Arts and Social Sciences (Cass), who issued a cease-work order on Tuesday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/17/almost-30-staff-at-anu-humanities-school-stop-work-after-health-and-safety-report-warns-of-serious-harm\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UTS’s teacher education program set to close as university reveals plan to slash more than 1,000 subjects",
      "link": "https://www.theguardian.com/australia-news/2025/sep/17/utss-teacher-education-program-set-to-close-as-university-reveals-plan-to-slash-over-1000-subjects",
      "pub_time_taipei": "2025-09-17T14:37:24+08:00",
      "summary": "<p>Of 1,101 subjects to be axed, 463 had no enrolments and weren’t taught in 2024, according to University of Technology Sydney proposal</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The University of Technology Sydney will close its <a href=\"https://www.theguardian.com/commentisfree/2025/aug/21/something-is-rotten-in-australias-tertiary-education-and-utss-suspension-of-teaching-courses-is-one-of-its-biggest-disgraces\">teacher education program</a> and public health school as part of a sweeping restructure that would remove more than 1,100 subjects to return the institution to surplus.</p><p>The proposed cuts, released on Wednesday, are part of the debt-ridden university’s strategy to reduce expenditure by $100m annually, including previously announcing the cutting of about 400 jobs.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/17/utss-teacher-education-program-set-to-close-as-university-reveals-plan-to-slash-over-1000-subjects\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Human-made global warming ‘caused two in three heat deaths in Europe this summer’",
      "link": "https://www.theguardian.com/environment/2025/sep/17/human-made-global-warming-caused-two-in-three-heat-deaths-in-europe-this-summer-analysis-finds",
      "pub_time_taipei": "2025-09-17T12:00:27+08:00",
      "summary": "<p>Researchers from Imperial College London say 16,500 deaths caused by hot weather brought on by greenhouse gases</p><p>Human-made global heating caused two in every three heat deaths in Europe during this year’s scorching summer, an early <a href=\"https://www.imperial.ac.uk/media/imperial-college/grantham-institute/public/publications/institute-reports-and-analytical-notes/Summer-heat-deaths-in-854-European-cities-more-than-tripled-due-to-climate-change.pdf\">analysis of mortality</a> in 854 big cities has found.</p><p>Epidemiologists and climate scientists attributed 16,500 out of 24,400 heat deaths from June to August to the extra hot weather brought on by greenhouse gases.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/17/human-made-global-warming-caused-two-in-three-heat-deaths-in-europe-this-summer-analysis-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "France proposes ceiling on value of UK components in €150bn EU defence fund",
      "link": "https://www.theguardian.com/politics/2025/sep/17/france-proposes-ceiling-on-value-of-uk-components-in-eu-defence-fund",
      "pub_time_taipei": "2025-09-17T12:00:25+08:00",
      "summary": "<p>Negotiations soon to begin on UK’s entry to Safe scheme, which it hopes will secure bigger role for its defence firms</p><p>France has proposed limiting the use of British-produced military components in the EU’s €150bn defence fund, in a move that could complicate negotiations over the UK’s entry into the scheme.</p><p>Four diplomatic sources told the Guardian that French officials had proposed a 50% ceiling on the value of UK components in projects financed through the EU’s €150bn Security Action for Europe (Safe) fund.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/17/france-proposes-ceiling-on-value-of-uk-components-in-eu-defence-fund\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. wins release of Wells Fargo banker placed under exit ban in China",
      "link": "https://www.washingtonpost.com/national-security/2025/09/16/china-exit-ban-us-citizen-released/",
      "pub_time_taipei": "2025-09-17T10:55:42+08:00",
      "summary": "Beijing has allowed Mao Chenyue, a bank managing director in Atlanta, to return to the United States, people familiar with the matter said."
    },
    {
      "source": "衛報",
      "title": "Rocks on train tracks strand 900 Machu Picchu tourists amid protest",
      "link": "https://www.theguardian.com/world/2025/sep/17/rocks-on-train-tracks-strand-900-machu-picchu-tourists-amid-protest",
      "pub_time_taipei": "2025-09-17T09:31:30+08:00",
      "summary": "<p>About 1,400 visitors were evacuated but hundreds were left stuck because of action linked to bus contract dispute, say Peru authorities</p><p>At least 900 tourists were stranded near the ancient Inca citadel of <a href=\"https://www.theguardian.com/travel/2022/mar/23/machu-picchu-inca-site-wrong-name\">Machu Picchu </a>on Tuesday, Peru’s tourism minister said, after a passenger train service was suspended due to a protest.</p><p>PeruRail said service was suspended on Monday because the route in Peru’s mountainous Cusco region had been blocked by “rocks of various sizes” as residents clashed with authorities and bus companies. PeruRail’s local unit also said “third parties” had excavated part of its rail route, which affected the track’s stability and slowed down the evacuation of tourists.</p> <a href=\"https://www.theguardian.com/world/2025/sep/17/rocks-on-train-tracks-strand-900-machu-picchu-tourists-amid-protest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Anthony Albanese fails to seal defence treaty between Australia and PNG",
      "link": "https://www.theguardian.com/world/2025/sep/17/australia-png-defence-treaty-delayed-anthony-albanese-papua-new-guinea",
      "pub_time_taipei": "2025-09-17T08:05:39+08:00",
      "summary": "<p>Australian PM will leave Port Moresby without agreement, sparking a setback for strategy to minimise China’s influence among Pacific nations</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Anthony Albanese’s strategy of pushing back against China in the Pacific has been dealt another blow, with <a href=\"https://www.theguardian.com/australia-news/2025/sep/16/australia-png-papua-new-guinea-military-defence-treaty-agreement-as-china-pacific-influence-grows\">a major defence treaty</a> with Papua New Guinea delayed amid concerns about sovereignty.</p><p>A deal was expected with the former Australian colony this week but the prime minister is set to leave Port Moresby without signing the so-called Pukpuk mutual defence treaty with his counterpart, <a href=\"https://www.theguardian.com/world/2025/sep/16/papua-new-guinea-independence-50th-anniversary-png-world-leaders\">James Marape</a>, on Wednesday.</p> <a href=\"https://www.theguardian.com/world/2025/sep/17/australia-png-defence-treaty-delayed-anthony-albanese-papua-new-guinea\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We’re still in the dark’: a missing land defender and the deadly toll of land conflict on Indigenous people",
      "link": "https://www.theguardian.com/environment/2025/sep/17/missing-land-defender-deadly-toll-land-conflict-indigenous-people",
      "pub_time_taipei": "2025-09-17T07:01:18+08:00",
      "summary": "<p>Julia Chuñil is one of 146 land defenders who were killed or went missing last year, a third of them from Indigenous communities</p><p>One day last November, Julia Chuñil called for her dog, Cholito, and they set off into the woods around her home to search for lost livestock. The animals returned but Chuñil, who was 72 at the time, and Cholito did not.</p><p>More than 100 people joined her family in a search lasting weeks in the steep, wet and densely overgrown terrain of Chile’s ancient Valdivian forest. After a month, they even kept an eye on vultures for any grim signs. But they <a href=\"https://www.theguardian.com/global-development/2025/apr/07/what-happened-to-julia-chunil-missing-land-defender-chile\">found no trace of Chuñil</a>.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/17/missing-land-defender-deadly-toll-land-conflict-indigenous-people\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Taliban shut down WiFi, a lifeline for women and girls, in Afghan province",
      "link": "https://www.washingtonpost.com/world/2025/09/16/afghanistan-internet-ban-taliban-balkh/",
      "pub_time_taipei": "2025-09-17T04:39:55+08:00",
      "summary": "Afghan government workers in Balkh province appeared to have been taken by surprise by the WiFi ban."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump discloses U.S. targeted a third alleged drug boat from Venezuela",
      "link": "https://www.washingtonpost.com/national-security/2025/09/16/trump-drug-boat-maduro/",
      "pub_time_taipei": "2025-09-17T04:11:01+08:00",
      "summary": "The president acknowledged the incident while delivering a warning to Venezuela’s president, Nicolás Maduro."
    },
    {
      "source": "衛報",
      "title": "Bolsonaro ordered to pay damages for racist remarks in office",
      "link": "https://www.theguardian.com/world/2025/sep/16/bolsonaro-damages-brazil",
      "pub_time_taipei": "2025-09-17T03:23:00+08:00",
      "summary": "<p>Court rules former president, sentenced to 27 years for coup attempt, must pay R$1m for ‘cockroaches’ comment in 2021</p><p><a href=\"https://www.theguardian.com/world/jair-bolsonaro\">Jair Bolsonaro</a> has been ordered to pay R$1m (£138,000) in collective moral damages for remarks deemed “racist” while he was in office.</p><p>The latest ruling, delivered by a state appeals court, came less than a week after Brazil’s former president was <a href=\"https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup\">sentenced to 27 years</a> and three months in prison for leading an attempted coup to <a href=\"https://www.theguardian.com/world/2025/sep/11/jair-bolsonaro-conviction-attempted-coup-what-happens-next-explainer\">overturn the result of the 2022 election</a>.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/bolsonaro-damages-brazil\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Netanyahu’s ‘super-Sparta’ vision braces Israel for isolated economic future",
      "link": "https://www.theguardian.com/world/2025/sep/16/netanyahu-super-sparta-vision-israel-economic-future-isolation",
      "pub_time_taipei": "2025-09-17T03:03:46+08:00",
      "summary": "<p>Israeli PM’s outline of partial autarky and more militarised society stirs up backlash and concern over pariah status </p><p>Hours before unleashing a ground offensive against Gaza City on Tuesday, Benjamin Netanyahu braced his country for a future of mounting economic isolation, urging it to become a “super <a href=\"https://education.nationalgeographic.org/resource/sparta/\">Sparta</a>” of the Middle East.</p><p>The future the prime minister laid out for Israel, of a more militarised society, a partial autarky – or economically self-sufficient country – with limited trade options and relying increasingly on homemade production, has stirred up a backlash among Israelis who are ever more uneasy at the prospect of following him down the path to a pariah state.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/netanyahu-super-sparta-vision-israel-economic-future-isolation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel’s war in Gaza ‘morally, politically and legally intolerable’ says UN secretary general - as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
      "pub_time_taipei": "2025-09-17T03:01:12+08:00",
      "summary": "<p>This live blog is now closed. You can read our latest report here:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/16/israel-launches-ground-offensive-deep-inside-gaza-city\">Israel launches ground offensive deep inside Gaza City</a></p></li></ul><p>Wafa, the Palestinian news agency, <a href=\"https://english.wafa.ps/Pages/Details/161389\">has been told</a> by medical sources that at least 38 Palestinian people, including women and children, have been killed by Israeli forces since dawn today.</p><p>As well as facing relentless bombardments, Gaza City, the biggest built-up area of the territory, is being gripped by a famine caused by Israel’s restrictions on aid.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli military begins ground invasion of Gaza City",
      "link": "https://www.washingtonpost.com/world/2025/09/16/israel-gaza-city-ground-invasion/",
      "pub_time_taipei": "2025-09-17T02:14:07+08:00",
      "summary": "Palestinians in Gaza City reported a night of heavy bombardment. A U.N. commission said Israel was committing genocide in Gaza; Israel rejected the claim as “falsehoods.”"
    },
    {
      "source": "衛報",
      "title": "Israel launches ground offensive deep inside Gaza City",
      "link": "https://www.theguardian.com/world/2025/sep/16/israel-launches-ground-offensive-deep-inside-gaza-city",
      "pub_time_taipei": "2025-09-17T02:11:59+08:00",
      "summary": "<p>IDF says advance aims to ‘dismantle Hamas’s grip’ as UN report says Israel has committed genocide in territory</p><p>Israel unleashed its long-threatened ground offensive in Gaza City on Tuesday, sending tanks and remote-controlled armoured cars packed with explosives into its streets, in defiance of international criticism and the findings of a UN commission that it was committing genocide in the Palestinian territory.</p><p>“Gaza is burning. The IDF is striking terror infrastructure with an iron fist,” Israel’s defence minister, Israel Katz, wrote on X as the attack was launched in the early hours of the morning, adding: “We will not relent until the mission is completed.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-launches-ground-offensive-deep-inside-gaza-city\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.N. commission finds that Israel committed genocide in Gaza",
      "link": "https://www.washingtonpost.com/world/2025/09/16/gaza-genocide-un-israel/",
      "pub_time_taipei": "2025-09-17T01:21:42+08:00",
      "summary": "Israel rejected the conclusions, which echo those of a growing group of governments and human rights organizations."
    },
    {
      "source": "華盛頓郵報",
      "title": "Key aid groups suspend work, face tough choices as Israel invades Gaza City",
      "link": "https://www.washingtonpost.com/world/2025/09/16/gaza-city-invasion-aid-israel/",
      "pub_time_taipei": "2025-09-17T00:58:07+08:00",
      "summary": "Aid workers “face a harrowing, untenable decision: Stay and maybe be killed, or leave their homes, maybe never to return,” the head of an aid group said."
    },
    {
      "source": "衛報",
      "title": "UN tries to limit staff going to Cop30 in Brazil due to high price of hotels",
      "link": "https://www.theguardian.com/environment/2025/sep/16/un-tries-to-limit-staff-going-to-cop30-in-brazil-due-to-high-price-of-hotels",
      "pub_time_taipei": "2025-09-17T00:44:01+08:00",
      "summary": "<p>Accommodation costs at climate summit in Belem are pricing out some developing countries and media outlets</p><p></p><p>The United Nations has urged its staff to limit attendance at the Cop30 climate summit in Brazil in November due to high accommodation prices, while government delegations are still scrambling to find rooms within their budgets.</p><p>The move comes as delegations grow increasingly concerned about the cost of accommodation in the coastal Amazon city of Belem hosting Cop30. Brazil said it was working to increase the number of available hotel beds, but soaring prices for accommodation have stoked calls from some governments to relocate the conference, which Brazilian officials have rejected.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/16/un-tries-to-limit-staff-going-to-cop30-in-brazil-due-to-high-price-of-hotels\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. kills 3 in strike on alleged drug boat from Venezuela, Trump says",
      "link": "https://www.washingtonpost.com/national-security/2025/09/15/trump-venezuela-drug-strike/",
      "pub_time_taipei": "2025-09-17T00:09:21+08:00",
      "summary": "The president also signaled that his administration was preparing to take military action against Latin American cartels that move narcotics over land."
    },
    {
      "source": "衛報",
      "title": "Israel has committed genocide in Gaza, says UN commission of inquiry",
      "link": "https://www.theguardian.com/world/2025/sep/16/israel-committed-genocide-in-gaza-says-un-inquiry",
      "pub_time_taipei": "2025-09-16T23:49:17+08:00",
      "summary": "<p>Report cites scale of killings and aid blockages, and calls on member countries to punish those responsible</p><p>A UN commission has found that Israel is committing genocide in Gaza, citing tens of thousands of civilian deaths and massive destruction, and has called on member countries to punish those responsible for it.</p><p>The United Nations independent international commission of inquiry (COI), which does not speak on behalf of the UN, found that “genocide is occurring in Gaza and is continuing to occur”, said its head, Navi Pillay.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-committed-genocide-in-gaza-says-un-inquiry\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Who was Agnes Wanjiru, Kenyan woman killed near army base in 2012?",
      "link": "https://www.theguardian.com/world/2025/sep/16/who-was-agnes-wanjiru-kenya-profile",
      "pub_time_taipei": "2025-09-16T23:37:20+08:00",
      "summary": "<p>Relatives remember a dependable, kind and funny woman and remain traumatised by her death</p><p>Perhaps the Kenyan market town of Nanyuki’s greatest claim to fame was that it straddles the equator. But now it has become synonymous with something darker. It was here where Agnes Wanjiru was born and lived and where she was brutally killed.</p><p>Her family searched for her for months before her body was found stuffed into a septic tank at the same hotel where she had last been seen alive.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/who-was-agnes-wanjiru-kenya-profile\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kenya seeks arrest of former British soldier over alleged murder of Agnes Wanjiru",
      "link": "https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru",
      "pub_time_taipei": "2025-09-16T22:28:29+08:00",
      "summary": "<p>High court judge issues arrest warrant, saying a suspect has been charged in relation to 2012 death of 21-year-old</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/16/who-was-agnes-wanjiru-kenya-profile\">Profile: who was Agnes Wanjiru?</a></p></li></ul><p>A warrant has been issued for the arrest of a British national on suspicion of the murder of the Kenyan woman Agnes Wanjiru, who was found dead in the grounds of a hotel near an army base in 2012.</p><p>The high court judge Alexander Muteti issued the arrest warrant earlier on Tuesday in Kenya, with the prosecution telling the court a suspect had been charged with murder, and his extradition to Kenya was being sought.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Lesotho villagers complain of damage from water project backed by African Development Bank",
      "link": "https://www.theguardian.com/world/2025/sep/16/lesotho-villagers-complain-damage-water-project-african-development-bank",
      "pub_time_taipei": "2025-09-16T21:44:21+08:00",
      "summary": "<p>About 1,600 people file complaint to AfDB demanding transparency over forced relocations and compensation</p><p>Eighteen rural communities in Lesotho have filed a complaint with the African Development Bank (AfDB) over its funding of a multibillion-pound water project whose construction process they claim has ruined fields, polluted water sources and damaged homes.</p><p>About 1,600 people living in the villages in Mokhotlong district in north-east Lesotho are demanding transparency over planned forced relocations and compensation they say they have not been consulted on.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/lesotho-villagers-complain-damage-water-project-african-development-bank\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Judge criticizes Trump’s deportations to Ghana but says she can’t intervene",
      "link": "https://www.washingtonpost.com/immigration/2025/09/16/trump-ghana-immigration-deportations-chutkan/",
      "pub_time_taipei": "2025-09-16T21:29:07+08:00",
      "summary": "U.S. District Judge Tanya S. Chutkan said she was “dismayed” by the deportation of five men to Ghana but that the court’s “hands are tied.”"
    }
  ]
}