{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-09T20:40:04.534632+08:00",
  "window_end_taipei": "2025-09-10T20:40:04.534632+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "White House says it would back forensic analysis of signature on Epstein letter – live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
      "pub_time_taipei": "2025-09-10T20:34:51+08:00",
      "summary": "<p>Trump officials continue to insist that suggestive note and drawing were not work of the president </p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/09/trump-jeffrey-epstein-birthday-note\">Trump calls release of suggestive note ‘a dead issue’</a></p></li></ul><p><strong>A jump in greenhouse gas <a href=\"https://www.theguardian.com/environment/pollution\">pollution</a> in the US helped push global <a href=\"https://www.theguardian.com/environment/carbon-emissions\">emissions</a> higher in the first half of this year. This could be an omen of what’s to come, with <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s pro-fossil fuel agenda set to significantly slow down the emissions cuts required to avoid disastrous climate impacts, a new forecast has found.</strong></p><p>The “most abrupt shift in energy and climate policy in recent memory” that has occurred since Trump re-entered the White House will have profound consequences for the global <a href=\"https://www.theguardian.com/environment/climate-crisis\">climate crisis</a> by slowing the pace of US emissions cuts by as much as half the rate achieved over the past two decades, <a href=\"https://rhg.com/research/taking-stock-2025/\">the Rhodium Group forecast states</a>.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "South Korean woman who bit off attacker’s tongue acquitted after 61 years",
      "link": "https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years",
      "pub_time_taipei": "2025-09-10T20:34:00+08:00",
      "summary": "<p> Choi Mal-ja’s appeal gained momentum after #MeToo movement inspired her to seek justice</p><p>A South Korean court has acquitted a woman convicted six decades ago after biting off part of a man’s tongue during an alleged sexual assault, after she challenged the ruling, inspired by the country’s #MeToo movement.</p><p>Choi Mal-ja was 19 in 1964 when she was attacked by a 21-year-old man in the southern town of Gimhae.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Starmer says he has confidence in Peter Mandelson amid calls to sack him over Epstein ties – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/10/keir-starmer-isaac-herzog-pmqs-labour-kemi-badenoch-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-09-10T20:33:25+08:00",
      "summary": "<p>PM was grilled by Kemi Badenoch on suitability of Mandelson for job as US ambassador</p><p><em>Helena Horton is a Guardian environment reporter.</em></p><p><strong>Emma Reynolds</strong>, the new environment secretary, had a difficult job this morning: meeting a group of farmers after Labour caused fury in the rural community by introducing a new inheritance tax.</p><p>The Treasury reserve, designed to be used for “genuinely unforeseen, unaffordable and unavoidable pressures” has recently been used to fund higher public sector pay and compensation payouts.</p><p>In a letter to ministers, the chancellor said Treasury would only consider providing reserve funds to departments that have already maximised their savings …</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/10/keir-starmer-isaac-herzog-pmqs-labour-kemi-badenoch-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New French PM takes office as ‘Block Everything’ protests rock country – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/10/france-block-everything-protests-macron-lecornu-europe-live-news-updates",
      "pub_time_taipei": "2025-09-10T20:31:03+08:00",
      "summary": "<p>Sébastien Lecornu appointment comes amid protests across France including 1,000 demonstrators trying to enter Gare du Nord station in Paris</p><p><a href=\"https://www.theguardian.com/world/2025/sep/09/francois-bayrou-france-block-everything-protests-macron\">Emmanuel Macron appoints his third prime minister in a year</a></p><p>A teacher taking part in the protests in <strong>Paris</strong> said he was against the ousted government’s planned budget cuts. “[François]Bayrou was ousted, [now] his policies must be eliminated,” <strong>Christophe Lalande</strong> told Reuters, calling for more funding for schools and hospitals.</p><p>At another protest in the city, unionist <strong>Amar Lagha</strong> told the news agency:</p><p>This day is a message to all the workers of this country: that there is no resignation, the fight continues, and a message to this government that we won’t back down, and if we have to die, we’ll die standing.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/10/france-block-everything-protests-macron-lecornu-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Poland says Russian drones violated its airspace, risking NATO response",
      "link": "https://www.washingtonpost.com/world/2025/09/10/poland-russia-nato-drones-ukraine-war/",
      "pub_time_taipei": "2025-09-10T20:22:22+08:00",
      "summary": "The military called the breach of Poland’s airspace “unprecedented,” and it triggered a request by Warsaw to consult with fellow NATO members."
    },
    {
      "source": "衛報",
      "title": "Ursula von der Leyen calls for suspension of EU trade with Israel",
      "link": "https://www.theguardian.com/world/2025/sep/10/ursula-von-der-leyen-suspension-eu-trade-israel",
      "pub_time_taipei": "2025-09-10T20:12:15+08:00",
      "summary": "<p>Commission president cites illegal West Bank settlement plans, Gaza and attempts to ‘undermine two-state solution’</p><p>The European Commission president, Ursula von der Leyen, has called for a suspension of trade with Israel, as she spoke of Europe’s “painful” inability to respond to the war on Gaza and ensuing humanitarian disaster.</p><p>In her most extended condemnation yet of the Israeli government, von der Leyen criticised plans for illegal settlements that <a href=\"https://www.theguardian.com/world/2025/aug/14/israel-appears-set-to-approve-controversial-settlement-of-3400-homes-in-west-bank\">would split the occupied West Bank in half</a>, as well as incitement of violence by extremist Israeli ministers, as a “clear attempt to undermine the two-state solution”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/ursula-von-der-leyen-suspension-eu-trade-israel\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Starmer’s meeting with Israeli president could set relations back further",
      "link": "https://www.theguardian.com/world/2025/sep/10/israel-president-isaac-herzog-meeting-keir-starmer-analysis",
      "pub_time_taipei": "2025-09-10T20:09:17+08:00",
      "summary": "<p>Two leaders have competing visions for Israel’s security and Palestinian self-rule with little chance of finding common ground</p><p>A meeting in London between Keir Starmer and the Israeli president, Isaac Herzog, could not come at a more difficult time for either leader, and far from easing British-Israeli relations, the encounter risks setting them back yet further.</p><p>Once the meeting on Wednesday was in the diary, there was a faint hope within Downing Street that the two men would at least listen to each other about their competing visions for Israel’s future, including a two-state solution to the Palestinian conflict, a vision Herzog once shared.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/israel-president-isaac-herzog-meeting-keir-starmer-analysis\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump jeered by protesters as he dines at Washington DC restaurant",
      "link": "https://www.theguardian.com/us-news/2025/sep/10/trump-protesters-restaurant-washington-dc",
      "pub_time_taipei": "2025-09-10T20:08:48+08:00",
      "summary": "<p>Protesters shouted ‘Trump is the Hitler of our time!’ as he had a meal near the White House to promote his deployment of the National Guard</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates\">US politics live – latest updates</a></p></li></ul><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> faced protesters shouting “Free DC! Free Palestine! Trump is the Hitler of our time!” as he dined at a Washington restaurant, videos posted online showed.</p><p>The US president approached the shouting protesters in the restaurant, pausing a few feet away from them for a few moments, nodding and smiling without offering a response.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/10/trump-protesters-restaurant-washington-dc\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Poland closer to military conflict than any time since second world war, PM says after Russian drones shot down – live",
      "link": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
      "pub_time_taipei": "2025-09-10T20:04:47+08:00",
      "summary": "<p>Tusk says there were 19 violations of Polish airspace overnight and most likely that four drones shot down</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military\">Full report: Poland shoots down drones over its territory amid Russian attack on Ukraine, says military</a></p></li></ul><p>Lubelskie region governor Krzysztof Komorski is leading an emergency meeting with the police this morning. <br /><br />\n In a <a href=\"https://x.com/komorski4lbn/status/1965618423045689434\">post on X</a>, he urged residents to follow the guidance from the relevant authorities.</p><p>Prime minister Donald Tusk meanwhile said in <a href=\"https://x.com/donaldtusk/status/1965626207078437321\">his latest update</a> that he is in “constant contact” with Nato secretary general Mark Rutte.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "What to know as Poland invokes NATO Article 4, citing Russian drone violation",
      "link": "https://www.washingtonpost.com/world/2025/09/10/poland-russia-ukraine-drone-article-4-nato/",
      "pub_time_taipei": "2025-09-10T19:51:16+08:00",
      "summary": "Poland accused Russia of violating its airspace 19 times overnight, during its bombardment of neighboring Ukraine. Moscow denied the drones were Russian."
    },
    {
      "source": "衛報",
      "title": "Jaguar Land Rover says cyber-attack has affected ‘some data’",
      "link": "https://www.theguardian.com/business/2025/sep/10/jaguar-land-rover-says-cyber-attack-has-affected-some-data",
      "pub_time_taipei": "2025-09-10T19:48:00+08:00",
      "summary": "<p>Carmaker has informed relevant regulators and ‘will contact anyone as appropriate’ as investigation progresses</p><p>The cyber-attack on Jaguar Land Rover has affected data held by the carmaker, it has said, as its factories in the UK and abroad face prolonged closure.</p><p>JLR, Britain’s biggest carmaker, said on Wednesday that in its investigations into <a href=\"https://www.theguardian.com/business/2025/sep/02/jaguar-land-rover-cyber-incident-manufacturing-retail\">the hack</a>, which first emerged last week, it had now discovered data had been breached.</p> <a href=\"https://www.theguardian.com/business/2025/sep/10/jaguar-land-rover-says-cyber-attack-has-affected-some-data\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza aid flotilla carrying Greta Thunberg reports second drone attack in 24 hours",
      "link": "https://www.theguardian.com/world/2025/sep/10/gaza-aid-flotilla-carrying-greta-thunberg-reports-second-drone-attack-on-boat-at-tunisian-port",
      "pub_time_taipei": "2025-09-10T19:46:06+08:00",
      "summary": "<p>Global Sumud Flotilla says no passengers or crew harmed by alleged incendiary device dropped on boat in Tunisian port</p><p>A flotilla seeking to break Israel’s aid blockade of Gaza has said it was attacked by a drone for the second time in less than 24 hours.</p><p>The Global Sumud Flotilla (GSF), which is carrying pro-Palestinian activists, including Greta Thunberg, said in a statement early on Wednesday that it had been attacked by another drone, which dropped an incendiary device on one of its boats, the Alma, as it was moored in the port of Sidi Bou Said in Tunisia. None of the passengers or crew were harmed and no structural damage was caused, it said</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/gaza-aid-flotilla-carrying-greta-thunberg-reports-second-drone-attack-on-boat-at-tunisian-port\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel threatens ‘enemies everywhere’ after strike against Hamas in Qatar",
      "link": "https://www.washingtonpost.com/world/2025/09/10/israel-qatar-strike-hamas/",
      "pub_time_taipei": "2025-09-10T19:42:32+08:00",
      "summary": "Hamas said that Khalil al-Hayya, who had been leading indirect ceasefire talks with Israel, survived the deadly attacks on his villa in Doha, Qatar."
    },
    {
      "source": "衛報",
      "title": "UN inspectors can resume work at Iran nuclear sites after breakthrough deal",
      "link": "https://www.theguardian.com/world/2025/sep/10/un-inspectors-iran-nuclear-sites-breakthrough-deal",
      "pub_time_taipei": "2025-09-10T19:36:01+08:00",
      "summary": "<p>Rafael Grossi, IAEA director general, says agreement with Tehran is ‘important step in the right direction’</p><p>Tehran and the UN nuclear inspectorate have reached an agreement that will allow UN inspectors to return to inspect all of Iran’s nuclear sites, including those bombed by Israel and the US in June.</p><p>The breakthrough, confirmed by Rafael Grossi, the director general of the International Atomic Energy Agency, came during a three-hour meeting on Monday between Grossi and the Iranian foreign minister, Abbas Araghchi, in Cairo.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/un-inspectors-iran-nuclear-sites-breakthrough-deal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "From woodcuts to Colin Firth: how Jane Austen’s stories have been pictured",
      "link": "https://www.theguardian.com/books/2025/sep/10/from-wood-engravings-to-colin-firth-new-exhibition-depicts-the-stories-of-jane-austen",
      "pub_time_taipei": "2025-09-10T19:00:03+08:00",
      "summary": "<p>Bath museum shows how author’s illustrators and adapters have portrayed her characters through history</p><p>For the 21st-century Jane Austen fan, <a href=\"https://www.theguardian.com/books/2022/mar/25/mr-darcy-colin-firth-white-shirt-lake-scene-jane-austen-exhibition\">the images of Colin Firth’s Mr Darcy</a> in the beloved BBC series Pride and Prejudice or <a href=\"https://www.theguardian.com/film/2020/feb/14/emma-review-jane-austen-anya-taylor-joy\">Anya Taylor-Joy’s big-screen portrayal of Emma</a> may be the first to leap to mind.</p><p>But an exhibition opening in Bath celebrates the varied ways illustrators of Austen’s work and adapters of her novels have depicted some of her most cherished characters.</p> <a href=\"https://www.theguardian.com/books/2025/sep/10/from-wood-engravings-to-colin-firth-new-exhibition-depicts-the-stories-of-jane-austen\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Meet the retiree who realized his dream of joining the LSU marching band as a 66-year-old freshman",
      "link": "https://www.theguardian.com/us-news/2025/sep/10/ken-broussard-lsu-marching-band",
      "pub_time_taipei": "2025-09-10T19:00:03+08:00",
      "summary": "<p>Kent Broussard joined Louisiana State University’s famed Golden Band from Tigerland after retiring as an accountant</p><p>Some dreams live on in time forever, <a href=\"https://www.youtube.com/watch?v=XuRnNRHcN4A\">says</a> the summer <a href=\"https://www.theguardian.com/sport/olympic-games\">Olympics</a> anthem considered by many to be the greatest – and living proof of that is a retired accountant who recently enrolled as a freshman at <a href=\"https://www.theguardian.com/us-news/louisiana\">Louisiana</a> State University in his mid-60s to fulfill his lifelong ambition of playing for the school’s famed marching band.</p><p>Kent Broussard drew nationwide media attention after being shown on ESPN’s broadcast of the LSU football team’s victory at home against in-state rival Louisiana Tech on 6 September.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/10/ken-broussard-lsu-marching-band\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Starmer tightens grip on economic policy by strengthening autumn ‘budget board’",
      "link": "https://www.theguardian.com/uk-news/2025/sep/10/keir-starmer-tightens-grip-on-economic-policy-by-strengthening-autumn-budget-board",
      "pub_time_taipei": "2025-09-10T18:48:53+08:00",
      "summary": "<p>Key figures from No 10 and No 11 appointed to group include Torsten Bell, new economic adviser Minouche Shafik and comms chief Tim Allan</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/10/keir-starmer-isaac-herzog-pmqs-labour-kemi-badenoch-uk-politics-live-news-updates\">UK politics live – latest updates</a></p></li></ul><p>Keir Starmer is tightening his grip on economic policy by beefing up a committee that will help shape the 26 November budget.</p><p>Pensions minister Torsten Bell and <a href=\"https://www.theguardian.com/politics/2025/aug/29/starmer-names-former-bank-of-england-deputy-governor-as-his-chief-economic-adviser\">Starmer’s new chief economic adviser, Minouche Shafik</a>, will co-chair the “budget board”, that will meet weekly to discuss the details of the statement.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/10/keir-starmer-tightens-grip-on-economic-policy-by-strengthening-autumn-budget-board\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Leak exposes Washington Post boss Will Lewis’s role as secret adviser to Boris Johnson while PM",
      "link": "https://www.theguardian.com/uk-news/2025/sep/10/washington-post-boss-will-lewis-secret-adviser-boris-johnson-leak",
      "pub_time_taipei": "2025-09-10T18:37:10+08:00",
      "summary": "<p>Extensive meetings in 2022 between Lewis, then vice-chair of AP, and Johnson were not disclosed in transparency records</p><p>The publisher of the Washington Post, Will Lewis, is facing fresh questions over his independence after a cache of leaked files revealed he gave extensive support to Boris Johnson as a secret political adviser when Johnson was prime minister.</p><p>The files shed light on how the media executive, who at the time was vice-chair of the Associated Press news agency, worked behind the scenes with Johnson as his premiership was engulfed by a series of scandals.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/10/washington-post-boss-will-lewis-secret-adviser-boris-johnson-leak\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Four dead, including two children, attempting to cross Channel to UK in last 24 hours",
      "link": "https://www.theguardian.com/uk-news/2025/sep/10/four-dead-including-two-children-attempting-to-cross-channel-to-uk-in-last-24-hours",
      "pub_time_taipei": "2025-09-10T18:32:11+08:00",
      "summary": "<p>Number of attempts to cross Channel has been particularly high for several days, say French authorities</p><p>Four people including two children have died in two separate incidents while trying to cross the Channel to the UK in the last 24 hours, while three others are missing in a third incident.</p><p>On Tuesday night off the coast of Sangatte, France, three people lost their lives while travelling on a dinghy with 38 people onboard. Three others are missing after an incident in Neufchâtel-Hardelot, France, on a boat with 115 people onboard.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/10/four-dead-including-two-children-attempting-to-cross-channel-to-uk-in-last-24-hours\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Poland shoots down drones over its territory amid Russian attack on Ukraine | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/sep/10/first-thing-poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine",
      "pub_time_taipei": "2025-09-10T18:28:47+08:00",
      "summary": "<p>PM says operation followed ‘repeated violations of Polish airspace’. Plus, New Mexico to be first state to offer free universal childcare</p><p>Good morning.</p><p>Polish and Nato air defenses <a href=\"https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military\">shot down several drones that entered its airspace</a> on Wednesday morning, as Russia’s attack on Ukraine spread to Nato territory in the most significant way since the war began.</p><p><strong>Is this a first?</strong> A stray Ukrainian missile struck a southern Polish village in 2022, killing two people, but there have previously been no reports of Polish or other Nato defence forces destroying drones.</p><p><strong>Could it be an accident?</strong> The Ukrainian president, Volodymyr Zelenskyy, does not think so owing to the number of drones that entered Polish airspace. In his view “Moscow is always testing the limits of the possible, and if it does not meet a strong reaction, moves to a new level of escalation”.</p><p>Stay up to date with <a href=\"https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live\">our live blog</a>.</p><p><strong>How significant is this?</strong> A Georgia-based immigration attorney based said it was “outrageous” and emphasised that it was illegal to detain a valid visa-holder in this way.</p><p><strong>Are there others?</strong> Attorneys working on the case had <a href=\"https://apnews.com/article/south-korea-us-georgia-raid-hyundai-24d990562f5ac20e7d3e983a77a4f7ff\">already claimed</a> that immigrants with a valid working status were swept up alongside the people allegedly working unlawfully, and placed in removal proceedings. That view was backed up by an agency official, who spoke on condition of anonymity to discuss sensitive government matters.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/10/first-thing-poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "James McAvoy reportedly assaulted  in Toronto bar",
      "link": "https://www.theguardian.com/film/2025/sep/10/james-mcavoy-reportedly-assaulted-in-toronto-bar",
      "pub_time_taipei": "2025-09-10T18:12:49+08:00",
      "summary": "<p>Actor promoting his directorial debut California Schemin’ at the city’s film festival is reported to have been punched by another drinker</p><p>The actor James McAvoy was assaulted in a bar in Toronto, it has been reported.</p><p><a href=\"https://people.com/james-mcavoy-punched-by-man-bar-toronto-film-festival-exclusive-11806900\">According to People magazine</a>, McAvoy was “sucker punched” by another visitor to Charlotte’s Room bar on Monday evening, two days after the premiere of <a href=\"https://www.theguardian.com/film/2025/sep/07/california-schemin-review-james-mcavoys-directorial-debut\">his directorial debut, California Schemin’</a>, at the Toronto film festival.</p> <a href=\"https://www.theguardian.com/film/2025/sep/10/james-mcavoy-reportedly-assaulted-in-toronto-bar\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Poland shoots down drones over its territory amid Russian attack on Ukraine",
      "link": "https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military",
      "pub_time_taipei": "2025-09-10T18:09:58+08:00",
      "summary": "<p>Donald Tusk says operation was launched after ‘repeated violations of Polish airspace’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live\">Follow the latest updates live</a></p></li></ul><p>Poland scrambled its own and Nato air defences to shoot down several drones that entered its airspace on Wednesday morning, as Russia’s attack on Ukraine spread to Nato territory in the most significant way since the full-scale invasion more than three years ago.</p><p>Donald Tusk, Poland’s prime minister, convened an emergency meeting of the council of ministers at 8am local time, and said he was in “constant contact” with Nato’s secretary general, Mark Rutte.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Six shot dead in two days as Cape Town reels from gang violence",
      "link": "https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days",
      "pub_time_taipei": "2025-09-10T18:07:25+08:00",
      "summary": "<p>Minister admits there is ‘no proper plan’ to tackle violent crime in divided city that pulls in 2.4 million visitors  </p><p>Six people have been shot dead in two days in a <a href=\"https://www.saps.gov.za/services/downloads/2024/2024-2025_Q4_crime_stats.pdf\">crime-plagued area</a> of Cape Town, adding to the death toll in a city already reeling from the scourge of gang-related violence.</p><p>At 11.30pm on Monday, two women, aged 19 and 25, were killed and a 24-year-old woman injured in a shooting in Wallacedene, an informal settlement on Cape Town’s north-eastern edge, <a href=\"https://www.saps.gov.za/newsroom/msspeechdetail.php?nid=63778\">South African police</a> said. About 10 minutes later, two other women in their 20s were killed by gunshots to the head in a bedroom in the same area, with police saying the deaths may be linked.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/cape-town-shootings-six-people-dead-two-days\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rightwing influencer accompanied Ice agents during raids in Chicago",
      "link": "https://www.theguardian.com/us-news/2025/sep/10/rightwing-influencer-ice-raids-chicago",
      "pub_time_taipei": "2025-09-10T18:00:08+08:00",
      "summary": "<p>Ben Bergquam was with Ice agents during a raid on Sunday and yelled at protesters that they were ‘the enemy within’</p><p>A rightwing influencer accompanied officials from Immigration and Customs Enforcement (Ice) in <a href=\"https://www.theguardian.com/us-news/chicago\">Chicago</a> on Sunday as the agency ramps up arrests in the city. Ice agents arrested four people on the city’s south-west side.</p><p>Ben Bergquam, the rightwing internet personality, was with agents, filming and making content as well as getting into altercations with local residents along the way, according to a video the Guardian viewed on X. In the video, he appears to be in the car with Ice agents and nearby as they arrest people; later on he yells at a group of Chicagoans who are gathered to prevent Ice operations that they are “the enemy within”.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/10/rightwing-influencer-ice-raids-chicago\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The rules of political gravity have set in for Jacinta Nampijinpa Price – but the Coalition is still in a dangerous limbo",
      "link": "https://www.theguardian.com/australia-news/2025/sep/10/jacinta-nampijinpa-price-sussan-ley-indian-migration-comments-repercussions-for-coalition",
      "pub_time_taipei": "2025-09-10T17:51:57+08:00",
      "summary": "<p>Price’s refusal to endorse Sussan Ley’s leadership on Wednesday was a deliberate provocation that left the opposition leader no choice</p><ul><li><p>Report: <a href=\"https://www.theguardian.com/australia-news/2025/sep/10/jacinta-namipijinpa-price-refuses-to-back-sussan-ley-leadership-apologise-indian-migration-comments\">Ley dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise over migrants comments</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>For much of her short career in Canberra, the usual rules of political gravity have appeared not to apply to <a href=\"https://www.theguardian.com/australia-news/2025/sep/10/jacinta-namipijinpa-price-refuses-to-back-sussan-ley-leadership-apologise-indian-migration-comments\">Jacinta Nampijinpa Price</a>.</p><p>A firebrand, outspoken and unapologetic about almost everything, she went from a first-term backbencher from the Northern Territory to a member of the shadow cabinet in less than a term. Easily the most prominent opponent of the <a href=\"https://www.theguardian.com/australia-news/indigenous-voice-to-parliament\">Indigenous voice to parliament</a>, Price used the referendum campaign to build her political brand exponentially.</p><p>Tom McIlroy is Guardian Australia’s chief political correspondent</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/10/jacinta-nampijinpa-price-sussan-ley-indian-migration-comments-repercussions-for-coalition\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Abbott says dumped frontbencher ‘will be a big loss’ - as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb",
      "pub_time_taipei": "2025-09-10T17:16:53+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/10/jacinta-namipijinpa-price-refuses-to-back-sussan-ley-leadership-apologise-indian-migration-comments\">Ley dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise over migrants comments</a></p></li><li><p>Analysis: <a href=\"https://www.theguardian.com/australia-news/2025/sep/10/jacinta-nampijinpa-price-sussan-ley-indian-migration-comments-repercussions-for-coalition\">The rules of political gravity have set in for Jacinta Nampijinpa Price – but the Coalition is still in a dangerous limbo</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Matt Thistlethwaite</strong>, the assistant minister for foreign affairs and trade, said Israel’s <a href=\"https://www.theguardian.com/world/2025/sep/09/israel-targets-top-hamas-members-in-qatar-for-gaza-ceasefire-talks\">strikes against top Hamas members in Qatar</a> violated the nation’s sovereignty and imperilled ceasefire talks, adding the Australian government was not informed of the actions beforehand.</p><p>Thistlethwaite told RN Breakfast this morning the government condemned the strikes, adding:</p><p>These strikes violate Qatar’s sovereignty and they imperil a ceasefire and the release of the Israeli hostages. And unfortunately, they risk further escalation in the conflict.</p><p>Qatar’s been working quite hard behind the scenes alongside the United States and Egypt to try and broker a ceasefire and a release of hostages deal. So these strikes will imperil that. Nonetheless, it’s encouraging to hear Qatari leaders say that they remain committed to trying to broker an agreement and a ceasefire.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ley dumps Nampijinpa Price from shadow ministry over refusal to back leadership or apologise for migration comments",
      "link": "https://www.theguardian.com/australia-news/2025/sep/10/jacinta-namipijinpa-price-refuses-to-back-sussan-ley-leadership-apologise-indian-migration-comments",
      "pub_time_taipei": "2025-09-10T17:01:59+08:00",
      "summary": "<p>Coalition leader says firebrand Northern Territory senator ‘failed to uphold the standards I have set’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Sussan Ley has sacked Jacinta Nampijinpa Price from the shadow ministry after the firebrand senator refused to express support for the Liberal leader or apologise for <a href=\"https://www.theguardian.com/australia-news/2025/sep/04/jacinta-nampijinpa-price-blames-abc-for-claim-government-prioritising-labor-voting-migrants\">her comments about Indian migrants</a>.</p><p>Ley said Price’s frontbench position had become “untenable” after the Country Liberal senator fronted a dramatic press conference in Perth earlier in the day.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/10/jacinta-namipijinpa-price-refuses-to-back-sussan-ley-leadership-apologise-indian-migration-comments\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Emptying olive oil an ‘act of faith’, accused say, after pleading guilty to damaging Sydney’s Anzac Memorial",
      "link": "https://www.theguardian.com/australia-news/2025/sep/10/olive-oil-damaging-sydney-anzac-memorial-accused-plead-guilty-ntwnfb",
      "pub_time_taipei": "2025-09-10T16:30:06+08:00",
      "summary": "<p>Two born-again Christians admit damaging war memorial but argue their behaviour is a show of faith rather than disrespect</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Emptying bottles of olive oil on a war memorial in broad daylight is an act of faith, say two men who have admitted recklessly damaging the sacred site.</p><p>Abel Clark and Peter McMaster, both 61, may have permanently stained the granite walls and steps of Sydney’s Anzac Memorial when they “blessed” them with olive oil about midday on 4 September.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/10/olive-oil-damaging-sydney-anzac-memorial-accused-plead-guilty-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tornado in central NSW and flood rescues in Sydney as wild weather soaks state",
      "link": "https://www.theguardian.com/australia-news/2025/sep/10/tornado-in-central-nsw-and-flood-rescues-in-sydney-as-wild-weather-soaks-south-east-of-australia",
      "pub_time_taipei": "2025-09-10T16:21:25+08:00",
      "summary": "<p>Heavy rainfall forecast to continue in Sydney on Thursday as low pressure weather system heads for parts of Queensland</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Two groups have been rescued from flooding while a tornado warning for central New South Wales has been downgraded as large parts of the state brace for a further battering of rainfall and heavy winds from a low pressure system off the Tasman Sea.</p><p>The NSW State Emergency Service said it had responded to more than 90 incidents in the past 24 hours, including flood rescues for a motorist who had driven off a cliff face at Camden Bypass and a group of bushwalkers trapped by flood waters at Wattamolla.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/10/tornado-in-central-nsw-and-flood-rescues-in-sydney-as-wild-weather-soaks-south-east-of-australia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump reportedly asks EU to impose 100% tariffs on India and China",
      "link": "https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia",
      "pub_time_taipei": "2025-09-10T15:46:41+08:00",
      "summary": "<p>In effort to end Russia’s war in Ukraine, US president reportedly proposes tariffs of up to 100% targeting Putin allies and trade partners</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news\">Business live – latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live\">Europe live – latest updates</a></p></li></ul><p>Donald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to end the war in Ukraine, according to reports.</p><p>The US president made the demand during a meeting between US and EU officials discussing options to increase economic pressure on Russia on Tuesday, according to the Financial Times, BBC and Bloomberg, who cited sources familiar with the discussions.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "With Qatar attack, which countries has Israel struck since October 2023?",
      "link": "https://www.washingtonpost.com/world/2025/09/10/countries-israel-attacked-qatar-doha/",
      "pub_time_taipei": "2025-09-10T14:31:39+08:00",
      "summary": "Since Hamas’s Oct. 7 incursion, Israel has invaded Gaza and attacked five countries, including Iran and Syria."
    },
    {
      "source": "衛報",
      "title": "Trump appears sidelined as the US caught unawares by Israel’s unprecedented strikes on Qatar",
      "link": "https://www.theguardian.com/world/2025/sep/10/trump-us-israel-hamas-strike-qatar",
      "pub_time_taipei": "2025-09-10T12:00:04+08:00",
      "summary": "<p>The White House is caught between supporting Israel’s war against Hamas and  patching up relations with a key US ally in the region</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/09/israel-targets-top-hamas-members-in-qatar-for-gaza-ceasefire-talks\">Full report: Israel launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks</a></p></li></ul><p>In the aftermath of Israeli airstrikes targeting Hamas negotiators in the heart of Qatar’s capital Doha, the White House appeared sidelined from halting a conflict that Donald Trump has claimed only he could mediate.</p><p>As details of the diplomatic flurry <a href=\"https://www.theguardian.com/world/2025/sep/09/israel-targets-top-hamas-members-in-qatar-for-gaza-ceasefire-talks\">before Tuesday’s extraordinary strike</a> were revealed, it was claimed that the White House had little say in how Israel opened its latest front in its war against Hamas – this one on a US ally hosting negotiations days after Trump had claimed he was close to reaching a deal.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/trump-us-israel-hamas-strike-qatar\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Discovery of new campsite shows fugitive Tom Phillips had ‘outside help,’ NZ police say",
      "link": "https://www.theguardian.com/world/2025/sep/10/tom-phillips-new-zealand-man-fugitive-father-outside-help-nz-police-ntwnfb",
      "pub_time_taipei": "2025-09-10T10:57:50+08:00",
      "summary": "<p>Phillips had spent nearly four years hiding in the wilderness with his three children before he was killed in an exchange of fire with police on Monday</p><p>Fugitive father Tom Phillips was receiving outside help during his years on the run before he was killed in a police shoot-out this week, New Zealand police said on Wednesday as they released images that show a newly discovered campsite.</p><p>Phillips had spent nearly four years hiding in the wilderness with his three children. He was <a href=\"https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police\">killed in an exchange of fire</a> with police after reports of a burglary in the remote town of Piopio, in the central North Island, on Monday.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/tom-phillips-new-zealand-man-fugitive-father-outside-help-nz-police-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel says it’s bombing its way to peace. The region fears more chaos.",
      "link": "https://www.washingtonpost.com/world/2025/09/09/israel-qatar-strike-gaza-ceasefire-trump-analysis/",
      "pub_time_taipei": "2025-09-10T08:18:05+08:00",
      "summary": "Israeli Prime Minister Benjamin Netanyahu said the strike on Doha could “open the door to an end of the war.” Nobody in the region is buying it."
    },
    {
      "source": "衛報",
      "title": "White House says US military informed Trump about Doha strikes–  as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
      "pub_time_taipei": "2025-09-10T07:55:12+08:00",
      "summary": "<p>This blog has now closed. You can read our full report on the <a href=\"https://www.theguardian.com/world/2025/sep/09/israel-targets-top-hamas-members-in-qatar-for-gaza-ceasefire-talks\">Israeli attack on Hamas leaders in Qatar here</a> and all our reporting on <a href=\"https://www.theguardian.com/world/gaza\">Israel’s war on Gaza here</a></p><p><em>Dan Sabbagh is the Guardian’s defence and security editor</em></p><p>Fifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Elizabeth Tsurkov, Princeton student held captive in Iraq, is released, Trump says",
      "link": "https://www.washingtonpost.com/world/2025/09/09/elizabeth-tsurkov-iraq-kidnapping-release/",
      "pub_time_taipei": "2025-09-10T07:35:37+08:00",
      "summary": "Israeli-Russian dual citizen Elizabeth Tsurkov was kidnapped in 2023 by an Iran-backed militia in Iraq, and Trump said she has been moved to the U.S. embassy there."
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli strike takes fight with Hamas to Qatar, key intermediary in Gaza talks",
      "link": "https://www.washingtonpost.com/world/2025/09/09/doha-qatar-israel-strike-peace-ceasefire-gaza/",
      "pub_time_taipei": "2025-09-10T07:26:13+08:00",
      "summary": "Qatar says it will continue its efforts to mediate between Israel and Hamas. But diplomats and analysts believe the short term prospects for peace look dim."
    },
    {
      "source": "衛報",
      "title": "Junk food leads to more children being obese than underweight for first time",
      "link": "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
      "pub_time_taipei": "2025-09-10T07:01:54+08:00",
      "summary": "<p>Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef</p><p>More children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets.</p><p>There are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases.</p> <a href=\"https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli airstrike targets top Hamas leaders, upending ceasefire talks",
      "link": "https://www.washingtonpost.com/world/2025/09/09/israel-qatar-explosion-hamas/",
      "pub_time_taipei": "2025-09-10T06:36:24+08:00",
      "summary": "The attack in the Qatari capital, Doha, sought to assassinate much of Hamas’s leadership, but the militant group said no senior figures were killed."
    },
    {
      "source": "華盛頓郵報",
      "title": "Doha strike shows Israeli policy is ‘devastation’ or ‘surrender,’ former Mideast envoy says",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T06:19:57+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli strike targeting Hamas in Qatar ‘does not advance Israel or America’s goals,’ Trump says",
      "link": "https://www.washingtonpost.com/world/2025/09/09/qatar-doha-explosion-israel-hamas/",
      "pub_time_taipei": "2025-09-10T06:19:57+08:00",
      "summary": "Qatar’s prime minister said the country would continue to seek a diplomatic resolution to the war in Gaza, despite the strike."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump says U.S. alerted Qatar to Israeli attack ‘too late’ to stop it",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T05:58:42+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Qatar will continue to seek diplomatic solution on Gaza, official says",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T05:39:41+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "First two Brazilian judges vote to convict Jair Bolsonaro in coup plot trial",
      "link": "https://www.theguardian.com/world/2025/sep/09/brazil-jair-bolsonaro-trial",
      "pub_time_taipei": "2025-09-10T05:30:45+08:00",
      "summary": "<p>Three more supreme court justices to cast their votes in coming days, with verdict expected by Thursday</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/08/judge-alexandre-de-moraes-jair-bolsonaro-trial\">‘He’s always on the attack’: the Brazilian judge prosecuting Bolsonaro inspires both love and hate</a></p></li></ul><p>Jair Bolsonaro led a criminal organisation that sought to plunge Brazil back into dictatorship with a murderous power grab involving special forces assassins and a vast disinformation campaign, the supreme court judge presiding over the former president’s trial has claimed as he voted for Bolsonaro’s conviction.</p><p>Alexandre de Moraes was the first supreme court justice of five to announce his decision on Tuesday, as the trial of Bolsonaro and seven alleged co-conspirators – including four senior members of the military and the former head of Brazil’s answer to MI6 – entered its final stretch.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/brazil-jair-bolsonaro-trial\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Qatar joins growing list of countries struck by Israel since Oct. 7",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T05:16:33+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "European leaders condemn Israel’s strike for violating Qatar’s territorial integrity",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T04:21:50+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "In Gaza, Palestinians too concerned with survival to follow Doha strike",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T04:12:42+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Rep. Ro Khanna says Israeli strike in Qatar risks escalation",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T03:30:24+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Why are Hamas leaders in Doha?",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T03:27:21+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Strike in Doha comes as Gaza faces famine, mass displacement",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T03:18:51+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Qatar’s Interior Ministry said Tuesday that a member of its security forces was killed in the...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T03:01:26+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "White House says it warned Qatar officials ahead of Israeli attack",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:56:29+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Qatar denies White House claim that it informed Qataris of attack in advance",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:56:21+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump to Qatari officials: ‘Such a thing will not happen again’",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:55:16+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel issues mass displacement order for Gaza City",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:49:05+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel Defense Forces chief of staff Eyal Zamir had warned on Aug. 31 that Israel could...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:47:22+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli Doha attack hit building in upscale embassy district",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:42:50+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "French President Emmanuel Macron was one of the first European heads of government on Tuesday to...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:27:40+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas said the attack “failed” to take out Hamas leaders, including Khalil al-Hayya, a central figure...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:15:44+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Netanyahu says Israel acted ‘wholly independently’",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T02:01:50+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Canadian apiary store owner foils honey heist by marauding swarm of ‘robber bees’",
      "link": "https://www.theguardian.com/world/2025/sep/09/canada-bees-honey-heist",
      "pub_time_taipei": "2025-09-10T01:45:02+08:00",
      "summary": "<p>Raids by rival hives aren’t rare after a dry, hot summer, but Christine McDonald was surprised to find her store besieged</p><p>A Canadian beekeeper has described fending off thousands of “robber <a href=\"https://www.theguardian.com/environment/bees\">bees</a>” as they raided her shop in a brazen attempt to steal honey.</p><p>Christine McDonald, who owns Rushing River Apiaries in the British Columbia city of Terrace, said she entered her shop to find it overrun by the swarm.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/canada-bees-honey-heist\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Nepal’s prime minister resigns and parliament burns amid deadly protests",
      "link": "https://www.washingtonpost.com/world/2025/09/09/nepal-social-media-protests-prime-minister-resigns/",
      "pub_time_taipei": "2025-09-10T01:19:53+08:00",
      "summary": "Anger had been mounting for years against a Nepali political elite viewed as corrupt and out of touch, and it exploded Tuesday with sudden ferocity."
    },
    {
      "source": "華盛頓郵報",
      "title": "Whether U.S. approved Israeli attack in advance remains unclear",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:50:40+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Gulf Cooperation Council countries express solidarity with Qatar",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:44:33+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Arab countries slam Israeli strike in Doha",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:39:38+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Strike on Qatar likely to worry Egypt and Turkey, where Hamas leaders visit or live",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:23:04+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Ethiopia inaugurates Africa’s largest hydroelectric dam as Egypt rift deepens",
      "link": "https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens",
      "pub_time_taipei": "2025-09-10T00:19:28+08:00",
      "summary": "<p>Ethiopian PM says dam will electrify entire region but Egypt fears it could restrict water supply during droughts</p><p>Ethiopia has inaugurated Africa’s largest hydroelectric dam, a project that could transform the country’s energy sector but may also aggravate tensions with neighbouring Egypt.</p><p>State media showed the Ethiopian prime minister, Abiy Ahmed, touring the site of the Grand Ethiopian Renaissance Dam (GERD) in Guba district with the Kenyan president, William Ruto, the Somali president, Hassan Sheikh Mohamud, and the African Union chairperson, Mahmoud Ali Youssouf.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel claims sole responsibility for attack on Hamas leadership in Doha",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:10:13+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "The Israeli strikes appeared designed to scuttle negotiations over a ceasefire in Gaza, said a Middle...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:06:57+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Attack has damaged chance of ceasefire deal, expert says",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:03:05+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. military officials said little about the Israeli attack in Qatar on Tuesday. U.S. Central Command,...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:00:24+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "The U.S. Embassy in Qatar lifted all restrictions on its personnel, including the shelter-in-place advisory and...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-10T00:00:19+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas leaders in Doha were in the process of considering the latest proposed terms for a...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T23:56:07+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "The families of Israeli hostages in Gaza expressed concern about the potential impacts of Israel’s strike...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T23:13:22+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Qatar’s Interior Ministry said the attack was on a “Hamas residential headquarters” in Doha.",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T23:07:32+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Russia strikes eastern Ukraine village, killing 24, many retirees",
      "link": "https://www.washingtonpost.com/world/2025/09/09/ukraine-russia-glide-bomb-yarova/",
      "pub_time_taipei": "2025-09-09T23:00:11+08:00",
      "summary": "Since June, Russia has attacked Ukrainian cities nightly, launching at times hundreds of attack drones and dozens of missiles and killing hundreds of civilians."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. allies in Doha did not receive advance warning of an attack, a Western diplomat in...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T22:23:37+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Joseph Kony case in The Hague begins with accounts of alleged atrocities",
      "link": "https://www.theguardian.com/world/2025/sep/09/joseph-kony-icc-hearing-the-hague-alleged-atrocities",
      "pub_time_taipei": "2025-09-09T22:16:54+08:00",
      "summary": "<p>ICC hearing takes place in absence of Ugandan rebel leader accused of murder, rape, torture and sexual slavery</p><p>An international criminal court hearing into charges of war crimes and crimes against humanity against the Ugandan fugitive rebel leader Joseph Kony has begun with accounts of atrocities allegedly committed by his Lord’s Resistance Army.</p><p>The ICC’s first in-absentia hearing will confirm charges but cannot progress to a trial in Kony’s absence. The warlord faces 39 counts, including murder, rape, sexual slavery, enslavement and torture, allegedly committed in northern Uganda between July 2002 and December 2005.</p><p><em>Reuters and Agence France-Presse contributed to this report</em></p> <a href=\"https://www.theguardian.com/world/2025/sep/09/joseph-kony-icc-hearing-the-hague-alleged-atrocities\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Qatar says Israel targeted Hamas leadership in Doha, condemns attack",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T22:08:50+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Qatar’s capital, Doha, has been at the center of ceasefire negotiations between Israel and Hamas, with...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T22:04:14+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "The U.S. Embassy in Doha has advised American citizens in Qatar to shelter-in-place following Israeli strikes...",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T21:59:52+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "Here is the location of the strike in Qatar’s capital",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T21:46:56+08:00",
      "summary": ""
    },
    {
      "source": "華盛頓郵報",
      "title": "France ousts another prime minister, deepening Macron’s troubles",
      "link": "https://www.washingtonpost.com/world/2025/09/08/france-no-confidence-vote-macron/",
      "pub_time_taipei": "2025-09-09T21:39:02+08:00",
      "summary": "The National Assembly voted to force François Bayrou to resign, France’s second government collapse in less than a year, which sets the stage for the fourth premier in 20 months."
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel says it targeted Hamas leaders",
      "link": "https://www.washingtonpost.com",
      "pub_time_taipei": "2025-09-09T21:36:36+08:00",
      "summary": ""
    },
    {
      "source": "衛報",
      "title": "Nepal prime minister quits after deaths at protests sparked by social media ban",
      "link": "https://www.theguardian.com/world/2025/sep/09/nepal-protests-social-media-ban-lifted-gen-z-kathmandu",
      "pub_time_taipei": "2025-09-09T20:50:23+08:00",
      "summary": "<p>KP Sharma Oli resigns as police meet protests with deadly force, leaving 19 dead, and federal parliament is set alight </p><p>Nepal’s prime minister has resigned after some of the worst unrest in decades rocked the country this week, set off by a ban on social media and discontent at political corruption and nepotism.</p><p>KP Sharma Oli’s resignation came a day after <a href=\"https://www.theguardian.com/world/2025/sep/08/nepal-bans-26-social-media-sites-including-x-whatsapp-and-youtube\">widespread protests were met with deadly force</a> by police, leaving 19 dead and hundreds injured. The spark for the protests was a government ban on 26 prominent social media apps, but escalated into a larger mass movement against corruption among political elites.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/nepal-protests-social-media-ban-lifted-gen-z-kathmandu\">Continue reading...</a>"
    }
  ]
}