{
  "mode": "last_24h",
  "window_start_taipei": "2025-08-31T20:40:06.988824+08:00",
  "window_end_taipei": "2025-09-01T20:40:06.988824+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Russian interference suspected after Von der Leyen’s plane hit by GPS jamming over weekend – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
      "pub_time_taipei": "2025-09-01T20:34:02+08:00",
      "summary": "<p>Plane landed safely in Bulgaria but authorities suspect jamming due to ‘blatant interference from Russia’, says European Commission spokesperson</p><p>EU transport spokesperson <strong>Anna-Kaisa Itkonen</strong> also offered a bit more detail on the issue of GPS jamming and its impact on operations.</p><p>She said:</p><p><em>“Generally, <strong>we have been seeing a quite a lot of such jamming and spoofing activities, notably in the eastern flank of Europe.</strong></em></p><p><em><strong>Europe is</strong> the most concerned region in the or <strong>most affected region globally</strong>, on this.</em></p><p><em>“We are, of course, aware and used to somehow to the threats and intimidations that are [a] regular component of Russia’s hostile behaviour.</em></p><p><em>Of course, <strong>this will only reinforce even further our unshakable commitment to ramp up defence capabilities and support for Ukraine.</strong>”</em></p><p><em>“This incident actually underlines the urgency of the mission that the President is carrying out in the frontline member states.”</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "No 10 says Downing Street reshuffle shows its ‘focus on delivery’ as Tories claim government is ‘in crisis’ – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news",
      "pub_time_taipei": "2025-09-01T20:28:21+08:00",
      "summary": "<p>Darren Jones moved to new senior role in Downing Street and former Blair adviser Tim Allan to lead communications</p><p>And while we are talking about Blair-era Labour aides, <strong>Peter Hyman</strong>, who wrote speeches for Tony Blair and later worked for Keir Starmer in the run-up to the general election, has launched <a href=\"https://substack.com/home/post/p-172073144\">a new Substack blog</a>. It is called Changing the Story, which tells you quite a lot about what he thinks is going wrong with No 10. Here is an extract from his first post.</p><p>Starmer is an ‘opportunity’ prime minister forced to become a ‘security’ one. And that’s why the government’s narrative is seen by some to be elusive.</p><p>Let me explain.</p><p>I remember well Tim Allan’s leaving drinks at Number 10 in the earlyish Blair era. In his fulsome farewell speech Tony Blair noted only half jokingly “Tim’s even more right wing than me..”</p><p>The same Tim Allan who as head of Portland had a contract to polish Vladimir Putin’s reputation?</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Afghanistan earthquake live: ‘There is death in every home’, families say, after 800 killed in quake in east of country",
      "link": "https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports",
      "pub_time_taipei": "2025-09-01T20:28:13+08:00",
      "summary": "<p>Several villages in Kunar province ‘completely destroyed’, says public health ministry, as rescue operations take place</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/01/afghanistan-earthquake-near-jalalabad-magnitude-6-quake-pakistan-border\">Magnitude 6 earthquake hits eastern Afghanistan</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/sep/01/how-have-you-been-affected-by-the-earthquake-in-afghanistan\">How have you been affected by the earthquake?</a></p></li></ul><p>One resident in Afghanistan’s <strong>Nurgal district</strong>, one of the worst-affected areas in Kunar, said almost the entire village had collapsed under the force of the earthquake. <br /><br />\n “Children are under the rubble. The elderly are under the rubble. Young people are under the rubble,” the villager, who did not give his name, told the Associated Press.</p><p>“We need help here,” he pleaded. “We need people to come here and join us. Let us pull out the people who are buried. There is no one who can come and remove dead bodies from under the rubble.”</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel committing genocide in Gaza, world’s top scholars on the crime say",
      "link": "https://www.theguardian.com/world/2025/sep/01/israel-committing-genocide-in-gaza-worlds-top-scholars-on-the-say",
      "pub_time_taipei": "2025-09-01T20:06:16+08:00",
      "summary": "<p>International Association of Genocide Scholars resolution backed by 86% of members who voted</p><p>An overwhelming majority of members of the world’s leading genocide scholars’ association have backed a resolution stating that Israel’s actions in Gaza meet the legal definition of the crime.</p><p>Eighty-six per cent of those who voted in the 500-member International Association of Genocide Scholars (IAGS) supported the motion. The resolution states that “Israel’s policies and actions in Gaza meet the legal definition of genocide in article II of the United Nations convention for the prevention and punishment of the crime of genocide (1948).”</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/israel-committing-genocide-in-gaza-worlds-top-scholars-on-the-say\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weinstein accuser Kaja Sokola: ‘It is very important for people to speak out’",
      "link": "https://www.theguardian.com/world/2025/sep/01/harvey-weinstein-accuser-kaja-sokola",
      "pub_time_taipei": "2025-09-01T20:00:08+08:00",
      "summary": "<p>Woman who testified at producer’s trial says despite mixed verdict she is proud to have stood up and told her story </p><p>Victims of sexual crimes and #MeToo harassment have, on multiple fronts, seen setbacks in the US in recent months.</p><p>The movie mogul Harvey Weinstein is now looking at a third trial on sexual assault charges after previous cases delivered mixed results for his victims. A high-profile case of federal racketeering conspiracy and sex trafficking against the rapper Sean Combs returned a verdict only on lesser charges.</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/harvey-weinstein-accuser-kaja-sokola\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We’re winning a battle’: Mexico’s jaguar numbers up 30% in conservation drive",
      "link": "https://www.theguardian.com/world/2025/sep/01/mexico-jaguar-numbers-rise-conservation-drive",
      "pub_time_taipei": "2025-09-01T19:49:48+08:00",
      "summary": "<p>Conservationists hope that in 15 years species will no longer be at risk of extinction in Mexico – but challenges remain</p><p>In 2010, Gerardo Ceballos and a group of other researchers set out to answer a burning question: how many jaguars were there in Mexico? They knew there weren’t many. Hunting, loss of habitat, conflict with cattle ranchers and other issues had pushed the population to the brink of extinction.</p><p>Ceballos and his team from the National Alliance for Jaguar Conservation (ANCJ) thought there were maybe 1,000 jaguars across the country. They decided to carry out the country’s first census of the animal to find out exactly how many there were. They found 4,100.</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/mexico-jaguar-numbers-rise-conservation-drive\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump’s war on Fed is ‘serious danger’ to world economy, says ECB head",
      "link": "https://www.theguardian.com/us-news/2025/sep/01/trump-us-fed-ecb-christine-lagarde",
      "pub_time_taipei": "2025-09-01T19:46:37+08:00",
      "summary": "<p>Undermining independence of central bank will affect the US and other countries, says Christine Lagarde</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Donald Trump’s attempt to influence the US Federal Reserve could pose a “very serious danger” for the world economy, the head of the European Central Bank has warned.</p><p>Christine Lagarde, the president of the ECB, said Trump undermining the independence of the world’s most powerful central bank would have an impact for the US and other countries.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/01/trump-us-fed-ecb-christine-lagarde\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Why more and more people are tuning the news out: ‘Now I don’t have that anxiety’",
      "link": "https://www.theguardian.com/society/ng-interactive/2025/sep/01/news-avoidance-high-anxiety",
      "pub_time_taipei": "2025-09-01T19:00:34+08:00",
      "summary": "<p>Emotional toll of constant negative news and unlimited access to ‘doomscrolling’ has led to record-high news avoidance</p><p>News has never been more accessible – but for some, that’s exactly the problem. Flooded with information and relentless updates, more and more people around the world are tuning out.</p><p>The reasons vary: for some it’s the sheer volume of news, for others the emotional toll of negative headlines or a distrust of the media itself. In online forums devoted to mindfulness and mental health, people discuss how to step back, from setting limits to cutting the news out entirely.</p> <a href=\"https://www.theguardian.com/society/ng-interactive/2025/sep/01/news-avoidance-high-anxiety\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Magnitude 6 earthquake in eastern Afghanistan leaves at least 800 dead | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/sep/01/first-thing-magnitude-6-earthquake-in-eastern-afghanistan-leaves-at-least-800-dead",
      "pub_time_taipei": "2025-09-01T18:57:41+08:00",
      "summary": "<p>Rescue efforts hampered by steep terrain after shallow quake that was felt more than 100 miles away in Kabul. Plus, the liberal who loves hunting and wants to change your mind</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>A powerful earthquake that hit eastern Afghanistan has left <a href=\"https://www.theguardian.com/world/2025/sep/01/afghanistan-earthquake-near-jalalabad-magnitude-6-quake-pakistan-border\">more than 800 people dead</a> and injured about 2,500, according to Taliban officials.</p><p><strong>Is the death toll expected to rise?</strong> Yes, it’s expected to rise significantly as local hospitals report being inundated with casualties and hundreds still remain unaccounted for. Medics at the provincial hospital in Asadabad in Kunar described the situation as an overwhelming crisis, with new patients arriving every few minutes.</p><p><strong>Why does Trump want to mandate ID for voters?</strong> The voting reform push by Trump stems from baseless claims that the 2020 election he lost was stolen from him.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/01/first-thing-magnitude-6-earthquake-in-eastern-afghanistan-leaves-at-least-800-dead\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Reeves says Thames Water should find ‘market-based solution’",
      "link": "https://www.theguardian.com/business/2025/sep/01/rachel-reeves-thames-water-creditors",
      "pub_time_taipei": "2025-09-01T18:35:20+08:00",
      "summary": "<p>Chancellor aims to reassure creditors but says ministers are planning for all options including special administration</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Rachel Reeves has told investors she would like to see a “market-based solution” for problems at Thames Water, rather than placing the company into special administration.</p><p>The chancellor sent a letter in July to the Thames Water creditor group, which represents about 100 financial institutions that are trying to create a rescue plan for the company.</p> <a href=\"https://www.theguardian.com/business/2025/sep/01/rachel-reeves-thames-water-creditors\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Donald Trump says he is not a dictator. Isn’t he?",
      "link": "https://www.theguardian.com/us-news/ng-interactive/2025/sep/01/trump-dictator-authoritarianism-politics",
      "pub_time_taipei": "2025-09-01T18:00:34+08:00",
      "summary": "<p>From deploying the national guard to targeting news channels and schools, the US president’s actions are anything from typical of a democratic leader</p><p>Speaking in the Oval Office this week, <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> had something he wanted to clarify.</p><p>“I’m not a dictator. I don’t like a dictator,” the president said.</p> <a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/sep/01/trump-dictator-authoritarianism-politics\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: deep trough over Europe brings severe storms",
      "link": "https://www.theguardian.com/environment/2025/sep/01/weather-tracker-deep-trough-europe-severe-storms-france-italy-slovenia",
      "pub_time_taipei": "2025-09-01T17:43:11+08:00",
      "summary": "<p>Heavy rain, lightning and tornadoes lash swaths of continent, with France, Italy and Slovenia among worst hit</p><p>Severe storms linked to a deep upper air trough formed from the ex-hurricane Erin lashed parts of western and southern Europe last week.</p><p>Italy was hit by severe rainfall on Thursday that caused flooding in the Lombardy region. The commune of Busto Arsizio was badly affected, with more than 100mm of rain and frequent lightning.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/01/weather-tracker-deep-trough-europe-severe-storms-france-italy-slovenia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Royal Mail returns to profit as takeover brings ‘year of change’",
      "link": "https://www.theguardian.com/business/2025/sep/01/royal-mail-profit-takeover-ids-daniel-kretinsky",
      "pub_time_taipei": "2025-09-01T17:28:05+08:00",
      "summary": "<p>Rise in profit comes a year after parent company IDS agreed to acquisition by Daniel Křetínský’s EP Group</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Royal Mail has made a profit for the first time in three years, its owner said in its first results since its £3.6bn takeover by the Czech billionaire Daniel Křetínský.</p><p>International Distribution Services (IDS), which owns Royal Mail, said the postal service made a pre-tax profit of £194m in its financial year ended in March, up from a loss of £143m last year, as parcel volumes increased.</p> <a href=\"https://www.theguardian.com/business/2025/sep/01/royal-mail-profit-takeover-ids-daniel-kretinsky\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two skydivers snagged on newly added plane step before falling to their deaths, NSW court hears",
      "link": "https://www.theguardian.com/australia-news/2025/sep/01/nsw-skydivers-stephen-hoare-alex-welling-death-court-ntwnfb",
      "pub_time_taipei": "2025-09-01T17:27:57+08:00",
      "summary": "<p>Experienced instructor Stephen Hoare and his tandem passenger Alex Welling died while skydiving at Goulburn airport</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Two skydivers became snagged on a plane and dangled frantically mid-air before falling to their deaths, with critical safety checks overlooked before the “catastrophic” jump, a court has been told.</p><p>Experienced instructor Stephen Hoare, 37, and his tandem passenger Alex Welling, 32, died while skydiving at Goulburn airport, in southern New South Wales, on 27 June 2021.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/01/nsw-skydivers-stephen-hoare-alex-welling-death-court-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Nothing secret’ about the $400m Nauru deportation plan, says Anthony Albanese",
      "link": "https://www.theguardian.com/australia-news/2025/sep/01/nothing-secret-about-the-400m-nauru-deportation-plan-says-anthony-albanese",
      "pub_time_taipei": "2025-09-01T17:22:23+08:00",
      "summary": "<p>Amid backbench and opposition criticism, the prime minister says non-citizens do not have a ‘legitimate’ reason to stay in Australia</p><p>Anthony Albanese has insisted there’s “nothing secret” about <a href=\"https://www.theguardian.com/australia-news/2025/aug/30/australia-signs-400m-deal-to-deport-foreign-born-former-detainees-to-nauru\">a $400m deal with Nauru to offload hundreds of non-citizens</a> to the tiny Pacific island as questions mount over the agreement’s fine print.</p><p>The Albanese government quietly announced the news on Friday evening without attaching a dollar figure to the deal, nor providing details of the agreement between the nations.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/01/nothing-secret-about-the-400m-nauru-deportation-plan-says-anthony-albanese\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Magnitude 6 earthquake in eastern Afghanistan leaves at least 800 dead",
      "link": "https://www.theguardian.com/world/2025/sep/01/afghanistan-earthquake-near-jalalabad-magnitude-6-quake-pakistan-border",
      "pub_time_taipei": "2025-09-01T16:57:11+08:00",
      "summary": "<p>Rescue efforts hampered by steep terrain after shallow quake that was felt  more than 100 miles away in Kabul</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports\">Afghanistan earthquake – latest updates</a></p></li></ul><p>A powerful earthquake that hit eastern Afghanistan has left more than 800 people dead and injured about 2,500, according to Taliban officials.</p><p>The magnitude 6 earthquake hit four provinces in eastern Afghanistan around midnight on Sunday, with the rugged, mountainous region of Kunar the worst affected, triggering landslides and flooding.</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/afghanistan-earthquake-near-jalalabad-magnitude-6-quake-pakistan-border\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Keir Starmer shakes up No 10 operation with mini-reshuffle",
      "link": "https://www.theguardian.com/politics/2025/sep/01/keir-starmer-shakes-up-no-10-operation-with-mini-reshuffle",
      "pub_time_taipei": "2025-09-01T16:19:12+08:00",
      "summary": "<p>Exclusive: Darren Jones appointed to new senior role in charge of day-to-day delivery of PM’s priorities</p><p>Darren Jones, the chief secretary to the Treasury, has been moved to a new senior role in Downing Street as Keir Starmer attempts to get a grip on delivery before what is likely to be a tumultuous autumn for the government, the Guardian understands.</p><p>The senior MP, whose new title will be chief secretary to the prime minster, has been put in charge of day-to-day delivery of the prime minister’s priorities after No 10 spent the summer struggling to get on the front foot on issues including the economy and migration, and lags behind Reform UK in the polls.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/01/keir-starmer-shakes-up-no-10-operation-with-mini-reshuffle\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "PM says neo-Nazi giving speech from Victoria’s parliament steps ‘isn’t the Australian way’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/01/australia-politics-live-labor-coalition-housing-net-zero-anthony-albanese-sussan-ley-question-time-ntwnfb",
      "pub_time_taipei": "2025-09-01T16:13:19+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/01/victoria-police-say-people-helping-alleged-porepunkah-shooting-gunman-dezi-freeman-ntwnfb\">‘Come forward’: police say people ‘know the whereabouts’ of alleged Porepunkah killer Dezi Freeman</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Shadow immigration minister says Coalition support ‘sustainable’ migration</strong></p><p>Asked about the Coalition’s own migration policy, Scarr says he supports a “sustainable” level of migration.</p><p>That looks like considering things like skill shortages, considering things like our humanitarian intake. Australia has always had a generous humanitarian intake for decades and decades.</p><p>Net overseas migration obviously was in negative territory during Covid, and then we had these huge increases during the first two years of the Albanese government, and that has distorted, in many respects, the debate.</p><p>We just need to be terribly careful when we’re discussing issues such as immigration, that the fringes, the extremes don’t get a foothold in the debate.</p><p>I think when we see neo-Nazis address a crowd of people in some of our major cities that raises material concerns with respect to social cohesion in our country.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/01/australia-politics-live-labor-coalition-housing-net-zero-anthony-albanese-sussan-ley-question-time-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Elon Musk shares post on X with incorrect attendance figures for Australia’s anti-immigration protests",
      "link": "https://www.theguardian.com/australia-news/2025/sep/01/elon-musk-shares-post-on-x-with-incorrect-attendance-figures-for-australias-anti-immigration-protests",
      "pub_time_taipei": "2025-09-01T16:11:22+08:00",
      "summary": "<p>The March for Australia demonstrations were promoted by neo-Nazis, anti-lockdown figures and other fringe groups</p><p>Elon Musk has shared a post on social media that wrongly claims 150,000 <a href=\"https://www.theguardian.com/australia-news/2025/sep/01/neo-nazis-attack-camp-sovereignty-indigenous-site-melbourne-anti-immigration-protest-police-injured-sydney-ntwnfb\">people took part in anti-immigration protests</a> in the Australian cities of Sydney and Brisbane, despite police estimating the total of those in attendance was about 21,000.</p><p>Musk shared a post from an X user showing a video of a protest held in Sydney on Sunday, under the banner March for Australia.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/01/elon-musk-shares-post-on-x-with-incorrect-attendance-figures-for-australias-anti-immigration-protests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Queensland showdown looms over pill-testing clinic’s plan to reopen with private funds",
      "link": "https://www.theguardian.com/australia-news/2025/sep/01/queensland-pill-testing-showdown-clinics-reopen-private-funds",
      "pub_time_taipei": "2025-09-01T15:23:58+08:00",
      "summary": "<p>Deputy premier threatens to ban practice that was opened as publicly funded service by previous Labor government and then shut down by LNP</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Queensland government is set for a showdown over its objections to a plan to reopen a pill testing clinic in Brisbane with private funding.</p><p>The Loop Australia – which operated the CheQpoint clinic in Bowen Hills, in Brisbane’s inner north, with public money until April – has announced a plan to reopen on Friday after it received a private donation.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/01/queensland-pill-testing-showdown-clinics-reopen-private-funds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK house prices in surprise fall amid high mortgage costs",
      "link": "https://www.theguardian.com/money/2025/sep/01/uk-house-prices-fall-mortgage-costs-august-nationwide",
      "pub_time_taipei": "2025-09-01T15:21:45+08:00",
      "summary": "<p>Average price for a home drops by 0.1% to £271,079 in August compared with July, according to Nationwide</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>UK house prices unexpectedly fell in August as high mortgage costs dampened activity.</p><p>The average price for a home dropped by 0.1% to £271,079 compared with July, according to Nationwide Building Society. Economists had expected a rise of 0.2%, according to a poll by Reuters.</p> <a href=\"https://www.theguardian.com/money/2025/sep/01/uk-house-prices-fall-mortgage-costs-august-nationwide\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Xi Jinping criticises ‘bullying behaviour’ and Putin blames west for Ukraine war at Shanghai summit",
      "link": "https://www.theguardian.com/world/2025/sep/01/xi-jinping-putin-china-summit-shanghai",
      "pub_time_taipei": "2025-09-01T14:00:02+08:00",
      "summary": "<p>China’s leader urges attendees to oppose ‘cold war mentality’ while Russian president claims Ukraine war was ‘provoked by the west’</p><p>Xi Jinping has criticised the “bullying behaviour” of other countries while Vladimir Putin has blamed the west for his war on Ukraine, on the second day of a major summit in China which seeks to challenge western-led multilateral blocs.</p><p>The Shanghai Cooperation Summit (SCO) began in the city of Tianjin on Sunday, with<a href=\"https://www.theguardian.com/world/2025/aug/31/putin-modi-erdogan-xi-china-talks\"> Xi welcoming dozens of leaders</a> from Eurasian member states and other partner and observer countries, including Putin, and Indian prime minister Narendra Modi.</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/xi-jinping-putin-china-summit-shanghai\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Indonesia protests: president scraps lawmakers’ perks in bid to calm tensions",
      "link": "https://www.theguardian.com/world/2025/sep/01/indonesia-protests-president-prabowo-subianto-scraps-lawmakers-perks",
      "pub_time_taipei": "2025-09-01T13:12:56+08:00",
      "summary": "<p>Police set up checkpoints across Jakarta on Monday after deadly protests that have forced Prabowo Subianto to remove perks include a housing allowance worth 10 times the minimum wage</p><p>Indonesian political parties have agreed to cut some lawmakers’ perks, including a controversial $3,000 housing allowance, the president said, as security measures were stepped up in an attempt to halt protests that have gripped the country for a week.</p><p>President Prabowo Subianto, accompanied by leaders of eight Indonesian political parties, told a televised news conference in the capital, Jakarta, on Sunday that they had agreed to cut the housing allowance and suspend overseas trips for members of parliament.</p> <a href=\"https://www.theguardian.com/world/2025/sep/01/indonesia-protests-president-prabowo-subianto-scraps-lawmakers-perks\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US reportedly suspends visa approvals for nearly all Palestinian passport holders",
      "link": "https://www.theguardian.com/us-news/2025/aug/31/palestine-passport-visa-approval-suspension",
      "pub_time_taipei": "2025-09-01T07:28:34+08:00",
      "summary": "<p>Restrictions to prevent travel for healthcare and college and come after denying visas to Palestinian Authority leaders</p><p>The United States has suspended visa approvals for nearly everyone who holds a <a href=\"https://www.theguardian.com/world/palestinian-territories\">Palestinian</a> passport, the New York Times reported on Sunday.</p><p>The restrictions go beyond those <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s <a href=\"https://www.theguardian.com/us-news/trump-administration\">administration</a> had <a href=\"https://www.theguardian.com/world/2025/aug/29/us-denies-palestinian-authority-visa-general-assembly\">previously announced</a> on visitors from Gaza. They would prevent Palestinians from traveling to the United States for medical treatment, attending college and business travel, the newspaper reported, citing unidentified officials.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/31/palestine-passport-visa-approval-suspension\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Houthis detain at least 11 UN workers in raids on two agencies in Sana’a",
      "link": "https://www.theguardian.com/world/2025/aug/31/houthis-raid-offices-un-agencies-wfp-unicef-sanaa-yemen",
      "pub_time_taipei": "2025-09-01T03:47:54+08:00",
      "summary": "<p>UN condemns ‘arbitrary detentions’ by Iran-backed group at World Food Programme and Unicef offices in Yemen</p><p>The Iranian-backed Houthis raided offices of the UN’s food, health and children’s agencies in Yemen’s capital, detaining at least 11 employees, as the rebels tightened security across Sana’a after <a href=\"https://www.theguardian.com/world/2025/aug/30/yemens-houthis-say-israeli-airstrike-killed-their-prime-minister\">the Israeli killing of their prime minister</a> and several cabinet members.</p><p>The UN envoy for Yemen, Hans Grundberg, said on Sunday evening: “I strongly condemn the new wave of arbitrary detentions of UN personnel today in Sana’a and Hodeidah … as well as the forced entry into UN premises and seizure of UN property. At least 11 UN personnel were detained.”</p> <a href=\"https://www.theguardian.com/world/2025/aug/31/houthis-raid-offices-un-agencies-wfp-unicef-sanaa-yemen\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK still intends to recognise a Palestinian state, David Lammy to tell MPs",
      "link": "https://www.theguardian.com/politics/2025/aug/31/uk-still-intends-to-recognise-a-palestinian-state-david-lammy-to-tell-mps",
      "pub_time_taipei": "2025-09-01T01:10:22+08:00",
      "summary": "<p>Foreign secretary to say an assessment will be carried out of whether Israel has complied with Keir Starmer’s terms</p><p>David Lammy will tell MPs on Monday that the UK still intends to recognise a Palestinian state in September, with Israel having shown no sign of meeting the government’s demands.</p><p>The foreign secretary will say in a Commons statement that government officials intend to carry out a formal assessment in the coming days of whether Israel has complied with the tests set out by the prime minister, Keir Starmer.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/31/uk-still-intends-to-recognise-a-palestinian-state-david-lammy-to-tell-mps\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli airstrikes and gunfire have killed 30 around Gaza City, local officials say",
      "link": "https://www.theguardian.com/world/2025/aug/31/israeli-airstrikes-gunfire-gaza-city",
      "pub_time_taipei": "2025-09-01T00:08:32+08:00",
      "summary": "<p>Toll includes 13 people trying to get food near distribution point, as Israeli cabinet to discuss next stages of offensive  </p><p>Israeli airstrikes and gunfire killed at least 30 people in and around Gaza City, local health authorities said, as a 20-boat <a href=\"https://www.theguardian.com/environment/2025/aug/31/aid-flotilla-with-greta-thunberg-set-to-sail-for-gaza-to-break-siege\">humanitarian aid flotilla</a> carrying activists including Greta Thunberg set sail from Barcelona for the stricken territory.</p><p>Authorities said the toll from Israeli tank and gunfire included 13 people who died trying to get food near a distribution site in the Gaza Strip, two in a house in Gaza City and 15, including five children, in a strike on a residential building on Saturday.</p><p><em>With Reuters and Agence France-Presse</em></p> <a href=\"https://www.theguardian.com/world/2025/aug/31/israeli-airstrikes-gunfire-gaza-city\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Putin, Modi and Erdoğan among leaders in China for talks with Xi",
      "link": "https://www.theguardian.com/world/2025/aug/31/putin-modi-erdogan-xi-china-talks",
      "pub_time_taipei": "2025-08-31T23:18:31+08:00",
      "summary": "<p>Chinese president hosts bilateral meetings on sidelines of Shanghai Cooperation Organisation summit in Tianjin</p><p>Xi Jinping and Vladimir Putin have met on the sidelines of a showpiece summit in China that seeks to challenge US-led, western-dominated blocs and is being attended by the leaders of more than two dozen nations.</p><p>The Chinese and Russian leaders, who are closely allied under what they have termed a “limitless” partnership, discussed Putin’s recent meeting with Donald Trump, according to a Kremlin official, who gave no further details.</p> <a href=\"https://www.theguardian.com/world/2025/aug/31/putin-modi-erdogan-xi-china-talks\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Lyon mayor condemns ‘Free Gaza’ defacement of Holocaust memorial",
      "link": "https://www.theguardian.com/world/2025/aug/31/lyon-mayor-condemns-free-gaza-defacement-of-holocaust-memorial",
      "pub_time_taipei": "2025-08-31T23:02:23+08:00",
      "summary": "<p>Mayor says city stands firm against antisemitism after message scratched into black marble memorial </p><p>A Holocaust memorial unveiled only eight months ago in the French city of Lyon has been inscribed with the words “Free Gaza”, local officials said, amid growing concern about antisemitic incidents in France.</p><p>The words were scratched into the black marble memorial late on Saturday, the city’s mayor, Grégory Doucet<em>,</em> said.<em> </em>Yonathan Arfi, of the Council of French Jewish Institutions (CRIF), posted a photo on social media and called the incident “despicable”.</p> <a href=\"https://www.theguardian.com/world/2025/aug/31/lyon-mayor-condemns-free-gaza-defacement-of-holocaust-memorial\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Vladimir Putin meets Xi Jinping arrives in China for security summit – Ukraine war live",
      "link": "https://www.theguardian.com/world/live/2025/aug/31/russia-ukraine-war-control-major-ukrainian-city-latest-updates-news-live",
      "pub_time_taipei": "2025-08-31T22:47:58+08:00",
      "summary": "<p>Russian president and his Chinese counterpart shake hands as more than 20 world leaders attend Shanghai Cooperation Organisation summit in Tianjin</p><p>Following a meeting with Ukraine’s top general, <strong>Oleksandr Syrsky</strong>, Ukrainian President <strong>Volodymyr Zelenskyy</strong> said that his country’s forces are planning new strikes deep into Russia.</p><p><a href=\"https://x.com/ZelenskyyUa/status/1962094455181160741\">In a post on X</a>, the Ukrainian leader wrote:</p><p><em>We analysed in detail the situation in the Zaporizhzhia direction and the enemy’s intentions. Also the situation in the border areas of the Sumy and Kharkiv regions.</em></p><p><em>We will continue our active operations in exactly the way needed for Ukraine’s defence. The forces and resources are prepared. New deep strikes have also been planned.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/aug/31/russia-ukraine-war-control-major-ukrainian-city-latest-updates-news-live\">Continue reading...</a>"
    }
  ]
}