{
  "mode": "last_24h",
  "window_start_taipei": "2025-08-30T20:40:04.045813+08:00",
  "window_end_taipei": "2025-08-31T20:40:04.045813+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "‘I’m holding his political wake’: the trumpeter waiting to mark Bolsonaro’s judgment day",
      "link": "https://www.theguardian.com/world/2025/aug/31/im-holding-his-political-wake-trumpeter-waiting-to-mark-jair-bolsonaro-judgment-day",
      "pub_time_taipei": "2025-08-31T20:00:32+08:00",
      "summary": "<p>Brazil’s ex-president is expected to be convicted over failed coup – and Fabiano Leitão, who has provoked him for years, is ready</p><p>When Jair Bolsonaro was Brazil’s far-right president, the guerrilla trumpeter Fabiano Leitão would stalk him around the capital, Brasília, to taunt him with renditions of the anti-fascist anthem <a href=\"https://www.theguardian.com/commentisfree/2022/sep/21/the-guardian-view-on-italys-resistance-anthem-sing-it-loud-sing-it-proud\">Bella Ciao</a>.</p><p>In March, when Bolsonaro was charged with plotting a coup, Leitão changed his tune and began provoking the ex-president by serenading him with Chopin’s Funeral March. “It symbolises his political demise, which is what we want to see,” said the 46-year-old musician.</p> <a href=\"https://www.theguardian.com/world/2025/aug/31/im-holding-his-political-wake-trumpeter-waiting-to-mark-jair-bolsonaro-judgment-day\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trial of tech that could be used to keep Australian under-16s off social media finds some errors ‘inevitable’",
      "link": "https://www.theguardian.com/australia-news/2025/aug/31/age-assurance-technology-trial-report-australia-under-16-social-media-ban-some-errors-inevitable",
      "pub_time_taipei": "2025-08-31T20:00:31+08:00",
      "summary": "<p>Report from age assurance trial finds multiple fallback options may be needed, as communications minister says there is no ‘one size fits all’ solution</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The official trial of age assurance technologies that could be used to keep under-16s from accessing social media has found that while there were effective options, errors were inevitable and age estimation tools were more likely to make mistakes for users within two years of 16.</p><p>The long-awaited report from the trial found that companies may need to provide multiple “fallback options” such as ID checks in those cases where age estimation technology fails.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/31/age-assurance-technology-trial-report-australia-under-16-social-media-ban-some-errors-inevitable\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ghislaine Maxwell hinted at Epstein’s ties to Trump officials – why wasn’t she pressed for names?",
      "link": "https://www.theguardian.com/us-news/2025/aug/31/ghislaine-maxwell-epstein-trump",
      "pub_time_taipei": "2025-08-31T20:00:29+08:00",
      "summary": "<p>Experts raise questions about the DoJ’s interview with the Epstein associate that left questions remaining</p><p>As deputy US attorney Todd Blanche announced last week that the justice department would release <a href=\"https://www.theguardian.com/us-news/2025/aug/22/maxwell-transcripts-trump-epstein-maga\">transcripts</a> of his <a href=\"https://www.theguardian.com/us-news/2025/aug/22/ghislaine-maxwell-transcript-what-we-know\">interview</a> with <a href=\"https://www.theguardian.com/us-news/ghislaine-maxwell\">Ghislaine Maxwell</a>, he described this disclosure as being “in the interest of transparency”.</p><p>“Except for the names of victims, every word is included. Nothing removed. Nothing hidden,” Blanche also said of his two-day sit down with Maxwell, who was convicted sex trafficking in relation to <a href=\"https://www.theguardian.com/us-news/jeffrey-epstein'\">Jeffrey Epstein</a>’s abuse of teenage girls.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/31/ghislaine-maxwell-epstein-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Vladimir Putin arrives in China for security summit – Ukraine war live",
      "link": "https://www.theguardian.com/world/live/2025/aug/31/russia-ukraine-war-control-major-ukrainian-city-latest-updates-news-live",
      "pub_time_taipei": "2025-08-31T19:33:29+08:00",
      "summary": "<p>Russian president and Indian prime minister among more than 20 world leaders attending Shanghai Cooperation Organisation summit in Tianjin</p><p>The Kremlin said that European powers were hindering US President Donald Trump’s efforts to achieve peace in Ukraine and that Russia would continue its operation in Ukraine until Moscow saw signs that Kyiv was ready for peace.</p><p>Kremlin spokesperson Dmitry Peskov told Russian state media reporters that the “European party of war” was continuing to hinder US and Russian efforts on Ukraine. “We are ready to resolve the problem by political and diplomatic means,” Peskov said. “But so far we do not see reciprocity from Kyiv in this. So we shall continue the special military operation.”</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/31/russia-ukraine-war-control-major-ukrainian-city-latest-updates-news-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli airstrikes and gunfire have killed 18 around Gaza City, local officials say",
      "link": "https://www.theguardian.com/world/2025/aug/31/israeli-airstrikes-gunfire-gaza-city",
      "pub_time_taipei": "2025-08-31T19:14:05+08:00",
      "summary": "<p>Toll includes 13 people trying to get food near distribution point, as Israeli cabinet to discuss next stages of offensive</p><p>Israeli airstrikes and gunfire killed at least 18 people in and around Gaza City, local health authorities said, as Benjamin Netanyahu’s security cabinet prepared to discuss plans to seize the city.</p><p>Residents of Sheikh Radwan, one of the largest neighbourhoods of Gaza City, told reporters the area had been under Israeli tank shelling and airstrikes throughout Saturday, overnight and on Sunday morning, forcing many families to flee.</p><p><em>With Reuters and Agence France-Presse</em></p> <a href=\"https://www.theguardian.com/world/2025/aug/31/israeli-airstrikes-gunfire-gaza-city\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "British baby dies from whooping cough as vaccination rates fall",
      "link": "https://www.theguardian.com/society/2025/aug/31/british-baby-dies-from-whooping-cough-as-vaccination-rates-fall",
      "pub_time_taipei": "2025-08-31T19:01:27+08:00",
      "summary": "<p>Infant’s mother had not been vaccinated against the highly infectious disease, which affects the lungs and airways</p><p>A baby in the UK has died from whooping cough, marking the first such death in the country this year.</p><p>The infant’s mother had not been vaccinated against the highly infectious disease, which affects the lungs and airways. This death occurred as vaccination rates among children and pregnant women in the UK have <a href=\"https://www.theguardian.com/society/2025/aug/28/england-needs-to-wake-up-to-faltering-infant-vaccination-rate-experts-warn\">fallen to their lowest levels in 15 years</a>.</p> <a href=\"https://www.theguardian.com/society/2025/aug/31/british-baby-dies-from-whooping-cough-as-vaccination-rates-fall\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The budget, immigration, Trump’s visit: the tests lying in wait for Keir Starmer",
      "link": "https://www.theguardian.com/politics/2025/aug/31/the-budget-immigration-trump-visit-the-tests-lying-in-wait-for-keir-starmer",
      "pub_time_taipei": "2025-08-31T19:00:28+08:00",
      "summary": "<p>There is no shortage of challenges for the PM as MPs head back to Westminster and he tries to get on the front foot</p><p>As Keir Starmer returns from his summer break in Europe, and Labour MPs head back to Westminster for the new parliamentary session, the government will be hoping to get on the front foot after a tumultuous few months.</p><p>The recess has given ministers time to think, and to plan, but also the chance to study the polls. This week, YouGov put Labour on just 20% – the lowest level in more than five years – and eight points behind Nigel Farage’s Reform UK.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/31/the-budget-immigration-trump-visit-the-tests-lying-in-wait-for-keir-starmer\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tories would maximise North Sea oil and gas extraction, Badenoch to say",
      "link": "https://www.theguardian.com/politics/2025/aug/30/tories-would-maximise-north-sea-oil-and-gas-extraction-badenoch-expected-to-say",
      "pub_time_taipei": "2025-08-31T18:35:41+08:00",
      "summary": "<p>Conservative leader says it is ‘absurd’ to shift away from fossil fuels and leave ‘vital resources untapped’</p><p>The Conservative party will aim to “maximise extraction” of oil and gas in the North Sea if it wins power, Kemi Badenoch has vowed.</p><p>The Tory party leader will use a speech in Aberdeen in the coming days to set out her plans to extract as much oil and gas as possible instead of shifting away from fossil fuels.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/30/tories-would-maximise-north-sea-oil-and-gas-extraction-badenoch-expected-to-say\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Richard Tice hits back at C of E criticism of Reform immigration policy",
      "link": "https://www.theguardian.com/politics/2025/aug/31/richard-tice-church-archbishop-criticism-reform-immigration-policy",
      "pub_time_taipei": "2025-08-31T18:28:36+08:00",
      "summary": "<p>Deputy leader says archbishop should stay out of matter after Stephen Cottrell calls policy isolationist and kneejerk</p><p>Reform UK has engaged in a war of words with the Church of England over the party’s plans to <a href=\"https://www.theguardian.com/politics/2025/aug/26/nigel-farage-plan-deport-asylum-seekers-scorn-from-legal-experts\">deport all asylum seekers</a> who arrive in small boats, after the church’s most senior bishop called the proposal “isolationist, short-term [and] kneejerk”.</p><p>Richard Tice, the party’s deputy leader, hit back against the archbishop of York, Stephen Cottrell, on Sunday, accusing him of interfering in domestic politics.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/31/richard-tice-church-archbishop-criticism-reform-immigration-policy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bridget Phillipson: parents must do more about bad behaviour and attendance in schools",
      "link": "https://www.theguardian.com/politics/2025/aug/31/bridget-phillipson-parents-must-do-more-about-bad-behaviour-and-attendance-in-schools",
      "pub_time_taipei": "2025-08-31T17:16:33+08:00",
      "summary": "<p>Education secretary targets 800 schools as she attempts to turn around post-Covid trends with enhanced support</p><p>Parents and caregivers “need to do more” to reverse post-Covid trends of poor attendance and behaviour in schools, the education secretary has said, announcing measures to support schools in England before the start of the new school year.</p><p>Bridget Phillipson unveiled a UK government programme on Sunday targeting 800 schools attended by about 600,000 pupils, beginning with an initial wave of 21 schools that will serve as attendance and behaviour hubs.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/31/bridget-phillipson-parents-must-do-more-about-bad-behaviour-and-attendance-in-schools\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Neo-Nazis and politicians among protesters at anti-immigration March for Australia rallies",
      "link": "https://www.theguardian.com/australia-news/2025/aug/31/march-for-australia-neo-nazis-among-protesters-at-anti-immigration-rallies",
      "pub_time_taipei": "2025-08-31T16:51:02+08:00",
      "summary": "<p>One Nation leader Pauline Hanson joins gathering in Canberra while far-right figure speaks outside state parliament in Melbourne</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunkah-shooting-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A neo-Nazi was among speakers to address the crowd at a tense anti-immigration protest in Melbourne, as similar demonstrations under the banner March for Australia took place in state and territory capitals across the country on Sunday.</p><p>While the protests were <a href=\"https://www.theguardian.com/world/2025/aug/30/march-australia-rally-locations-organisers-date-government-statement-anti-immigration-protest\">condemned as hateful by the federal government</a>, some politicians attended, including the One Nation leader, Pauline Hanson, and party member Senator Malcolm Roberts in Canberra and the federal MP Bob Katter in Townsville.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/31/march-for-australia-neo-nazis-among-protesters-at-anti-immigration-rallies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pauline Hanson joins crowds in Canberra as anti-immigration protests heat up across country – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunkah-shooting-sunday-ntwnfb",
      "pub_time_taipei": "2025-08-31T14:03:30+08:00",
      "summary": "<p>This blog is now closed</p><p>Asked about the planned anti-immigration protests across Australia today, <strong>Julian Leeser</strong> says he’s concerned about some of the anti-Indian and antisemitic sentiment being expressed. But he also adds that there are people who will be attending these protests with “goodwill”:</p><p>There are people there of goodwill who want to change policies in relation to this country. But I would say to them be careful of the company you keep. I’ve seen some of the material for that particular protest and I’m really concerned about the anti-Indian sentiment that is being expressed and some of the antisemitic undertones of some of those protests.</p><p>We are working through this legislation through our processes but I will say this: This cohort of people have had ample opportunities to put their case. They have exhausted all appeal avenues and the question now is whether they can be removed to another country.</p><p>This is a legitimate arrangement. The only reason people can remain in Australia – and this is very well established under the migration law of this country – is if they have an Australian citizen or on a valid visa.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunkah-shooting-sunday-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Wife of alleged Porepunkah killer Dezi Freeman urges him to surrender, sharing ‘deep sorrow’ at police deaths",
      "link": "https://www.theguardian.com/australia-news/2025/aug/31/dez-freeman-accused-porepunkah-police-killer-dezi-manhunt-day-six-ntwnfb",
      "pub_time_taipei": "2025-08-31T12:53:39+08:00",
      "summary": "<p>Amalia Freeman says Victoria police have her ‘full support’ in search for fugitive accused of fatally shooting two officers</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/31/from-wieambilla-to-porepunkah-anti-government-extremists-sovereign-citizens-australia\">From Wieambilla to Porepunkah, violent ‘anti-government extremists’ are a growing threat</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunkah-shooting-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The wife of a fugitive accused of killing two police officers has urged him to surrender and says she will cooperate fully with authorities.</p><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/30/suspected-porepunkah-gunman-dezi-freeman-had-no-convictions-for-violence-or-firearm-offences-court-record-shows-ntwnfb\">Dezi Freeman</a>, also known as Desmond Filby, <a href=\"https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area\">fled into the bush on Tuesday after a fatal confrontation</a> at a property in Porepunkah, about 300km north-east of Melbourne.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/31/dez-freeman-accused-porepunkah-police-killer-dezi-manhunt-day-six-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘I was never worried’: 10 years on since Syrian siblings’ 2,700-mile escape to Germany",
      "link": "https://www.theguardian.com/news/ng-interactive/2025/aug/31/i-was-never-worried-10-years-on-since-syrian-siblings-2700-mile-escape-to-germany",
      "pub_time_taipei": "2025-08-31T12:00:20+08:00",
      "summary": "<p>Ten years after Angela Merkel declared ‘We can do this’ at the height of the 2015 migration into Europe, Syrian refugee Somar Kreker looks back at his 44-day odyssey</p><p>The trip would be tough, Somar Kreker knew, but he was not overly fearful. It was the summer of 2015, and in a small flat in Amman, Jordan, this young Syrian’s only thought was how to turn a long and arduous journey into something more bearable. The engineering student had fled Syria three and a half years earlier after refusing to enlist in the brutal regime’s army. He was now ready to begin a new chapter of his life, starting with a new task: to reunite with his younger sisters, still trapped in Damascus, and lead them to Germany, where their brother was living.</p><p>“I was never worried or stressed about the trip,” says Somar, just 27 years old at the time. “I never had any thought about danger or failure. My only thoughts were how I could make the trip a happy adventure for me and my sisters.</p> <a href=\"https://www.theguardian.com/news/ng-interactive/2025/aug/31/i-was-never-worried-10-years-on-since-syrian-siblings-2700-mile-escape-to-germany\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli airstrike kills Houthi prime minister in Yemen, rebels say",
      "link": "https://www.theguardian.com/world/2025/aug/30/yemens-houthis-say-israeli-airstrike-killed-their-prime-minister",
      "pub_time_taipei": "2025-08-31T09:56:37+08:00",
      "summary": "<p>Ahmed al-Rahawi killed alongside several ministers gathered for prerecorded speech by rebel group’s leader</p><p>An Israeli airstrike killed the prime minister of the Houthi rebel-controlled government in Yemen’s capital, Sana’a, the Houthis have said.</p><p>Ahmed al-Rahawi was killed in a strike in Sana’a on Thursday along with a number of ministers, the rebels said in a statement on Saturday. Other ministers and officials were wounded, the statement added without providing further details.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/yemens-houthis-say-israeli-airstrike-killed-their-prime-minister\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chicago mayor signs executive order directing city to resist Trump’s immigration raids",
      "link": "https://www.theguardian.com/us-news/2025/aug/30/chicago-mayor-executive-order-trump-immigration-raids",
      "pub_time_taipei": "2025-08-31T08:30:37+08:00",
      "summary": "<p>Brandon Johnson’s order directs city police not to collaborate with federal agents in immigration enforcement</p><p>The mayor of <a href=\"https://www.theguardian.com/us-news/chicago\">Chicago</a> has signed an executive order outlining how the city will attempt to resist <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s immigration crackdown.</p><p>Brandon Johnson pushed back on Saturday against what he called the “out-of-control” Trump administration’s plan to deploy large numbers of federal officers into the country’s third-largest city, which could take place within days.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/30/chicago-mayor-executive-order-trump-immigration-raids\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Records fall as Sifan Hassan and Hailemaryam Kiros win Sydney Marathon",
      "link": "https://www.theguardian.com/sport/2025/aug/31/sydney-marathon-major-sifan-hassan-hailemaryam-kiros",
      "pub_time_taipei": "2025-08-31T08:11:07+08:00",
      "summary": "<ul><li><p>Dutch star and Ethiopian run fastest times on Australian soil</p></li><li><p>Kenyan running great Eliud Kipchoge finishes ninth</p></li></ul><p>The Dutch multi-distance phenomenon Sifan Hassan has set a race record to claim victory in the <a href=\"https://www.theguardian.com/australia-news/gallery/2025/aug/31/sydney-marathon-2025-thousands-turn-out-and-records-tumble-in-races-debut-as-a-major-in-pictures\">first running of the Sydney Marathon as a World Majors Series event</a>.</p><p>Hassan clocked a women’s winning time of two hours 18 minutes and 22 seconds as Kenyan legend Eliud Kipchoge fell short of the podium in the men’s category on Sunday.</p><p><a href=\"https://www.theguardian.com/sport/article/2024/jun/17/from-the-pocket-newsletter-afl-weekly-footy-email-from-jonathan-horn-guardian-australia-sign-up-subscribe\">Ahead of AFL finals sign up for our free weekly newsletter</a></p> <a href=\"https://www.theguardian.com/sport/2025/aug/31/sydney-marathon-major-sifan-hassan-hailemaryam-kiros\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Eight people kidnapped from Haitian orphanage released after three weeks",
      "link": "https://www.theguardian.com/world/2025/aug/29/nine-captives-haiti-kidnapping-release",
      "pub_time_taipei": "2025-08-31T07:43:37+08:00",
      "summary": "<p>Irish aid worker and director Gena Heraty was taken along with seven Haitians, including a three-year-old child</p><p>An Irish aid worker and seven fellow captives have been released nearly a month after they were kidnapped in Haiti.</p><p>Gena Heraty, a missionary who ran the Our Little Brothers and Sisters orphanage in the hills outside Haiti’s capital, Port-au-Prince, was<a href=\"https://www.theguardian.com/world/2025/aug/04/haiti-mass-kidnapping-orphanage\"> abducted on 3 August along with seven Haitians, including a three-year-old child</a>.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/nine-captives-haiti-kidnapping-release\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "More than 500 workers at Voice of America and other broadcasters to be laid off",
      "link": "https://www.theguardian.com/us-news/2025/aug/30/voice-of-america-lay-offs",
      "pub_time_taipei": "2025-08-31T04:54:22+08:00",
      "summary": "<p>Acting CEO of parent agency makes announcement one day after judge blocks her from firing VOA director</p><p>The agency that oversees Voice of America and other government-funded international broadcasters is eliminating jobs for more than 500 employees, a <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> official said. The move could ratchet up a months-long legal challenge over the news outlets’ fate.</p><p>Kari Lake, acting CEO of the US Agency for Global Media, announced the latest round of job cuts late Friday, one day after a federal judge <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.278809/gov.uscourts.dcd.278809.76.0.pdf\">blocked her</a> from removing Michael Abramowitz as VOA director.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/30/voice-of-america-lay-offs\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bernie Sanders demands that RFK Jr step down as health secretary",
      "link": "https://www.theguardian.com/us-news/2025/aug/30/bernie-sanders-rfk-jr-resign",
      "pub_time_taipei": "2025-08-31T02:58:59+08:00",
      "summary": "<p>Vermont senator says Kennedy is endangering the health of the American people as head of the US health department</p><p><a href=\"https://www.theguardian.com/us-news/bernie-sanders\">Bernie Sanders</a> has joined in on growing <a href=\"https://www.theguardian.com/us-news/2025/aug/28/rfk-resign-cdc-susan-monarez-fired\">public calls</a> for <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s health secretary, <a href=\"https://www.theguardian.com/us-news/robert-f-kennedy-jr\">Robert F Kennedy Jr</a>, to resign, after <a href=\"https://www.theguardian.com/us-news/2025/aug/27/cdc-director-susan-monarez-ousted\">recent chaos</a> across US health agencies.</p><p>In an <a href=\"https://www.nytimes.com/2025/08/30/opinion/bernie-sanders-robert-f-kennedy-jr-resign-hhs.html?fbclid=PAZnRzaAMgB5hleHRuA2FlbQIxMQABp_MoybRQF8MOnA5Lk0n9wvzN0kPikwkvT1TT6C-65wtqkT0Kf6pOH5hS-SNj_aem_J0jEgDGo_PUtfPl3jJKnFw\">op-ed</a> published in the New York Times on Saturday, the Vermont senator accused Kennedy of “endangering the health of the American people now and into the future”, adding: “He must resign.”</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/30/bernie-sanders-rfk-jr-resign\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New York City declares Harlem legionnaire’s disease outbreak over",
      "link": "https://www.theguardian.com/us-news/2025/aug/30/new-york-city-harlem-legionnaires-disease-outbreak-over",
      "pub_time_taipei": "2025-08-31T01:07:34+08:00",
      "summary": "<p>A hospital’s cooling tower was harboring bacteria as seven people died and 90 were hospitalized over three weeks</p><p><a href=\"https://www.theguardian.com/us-news/new-york\">New York City</a> has declared the deadly <a href=\"https://www.theguardian.com/us-news/2025/aug/05/new-york-city-legionnaires-disease-outbreak\">legionnaires’ disease outbreak</a> in central Harlem over, nearly three weeks since it began.</p><p>On Friday, city health officials <a href=\"https://www.nyc.gov/site/doh/about/press/pr2025/health-department-closes-investigation-central-harlem-legionnaires-cluster.page\">announced</a> that there have been no new cases among residents who live or work in the area since 9 August. As of Friday, there have been 114 cases of legionnaires’ disease, with 90 people hospitalized – six of those remaining in hospital – and seven deaths.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/30/new-york-city-harlem-legionnaires-disease-outbreak-over\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Investigation launched into ‘horrific murder’ of Ukrainian politician in Lviv",
      "link": "https://www.theguardian.com/world/2025/aug/30/andriy-parubiy-murder-shot-dead-ukraine-politician-lviv",
      "pub_time_taipei": "2025-08-31T00:53:14+08:00",
      "summary": "<p>Former parliamentary speaker Andriy Parubiy shot dead as EU ministers meet to discuss measures to force Moscow to the negotiating table</p><p>A Ukrainian former parliamentary speaker was shot dead in Lviv on Saturday, authorities said, as European foreign ministers met to discuss increasing pressure on Moscow to end its war against Ukraine.</p><p>Andriy Parubiy, a member of parliament who served as parliamentary speaker from 2016 to 2019 and a key figure in Ukraine’s 2013 pro-European Maidan revolution, was shot dead, prosecutors said. A murder investigation has been launched and the president, Volodymyr Zelenskyy, condemned the killing as a “horrific murder”.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/andriy-parubiy-murder-shot-dead-ukraine-politician-lviv\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Seven Israeli soldiers wounded in explosion in Gaza City, IDF says",
      "link": "https://www.theguardian.com/world/2025/aug/30/israeli-soldiers-wounded-gaza-city-explosion-armoured-vehicle",
      "pub_time_taipei": "2025-08-30T22:57:54+08:00",
      "summary": "<p>Armoured vehicle hit in Zeitoun neighbourhood as Arab media reports intense clashes in the area</p><p>Seven Israeli soldiers were wounded in an explosion targeting an armoured vehicle in Gaza City on Friday night, the Israel Defense Forces have said.</p><p>The soldiers were wounded while operating in the Zeitoun neighbourhood, which has been the site of intense Israeli military activity in recent weeks.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/israeli-soldiers-wounded-gaza-city-explosion-armoured-vehicle\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Most of this is symbolic’: the new wave of anti-migrant vigilantes in Europe",
      "link": "https://www.theguardian.com/world/2025/aug/30/europe-anti-migrant-vigilantes-spain-poland-netherlands-iceland-northern-ireland",
      "pub_time_taipei": "2025-08-30T22:00:02+08:00",
      "summary": "<p>‘Citizen patrols’ and self-styled protective forces are fuelling social fears and the far right, say experts</p><p>Sporting black shirts emblazoned with an iron cross, a dozen or so men marched through the centre of Reykjavík, courting attention on a buzzy Friday night. In Poland and the Netherlands, vigilantes thronged along the German border, ready to turn back any asylum seekers they came across. In Belfast, they roamed after sunset, demanding to see the identity documents of migrants and people of colour.</p><p>Each of the groups, who are part of a renewed wave of anti-migrant vigilantes that have sprung up in recent months across Europe, have sought to cast themselves as a sort of protective force. But those who have studied vigilantes warn that their actions often exacerbate security concerns, sow fear and fuel the far right.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/europe-anti-migrant-vigilantes-spain-poland-netherlands-iceland-northern-ireland\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ukrainian lawmaker shot dead in Lviv as Zelenskyy says hunt for killer is under way – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/aug/30/russia-ukraine-war-live-news-updates-zaporizhzhia",
      "pub_time_taipei": "2025-08-30T21:57:20+08:00",
      "summary": "<p>This live blog is now closed</p><p><strong>Andriy Parubiy</strong>, a <strong>Ukrainian</strong> politician who previously served as the parliament speaker, has been shot dead in western city of <strong>Lviv</strong>, say officials.</p><p>Confirming the news, Ukrainian president <strong>Volodymyr Zelenskyy</strong> wrote on X:</p><p>Ukraine’s minister of internal affairs Ihor Klymenko and prosecutor general Ruslan Kravchenko have just reported the first known circumstances of the horrendous murder in Lviv. Andriy Parubiy was killed.</p><p>My condolences to his family and loved ones. All necessary forces and means are engaged in the investigation and search for the killer.</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/30/russia-ukraine-war-live-news-updates-zaporizhzhia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fire kills three people in Indonesia after protesters torch council buildings",
      "link": "https://www.theguardian.com/world/2025/aug/30/fire-kills-three-people-in-indonesia-after-protesters-storm-council-buildings-in-the-wake-of-taxi-drivers-death",
      "pub_time_taipei": "2025-08-30T21:15:58+08:00",
      "summary": "<p>Cities in Indonesia rocked by protests after motorcycle taxi driver run over by police tactical vehicle</p><p>Protesters have torched parliamentary buildings in three further Indonesian provinces, a day after at least three people were killed by a fire started by demonstrators at a council building in the city of Makassar.</p><p>Protests erupted across Indonesia after footage spread showing a motorcycle taxi driver being run over and killed by a police vehicle on Thursday night during <a href=\"https://www.theguardian.com/world/2025/aug/26/indonesia-protests-austerity-parliament-member-privileges\">earlier demonstrations over low wages for workers and perks</a> for lawmakers.</p> <a href=\"https://www.theguardian.com/world/2025/aug/30/fire-kills-three-people-in-indonesia-after-protesters-storm-council-buildings-in-the-wake-of-taxi-drivers-death\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Taliban launch crackdown on Afghanistan’s secret beauty salons",
      "link": "https://www.theguardian.com/global-development/2025/aug/30/taliban-crackdown-afghanistan-secret-beauty-salons-women-gender-apartheid",
      "pub_time_taipei": "2025-08-30T21:00:01+08:00",
      "summary": "<p>The clandestine businesses – a financial lifeline for many women – have been given a month to cease operations</p><p>The Taliban have issued an order targeting underground beauty salons operating in secret across Afghanistan, warning the women running them that they have one month to stop or face arrest.</p><p>Officially, all beauty salons were closed by the Taliban in August 2023, shuttering 12,000 businesses with the loss of more than 50,000 female beautician jobs. Yet <a href=\"https://www.theguardian.com/global-development/article/2024/aug/01/afghanistan-taliban-repression-women-beauticians-secret-salons-hair-makeup#:~:text=The%20Taliban%20announced%20the%20closure,makeup%20%E2%80%93%20were%20violating%20Islamic%20law.\">clandestine salons have continued to operate</a> within communities across the country.</p> <a href=\"https://www.theguardian.com/global-development/2025/aug/30/taliban-crackdown-afghanistan-secret-beauty-salons-women-gender-apartheid\">Continue reading...</a>"
    }
  ]
}