{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-07T20:40:07.317336+08:00",
  "window_end_taipei": "2025-10-08T20:40:07.317336+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Tories would abolish stamp duty, Badenoch tells party conference – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/08/conservative-tory-conference-kemi-badenoch-labour-keir-starmer-india-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-10-08T20:23:19+08:00",
      "summary": "<p>Party leader says measure is a ‘bad tax’ and scrapping it would free up the housing market and improve social mobility</p><p>Voting in the Labour deputy leadership election opens today. <strong>Lucy Powell</strong>, the former Commons leader, is seen as the favourite and, as <strong>Jessica Elgot</strong> reports, <strong>Powell</strong> told supporters yesterday that, if she is elected, she will use the post to argue for changes in the way the government is operating. “We can’t sugarcoat the fact that things aren’t going well,” she said.</p><p>Powell is no longer a government minister and, if she is elected deputy leader, she will do the job from the backbenches. In an interview on Newsnight last night, <strong>Bridget Phillipson</strong>, the education secretary standing against Powell, said a Powell victory would be “destabilising” for the party. She said:</p><p>[Electing Powell] risks destabilising the party … we best achieve what we need to do together when we have those fierce conversations, including disagreements, behind closed doors.</p><p>Members need to understand that there’s a potential challenge around all of that – that if you’re not inside when the big decisions are being made, you’re not at that table, you’re not in those conversations.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/08/conservative-tory-conference-kemi-badenoch-labour-keir-starmer-india-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Outgoing French PM says ‘there is desire’ to agree budget and talks down prospect of snap election – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/08/france-emmanuel-macron-lecornu-europe-live-news-updates",
      "pub_time_taipei": "2025-10-08T20:16:31+08:00",
      "summary": "<p>Sébastien Lecornu speaks at the Matignon Palace and expresses optimism that parliament will not need to be dissolved</p><p><strong>Emmanuel Macron’s</strong> second term is set to end in May 2027 and he has repeatedly said he will not resign, the Associated Press (AP) reports.</p><p>If the French president were to quit, the Constitutional Council would declare a vacancy, the Senate president would assume interim powers and a new presidential election would be held within 35 days.<br /><br />\n On the far left, Melenchon’s France Unbowed has asked for Macron’s departure.<br /><br />\n More surprisingly, and a sign of Macron’s growing isolation inside his own camp, <strong>Édouard Philippe,</strong> Macron’s first prime minister after he swept to power in 2017 and once a close ally, has suggested the president should step down and call an early presidential election once the 2026 budget is adopted.<br /><br />\n Since 1958 and the inception of the Fifth Republic, only one French president has resigned: <strong>Charles de Gaulle</strong> after losing a 1969 referendum.</p><p><em>New Caledonia, which may seem far from mainland France but on which, as you know, important texts (…) [are to be adopted] in the coming days, and unfortunately the political situation prevents us from starting the debates and the possible adoption of these texts by the National Assembly and the Senate. This is a major concern.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/08/france-emmanuel-macron-lecornu-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ex-FBI director James Comey to appear in court amid concerns of Trump weaponizing justice department – live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates",
      "pub_time_taipei": "2025-10-08T20:15:57+08:00",
      "summary": "<p>Former FBI director expected to plead not guilty in case that has amplified concerns that the department is being used to pursue Trump’s enemies</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/08/james-comey-court-indictment\">Ex-FBI director to appear in court on lying to Congress charge</a></p></li></ul><p><strong>A <a href=\"https://www.nationalreview.com/news/dem-ag-nominee-jay-jones-fantasized-about-shooting-former-virginia-gop-speaker-he-receives-both-bullets/\">series of “violent” texts</a> sent by a Democrat seeking to become Virginia’s attorney general has shaken up the state’s governor’s race, with Republican candidate Winsome Earle-Sears seizing on the controversy to try to reverse her opponent’s double-digit polling lead.</strong></p><p>Earle-Sears has released<a href=\"https://x.com/winwithwinsome/status/1974832866388566097?s=46&amp;t=uQxq3EX7p3bygcqVfUnstg\"> new campaign advertisements</a> condemning Democratic former congresswoman Abigail Spanberger, her opponenent in the governor’s race, for continuing to support Jay Jones, whose private texts three years ago speculated about a senior state Republican getting “two bullets to the head” and “breeding little fascists”.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Senior U.S. officials join Gaza ceasefire talks as momentum builds",
      "link": "https://www.washingtonpost.com/world/2025/10/08/us-israel-gaza-egypt-peace-talks/",
      "pub_time_taipei": "2025-10-08T20:12:43+08:00",
      "summary": "Steve Witkoff and Jared Kushner joined Gaza ceasefire talks in Egypt, signaling some hope for a breakthrough though major sticking points remain."
    },
    {
      "source": "衛報",
      "title": "More than 40 Trump administration picks tied directly to oil, gas and coal, analysis shows",
      "link": "https://www.theguardian.com/us-news/2025/oct/08/trump-administration-fossil-fuels-climate",
      "pub_time_taipei": "2025-10-08T20:00:30+08:00",
      "summary": "<p>Report looks at White House nominees and appointees and agencies dictating energy, environment and climate policy</p><p>Donald Trump has placed dozens of people with ties to the fossil fuel sector in his <a href=\"https://www.theguardian.com/us-news/trump-administration\">administration</a>, including more than 40 who have directly worked for oil, gas or coal companies, according to a <a href=\"https://u7061146.ct.sendgrid.net/ls/click?upn=u001.gqh-2BaxUzlo7XKIuSly0rCxXwZR0L9lem-2B5XpAYqIXzOQgVY0Vp5bkBMOekGT0T0OZ6NJRkYH7gijmHnEP9Vi1auCzsK7HAb2BEB-2Fccsj1Co-3DU5UH_9zSeFP1w5uBM-2FrFVTZzTH7D8qX16e0hB7b1f0c81TGsENPaaIQ2nJI4iWgJqb1lGBmam4oj4-2FRMZEB3hdBv2Gojr44mf4RjJkDMcieA2BrDrTPJT841TmlfHsJphHudKh19qPP2-2Bn7Ha4IXF7yU8r2mqBPwSJCYErcuMEFfneizIKUwhA9vxamfJS2-2BBb7FSaHwiPY4ueWplcEiSsfJaHnWHwzkvcvBEKmeaYxRWu86QEUcRnxlInM-2FdbV1lDYQtkzZTjArHxcpmxtzR-2FMAW50CSxzBK4ILlh8KO8KmU6D-2BvITyZPOhCwceexbDCmgDmiLUwMVjDjGsYgWX7x3psv1ooaVea2FE5gJbvS00a7jM-3D\">new analysis</a>.</p><p>The report from Public Citizen, a consumer advocacy and ethics non-profit that has been critical of the Trump administration, alongside the Revolving Door Project, a corporate watchdog, analyzed the backgrounds of nominees and appointees within the White House and eight agencies dictating energy, environmental and climate policy. That includes the Environmental Protection Agency, the interior and energy departments and others.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/08/trump-administration-fossil-fuels-climate\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ovo pricing change could double charging costs for some EV owners",
      "link": "https://www.theguardian.com/environment/2025/oct/08/ovo-pricing-change-could-double-charging-costs-for-some-ev-owners",
      "pub_time_taipei": "2025-10-08T19:52:32+08:00",
      "summary": "<p>Customers on Charge Anytime deal who drive fewer than 700 miles a month say they will be left with higher bills</p><p>Electric vehicle owners fear they will be left out of pocket after the energy supplier Ovo announced changes to a popular charging deal which could double the cost for some customers.</p><p>Drivers who have an energy contract with the company can currently charge their vehicles at any time of day or night for 7p a kilowatt hour (kWh), making its Charge Anytime deal the cheapest on the market.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/08/ovo-pricing-change-could-double-charging-costs-for-some-ev-owners\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Paraglider bomb attack by Myanmar military kills at least 20 at protest",
      "link": "https://www.theguardian.com/world/2025/oct/08/paraglider-bomb-attack-by-myanmar-military-kills-people-at-protest",
      "pub_time_taipei": "2025-10-08T19:46:21+08:00",
      "summary": "<p>Dozens more injured by night strike on anti-government demonstration held during national holiday</p><p>At least 20 people were killed and dozens more were injured in central Myanmar after the military launched a paraglider bomb attack during an anti-government protest on Monday night.</p><p>The attack hit Chaung U, in Sagaing region, twice during a national holiday. Myanmar has been engulfed in armed conflict since the military seized power in 2021 and the town has been a key battleground in the war.</p> <a href=\"https://www.theguardian.com/world/2025/oct/08/paraglider-bomb-attack-by-myanmar-military-kills-people-at-protest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza ceasefire talks live: Hamas says hostage and prisoner lists exchanged with Israel",
      "link": "https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates",
      "pub_time_taipei": "2025-10-08T19:43:09+08:00",
      "summary": "<p>Qatari PM and US’s Witkoff and Kushner join Hamas and Israeli negotiators working on Trump’s Gaza plan</p><p>As part of the Guardian’s <strong>Israel-Gaza: two years on </strong>series marking the second anniversary of the <strong>Hamas</strong> attack into <strong>Israel</strong> and the war in <strong>Gaza</strong>, the below has been published:</p><p>The children’s names appear on a list of victims of Israel’s offensive in Gaza, maintained by health authorities in the territory. As of the end of July it ran to 60,199 names, of whom 18,457 were under 18s. Far from comprehensive, the list does not include the thousands still buried under the rubble of destroyed buildings, as well as the war’s many indirect victims.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tories will scrap stamp duty on primary residences, Kemi Badenoch tells conference",
      "link": "https://www.theguardian.com/politics/2025/oct/08/tories-scrap-stamp-duty-kemi-badenoch-conservative-conference-speech",
      "pub_time_taipei": "2025-10-08T19:29:38+08:00",
      "summary": "<p>Leader announces tax cut plan for England and Northern Ireland in policy-heavy speech aimed at boosting fiscal credibility</p><p>The Conservatives will scrap stamp duty on sales of primary residences if they win the next election, Kemi Badenoch has said in a policy-heavy speech designed to improve her party’s economic credibility.</p><p>The Tory leader told her party’s conference that in England and Northern Ireland she would abolish the tax that new buyers have to pay on house purchases over £125,000. The Conservatives calculate that this would cost £9bn a year to the Treasury. Stamp duty would still apply to additional properties and properties bought by companies, and for purchases by non-UK residents.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/08/tories-scrap-stamp-duty-kemi-badenoch-conservative-conference-speech\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "For the European Union, political trouble rises in the east",
      "link": "https://www.washingtonpost.com/world/2025/10/08/east-europe-political-turmoil-eu/",
      "pub_time_taipei": "2025-10-08T19:29:12+08:00",
      "summary": "A populist victory in the Czech Republic, protests in Lithuania, obstruction in Slovakia and Hungary — all show the E.U. faces political turmoil on its eastern flank."
    },
    {
      "source": "衛報",
      "title": "Bank of England warns of growing risk that AI bubble could burst",
      "link": "https://www.theguardian.com/business/2025/oct/08/bank-of-england-warns-of-growing-risk-that-ai-bubble-could-burst",
      "pub_time_taipei": "2025-10-08T19:14:08+08:00",
      "summary": "<p>Possibility of ‘sharp market correction has increased’, says Bank’s financial policy committee </p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/08/spot-gold-rises-above-4000-first-time-vertu-motors-warns-profit-hit-jlr-disruption-federal-reserve-imf-business-live\">Business live – latest updates</a></p></li></ul><p>The Bank of England has warned there is a growing risk of a “sudden correction” in global markets as it raised concerns about soaring valuations of leading AI tech companies.</p><p>Policymakers said there were also threats of a “sharp repricing of US dollar assets” if the Federal Reserve lost credibility in the eyes of global investors. It comes as Donald Trump’s <a href=\"https://www.theguardian.com/us-news/2025/sep/01/trump-us-fed-ecb-christine-lagarde\">continues to attack the US central bank</a> and threaten its independence.</p> <a href=\"https://www.theguardian.com/business/2025/oct/08/bank-of-england-warns-of-growing-risk-that-ai-bubble-could-burst\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Country superstar Zach Bryan criticised by US Homeland Security over Ice lyrics",
      "link": "https://www.theguardian.com/music/2025/oct/08/country-superstar-zach-bryan-criticised-by-us-homeland-security-over-ice-lyrics",
      "pub_time_taipei": "2025-10-08T19:10:22+08:00",
      "summary": "<p>Government department taunts chart-topping artist who sang of scared children and Ice raids on unreleased new song</p><p>Zach Bryan, one of the biggest stars in US country music, has been criticised by the Department of Homeland Security (DHS) over a new song in which he sings about immigration raids by Ice.</p><p>The DHS’s assistant secretary of public affairs, Tricia McLaughlin, told Bryan to “stick to Pink Skies, dude,” referring to one of his previous hits, in comments reported by the Independent. The DHS also made a provocative post on X, laying another Bryan song, Revival, over footage of Ice officers arresting migrants, with the caption “we’re having an All Night Revival”.</p> <a href=\"https://www.theguardian.com/music/2025/oct/08/country-superstar-zach-bryan-criticised-by-us-homeland-security-over-ice-lyrics\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: National guard troops arrive in Chicago as governor decries Trump’s ‘military invasion’",
      "link": "https://www.theguardian.com/us-news/2025/oct/08/first-thing-national-guard-troops-arrive-chicago-illinois-governor-decries-trump-military-invasion",
      "pub_time_taipei": "2025-10-08T19:01:09+08:00",
      "summary": "<p>Illinois governor says Donald Trump is ‘taking away people’s rights’. Plus, the key stats highlighting Israel’s destruction of Gaza</p><p>Good morning.</p><p>Texas national guard troops arrived in the Chicago area on Tuesday, marking an <a href=\"https://www.theguardian.com/us-news/2025/oct/07/texas-national-guard-troops-chicago-trump\">escalation of Donald Trump’s crackdown</a> on the city, in a move condemned as “military invasion”.</p><p><strong>How are elected Illinois officials responding to Trump’s incursion?</strong> The state’s governor, JB Pritzker, decried the move, saying: “Any kind of troops on the streets of an American city don’t belong unless there is an insurrection … I’m going to do everything I can to stop him from taking away people’s rights and from using the military to invade states.”</p><p><strong>How has Trump tried to weaponize</strong><strong> the attorney general’s office</strong><strong>?</strong> The president has overtly <a href=\"https://www.theguardian.com/us-news/2025/sep/21/trump-picks-his-former-lawyer-to-be-top-prosecutor-as-he-pushes-bondi-to-investigate-foes\">piled pressure</a> on Bondi to more aggressively pursue senior public officials he regards as his political enemies, including Comey.</p><p><strong>How did Bondi respond to Democratic </strong><strong>senators’ questioning?</strong> When pressed during the five-hour hearing, she <a href=\"https://www.theguardian.com/us-news/2025/oct/07/pam-bondi-senate-hearing-key-takeaways\">personally attacked</a> several senators or invoked the ongoing government shutdown to depict them as negligent.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/08/first-thing-national-guard-troops-arrive-chicago-illinois-governor-decries-trump-military-invasion\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Outgoing French PM hopeful for concessions to avoid snap elections",
      "link": "https://www.theguardian.com/world/2025/oct/08/outgoing-french-pm-hopeful-concessions-avoid-snap-elections",
      "pub_time_taipei": "2025-10-08T19:00:08+08:00",
      "summary": "<p>Sébastien Lecornu continues meetings with party leaders in effort to pass budget and avoid further political instability</p><p>• <a href=\"https://www.theguardian.com/world/live/2025/oct/08/france-emmanuel-macron-lecornu-europe-live-news-updates\">Europe live – latest updates</a></p><p>France’s caretaker prime minister, Sébastien Lecornu, has said his talks with various party leaders had revealed a “willingness” to pass a budget by the end of the year and that snap parliamentary elections were now looking less likely.</p><p>“This willingness creates a momentum and a convergence, obviously, which make the possibilities of a dissolution more remote,” he said in a brief address on Wednesday from the courtyard of Matignon Palace, the prime minister’s residence, in Paris.</p> <a href=\"https://www.theguardian.com/world/2025/oct/08/outgoing-french-pm-hopeful-concessions-avoid-snap-elections\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thousands take legal action over ‘widespread pollution’ of three UK rivers",
      "link": "https://www.theguardian.com/environment/2025/oct/08/thousands-take-legal-action-widespread-pollution-three-rivers-in-england-wales",
      "pub_time_taipei": "2025-10-08T18:22:39+08:00",
      "summary": "<p>Environmental group seeks damages from Welsh Water and two chicken producers, alleging responsibility for pollution in Wye, Lugg and Usk</p><p>Almost 4,000 people in England and Wales are taking legal action over what they allege is six years of sewage pollution that has devastated three rivers, including the Wye.</p><p>In the largest environmental group action of recent times, 3,943 residents and business owners are seeking substantial damages from Welsh Water and the leading chicken producers Avara Foods Ltd and Freemans of Newent Ltd, alleging they are responsible for “extensive and widespread pollution” in the Wye, Lugg and Usk.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/08/thousands-take-legal-action-widespread-pollution-three-rivers-in-england-wales\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Hundreds of Mount Everest hikers rescued from snowstorm, 10 remain",
      "link": "https://www.washingtonpost.com/world/2025/10/08/everest-hikers-trapped-blizzard/",
      "pub_time_taipei": "2025-10-08T18:19:49+08:00",
      "summary": "Some 580 hikers and over 300 mountain guides, yak handlers or support staff were rescued, Chinese state media said, after heavy snows stranded them on Mount Everest."
    },
    {
      "source": "華盛頓郵報",
      "title": "How Israel’s invasion has shattered lives, livelihoods and learning in Gaza",
      "link": "https://www.washingtonpost.com/world/2025/10/08/gaza-hamas-war-anniversary-two-years/",
      "pub_time_taipei": "2025-10-08T16:55:00+08:00",
      "summary": "Visualizing the devastating impact of the Israel-Gaza war on schools, homes, croplands and heritage sites, two years on from Hamas’s deadly Oct. 7, 2023, attack."
    },
    {
      "source": "衛報",
      "title": "ABC not banned from Trump press conferences, managing director says – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
      "pub_time_taipei": "2025-10-08T15:30:14+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/media/2025/oct/08/news-corp-australia-chair-michael-miller-says-social-media-platforms-monsters-torment-our-children\">News Corp Australia chair says social media platforms are ‘true monsters’ and ‘torment our children’</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Victorian premier, <strong>Jacinta Allan</strong>, is doing a breakfast television blitz this morning to announce that the public will be able to travel for free every weekend from early December until 1 February, as part of the launch of the metro tunnel.</p><p>Allan has described it as a “thank you” to commuters for enduring disruptions as the project was built. Speaking on Today, she said:</p><p>To say thank you to Victorians for their [patience, we are] delivering free public transport for everyone every weekend, everywhere in our state. From the opening of the metro tunnel in early December through to the 1st of February, when we integrate this amazing piece of infrastructure into the [public transport network].</p><p>This is how you do it to get a smooth, safe start, to get passengers using this infrastructure at the earliest opportunity.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Alleged ‘kill team’ face court after arrest en route to hit near Sydney daycare",
      "link": "https://www.theguardian.com/australia-news/2025/oct/08/alleged-kill-team-charged-after-arrest-en-route-to-hit-near-sydney-daycare",
      "pub_time_taipei": "2025-10-08T15:05:21+08:00",
      "summary": "<p>Police allege they identified the trio ‘mobilising’ to kill a man near a childcare centre in city’s south-west</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Two alleged members of a “kill team” have faced court over an alleged plot to murder a man picking up a child at daycare.</p><p>NSW Police on Tuesday pounced on a group of men driving through Revesby in Sydney’s southwest, allegedly with balaclavas and pistols.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/08/alleged-kill-team-charged-after-arrest-en-route-to-hit-near-sydney-daycare\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sydney Opera House pro-Palestine march has ‘disaster written all over it’, senior NSW police officer tells court",
      "link": "https://www.theguardian.com/world/2025/oct/08/sydney-opera-house-pro-palestine-march-has-disaster-written-all-over-it-senior-nsw-police-officer-tells-court-ntwnfb",
      "pub_time_taipei": "2025-10-08T14:34:11+08:00",
      "summary": "<p>Case between police and representatives from the Palestine Action Group and Jews Against Occupation remains before the NSW court of appeal</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>One of <a href=\"https://www.theguardian.com/australia-news/new-south-wales\">New South Wales</a>’ most senior police officers has told a court that a proposed pro-Palestine march to the Sydney Opera House has “disaster written all over it” due to “significant” safety concerns.</p><p>Representatives from the Palestine Action Group and Jews Against Occupation are in the NSW court of appeal fighting the police over the proposed march from Hyde Park to the Sydney landmark this Sunday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/08/sydney-opera-house-pro-palestine-march-has-disaster-written-all-over-it-senior-nsw-police-officer-tells-court-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "News Corp Australia chair says social media platforms are ‘true monsters’ and ‘torment our children’",
      "link": "https://www.theguardian.com/media/2025/oct/08/news-corp-australia-chair-michael-miller-says-social-media-platforms-monsters-torment-our-children",
      "pub_time_taipei": "2025-10-08T14:03:32+08:00",
      "summary": "<p>Michael Miller also says media must unite against second ‘big steal’ by tech companies seeking changes to copyright law to access content for free</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Social media is to blame for social cohesion issues across the globe, <a href=\"https://www.theguardian.com/media/news-corporation\">News Corp Australia’s</a> executive chair, Michael Miller, has said, as he calls for media to present a united front against the platforms and AI companies seeking content for free.</p><p>Miller told the Melbourne Press Club on Wednesday social media was rife with “misinformation, disinformation [and] the rabbit holes [that] they drag you down.</p> <a href=\"https://www.theguardian.com/media/2025/oct/08/news-corp-australia-chair-michael-miller-says-social-media-platforms-monsters-torment-our-children\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Death of three-year-old boy in social housing fire could have been caused by faulty electrical wiring, inquest hears",
      "link": "https://www.theguardian.com/australia-news/2025/oct/08/three-year-old-boy-death-larapinta-social-housing-fire-inquest-could-have-been-caused-by-faulty-electrical-wiring-ntwnfb",
      "pub_time_taipei": "2025-10-08T14:01:51+08:00",
      "summary": "<p>Inquest is hearing evidence about the 2023 death of Mitchell Thomas at Larapinta in Alice Springs</p><p><em><strong>Warning:</strong> This article contains an image and reference to an Indigenous Australian who has died</em></p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>An inquest in the Northern Territory will examine whether faulty electrical wiring in social housing caused a fire that killed a three-year-old Indigenous boy, after an audit of about 600 territory-owned properties found more than half needed immediate remedial work.</p><p>The inquest, which started in Alice Springs on Wednesday, is hearing evidence about the 2023 death of Mitchell Thomas in social housing in Larapinta, a western suburb of the town.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/08/three-year-old-boy-death-larapinta-social-housing-fire-inquest-could-have-been-caused-by-faulty-electrical-wiring-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK plastic waste exports to developing countries rose 84% in a year, data shows",
      "link": "https://www.theguardian.com/environment/2025/oct/08/uk-plastic-waste-exports-to-developing-countries-rose-84-in-a-year-data-shows",
      "pub_time_taipei": "2025-10-08T14:00:16+08:00",
      "summary": "<p>Campaigners say increase in exports mostly to Malaysia and Indonesia is ‘unethical and irresponsible waste imperialism’</p><p>Britain’s exports of plastic waste to developing countries have soared by 84% in the first half of this year compared with last year, according to an analysis of trade data carried out for the Guardian.</p><p>Campaigners described the rise in exports, mostly to Malaysia and Indonesia, as “unethical and irresponsible waste imperialism”.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/08/uk-plastic-waste-exports-to-developing-countries-rose-84-in-a-year-data-shows\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel intercepts another Gaza aid flotilla amid criticism over treatment of activists",
      "link": "https://www.theguardian.com/world/2025/oct/08/israel-intercepts-another-gaza-aid-flotilla-amid-criticism-over-treatment-of-activists",
      "pub_time_taipei": "2025-10-08T12:58:12+08:00",
      "summary": "<p>Israeli foreign ministry confirms interception and says those on board will be deported</p><p>A new Gaza-bound aid flotilla has been intercepted by the Israeli army, days after the detention of activists on board vessels bound for the war-torn territory caused <a href=\"https://www.theguardian.com/world/2025/oct/02/israels-gaza-flotilla-interception-triggers-protests-diplomatic-expulsions-and-calls-for-strikes\">international outrage and widespread protests</a>.</p><p>The Israeli military was jamming signals with at least two boats being boarded, the Freedom Flotilla Coalition said on Instagram.</p> <a href=\"https://www.theguardian.com/world/2025/oct/08/israel-intercepts-another-gaza-aid-flotilla-amid-criticism-over-treatment-of-activists\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "After two years, Israel’s Gaza war has reshaped the Middle East",
      "link": "https://www.washingtonpost.com/world/2025/10/08/israel-gaza-oct-7-middle-east/",
      "pub_time_taipei": "2025-10-08T12:00:01+08:00",
      "summary": "Israel’s hard power preeminence in the Middle East seems paramount. But the country’s leaders — and the entire region — still face an array of political challenges."
    },
    {
      "source": "衛報",
      "title": "New Zealand oceans warming 34% faster than global average, putting homes and industry at risk, report finds",
      "link": "https://www.theguardian.com/world/2025/oct/08/new-zealand-oceans-warming-34-per-cent-faster-than-global-average",
      "pub_time_taipei": "2025-10-08T08:57:22+08:00",
      "summary": "<p>NZ$180bn worth of housing and $26bn of infrastructure at risk of flooding and storm damage, new government report finds</p><p>New Zealand’s oceans are warming 34% faster than the global average, with NZ$180bn (US$104bn) worth of housing at risk of flooding, a new report about the nation’s marine environment has revealed.</p><p>The ministry of the environment and Stats NZ’s three-yearly update, <a href=\"https://mcusercontent.com/ebebf9501bcd56a598aa9f357/files/2d584549-1445-a5b3-f7dd-73c342c58c32/our_environment_2025_embargoed.pdf\">Our Environment 2025</a>, collates statistics, data and research across five domains – air, atmosphere and climate, freshwater, land, and marine – to paint a picture of the state of New Zealand’s marine environment.</p> <a href=\"https://www.theguardian.com/world/2025/oct/08/new-zealand-oceans-warming-34-per-cent-faster-than-global-average\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump administration intervenes to secure woman’s rescue from Gaza",
      "link": "https://www.washingtonpost.com/national-security/2025/10/07/trump-gaza-rescue-us-sailor-mother/",
      "pub_time_taipei": "2025-10-08T08:31:08+08:00",
      "summary": "The mother of a U.S. sailor was extracted from the war-ravaged enclave through a quiet, extraordinary collaboration of the U.S., Israeli and Jordanian governments."
    },
    {
      "source": "衛報",
      "title": "Mamdani attends Israelis for Peace vigil after his 7 October statement draws ire from Israel",
      "link": "https://www.theguardian.com/us-news/2025/oct/07/zohran-mamdani-statement-october-7-anniversary",
      "pub_time_taipei": "2025-10-08T08:27:48+08:00",
      "summary": "<p>New York City’s mayoral candidate sits in with Brad Lander after commemorating Israeli and Palestinian victims</p><p><a href=\"https://www.theguardian.com/us-news/zohran-mamdani\">Zohran Mamdani</a>, the New York City Democratic mayoral candidate, on Tuesday evening attended a vigil in Manhattan convened by Israelis for Peace, an anti-occupation group of Israelis in New York who have rallied weekly since 2023 to call for a ceasefire and the release of Israeli hostages.</p><p>Sitting in Union Square alongside New York City comptroller Brad Lander, his one-time rival for the Democratic nomination who has been campaigning for him, Mamdani listened as speakers at the event – which marked the two-year anniversary of the 7 October Hamas attacks on Israel – called for an end to the killing and to Israel’s occupation, and for equal rights for Palestinians.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/07/zohran-mamdani-statement-october-7-anniversary\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "John Gurdon, Nobel laureate who laid groundwork for cloning, dies at 92",
      "link": "https://www.washingtonpost.com/obituaries/2025/10/07/john-gurdon-dead/",
      "pub_time_taipei": "2025-10-08T06:11:17+08:00",
      "summary": "One of his early teachers called his scientific ambitions “ridiculous.” Undeterred, Dr. Gurdon went on to transform the understanding of DNA."
    },
    {
      "source": "衛報",
      "title": "US delegation led by Steve Witkoff due to arrive in Egypt for Gaza talks",
      "link": "https://www.theguardian.com/us-news/2025/oct/07/us-steve-witkoff-to-arrive-egypt-gaza-talks",
      "pub_time_taipei": "2025-10-08T05:34:24+08:00",
      "summary": "<p>White House says it is important ‘that we get this done quickly’ as indirect talks restart in Sharm el-Sheikh</p><p>A US delegation led by envoy Steve Witkoff is expected to join talks in Egypt on Wednesday to reinforce President Donald Trump’s involvement in the newly restarted negotiations between Hamas and Israel aimed at ending the war in Gaza.</p><p>The indirect talks at Sharm el-Sheikh, the Egyptian resort city on the Red Sea, entered their second day on the <a href=\"https://www.theguardian.com/world/2025/oct/07/israelis-gather-to-mark-two-years-since-7-october-hamas-attack-that-killed-1200\">second anniversary</a> of the Hamas surprise attack into Israel that triggered the bloody conflict.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/07/us-steve-witkoff-to-arrive-egypt-gaza-talks\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gisèle Pelicot’s ex-husband tells court man convicted of rape knew she was sedated",
      "link": "https://www.theguardian.com/world/2025/oct/07/gisele-pelicot-ex-husband-tells-court-man-convicted-rape-knew-sedated",
      "pub_time_taipei": "2025-10-08T02:35:03+08:00",
      "summary": "<p>Dominique Pelicot says Husamettin Dogan’s attempt to overturn conviction in the mass rape case ‘is indecent’</p><p>Dominique Pelicot, who drugged his ex-wife Gisèle Pelicot and invited dozens of strangers to rape her over almost a decade, has told a court that a man who is appealing against his rape conviction knew she was sedated and came to their home deliberately to abuse her.</p><p><a href=\"https://www.theguardian.com/world/2025/oct/06/gisele-pelicot-returns-court-face-one-men-convicted-raping-her-husamettin-dogan-appeal\">Husamettin Dogan</a>, 44, a married father, is seeking to overturn his conviction for raping Gisèle Pelicot while she was unconscious in her own bed in June 2019. Dogan is being tried on appeal in Nîmes in southern France.</p> <a href=\"https://www.theguardian.com/world/2025/oct/07/gisele-pelicot-ex-husband-tells-court-man-convicted-rape-knew-sedated\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Denmark plans social media ban for under-15s as PM warns phones ‘stealing childhood’",
      "link": "https://www.theguardian.com/world/2025/oct/07/danish-pm-plans-to-ban-social-media-for-under-15s-warning-it-is-stealing-childhood",
      "pub_time_taipei": "2025-10-08T01:43:03+08:00",
      "summary": "<p>Mette Frederiksen links social media use to anxiety, depression and lack of concentration</p><p>The Danish prime minister says the country will ban social media for under-15s, as she accused mobile phones and social networks of “stealing our children’s childhood”.</p><p>Mette Frederiksen used her speech on Tuesday at the opening of Folketing, the Danish parliament, to announce the proposal, in which she said: “We have unleashed a monster.” She added: “Never before have so many children and young people suffered from anxiety and depression.”</p> <a href=\"https://www.theguardian.com/world/2025/oct/07/danish-pm-plans-to-ban-social-media-for-under-15s-warning-it-is-stealing-childhood\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel marks two years since 7 October Hamas attack as Gaza ceasefire talks continue – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/07/gaza-ceasefire-peace-talks-israel-hamas-egypt-7-october-anniversary-middle-east-crisis-live-news-updates",
      "pub_time_taipei": "2025-10-08T00:37:00+08:00",
      "summary": "<p>Israelis gather to commemorate the second anniversary of the Hamas-led attack in which 1,200 people were killed. This live blog is closed</p><p></p><p><em>Deborah Cole</em> <em>is Berlin correspondent for the Guardian</em></p><p>Germany marked the two-year anniversary of the 7 October attacks with sombre commemorations across the country and official flags pulled to half mast.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/07/gaza-ceasefire-peace-talks-israel-hamas-egypt-7-october-anniversary-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "South American leftists struggle with Trump pressure, voter shift",
      "link": "https://www.washingtonpost.com/national-security/2025/10/07/trump-boric-chile-colombia-bolivia/",
      "pub_time_taipei": "2025-10-08T00:24:36+08:00",
      "summary": "The second Trump presidency’s focus on immigration and crime is mirroring a shift to the right among voters in South America."
    },
    {
      "source": "衛報",
      "title": "EU plan to match Trump steel tariffs spurs ‘existential threat’ to UK steel industry",
      "link": "https://www.theguardian.com/business/2025/oct/07/eu-plan-to-match-trump-steel-tariffs-spurs-existential-threat-to-uk-steel-industry",
      "pub_time_taipei": "2025-10-08T00:16:48+08:00",
      "summary": "<p>Starmer says UK in discussions with EU over Brussels plan to double import tariff to 50%, which unions warn could kill UK steel industry</p><p>The EU has announced it will match Donald Trump’s steel tariffs, doubling levies on imports to 50% in a decision condemned as “an existential threat” to the industry in the UK.</p><p>With 80% of British exports going to the EU, the change poses the UK steel industry’s biggest ever crisis, according to the lobby group representing the sector, while unions said they could kill off the industry.</p> <a href=\"https://www.theguardian.com/business/2025/oct/07/eu-plan-to-match-trump-steel-tariffs-spurs-existential-threat-to-uk-steel-industry\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "‘Enough’: Israel marks 2 years since Oct. 7, with sounds of war from Gaza",
      "link": "https://www.washingtonpost.com/world/2025/10/07/israel-oct-7-attack-anniversary/",
      "pub_time_taipei": "2025-10-07T23:21:46+08:00",
      "summary": "Israelis commemorated the second anniversary of the Hamas-led attacks on southern Israel as fighting continued. Ceasefire negotiations are ongoing in Egypt."
    },
    {
      "source": "衛報",
      "title": "Diplomacy’s lowest point: how the Israel-Gaza conflict was mishandled",
      "link": "https://www.theguardian.com/world/2025/oct/07/diplomacy-lowest-point-how-the-israel-gaza-conflict-was-mishandled",
      "pub_time_taipei": "2025-10-07T21:51:08+08:00",
      "summary": "<p>In two years there have been many versions of a ‘day after’ plan for Gaza and many obstacles to overcome</p><p>George Mitchell, the great US advocate for the Northern Ireland peace agreement, described diplomacy as 700 days of failure and one of success. In Gaza, tragically, there have been 730 days of failure and none of success. Indeed, the destruction, the death toll and the spillover of the conflict into other countries is a monument to shame diplomacy and what remains of international law. Arguably, it is the profession’s lowest point since 1939.</p><p>Some will claim failure is inevitable since this conflict is now so embedded and impervious to compromise that it can only be settled at the barrel of the gun, in essence through the repression or erasure of one side.</p> <a href=\"https://www.theguardian.com/world/2025/oct/07/diplomacy-lowest-point-how-the-israel-gaza-conflict-was-mishandled\">Continue reading...</a>"
    }
  ]
}