{
  "mode": "last_24h",
  "window_start_taipei": "2025-08-28T20:40:05.631505+08:00",
  "window_end_taipei": "2025-08-29T20:40:05.631505+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Zelenskyy calls for more pressure on Russia so ‘murderers do not feel impunity’ after Thursday’s Kyiv strikes – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/aug/29/ukraine-russia-war-zelenskyy-putin-latest-europe-news-updates-live",
      "pub_time_taipei": "2025-08-29T20:20:06+08:00",
      "summary": "<p>EU defence ministers to discuss pressure on Russia as Kaja Kallas accuses Putin of mocking peace efforts</p><p>European Commission president <strong>Ursula von der Leyen</strong> is in Latvia today, and has been speaking to the media in the last few minutes.</p><p>Speaking alongside Latvia’s prime minister <strong>Evika Siliņa, she</strong> <strong>praised the country’s work on becoming “a true drone and anti drone powerhouse” in Europe,</strong> contributing to Nato’s security in the region bordering with Russia.</p><p><em><strong>We know that Europe is only safe if the eastern border is safe.</strong></em></p><p><em>“The risks your country and the other Baltic States warned us about, unfortunately, have materialised. </em></p><p><em><strong>Russia’s brutal war against Ukraine is now in its fourth year</strong>, <strong>Putin is a predator</strong>, Putin’s proxies have been targeting our societies for years with hybrid attacks, with cyber-attacks, [and] the weaponising of migrants is another example.”</em></p> <a href=\"https://www.theguardian.com/world/live/2025/aug/29/ukraine-russia-war-zelenskyy-putin-latest-europe-news-updates-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Judges due to rule on Epping hotel injunction – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
      "pub_time_taipei": "2025-08-29T20:19:13+08:00",
      "summary": "<p>Home Office and Bell Hotel owner have challenged injunction granted to council that would stop dozens of asylum seekers being housed there</p><p>UK bank shares tumbled on Friday, cutting the stock market value of the sector by almost £8bn in morning trading, <a href=\"https://www.theguardian.com/politics/2025/aug/29/treasury-tax-big-banks-quantitative-easing-windfalls-thinktank\">as fresh calls for a windfall tax on large lenders</a> in the autumn budget spooked investors.</p><p>Calls for a tax grab, in a paper written by the <strong>Institute for Public Policy Research (IPPR)</strong> thinktank, took a toll on some of the UK’s biggest high street banks. <strong>NatWest Group</strong> suffered the biggest drop on Friday morning, registering a decline of as much as 5% in its share price, while <strong><a href=\"https://www.theguardian.com/business/lloyds-banking-group\">Lloyds Banking Group</a></strong> and <strong>Barclays</strong> followed close behind, falling 4.5% and 3.6% respectively. <strong>HSBC</strong> dropped more than 1%.</p> <a href=\"https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "IDF declares famine-hit Gaza City a combat zone, ending ‘tactical pauses’ that allowed limited food delivery – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates",
      "pub_time_taipei": "2025-08-29T20:10:06+08:00",
      "summary": "<p>Around one million Palestinian people expected to be displaced in shattered city where famine has been declared</p><p>A spokesperson for the Israeli military said earlier this week that the evacuation of Gaza City is “inevitable”. Benjamin Netanyahu has said Israel will launch its Gaza City assault while simultaneously pursuing a ceasefire, though talks have stalled.</p><p>The Israeli prime minister has claimed the assault is the best way to weaken Hamas and return hostages, but many hostage families disagree and fear it will endanger hostages lives.</p><p><em>In accordance with the situational assessment &amp; directives of the political echelon, starting today at 10:00, the local tactical pause in military activity will not apply to the area of Gaza City, which constitutes a dangerous combat zone.</em></p><p><em>The IDF continues supporting humanitarian efforts while conducting operations to protect Israel.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Backlash as White House chooses Robert F Kennedy Jr deputy to run CDC – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
      "pub_time_taipei": "2025-08-29T20:09:37+08:00",
      "summary": "<p>Senators’ fury at developments at US Centers for Disease Control and Prevention as Jim O’Neill picked to replace Susan Monarez</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/aug/28/cdc-chief-fired-white-house-monarez-trump\">White House picks Kennedy deputy to replace fired CDC chief</a></p></li></ul><p><strong>A visit to <a href=\"https://www.theguardian.com/world/taiwan\">Taiwan</a> by two US senators has drawn criticism from China, which claims the island as its own and objects to any contact between officials of the two sides.</strong></p><p>The chair of the Senate armed services committee, Roger Wicker, and the Nebraska senator Deb Fischer arrived in Taipei on Friday for a series of high-level meetings with senior Taiwanese leaders to discuss US-Taiwan relations, regional security, trade and investment, according to the American Institute in <a href=\"https://www.theguardian.com/world/taiwan\">Taiwan</a>, Washington’s de facto embassy in lieu of formal diplomatic relations with the self-governing island democracy.</p><p>A thriving democracy is never fully assured … and we’re here to talk to our friends and allies in Taiwan about what we’re doing to enhance worldwide peace.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Third of children do not play outdoors after school, UK research finds",
      "link": "https://www.theguardian.com/society/2025/aug/29/children-uk-outdoors-play-society-school-research",
      "pub_time_taipei": "2025-08-29T20:00:31+08:00",
      "summary": "<p>Study finds outdoor play has positive effect on children’s social and emotional skills</p><p>One in three children do not play outdoors after school and a fifth do not at the weekend, according to research that found outdoor play has a beneficial impact on young people’s developing social and emotional skills.</p><p>The University of Exeter study looked at data from 2,500 children between sevenand 12 from the multiethnic <a href=\"https://borninbradford.nhs.uk/\">Born in Bradford</a> research programme, which tracks the health, development and wellbeing of mothers and children from pregnancy onwards.</p> <a href=\"https://www.theguardian.com/society/2025/aug/29/children-uk-outdoors-play-society-school-research\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Newly elected Scottish Green leaders to campaign on universal income and free bus travel",
      "link": "https://www.theguardian.com/politics/2025/aug/29/newly-elected-scottish-green-leaders-ross-greer-gillian-mackay-campaign-universal-income-free-bus-travel",
      "pub_time_taipei": "2025-08-29T19:55:57+08:00",
      "summary": "<p>Ross Greer and Gillian Mackay, elected after 12.7% turnout, also vow to campaign on higher taxation of rich</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform\">UK politics live – latest updates</a></p></li></ul><p>The new leaders of the Scottish Greens, Ross Greer and Gillian Mackay, have promised to campaign for a universal income, free bus travel and higher taxation on the rich after winning a muted election contest.</p><p>Greer and Mackay, who were both backbench MSPs at Holyrood, were appointed co-conveners of the Scottish Greens after a noticeably low turnout of 12.7% – only 950 of the party’s 7,500 members voted after a low-key summer campaign.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/29/newly-elected-scottish-green-leaders-ross-greer-gillian-mackay-campaign-universal-income-free-bus-travel\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gun used in Emmett Till’s lynching is on display at museum 70 years later",
      "link": "https://www.theguardian.com/us-news/2025/aug/29/emmett-till-lynching-gun-museum",
      "pub_time_taipei": "2025-08-29T19:45:37+08:00",
      "summary": "<p>Mississippi museum announces display on anniversary of boy’s murder, a pivotal moment in civil rights movement</p><p>The gun used in the lynching of 14-year-old Emmett Till is now on display for the public to see, 70 years after the killing.</p><p>The <a href=\"https://www.theguardian.com/us-news/mississippi\">Mississippi</a> Department of Archives and History unveiled the .45-caliber pistol and its holster during a news conference on Thursday, which is the 70th anniversary of Till’s murder.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/29/emmett-till-lynching-gun-museum\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Taiwan has ‘right to remain free’, US senator says in visit criticised by China",
      "link": "https://www.theguardian.com/world/2025/aug/29/us-senators-taiwan-visit-taipei-china-criticism",
      "pub_time_taipei": "2025-08-29T19:24:09+08:00",
      "summary": "<p>Roger Wicker and Deb Fischer meet island’s president in Taipei as Beijing says trip sends ‘gravely wrong signal’</p><p>A visit to <a href=\"https://www.theguardian.com/world/taiwan\">Taiwan</a> by two US senators has drawn criticism from China, which claims the island as its own and objects to any contact between officials of the two sides.</p><p>The chair of the Senate armed services committee, Roger Wicker, and the Nebraska senator Deb Fischer arrived in Taipei on Friday for a series of high-level meetings with senior Taiwanese leaders. They plan to discuss US-Taiwan relations, regional security and trade and investment, according to the American Institute in Taiwan, Washington’s de facto embassy in lieu of formal diplomatic relations with the self-governing island democracy.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/us-senators-taiwan-visit-taipei-china-criticism\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘So aware of their emotions’: Pupils are standout stars in new series about Yorkshire academy",
      "link": "https://www.theguardian.com/tv-and-radio/2025/aug/29/pupils-stars-series-2-educating-yorkshire-academy-channel-4",
      "pub_time_taipei": "2025-08-29T19:07:51+08:00",
      "summary": "<p>Educating Yorkshire Part 2 shows inspirational teachers negotiating challenges in young people’s lives</p><p>“Basically, there’s summat wrong with me. I’m like … a psychopath. Genuinely!” A teenage girl with the face of an angel is confiding in Mr Wilson, one of the student managers. He listens solemnly, but his mouth twitches with the beginnings of a smile.</p><p>“I’m going to start by disagreeing with you,” he says with all the seriousness he can muster. “You’re not a psychopath.” The girl in the sky-blue hoodie relaxes and rewards him with a broad smile.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/aug/29/pupils-stars-series-2-educating-yorkshire-academy-channel-4\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hurricane Katrina victim identified 20 years later: ‘finally where she belongs’",
      "link": "https://www.theguardian.com/us-news/2025/aug/29/hurricane-katrina-woman-identified",
      "pub_time_taipei": "2025-08-29T19:00:11+08:00",
      "summary": "<p>Guardian US partner WWL Louisiana called in Ray Theriot, who used utility bills, driver’s licenses and property records</p><p>A woman who died at home during <a href=\"https://www.theguardian.com/us-news/hurricane-katrina\">Hurricane Katrina</a> in a community outside New Orleans, but who remained unidentified for nearly two decades, has finally been named before the storm’s 20th anniversary on Friday.</p><p>The woman, who was identified with the help of New Orleans’s CBS affiliate, <a href=\"https://www.wwltv.com/article/news/local/katrina/exclusive-wwl-louisiana-investigation-leads-officials-to-identify-unknown-katrina-victim/289-16c1df3d-7b1c-4164-9164-c896ae69ecae\">WWL Louisiana</a>, has been named as Dorothy Virginia Driggers Taquino, 81.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/29/hurricane-katrina-woman-identified\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US soldiers could be liable for war crimes in Gaza. Will they be prosecuted?",
      "link": "https://www.theguardian.com/world/2025/aug/29/israel-war-crimes-gaza-us-military",
      "pub_time_taipei": "2025-08-29T19:00:10+08:00",
      "summary": "<p>Human Rights Watch says US military personnel could face criminal prosecution for assisting Israel’s war in Gaza</p><p>Human rights groups and activists who protest against continued US support for <a href=\"https://www.theguardian.com/world/israel\">Israel</a> have focused primarily on the flow of US weapons, warning that continuing to send weapons to a state which has been documented using them in probable war crimes makes the US complicit.</p><p>However, this week, <a href=\"https://www.hrw.org/news/2025/08/26/gaza-us-forces-can-be-liable-for-assisting-israeli-war-crimes\">Human Rights Watch</a> (HRW) highlighted another facet of US military support for Israel: military cooperation and intelligence sharing.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/israel-war-crimes-gaza-us-military\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "DC eateries suffer as workers terrified of Ice stay home: ‘You don’t want to go outside’",
      "link": "https://www.theguardian.com/us-news/2025/aug/29/trump-ice-washington-dc-restaurants",
      "pub_time_taipei": "2025-08-29T19:00:10+08:00",
      "summary": "<p>Some restaurants in the US capital have closed their doors as workers stay home rather than risk deportation</p><p>Hernán was at the Latin American restaurant that he owns with his brother in north-west <a href=\"https://www.theguardian.com/us-news/washington-dc\">Washington DC</a> last week when his staff started getting phone calls and messages about <a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\">Immigration and Customs Enforcement (Ice)</a> checkpoints in the neighborhood. The employees, scared that they might be targeted and racially profiled, asked if they could go home.</p><p>Within hours, Hernán had to close their doors, and the restaurant hasn’t been open since.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/29/trump-ice-washington-dc-restaurants\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nearly 1,000 ‘worker over billionaire’ actions planned for Labor Day in US",
      "link": "https://www.theguardian.com/us-news/2025/aug/29/workers-over-billionaires-trump-protest",
      "pub_time_taipei": "2025-08-29T19:00:10+08:00",
      "summary": "<p>Rallies from Alaska to Hawaii will highlight cuts to wages, unions and social safety nets under Trump policies</p><p>Nearly 1,000 “worker over billionaire” <a href=\"https://workerslaborday.org/\">protests</a> are being planned in all 50 states starting this weekend as part of a Labor Day week of action organized by labor unions and advocacy groups in opposition to the Trump administration’s policies.</p><p>The actions include marches and rallies in cities such as <a href=\"https://www.cbsnews.com/chicago/news/chicago-labor-day-rally-march-workers-over-billionaires/\">Chicago</a> and <a href=\"https://www.mobilize.us/aflcio/event/834688/\">Los Angeles</a>, a Labor Day parade in <a href=\"https://www.mobilize.us/aflcio/event/793169/\">New York City</a>, rallies in <a href=\"https://www.mobilize.us/aflcio/event/834949/\">Palmer, Alaska</a>, <a href=\"https://www.mobilize.us/aflcio/event/831978/\">Freeport, Maine</a>, and a planned protest at the state capitol in <a href=\"https://www.mobilize.us/aflcio/event/823900/\">Honolulu</a>, Hawaii.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/29/workers-over-billionaires-trump-protest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Outback Wrangler star Matt Wright found guilty on two charges after fatal helicopter crash but jury deadlocked on third",
      "link": "https://www.theguardian.com/australia-news/2025/aug/29/matt-wright-outback-wrangler-trial-verdict-ntwnfb",
      "pub_time_taipei": "2025-08-29T18:03:31+08:00",
      "summary": "<p>Reality TV star accused of trying to cover up evidence following the February 2022 crash that killed co-star Chris ‘Willow’ Wilson</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Reality TV star Matt Wright has been found guilty of two counts of attempting to pervert the course of justice after a deadly helicopter crash.</p><p>But a supreme court jury in Darwin on Friday failed to reach agreement on a third count after a four-week trial held before acting justice Allan Blow.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/29/matt-wright-outback-wrangler-trial-verdict-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Giorgia Meloni ‘disgusted’ at posting of photos of her and other women on porn site",
      "link": "https://www.theguardian.com/world/2025/aug/29/giorgia-meloni-disgusted-at-posting-of-photos-of-her-and-other-women-on-porn-site",
      "pub_time_taipei": "2025-08-29T18:03:25+08:00",
      "summary": "<p>Italian platform Phica closes after sharing altered images of PM, her sister, opposition leader and others</p><p>The Italian prime minister, Giorgia Meloni, has said she is “disgusted” that photos of her and other women were posted on a pornographic website, and called for the perpetrators to be swiftly identified and “punished with the utmost firmness”.</p><p>Images of Meloni’s sister, Arianna, and the opposition leader, Elly Schlein, were also discovered on the Italian platform Phica, which had more than 700,000 subscribers before its managers closed the site on Thursday, blaming users for “using the platform incorrectly”.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/giorgia-meloni-disgusted-at-posting-of-photos-of-her-and-other-women-on-porn-site\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: Typhoon Kajiki lashes south-east Asia with fatalities in Vietnam",
      "link": "https://www.theguardian.com/environment/2025/aug/29/weather-tracker-typhoon-kajiki-lashes-south-east-asia-with-fatalities-vietnam",
      "pub_time_taipei": "2025-08-29T17:50:26+08:00",
      "summary": "<p>Duration of torrential rains from Typhoon Kajiki lead to elevated landslide risk  across Laos and Thailand</p><p><a href=\"https://earthobservatory.nasa.gov/images/154716/typhoon-kajiki-lashes-southeast-asia\">Typhoon Kajiki</a> steadily intensified over the South China Sea last weekend into a category 2 storm with sustained wind speeds of 115mph. It made landfall near the coastal city of Vinh in Vietnam on Monday afternoon, having slightly weakened but still packing a punch with winds of up to 100mph and torrential rainfall.</p><p>Kajiki’s wind threat soon faded after landfall, but the flood risk continued into Tuesday and Wednesday as the system moved inland. Parts of central and northern Vietnam, as well as Thailand, experienced 300-400mm of rainfall.</p> <a href=\"https://www.theguardian.com/environment/2025/aug/29/weather-tracker-typhoon-kajiki-lashes-south-east-asia-with-fatalities-vietnam\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK bank shares tumble after call for windfall tax on lenders in budget",
      "link": "https://www.theguardian.com/business/2025/aug/29/uk-bank-shares-tumble-after-call-for-windfall-tax-on-lenders-in-budget",
      "pub_time_taipei": "2025-08-29T17:40:07+08:00",
      "summary": "<p>Investor jitters follow report by IPPR, with stock market value of sector cut by almost £8bn in morning trading</p><ul><li><p><a href=\"https://www.theguardian.com/politics/2025/aug/29/treasury-tax-big-banks-quantitative-easing-windfalls-thinktank\">Treasury ‘should tax big banks on quantitative easing windfalls’, says thinktank</a></p></li><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/29/uk-business-confidence-rises-economy-fears-stock-market-bonds-inflation-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>UK bank shares tumbled on Friday, cutting the stock market value of the sector by almost £8bn in morning trading, <a href=\"https://www.theguardian.com/politics/2025/aug/29/treasury-tax-big-banks-quantitative-easing-windfalls-thinktank\">as fresh calls for a windfall tax on large lenders</a> in the autumn budget spooked investors.</p><p>Calls for a tax grab, in a paper written by the Institute for Public Policy Research (IPPR) thinktank, took a toll on some of the UK’s biggest high street banks. NatWest Group suffered the biggest drop on Friday morning, registering a decline of as much as 5% in its share price, while Lloyds Banking Group and Barclays followed close behind, falling 4.5% and 3.6% respectively. HSBC dropped more than 1%.</p> <a href=\"https://www.theguardian.com/business/2025/aug/29/uk-bank-shares-tumble-after-call-for-windfall-tax-on-lenders-in-budget\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thai court dismisses prime minister Paetongtarn Shinawatra",
      "link": "https://www.theguardian.com/world/2025/aug/29/thailand-prime-minister-paetongtarn-shinawatra-court-ruling-cambodia-hun-sen-phone-call",
      "pub_time_taipei": "2025-08-29T17:14:56+08:00",
      "summary": "<p>Daughter of former PM Thaksin accused of failing to protect country’s interests over leaked phone call with Cambodia’s leader</p><p>Thailand’s constitutional court has dismissed Paetongtarn Shinawatra from her position as prime minister, ruling that as the country’s leader she violated constitutional rules on ethics in a phone call with Cambodia’s senate president, Hun Sen.</p><p>The ruling, which ushers in a fresh period of instability in the country, means she immediately loses her job, which she had held for about a year. The 39-year-old <a href=\"https://www.theguardian.com/world/2025/jul/01/thailands-pm-paetongtarn-shinawatra-suspended-over-leaked-call\">had already been suspended</a> from her duties on 1 July after a recording was leaked of her phone conversation with Hun Sen, in which they discussed a simmering border dispute between the neighbouring countries.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/thailand-prime-minister-paetongtarn-shinawatra-court-ruling-cambodia-hun-sen-phone-call\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK bans Israeli officials from flagship defence show",
      "link": "https://www.theguardian.com/politics/2025/aug/29/uk-bans-israeli-officials-from-flagship-defence-show",
      "pub_time_taipei": "2025-08-29T17:02:13+08:00",
      "summary": "<p>Israel says Britain’s decision to exclude it from military weapons showcase is a ‘regrettable act of discrimination’</p><p>The UK has banned Israeli officials from attending the country’s flagship defence event next month.</p><p>Israeli industry, including UK subsidiaries of Israeli companies, will be able to attend London’s Defence &amp; Security Equipment International (DSEI) show in September but the UK government will not invite representatives of the Israeli government to the major industry event.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/29/uk-bans-israeli-officials-from-flagship-defence-show\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Severe thunderstorm warning for Porepunkah as manhunt continues – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb",
      "pub_time_taipei": "2025-08-29T16:03:26+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Expelled ambassador says allegations against Iran ‘baseless’ during Sydney airport exit</strong></p><p>Iran’s former ambassador to Australia – now persona non grata – denied allegations his government was behind two antisemitic arson attacks in Australia, describing the accusations as “baseless” as he left the country.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Porepunkah police shooting: wife of alleged killer Dezi Freeman arrested in late-night raid as manhunt continues",
      "link": "https://www.theguardian.com/news/2025/aug/29/porepunkah-raid-arrests-search-for-alleged-police-killer-dezi-freeman-continues-ntwnfb",
      "pub_time_taipei": "2025-08-29T15:25:02+08:00",
      "summary": "<p>Victoria police arrested and interviewed a 42-year-old woman and a 15-year-old boy, releasing them ‘pending further inquiries’</p><ul><li><p><a href=\"https://www.theguardian.com/news/2025/aug/29/what-we-know-so-far-porepunkah-police-shooting-victoria-manhunt-suspect-dezi-freeman-ntwnfb\">What we know so far about the Victoria police shooting and suspect Dezi Freeman</a></p></li><li><p>Report: <a href=\"https://www.theguardian.com/news/2025/aug/28/porepunkah-suspect-used-to-spy-on-my-family-with-drones-says-former-neighbour\">Porepunkah suspect used to spy on my family with drones, says former neighbour</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Police overnight arrested the wife of Porepunkah shooting suspect Dezi Freeman, interviewing and releasing the 42-year-old woman and a 15-year-old boy “pending further inquiries” as the manhunt in Victoria’s high country continues.</p><p>As the massive police operation to find the alleged cop killer marked its fourth day on Friday, the Bureau of Meteorology issued an emergency warning for severe thunderstorms in Victoria’s north-east, including the town of Porepunkah.</p> <a href=\"https://www.theguardian.com/news/2025/aug/29/porepunkah-raid-arrests-search-for-alleged-police-killer-dezi-freeman-continues-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least 23 dead in overnight Kyiv attack as UK and EU summon Russian envoys",
      "link": "https://www.theguardian.com/politics/2025/aug/28/uk-summons-russian-ambassador-over-british-council-missile-damage-in-kyiv",
      "pub_time_taipei": "2025-08-29T15:09:02+08:00",
      "summary": "<p>Missile strikes on Ukrainian capital hit EU and British Council offices in deadliest assault in months</p><p>The UK and European Union have summoned their Russian envoys after overnight missile strikes on Kyiv killed at least 23 people and damaged the city’s British Council and EU offices, in the deadliest aerial assault on the Ukrainian capital since the Alaska summit between Vladimir Putin and Donald Trump.</p><p>Four children were among those killed after a residential building in the eastern Darnytskyi district was struck in the middle of the night, according to Ukraine’s interior minister, Ihor Klymenko.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/28/uk-summons-russian-ambassador-over-british-council-missile-damage-in-kyiv\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Victoria warned to prepare for ‘destruction’ with severe weather and snow forecast",
      "link": "https://www.theguardian.com/australia-news/2025/aug/29/melbourne-weather-victoria-blizzard-snow-forecast-south-australia-severe-warnings-weekend",
      "pub_time_taipei": "2025-08-29T14:39:48+08:00",
      "summary": "<p>Gusts reaching up to 130km/h expected to push further into south-eastern states on Saturday, bringing showers, hail and thunderstorms</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Blizzards have been forecast for parts of Victoria and residents have been warned to prepare for power outages and “destruction” as damaging winds are expected to lash the south-eastern states into the weekend.</p><p>An intense cold front began moving across Victoria from South Australia on Friday, after rain, thunderstorms and destructive winds battered the Adelaide metro area and surrounds on Thursday night and Friday morning, and a tornado warning was briefly issued.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/29/melbourne-weather-victoria-blizzard-snow-forecast-south-australia-severe-warnings-weekend\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Friday briefing: Why are Palestinians shut out of post-war plans while former PM discusses their future?",
      "link": "https://www.theguardian.com/world/2025/aug/29/friday-briefing-why-are-palestinians-shut-out-of-post-war-plans-while-tony-blair-discusses-their-future",
      "pub_time_taipei": "2025-08-29T13:34:57+08:00",
      "summary": "<p>In today’s newsletter: Former PM returns to Middle East ​politics​ as civil society groups argue that any real solution must begin with Palestinian agency</p><p>Good morning. Tony Blair is back and he has plans for the Middle East.</p><p>No, you have not woken up and jumped back two decades in time. The former Labour leader, who was put under pressure to resign after the disastrous decision to go to war with Iraq – which led to the death of a million Iraqis and created a vacuum later filled by the brutal Islamic State – is back in the headlines this week.</p><p><em><strong>Ukraine </strong></em>| The UK and European Union have <a href=\"https://www.theguardian.com/politics/2025/aug/28/uk-summons-russian-ambassador-over-british-council-missile-damage-in-kyiv\">summoned their Russian envoys</a> after missile strikes on Kyiv killed at least 18 people and damaged British Council and EU offices.</p><p><em><strong>UK news </strong></em>| The Treasury is reportedly considering a <a href=\"https://www.theguardian.com/money/2025/aug/28/uk-landlords-could-face-tax-from-rents\">tax on landlords</a> in the autumn budget that would target income from rents. The proposals are centred on the expansion of national insurance to include rental income.</p><p><em><strong>Iran </strong></em>| The UK, France and Germany have <a href=\"https://www.theguardian.com/world/2025/aug/28/uk-germany-and-france-say-they-have-triggered-restored-un-sanctions-on-iran\">formally notified the UN</a> that they have triggered the restoration of sweeping UN sanctions against Iran, giving Tehran 30 days to make concessions on access to its nuclear sites.</p><p><em><strong>US news </strong></em>| The White House named <a href=\"https://www.theguardian.com/us-news/2025/aug/28/cdc-chief-fired-white-house-monarez-trump\">non-scientist Jim O’Neill, a deputy of Robert F Kennedy Jr</a>, to serve as acting head of the US Centers for Disease Control and Prevention (CDC), amid a standoff over the firing of director Susan Monarez whose lawyers said she could only be removed by Donald Trump himself.</p><p><em><strong>Environment </strong></em>| The <a href=\"https://www.theguardian.com/environment/2025/aug/28/collapse-critical-atlantic-current-amoc-no-longer-low-likelihood-study\">collapse</a> of a critical Atlantic current can no longer be considered a low-likelihood event, a study has concluded, making deep cuts to fossil fuel emissions even more urgent to avoid the catastrophic impact.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/friday-briefing-why-are-palestinians-shut-out-of-post-war-plans-while-tony-blair-discusses-their-future\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labor greenlights contentious Robbins Island windfarm despite fears for endangered orange-bellied parrot",
      "link": "https://www.theguardian.com/australia-news/2025/aug/29/labor-approves-robbins-island-windfarm-tasmania",
      "pub_time_taipei": "2025-08-29T13:24:59+08:00",
      "summary": "<p>Environment advocates have called for important migratory shorebird habitat off Tasmania to be declared ‘no-go site’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li></ul><p>The Albanese government has greenlit a contentious windfarm proposed for Robbins Island off north-western Tasmania, promising to impose conditions to protect threatened bird species, including the critically endangered orange-bellied parrot.</p><p>The environment minister, Murray Watt, announced on Friday that he had approved an application by the renewable energy company Acen Australia to build up to 100 turbines, a 1.2km bridge between the nearly 10,000-hectare island and the Tasmanian mainland, a 500-metre wharf and four quarries.</p><p><strong><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=copyembed\">Sign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/29/labor-approves-robbins-island-windfarm-tasmania\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Safety and space at risk as SUVs reach 30% of car market in English cities, researchers warn",
      "link": "https://www.theguardian.com/uk-news/2025/aug/29/giant-cars-motoring-uk-public-safety-paris",
      "pub_time_taipei": "2025-08-29T13:00:06+08:00",
      "summary": "<p>Campaigners call for Paris-style parking charges amid fears big vehicles are taking up excessive public space</p><p>The number of giant cars in England’s cities has increased tenfold in recent years, according to researchers, who warn the vehicles are taking up excessive public space and posing a threat to public safety.</p><p>Analysis published by <a href=\"https://cleancitiescampaign.org/carspreading/\">Clean Cities</a> has found SUVs have gone from 3% to 30% of existing cars in the past two decades. In London, the number of SUVs has increased from about 80,000 in 2002 to about 800,000 in 2023.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/29/giant-cars-motoring-uk-public-safety-paris\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New Zealand fugitive and one of his children spotted on CCTV after four years on the run, police believe",
      "link": "https://www.theguardian.com/world/2025/aug/29/new-zealand-fugitive-tom-phillips-cctv",
      "pub_time_taipei": "2025-08-29T09:49:08+08:00",
      "summary": "<p>Footage from a small North Island town store is the first confirmed sighting of Tom Phillips in a year, nearly four years after he disappeared with his three children</p><p>New CCTV footage believed to show New Zealand <a href=\"https://www.theguardian.com/world/2025/aug/20/new-zealand-fugitive-tom-phillips-children-hiding-nearly-four-years\">fugitive Tom Phillips</a> and one of his children allegedly breaking into and stealing from a convenience store has been released by police.</p><p>Detective senior sergeant Andy Saunders told media on Friday that investigators believe the pair in the video are Phillips and one of his three children, who vanished almost four years ago. It is the first confirmed sighting of Phillips in a year.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/new-zealand-fugitive-tom-phillips-cctv\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "India’s Modi to meet Xi and Putin on first China trip in seven years as US tariffs bite",
      "link": "https://www.theguardian.com/world/2025/aug/29/india-china-relations-modi-to-meet-xi-putin-first-china-trip-seven-years-us-tariffs",
      "pub_time_taipei": "2025-08-29T09:31:38+08:00",
      "summary": "<p>PM’s four-day trip, which includes Japan visit, comes as Delhi seeks to diversify trade and bolster ties with Beijing</p><p>The Indian prime minister, Narendra Modi, will land in China this weekend for his first visit in seven years – a trip that puts him in the company of the Chinese president, Xi Jinping, and the Russian president, Vladimir Putin, just as India’s ties with Washington have soured.</p><p>Modi’s visit to Tianjin for a regional security summit comes days after the <a href=\"https://www.theguardian.com/us-news/2025/aug/27/trump-tariff-india-russian-oil-purchase\">US doubled tariffs on Indian exports to 50%</a>, citing New Delhi’s refusal to stop buying Russian oil.</p> <a href=\"https://www.theguardian.com/world/2025/aug/29/india-china-relations-modi-to-meet-xi-putin-first-china-trip-seven-years-us-tariffs\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli forces raid former air defence base near Syrian capital",
      "link": "https://www.theguardian.com/world/2025/aug/28/israeli-forces-former-air-defence-base-southern-syria-damascus",
      "pub_time_taipei": "2025-08-29T02:38:53+08:00",
      "summary": "<p>Operation at site south of Damascus is deepest into Syrian territory since ousting of Bashar al-Assad last year</p><p>Israeli forces raided a former air defence base in southern Syria on Wednesday during a series of airstrikes in the area – their farthermost such operation inside Syria since Bashar al-Assad was ousted last December.</p><p>The site, near the city of al-Kiswah, about 6 miles (10km) south of Damascus, was a strategic base for Iranian militias during Assad’s rule.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/israeli-forces-former-air-defence-base-southern-syria-damascus\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Beach returned to First Nation after 170 years following Canada legal battle",
      "link": "https://www.theguardian.com/world/2025/aug/28/saugeen-first-nation-reserve-beach-ontario",
      "pub_time_taipei": "2025-08-29T02:29:13+08:00",
      "summary": "<p>Stretch of Lake Huron shore was promised to Saugeen people in 1854 treaty with crown but was wrongly omitted from map</p><p>A stretch of beach will be returned to a First Nation in <a href=\"https://www.theguardian.com/world/canada\">Canada</a> 170 years after it was mistakenly omitted from its reserve. The sandy sliver of land measures less than two miles long, but has nonetheless sparked an outsized battle, with a nearby resort town claiming the case sets a foreboding precedent for property rights in the country.</p><p>Canada’s supreme court said on Thursday that it would not hear a challenge from the town of South Bruce Peninsula, which is contesting a lower court’s ruling that the Saugeen First Nation’s reserve was erroneously smaller than promised.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/saugeen-first-nation-reserve-beach-ontario\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brawl erupts in Mexico’s senate after debate over US military intervention to fight drug cartels",
      "link": "https://www.theguardian.com/world/2025/aug/28/mexico-senate-fight-us-military-intervention-cartels",
      "pub_time_taipei": "2025-08-29T01:59:02+08:00",
      "summary": "<p>Alejandro ‘Alito’ Moreno and Gerardo Fernández Noroña grabbed and shouted at each other over the presence of foreign troops</p><p><a href=\"https://www.theguardian.com/world/mexico\">Mexico</a>’s senate devolved into violence this week as two of the country’s top politicians shoved, grabbed and shouted at each other after a heated discussion over the presence of foreign troops.</p><p>Alejandro “Alito” Moreno, head of the opposition Institutional Revolutionary party (Pri), grabbed at Gerardo Fernández Noroña, the senate president from the ruling Morena party, after lawmakers finished singing the national anthem to mark the end of the day’s session on Wednesday.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/mexico-senate-fight-us-military-intervention-cartels\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Uncontacted Peruvian tribe on deadly collision course with loggers, group says",
      "link": "https://www.theguardian.com/world/2025/aug/28/peru-amazon-logging-mashco-piro",
      "pub_time_taipei": "2025-08-29T01:42:41+08:00",
      "summary": "<p>Survival International says Mashco Piro seen in nearby Amazon village in alarming sign group is under stress</p><p>Members of an Indigenous tribe who live deep in Peru’s Amazon rainforest and avoid contact with outsiders have been reported entering a neighboring village in what activists consider an alarming sign that the group is under stress from development.</p><p>The sightings of members of Mashco Piro tribe come as a logging company is building a bridge that could give outsiders easier access to the tribe’s territory, a move that could raise the risk of disease and conflict, according to Survival International, which advocates for Indigenous rights.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/peru-amazon-logging-mashco-piro\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK and EU summon top Russian diplomats after strikes hit British Council and EU offices in deadly attack on Kyiv - as it happened",
      "link": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
      "pub_time_taipei": "2025-08-28T23:28:32+08:00",
      "summary": "<p>Overnight raid kills more than a dozen people as European leaders condemn ‘deliberate’ targeting of civilians and institutions</p><p>Ukrainian prime minister <strong>Yulia Svyrydenko</strong> has now responded to the overnight Russian attacks on Kyiv, <strong>criticising Moscow for “horrific and deliberate killing of civilians.”</strong></p><p>“The Russians are not choosing to end the war, only constant expansion of atrocities,” she said.</p><p><em>“Overnight in Kyiv, dozens of buildings were hit: residential houses, office centers, civilian enterprises. Among them also the building where the European Union Delegation to Ukraine is located. </em></p><p><em><strong>Russians now believe that they have paralyzed Ukraine’s allies with feigned plans for ‘negotiations’</strong> and endless delays that only serve as methods to buy time with the true goal only of preventing sanctions.</em></p><p><em>“My <strong>thoughts are with all those affected by the senseless Russian strikes on Kyiv</strong> which have damaged the British Council building. </em></p><p><em>Putin is killing children and civilians, and sabotaging hopes of peace. </em></p> <a href=\"https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Protesters throw stones at Argentina’s Milei over corruption allegations linked to sister",
      "link": "https://www.theguardian.com/world/2025/aug/28/argentina-javier-milei-hit-with-rocks-on-campaign-trail-amid-corruption-scandal-ntwnfb",
      "pub_time_taipei": "2025-08-28T22:27:43+08:00",
      "summary": "<p>President’s motorcade pelted with stones on campaign trail as country’s news agenda dominated by alleged scandal</p><p>The president of Argentina, <a href=\"https://www.theguardian.com/world/javier-milei\">Javier Milei</a>, has been pelted with stones while campaigning near the capital Buenos Aires by demonstrators protesting about allegations of corruption involving his influential sister.</p><p>The far-right leader, who was whisked from the scene by his security detail, sustained no injuries after his motorcade was attacked, presidential spokesperson Manuel Adorni wrote on X.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/argentina-javier-milei-hit-with-rocks-on-campaign-trail-amid-corruption-scandal-ntwnfb\">Continue reading...</a>"
    }
  ]
}