{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-24T20:40:08.525896+08:00",
  "window_end_taipei": "2025-10-25T20:40:08.525896+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Hadush Gerberslasie Kebatu manhunt live: Met Police takes over search for sex offender after London sighting",
      "link": "https://www.theguardian.com/uk-news/live/2025/oct/25/hadush-gerberslasie-kebatu-manhunt-met-police-sex-offender-london-latest-news",
      "pub_time_taipei": "2025-10-25T20:22:21+08:00",
      "summary": "<p>Cmdr James Conway says finding Kebatu, whose arrest sparked riots over the summer, is a ‘top priority’</p><p>A former asylum seeker who was released from prison in error after sexually assaulting a woman and a 14-year-old girl has been spotted “in the London area” after officers worked through the night to track his movements, Essex police said.</p><p>The Ethiopian national <strong>Hadush Gerberslasie Kebatu</strong> was <a href=\"https://www.theguardian.com/uk-news/2025/sep/23/asylum-seeker-at-centre-of-essex-hotel-protests-jailed-for-12-months\">jailed for 12 months</a> in September for sexual assault and made the subject of a five-year sexual harm prevention order.</p> <a href=\"https://www.theguardian.com/uk-news/live/2025/oct/25/hadush-gerberslasie-kebatu-manhunt-met-police-sex-offender-london-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Enforce law when suicide linked to domestic violence, say UK campaigners",
      "link": "https://www.theguardian.com/society/2025/oct/25/enforce-law-when-suicide-linked-to-domestic-violence-say-uk-campaigners",
      "pub_time_taipei": "2025-10-25T20:13:20+08:00",
      "summary": "<p>Landmark meeting in Westminster hears from string of families who say they have been failed by justice system</p><p>Every suicide in which the deceased has been a victim of domestic violence should be investigated as a potential homicide, according to calls by campaigners who want see abusers held to account for the devastating affect of their actions.</p><p>The move is necessary because police and prosecutors are not doing enough to bring perpetrators to justice in cases of suicide after domestic abuse.</p><p><em>In the UK and Ireland, <a href=\"https://www.samaritans.org/\">Samaritans</a> can be contacted on freephone 116 123, or email <a href=\"mailto:jo@samaritans.org\">jo@samaritans.org</a> or <a href=\"mailto:jo@samaritans.ie\">jo@samaritans.ie</a>. In the US, you can call or text the <a href=\"https://988lifeline.org/\">National Suicide Prevention Lifeline</a> on 988, chat on <a href=\"https://988lifeline.org/chat/\">988lifeline.org</a>, or <a href=\"https://www.crisistextline.org/\">text HOME</a> to 741741 to connect with a crisis counselor. In Australia, the crisis support service <a href=\"https://www.lifeline.org.au/\">Lifeline</a> is 13 11 14. Other international helplines can be found at <a href=\"http://www.befrienders.org/\">befrienders.org</a></em></p> <a href=\"https://www.theguardian.com/society/2025/oct/25/enforce-law-when-suicide-linked-to-domestic-violence-say-uk-campaigners\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "India’s $3.9 billion plan to help Modi’s mogul ally after U.S. charges",
      "link": "https://www.washingtonpost.com/world/2025/10/24/india-adani-group-modi-lic/",
      "pub_time_taipei": "2025-10-25T20:07:18+08:00",
      "summary": "Internal documents detail how Indian officials oversaw a plan to steer billions in investments to Gautam Adani’s businesses from the state life insurance agency."
    },
    {
      "source": "衛報",
      "title": "‘History is repeating itself’: fight against far-right in London’s East End goes on",
      "link": "https://www.theguardian.com/politics/2025/oct/25/history-repeating-fight-against-far-right-in-london-east-end",
      "pub_time_taipei": "2025-10-25T20:04:23+08:00",
      "summary": "<p>Eight-nine years after local people drove Oswald Mosley’s Blackshirts from Tower Hamlets, anti-far right coalition is still vital in borough</p><p>“The East End of London is the far right’s prime target – the essence of everything they don’t like. They feel if they can march through our borough with impunity, they can go anywhere. For them, it’s like Wembley (stadium), it’s the ultimate goal,” said Glyn Robbins, co-founder of United East End, an anti-far right coalition of community organisations.</p><p>In the East End, the historically working-class neighbourhoods in the shadow of the City of London, there’s a feeling that history is repeating itself. It was 89 years ago this month that local people, many of them British Jews, drove out Oswald Mosley’s Blackshirt militia from Whitechapel in the East End, in what has become known as the <a href=\"https://www.theguardian.com/commentisfree/2024/dec/28/battle-of-cable-street-family-history-jewish-blackshirts-racism\">Battle of Cable Street</a>.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/25/history-repeating-fight-against-far-right-in-london-east-end\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "RFK Jr to urge Americans to eat more saturated fats, alarming health experts",
      "link": "https://www.theguardian.com/us-news/2025/oct/25/rfk-jr-saturated-fats",
      "pub_time_taipei": "2025-10-25T20:00:34+08:00",
      "summary": "<p>Guidance from health and human services secretary contradicts decades of dietary recommendations</p><p><a href=\"https://www.theguardian.com/us-news/robert-f-kennedy-jr\">Robert F Kennedy Jr</a>, the health and human services secretary, is planning to issue guidance encouraging Americans to <a href=\"https://thehill.com/policy/healthcare/5563449-rfk-jr-saturated-fats-health-guidance-maha-hhs/\">eat more saturated fats</a>, contradicting <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC9794145/\">decades of dietary recommendations</a> and alarming experts.</p><p>“My response and sort of counsel to myself was to stay calm, and let’s see what happens, because there was no indication given as to how, why, when this potential shift would occur,” said Cheryl Anderson, an American Heart Association board member and professor at the University of California, San Diego’s school of public health and human longevity science.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/25/rfk-jr-saturated-fats\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labour’s new deputy leader Lucy Powell says she wants Starmer to succeed but party must change – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/25/new-labour-deputy-leader-lucy-powell-bridget-phillipson-uk-politics-latest-news-updates",
      "pub_time_taipei": "2025-10-25T19:52:37+08:00",
      "summary": "<p>Powell, who was sacked from cabinet in September, says party must be ‘more principled and strategic, less tactical, and strongly guided by our values’</p><p><strong>Lucy Powell</strong> has paid tribute to former Labour deputy leader <strong>Angela Rayner</strong>, saying she has some “big shoes to fill”, as she took to the stage to celebrate her win.</p><p>Powell spoke about how “division and hate” has increased. She said the desire for change is “palpable”.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/25/new-labour-deputy-leader-lucy-powell-bridget-phillipson-uk-politics-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australia Women’s Cricket World Cup players ‘touched inappropriately’ in India",
      "link": "https://www.theguardian.com/sport/2025/oct/25/australia-womens-cricket-world-cup-players-allegedly-touched-inappropriately-in-india",
      "pub_time_taipei": "2025-10-25T19:37:42+08:00",
      "summary": "<ul><li><p>Incident occurred near a cafe in Indore on Thurday</p></li><li><p>Local police have made an arrest, according to reports</p></li></ul><p>Two members of Australia’s Women’s World Cup team were “touched inappropriately” by a member of the public in India, Cricket Australia has said. The incident is understood to have occurred on Thursday in Indore, a day off for the team after their <a href=\"https://www.theguardian.com/sport/2025/oct/22/womens-world-cup-australia-england-match-report\">six-wicket victory over England</a>.</p><p>CA said in a statement: “We can confirm two members of the Australian women’s team were approached and touched inappropriately by a motorcyclist while walking to a cafe in Indore. The matter was reported by team security to police who are handling the matter.”</p> <a href=\"https://www.theguardian.com/sport/2025/oct/25/australia-womens-cricket-world-cup-players-allegedly-touched-inappropriately-in-india\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Japanese tourist dies in fall from Pantheon in Rome",
      "link": "https://www.theguardian.com/world/2025/oct/25/japanese-tourist-dies-in-fall-from-pantheon-in-rome",
      "pub_time_taipei": "2025-10-25T19:25:06+08:00",
      "summary": "<p>The 69-year-old man plunged 7 metres from an outer wall after becoming unwell and losing his balance</p><p>A Japanese tourist has died after falling from the outer wall of the Pantheon in Rome.</p><p>The man, 69, had been sitting on the wall before he plunged 7 metres into the ancient landmark’s moat on Friday night, the Italian news agency, Ansa, reported.</p> <a href=\"https://www.theguardian.com/world/2025/oct/25/japanese-tourist-dies-in-fall-from-pantheon-in-rome\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least four killed in Russian strikes overnight on Ukraine",
      "link": "https://www.theguardian.com/world/2025/oct/25/russian-overnight-strikes-ukraine-zelenskyy-sanctions-oil",
      "pub_time_taipei": "2025-10-25T19:17:36+08:00",
      "summary": "<p>Attacks come after Volodymyr Zelenskyy appeals to US for long-range missiles and urges allies to expand sanctions on Russian oil</p><p>Russian missile and drone attacks on Ukraine overnight killed at least four people and wounded 17 others, local officials said.</p><p>In the capital, Kyiv, two people were killed and 13 wounded in a ballistic missile attack in the early hours of Saturday, Timur Tkachenko, head of Kyiv’s city military administration, said. Three of the wounded were hospitalised, according to Ukraine’s state emergency service.</p> <a href=\"https://www.theguardian.com/world/2025/oct/25/russian-overnight-strikes-ukraine-zelenskyy-sanctions-oil\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Factionalism, farce and chaos dogs Reform UK in the garden of England",
      "link": "https://www.theguardian.com/politics/2025/oct/25/reform-uk-kent-meeting-chaos-factionalism",
      "pub_time_taipei": "2025-10-25T19:02:15+08:00",
      "summary": "<p>All is not well in Kent for Nigel Farage’s party as the recent video of an incendiary meeting suggests</p><p>When Reform UK swept to power in Kent at this year’s local elections, Nigel Farage arrived in the county by helicopter afterwards for a victory party marked by popping champagne corks and a volley of fireworks.</p><p>Just over 25 weeks on from what the Reform leader described as one of the most significant days of his career the sparks flying are of a very different kind.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/25/reform-uk-kent-meeting-chaos-factionalism\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The racism and Islamophobia behind many of the attacks on Zohran Mamdani",
      "link": "https://www.theguardian.com/us-news/2025/oct/25/zohran-mamdani-attacks-racism-islamophobia-",
      "pub_time_taipei": "2025-10-25T19:00:33+08:00",
      "summary": "<p>Critics of the Democratic nominee for NYC mayor have called him everything from ‘jihadist candidate’ to ‘terrorist sympathizer’</p><p>On Thursday morning, hours after a combative final New York mayoral debate that <a href=\"https://www.theguardian.com/us-news/2025/oct/23/shouting-and-ready-to-bump-chests-with-trump-but-nobody-moved-the-needle-in-the-final-new-york-mayoral-debate\">failed to move the needle</a> in his favor, Andrew Cuomo’s attacks on progressive Democratic rival Zohran Mamdani resumed a familiar, racially charged theme.</p><p>“God forbid, another 9/11, can you imagine Mamdani in the seat?” the independent candidate and former governor told conservative radio talkshow host Sid Rosenberg, referring to the 2001 terrorist attacks on New York City by Islamic extremists.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/25/zohran-mamdani-attacks-racism-islamophobia-\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Argentina goes to polls amid economic crisis and Trump ‘interference’",
      "link": "https://www.theguardian.com/world/2025/oct/25/argentina-president-javier-milei-polls-economic-crisis-trump",
      "pub_time_taipei": "2025-10-25T19:00:32+08:00",
      "summary": "<p>Poor showing in Sunday’s election would deal hammer blow to country’s radical libertarian president, Javier Milei</p><p>Argentina’s radical libertarian leader, Javier Milei, is facing a pivotal moment in his presidency with voters set to deliver their verdict on his two-year-old administration on Sunday against a backdrop of political and economic crisis and accusations that his ally Donald Trump is meddling in the country’s affairs.</p><p>A poor showing in Sunday’s midterm election would be a hammer blow to Milei, who took power in December 2023 <a href=\"https://www.theguardian.com/world/2023/dec/10/javier-milei-sworn-in-as-president-in-tipping-point-for-argentina\">pledging</a> to kickstart “a new era of peace and prosperity” by slashing spending and inflation.</p> <a href=\"https://www.theguardian.com/world/2025/oct/25/argentina-president-javier-milei-polls-economic-crisis-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Leftwinger Catherine Connolly takes clear lead in Ireland’s presidential race",
      "link": "https://www.theguardian.com/world/2025/oct/25/catherine-connolly-ireland-presidential-election-leftwing",
      "pub_time_taipei": "2025-10-25T18:24:26+08:00",
      "summary": "<p>Early tallies indicate resounding victory for leftwinger as voters deliver humbling rebuke to government</p><p>The leftwing independent candidate Catherine Connolly is on track to win Ireland’s presidential election, according to early vote tallies.</p><p>Reports from tallymen – unofficial but usually reliable observers at count centres – gave Connolly a wide lead on Saturday soon after ballot boxes opened at 9am.</p> <a href=\"https://www.theguardian.com/world/2025/oct/25/catherine-connolly-ireland-presidential-election-leftwing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump says he is open to meeting Kim Jong-un as he embarks on whirlwind Asia tour",
      "link": "https://www.theguardian.com/us-news/2025/oct/25/trump-open-to-meeting-kim-jong-un-asia-tour-japan-korea-xi-jinping",
      "pub_time_taipei": "2025-10-25T18:08:22+08:00",
      "summary": "<p>Trip will see him take part in high-stakes trade talks with Chinese leader Xi Jinping – but he also raised prospect of meeting North Korean leader</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-asia-tour-key-questions-xi-jinping-china-japan-south-korea-malaysia\"><strong>Trump in Asia: five key questions as US president prepares for diplomatic tour</strong></a></p></li></ul><p>Donald Trump has set off for a tour of Asia where he is expected to take part in high-stakes trade talks with China’s leader, Xi Jinping – telling reporters he was also open to a meeting with the North Korean leader, Kim Jong-un.</p><p>Trump, who left Washington on Friday night, <a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-asia-tour-key-questions-xi-jinping-china-japan-south-korea-malaysia\">is set for a five-day trip</a> to Malaysia, Japan and South Korea, his first visit to the region since taking office in January. He is due to arrive in Malaysia on Sunday morning local time.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/25/trump-open-to-meeting-kim-jong-un-asia-tour-japan-korea-xi-jinping\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "They wanted to make hummus. The Gaza war made them a political target.",
      "link": "https://www.washingtonpost.com/world/2025/10/25/germany-hummus-israeli-palestinian-partners/",
      "pub_time_taipei": "2025-10-25T17:00:37+08:00",
      "summary": "An Israeli and a Palestinian opened a restaurant hailed as a sign of hope — but the Hamas attack and war in Gaza brought ugliness and tested their partnership."
    },
    {
      "source": "華盛頓郵報",
      "title": "GOP hawks feel the whiplash of Trump’s China policy",
      "link": "https://www.washingtonpost.com/national-security/2025/10/24/xi-jinping-trump-china-summit/",
      "pub_time_taipei": "2025-10-25T17:00:00+08:00",
      "summary": "Republican hawks worry Trump will soften his stance on China as a meeting with Chinese leader Xi Jinping looms."
    },
    {
      "source": "華盛頓郵報",
      "title": "What to know about Trump’s role in the Thailand-Cambodia peace deal",
      "link": "https://www.washingtonpost.com/world/2025/10/25/trump-thailand-cambodia-peace-deal/",
      "pub_time_taipei": "2025-10-25T17:00:00+08:00",
      "summary": "Trump, who wants a Nobel Peace Prize, has claimed credit for the ceasefire between Thailand and Cambodia. He will oversee the signing of the “Kuala Lumpur Accord.”"
    },
    {
      "source": "華盛頓郵報",
      "title": "Pentagon orders aircraft carrier to Latin America as Trump signals escalation",
      "link": "https://www.washingtonpost.com/national-security/2025/10/24/aircraft-carrier-trump-caribbean-latin-america/",
      "pub_time_taipei": "2025-10-25T16:59:01+08:00",
      "summary": "A spokesman said the dramatic increase in combat power aims to “disrupt narcotics trafficking” and “degrade and dismantle” criminal groups operating in the region."
    },
    {
      "source": "華盛頓郵報",
      "title": "Switzerland is spending millions revamping its vast network of bunkers",
      "link": "https://www.washingtonpost.com/world/2025/10/25/switzerland-nuclear-bunkers-overhaul/",
      "pub_time_taipei": "2025-10-25T16:00:14+08:00",
      "summary": "Citing “the changing global security situation,” the famously neutral country is embarking on a major revamp of personal shelters and civil protection sites."
    },
    {
      "source": "衛報",
      "title": "Turkey likely to be excluded from Gaza stabilisation force after Israeli objection",
      "link": "https://www.theguardian.com/world/2025/oct/25/turkey-gaza-stabilisation-force-israeli-objection",
      "pub_time_taipei": "2025-10-25T12:00:24+08:00",
      "summary": "<p>Doubts over whether Ankara will be part of 5,000-strong force to be deployed to prevent postwar power vacuum</p><p>Turkey will probably be excluded from the 5,000-strong stabilisation force that is to be set up inside Gaza after Israel made clear it did not want Turkish troops taking part.</p><p>Marco Rubio, the US secretary of state, said it was a requirement that Israel is comfortable with the nationality of the multinational force, set up to prevent a security vacuum when the massive task of reconstruction in Gaza starts. Turkey has said it is willing to offer troops, but Israel has let it be known that it disapproves of Turkish troops taking part in the force.</p> <a href=\"https://www.theguardian.com/world/2025/oct/25/turkey-gaza-stabilisation-force-israeli-objection\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Six metres below ground: inside the secret hospital treating Ukrainian soldiers injured by Russian drones",
      "link": "https://www.theguardian.com/world/2025/oct/25/underground-hospital-ukrainian-soldiers-injured-by-russian-drones",
      "pub_time_taipei": "2025-10-25T12:00:24+08:00",
      "summary": "<p>Doctors at the secret facility are able to perform amputations while others monitor zigzagging drones overhead</p><p>Scrubby trees hide the entrance. A sloping wooden tunnel descends to a brightly lit reception area. There is a surgery unit, equipped with beds, cardiac monitors and ventilators. And shelves full of medical equipment, drugs and neat piles of spare clothes. In a staff room with a washing machine and kettle, doctors keep an eye on a screen. It shows the movements of Russian spy drones as they zigzag in the sky above.</p><p>Welcome to Ukraine’s secret underground hospital. The facility opened in August and is the second of its kind, located in eastern Ukraine not far from the frontline and the <a href=\"https://www.theguardian.com/world/2024/sep/18/if-they-dont-die-our-infantry-will-ukraines-pivotal-battle-for-donetsk\">city of Pokrovsk</a>, in Donetsk oblast. “We are 6 metres below the earth. It’s the safest way of providing help to our injured soldiers. And it keeps medical personnel safe,” said the clinic’s surgeon, Maj Oleksandr Holovashchenko.</p> <a href=\"https://www.theguardian.com/world/2025/oct/25/underground-hospital-ukrainian-soldiers-injured-by-russian-drones\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Children under 14 are incapable of evil and should be protected from criminal responsibility, NSW review finds",
      "link": "https://www.theguardian.com/australia-news/2025/oct/25/children-under-14-are-incapable-of-evil-and-should-be-protected-from-criminal-responsibility-nsw-review-finds",
      "pub_time_taipei": "2025-10-25T11:51:28+08:00",
      "summary": "<p>Review was led by former supreme court judge turned parole authority chair Geoffrey Bellew SC and former NSW police deputy commissioner Jeffrey Loy</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A centuries-old legal presumption that children aged between 10 and 14 are not capable of evil should become law, a New South Wales review led by a former supreme court judge and a former senior NSW police figure has recommended.</p><p>In NSW, the criminal age of responsibility is 10 but the common law presumption of doli incapax – Latin for “incapable of evil” – can apply up to 14, offering protection for children being prosecuted on the presumption they don’t understand the difference between right and wrong.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/25/children-under-14-are-incapable-of-evil-and-should-be-protected-from-criminal-responsibility-nsw-review-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Revealed: some Australians have overpaid their Centrelink debt by more than $20,000",
      "link": "https://www.theguardian.com/australia-news/2025/oct/24/revealed-some-australians-have-overpaid-their-centrelink-debt-by-more-than-20000",
      "pub_time_taipei": "2025-10-25T11:34:33+08:00",
      "summary": "<p><strong>Exclusive:</strong> Services Australia spokesperson says automatic BPay payments and Centrelink being unable to contact customers may be to blame</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/24/australia-news-live-police-search-colleen-walker-craig-bowraville-river-labor-environment-laws-murray-watt-coalition-greens-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Approximately 44,000 Australians who have a debt with Centrelink have overpaid it, some by $20,000 or more, Guardian Australia can reveal.</p><p>It is the latest in a string of scandals to hit Centrelink after hundreds of thousands of people <a href=\"https://www.theguardian.com/australia-news/2025/sep/26/more-than-300000-australians-had-centrelink-payments-cancelled-illegally-new-analysis-shows\">had their payments illegally cancelled</a>, with <a href=\"https://www.theguardian.com/australia-news/2025/mar/05/australia-mutual-obligation-system-it-system-error\">several reviews</a> concluding the welfare system is not working legally and the government announcing plans to undertake at least three remediation processes for separate issues – <a href=\"https://www.theguardian.com/australia-news/2025/sep/04/robodebt-victims-win-record-settlement-centrelink-government-compensation\">the robodebt class action</a>, <a href=\"https://www.theguardian.com/australia-news/2025/aug/27/about-3m-australians-affected-by-unlawful-centrelink-debt-calculation-to-be-eligible-for-up-to-600-compensation\">income apportionment</a> and overpaid debts.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/24/revealed-some-australians-have-overpaid-their-centrelink-debt-by-more-than-20000\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thailand’s Queen Mother Sirikit dies at 93 after more than a decade out of the public eye",
      "link": "https://www.theguardian.com/world/2025/oct/25/thailands-queen-mother-sirikit-dies-at-93-after-more-than-a-decade-out-of-the-public-eye",
      "pub_time_taipei": "2025-10-25T10:02:10+08:00",
      "summary": "<p>Prime minister Charnvirakul cancels trip to Asean summit in Malaysia after news of the Queen Mother’s death</p><p>Thailand’s Queen Mother Sirikit, who brought glamour to a postwar revival in the country’s monarchy and who, in later years, would occasionally wade into politics, has died aged 93, the Thai Royal Household bureau has announced.</p><p>The palace said she had been hospitalised since 2019 due to several illnesses and developed a bloodstream infection on 17bOctober before passing away late on Friday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/25/thailands-queen-mother-sirikit-dies-at-93-after-more-than-a-decade-out-of-the-public-eye\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump adviser Stephen Miller insists East Wing of White House ‘is not part of the White House’ – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
      "pub_time_taipei": "2025-10-25T09:56:06+08:00",
      "summary": "<p>This blog is now closed. Read our latest story <a href=\"https://www.theguardian.com/us-news/2025/oct/24/white-house-demolition-east-wing-trump-ballroom\">here</a></p><p><strong>The US secretary of state has confirmed Donald Trump’s announcement that all trade negotiations with Canada have been suspended.</strong></p><p>Marco Rubio spoke during a visit to a civil-military coordination centre in southern Israel.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least four people shot near Howard University, Washington DC police say",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/howard-university-shooting-police",
      "pub_time_taipei": "2025-10-25T09:30:24+08:00",
      "summary": "<p>Police say one person critical and one person in serious condition but no details on suspect or suspects</p><p>A shooting near Howard University has left at least four people shot, police in Washington DC said.</p><p>The shooting happened as thousands descended on the campus for homecoming celebrations.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/howard-university-shooting-police\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ex-60 Minutes producer Bill Owens says bosses discouraged him from covering Gaza and Trump",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/60-minutes-bill-owens",
      "pub_time_taipei": "2025-10-25T08:50:32+08:00",
      "summary": "<p>Show’s leader, who resigned in April, says he was also pressured to apologize for edit of Kamala Harris interview</p><p>The former executive producer of 60 Minutes, Bill Owens, said he faced intense internal pressure from his corporate bosses to avoid certain stories that had the potential to generate backlash for parent company Paramount, in his first public remarks <a href=\"https://www.theguardian.com/us-news/2025/apr/22/60-minutes-executive-producer-leaves-bill-owens\">since his sudden resignation</a> in late April.</p><p>In January, 60 Minutes <a href=\"https://www.cbsnews.com/video/us-gaza-policy-60-minutes-video-2025-01-12/\">ran a segment</a> featuring former state department employees who had quit over how Joe Biden’s administration handled the war in Gaza. The segment drew backlash from pro-Israel organizations and unnerved Paramount’s controlling shareholder, Shari Redstone, a strong supporter of Israel.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/60-minutes-bill-owens\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US places sanctions on Colombian president over alleged failure to stop cartels",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/us-sanctions-colombian-president-gustavo-petro",
      "pub_time_taipei": "2025-10-25T08:36:53+08:00",
      "summary": "<p>Treasury accuses Gustavo Petro of ‘allowing drug cartels to flourish’ as president attacks Trump’s ‘oppressive regime’</p><p>The US treasury department has announced sanctions on Colombian president Gustavo Petro, one of Donald Trump’s harshest international critics.</p><p>“President Petro has allowed drug cartels to flourish and refused to stop this activity,” treasury secretary Scott Bessent wrote in a post on X. “Today President Trump is taking strong action to protect our nation.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/us-sanctions-colombian-president-gustavo-petro\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Homemade chilli paste products linked to cluster of rat poisoning cases in south-east Queensland",
      "link": "https://www.theguardian.com/australia-news/2025/oct/25/homemade-chilli-paste-products-linked-to-cluster-of-rat-poisoning-cases-in-south-east-queensland",
      "pub_time_taipei": "2025-10-25T07:34:07+08:00",
      "summary": "<p>Queensland Health has issued an alert for people to be aware of the products they warn could still be circulating in the Logan community</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Health authorities have identified homemade chilli paste products as the source of a cluster of rat poisoning cases in south-east Queensland.</p><p>Five people from the same geographic area presented to hospitals earlier in October with symptoms consistent with being exposed to brodifacoum, the active ingredient in rat poison.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/25/homemade-chilli-paste-products-linked-to-cluster-of-rat-poisoning-cases-in-south-east-queensland\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. imposes sanctions on Colombian President Gustavo Petro and family",
      "link": "https://www.washingtonpost.com/world/2025/10/24/petro-colombia-sanctions-trump-us/",
      "pub_time_taipei": "2025-10-25T07:17:13+08:00",
      "summary": "Gustavo Petro has been Latin America’s most vocal critic of U.S. strikes on alleged drug boats. The administration says Petro has failed to stop illegal drug production."
    },
    {
      "source": "衛報",
      "title": "Liberals accuse Labor of secrecy for withholding PM’s letters to ministers – despite Coalition doing the same",
      "link": "https://www.theguardian.com/australia-news/2025/oct/25/liberals-accuse-labor-secrecy-withholding-pm-letters-to-ministers",
      "pub_time_taipei": "2025-10-25T07:00:19+08:00",
      "summary": "<p>Opposition senator’s FoI request rejected by Department of Prime Minister and Cabinet on national security and cabinet solidarity grounds</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Liberals have accused the Albanese government of a culture of secrecy after it refused to disclose the prime minister’s letters to his ministers laying out their responsibilities – despite the former Coalition government also failing to disclose the letters.</p><p>The freedom of information request, made by Liberal senator Maria Kovacic, was rejected by the Department of Prime Minister and Cabinet, which cited national security and cabinet solidarity concerns. The rejection was not without precedence – the former Morrison government also <a href=\"https://www.theguardian.com/australia-news/2021/apr/21/morrison-government-blocks-release-of-instructions-to-ministers-citing-cabinet-confidentiality\">rejected a freedom of information request</a> by Guardian Australia for the letters in 2021.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/25/liberals-accuse-labor-secrecy-withholding-pm-letters-to-ministers\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Lithuania shuts airports and Belarus border after weather balloon incursion",
      "link": "https://www.theguardian.com/world/2025/oct/24/weather-balloon-incursion-forces-lithuanias-biggest-airports-to-close",
      "pub_time_taipei": "2025-10-25T06:23:31+08:00",
      "summary": "<p>Vilnius and Kaunas airports closed down after balloons drift into country’s airspace for third time this month</p><p>Lithuania closed its two biggest airports on Friday and shut crossings on its border with Belarus after helium weather balloons drifted into its territory, the third such occurrence in the Baltic state this month.</p><p>European aviation has repeatedly been thrown into chaos in recent weeks by drone sightings and other air incursions, including at airports in <a href=\"https://www.theguardian.com/news/ng-interactive/2025/oct/05/a-collective-anxiety-attack-the-psychology-of-unexplained-drone-sightings-across-europe\">Copenhagen, Munich and the Baltic region</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/weather-balloon-incursion-forces-lithuanias-biggest-airports-to-close\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pentagon deploys top aircraft carrier as Trump militarisation of Caribbean ratchets up",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/trump-caribbean-uss-gerald-ford-carrier",
      "pub_time_taipei": "2025-10-25T04:00:44+08:00",
      "summary": "<p>Use of USS Gerald Ford along with fighter jets comes as president plots strikes against alleged cartels on land</p><p>The Pentagon said on Friday that it was deploying the United States’s most advanced aircraft carrier to the Caribbean, a major escalation in the Trump administration’s war against drug cartels that provides the resources to start conducting strikes against targets on the ground.</p><p>The move will bring the USS Gerald Ford, with dozens of stealth fighter jets and surveillance aircraft, in addition to other warships that accompany the carrier, to the coast of Venezuela as it nears the end of its current deployment in the Mediterranean.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-caribbean-uss-gerald-ford-carrier\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US and Canada spar over ad of Reagan denouncing tariffs that led to derailed trade talks",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/trump-canada-trade-negotations-ontario-tariffs",
      "pub_time_taipei": "2025-10-25T03:25:36+08:00",
      "summary": "<p>Ontario premier says he plans to run ad featuring speech that sparked Trump’s ire again during World Series but campaign will end Monday</p><p>After the US suspended all trade negotiations with <a href=\"https://www.theguardian.com/world/canada\">Canada</a> over a 1987 speech by Ronald Reagan denouncing tariffs that appeared to spark <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s ire, the premier of Ontario said he planned to run an ad featuring the speech again during the World Series on Friday.</p><p>Doug Ford, whose government ran the Reagan ad in US markets this week, first posted on X that the two nations were “stronger together”, while Trump added his own string of social media posts trumpeting the supposed benefits of tariffs.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-canada-trade-negotations-ontario-tariffs\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump cancels trade negotiations with Canada over anti-tariff ad",
      "link": "https://www.washingtonpost.com/world/2025/10/24/trump-cancel-canada-trade-negotiations-reagan/",
      "pub_time_taipei": "2025-10-25T02:51:56+08:00",
      "summary": "President Donald Trump claimed Canada “fraudulently used” an advertisement that featured audio from a 1987 radio address by President Ronald Reagan criticizing tariffs."
    },
    {
      "source": "華盛頓郵報",
      "title": "Tips for Trump on Russia (from an ex-oligarch once jailed by Putin)",
      "link": "https://www.washingtonpost.com/world/2025/10/24/mikkhail-khodorkovsky-trump-putin-russia/",
      "pub_time_taipei": "2025-10-25T01:14:27+08:00",
      "summary": "The key to dealing with Moscow, Mikhail Khodorkovsky said, is understanding the paramount role of Vladimir Putin as the driver of the war and applying direct pressure."
    },
    {
      "source": "衛報",
      "title": "Palestinian factions say they agree to let independent technocrat committee run Gaza",
      "link": "https://www.theguardian.com/world/2025/oct/24/palestinian-factions-say-they-agree-to-let-independent-technocrat-committee-run-gaza",
      "pub_time_taipei": "2025-10-25T00:50:30+08:00",
      "summary": "<p>Administration will manage basic services ‘in cooperation with Arab brothers and international institutions’, says joint statement</p><p>The main Palestinian factions have said they have agreed that an independent committee of technocrats would take over the running of Gaza after Hamas said it had received “clear guarantees” from mediators that “the war has effectively ended”.</p><p>A joint statement published on the Hamas website said the groups had agreed in a meeting in Cairo to hand “over the administration of the Gaza Strip to a temporary Palestinian committee composed of independent ‘technocrats’, which will manage the affairs of life and basic services in cooperation with Arab brothers and international institutions”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/palestinian-factions-say-they-agree-to-let-independent-technocrat-committee-run-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Scottish fire engine destined for West Bank may return after 15-month Israeli seizure",
      "link": "https://www.theguardian.com/uk-news/2025/oct/24/scottish-fire-engine-destined-for-west-bank-may-return-after-15-month-israeli-seizure",
      "pub_time_taipei": "2025-10-25T00:47:04+08:00",
      "summary": "<p>Dundee firefighters request return of donated appliance to avoid Nablus officials having to pay £16,000 Ashdod holding fees</p><p>A fully equipped fire engine donated by Dundee firefighters to their counterparts in the West Bank city of Nablus could be sent back to Scotland after being impounded for more than a year by Israeli authorities.</p><p>Firefighters in Dundee, which is twinned with Nablus, have regularly donated kit, equipment and medical supplies to the West Bank over the past 15 years, as well as bringing Palestinian firefighters to Scotland for training.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/24/scottish-fire-engine-destined-for-west-bank-may-return-after-15-month-israeli-seizure\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Surgeons remove up to 100 magnets from New Zealand teenager’s intestines",
      "link": "https://www.theguardian.com/world/2025/oct/24/surgeons-remove-high-power-temu-magnets-new-zealand-teenagers-intestines",
      "pub_time_taipei": "2025-10-25T00:42:45+08:00",
      "summary": "<p>Boy, 13, swallowed the high-power magnets after apparently buying them from the online retailer Temu</p><p>A 13-year-old boy in New Zealand swallowed up to 100 high-power magnets he bought online, forcing surgeons to remove tissue from his intestines, doctors said on Friday.</p><p>After suffering four days of abdominal pain, the unnamed teenager was taken to Tauranga hospital in the North Island. “He disclosed ingesting approximately 80 to 100 5x2mm high-power (neodymium) magnets about one week prior,” said a report by hospital doctors in the New Zealand Medical Journal.</p><p>This article’s byline was amended on 25 October 2025 to correct the news agency it was attributed to. An earlier version incorrectly attributed it to Associated Foreign Press; however the correct agency was Agence France-Presse.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/surgeons-remove-high-power-temu-magnets-new-zealand-teenagers-intestines\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Dead soldiers’ teeth reveal diseases that doomed Napoleon’s army",
      "link": "https://www.washingtonpost.com/science/2025/10/24/napoleons-army-diseases-ancient-dna-teeth/",
      "pub_time_taipei": "2025-10-24T23:00:00+08:00",
      "summary": "Scientists analyze ancient DNA to uncover the diseases that killed Napoleon's troops in 1812."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. kills six in latest strike on alleged drug boat, Hegseth says",
      "link": "https://www.washingtonpost.com/national-security/2025/10/24/us-boat-strike-caribbean-hegseth/",
      "pub_time_taipei": "2025-10-24T22:38:48+08:00",
      "summary": "The operation marked the 10th known attack on suspected smugglers from Latin America, pushing the reported death toll to at least 43."
    },
    {
      "source": "華盛頓郵報",
      "title": "Gold and silver coins stolen from French museum hours after Louvre heist",
      "link": "https://www.washingtonpost.com/world/2025/10/23/france-musem-heist-coins-diderot-louvre/",
      "pub_time_taipei": "2025-10-24T22:34:44+08:00",
      "summary": "The theft of French crown jewels overshadowed the robbery of some $100,000 worth of historical coins from a museum dedicated to philosopher Denis Diderot."
    },
    {
      "source": "衛報",
      "title": "Once Australia’s second priciest city, Melbourne has become more affordable. What happened – and will it last?",
      "link": "https://www.theguardian.com/australia-news/2025/oct/25/once-australias-second-priciest-city-melbourne-has-become-more-affordable-what-happened-and-will-it-last",
      "pub_time_taipei": "2025-10-24T22:00:46+08:00",
      "summary": "<p>More homes and less property investor activity has seen Victoria’s capital rise up the affordability rankings</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>In 2021, Melbourne’s median house price surpassed $1m, after a decade of rising by an average of more than $70,000 a year.</p><p>It was Australia’s second most expensive housing market, after Sydney. The next year, prices began to fall.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/25/once-australias-second-priciest-city-melbourne-has-become-more-affordable-what-happened-and-will-it-last\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Republicans who once opposed Trump’s military impulses now lower their guard",
      "link": "https://www.washingtonpost.com/national-security/2025/10/24/trump-military-strikes-republicans-war-powers/",
      "pub_time_taipei": "2025-10-24T21:42:26+08:00",
      "summary": "The president’s talk of further escalating his campaign in Latin America poses uncomfortable questions for some in Congress."
    },
    {
      "source": "衛報",
      "title": "US secretary of state Marco Rubio says ‘Hamas cannot be involved in governing Gaza’ – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/24/aid-gaza-israel-palestine-benjamin-netanyahu-hamas-ceasefire-west-bank-middle-east-live-news",
      "pub_time_taipei": "2025-10-24T21:31:46+08:00",
      "summary": "<p>Rubio also said the UN agency for Palestinian refugees (Unrwa) cannot play a future role in Gaza, claiming it is a ‘subsidiary of Hamas’</p><p>At least 14 migrants died when their inflatable dinghy capsized in the <strong>Aegean Sea</strong> off the <strong>Turkish</strong> resort of <strong>Bodrum</strong>, the governor’s office said on Friday, raising an earlier toll of seven dead.</p><p>“The lifeless bodies of 14 irregular migrants were recovered,” the office of the <strong>Mugla</strong> governorate said on X, quoting one of the two survivors as saying that 18 people had been on board when the dinghy went down. The fate of the other two remained unclear, reports Agence France-Presse (AFP).</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/24/aid-gaza-israel-palestine-benjamin-netanyahu-hamas-ceasefire-west-bank-middle-east-live-news\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Rubio stresses there is ‘no plan B’ amid questions over Trump’s Gaza deal",
      "link": "https://www.washingtonpost.com/world/2025/10/24/israel-hamas-gaza-war-ceasefire-rubio/",
      "pub_time_taipei": "2025-10-24T21:00:06+08:00",
      "summary": "The secretary of state said the U.S. was committed to Israel’s security, while warning the Trump-brokered ceasefire deal was the “only plan” that would succeed."
    }
  ]
}