{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-04T20:40:07.399976+08:00",
  "window_end_taipei": "2025-10-05T20:40:07.399976+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Youth-led US climate activists widen focus to fight authoritarianism",
      "link": "https://www.theguardian.com/us-news/2025/oct/05/sunrise-movement-climate-activism-authoritarianism",
      "pub_time_taipei": "2025-10-05T20:30:34+08:00",
      "summary": "<p>Sunrise Movement, which led calls for a Green New Deal, will organize against Trump’s attacks on universities</p><p>As the Trump administration cracks down on both environmental policies and progressive activism, the <a href=\"https://www.theguardian.com/us-news/2025/jun/18/sunrise-movement-big-oil-climate-bills\">Sunrise Movement</a>, the youth-led climate justice organization that <a href=\"https://www.theguardian.com/environment/2020/oct/16/sunrise-movement-wide-awakes-us-climate-activists\">popularized</a> <a href=\"https://www.theguardian.com/us-news/2020/nov/16/joe-biden-climate-crisis-ennvironment-energy\">calls</a> for a Green New Deal, is widening its mission to fight authoritarianism.</p><p>“Every day, <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> is seizing power and shredding the Constitution,” Sunrise’s executive director, Aru Shiney-Ajay, wrote in an open letter to Sunrise members, funders and allies. “What ordinary people do in the coming months will determine whether he and his billionaire cronies can cement their grip on power and turn this country into a playground for the rich and powerful.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/05/sunrise-movement-climate-activism-authoritarianism\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russian air attack across Ukraine damages energy networks, kills five",
      "link": "https://www.washingtonpost.com/world/2025/10/05/ukraine-russia-energy-attack/",
      "pub_time_taipei": "2025-10-05T20:24:53+08:00",
      "summary": "The drone and missile assault hit nine regions and left tens of thousands without electricity as Russia ramps up its energy war ahead of winter in Ukraine."
    },
    {
      "source": "衛報",
      "title": "Badenoch says her migration plan ‘credible’, but won’t say where 150,000 people a year being removed will go – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-10-05T20:00:57+08:00",
      "summary": "<p>Conservative leader grilled over her removals proposal ahead of party conference opening later today</p><p></p><p>The polling firm <strong>Opinium</strong> has released some research this morning suggesting that some Conservative party policies are popular with voters – but that, if people are explicitly told that they are Kemi Badenoch policies, their popularity goes down.</p><p>There is some evidence that Keir Starmer’s unpopularity has the same effect – and that, once a policy is associated with him, <a href=\"https://www.theguardian.com/politics/2025/oct/01/keir-starmer-labour-collapse-public-support-digital-id-cards\">voters are less inclined to back it</a>.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "An academic was aghast when her partner was accused of IRA activity. After his trial, he confessed",
      "link": "https://www.theguardian.com/uk-news/2025/oct/05/an-academic-was-aghast-when-her-partner-was-accused-of-ira-activity-after-his-trial-he-confessed",
      "pub_time_taipei": "2025-10-05T20:00:35+08:00",
      "summary": "<p>Mary Attenborough’s nightmare began when the police raided the flat she and Michael Gallagher shared, their memoir reveals, but their relationship prevailed</p><p>When police thundered into their London home in 1996 and arrested Michael Gallagher on suspicion of IRA activity, Margaret Attenborough was shocked and indignant.</p><p>She was an English academic who wrote books on geophysical software and her Scottish partner was a former civil servant who helped homeless alcoholics. The idea of him as an IRA man seemed ludicrous. Gallagher was romantic and cerebral – he had wowed Attenborough by completing the Guardian’s cryptic crossword in three minutes.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/05/an-academic-was-aghast-when-her-partner-was-accused-of-ira-activity-after-his-trial-he-confessed\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Police to get new powers to crack down on repeated protests, says Home Office",
      "link": "https://www.theguardian.com/uk-news/2025/oct/05/police-to-get-new-powers-to-crack-down-on-repeated-protests-says-home-office",
      "pub_time_taipei": "2025-10-05T19:36:05+08:00",
      "summary": "<p>Move follows arrest of almost 500 people at latest pro-Palestinian demonstration in London on Saturday</p><p>Ministers are to give police new powers to target repeated protests, aimed particularly at cracking down on demonstrations connected to Gaza, the Home Office has said.</p><p>The announcement, made the morning after <a href=\"https://www.theguardian.com/world/2025/oct/04/palestine-action-protest-police-arrests-london-demo\">almost 500 people</a> were arrested in London for expressing support for Palestine Action, a proscribed organisation, could allow police to order regular protests to take place at a different site.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/05/police-to-get-new-powers-to-crack-down-on-repeated-protests-says-home-office\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australian telcom bosses to be grilled over triple-zero service reliability ahead of summer bushfire season",
      "link": "https://www.theguardian.com/business/2025/oct/05/australian-telcom-bosses-to-be-grilled-over-triple-zero-service-reliability-ahead-of-summer-bushfire-season",
      "pub_time_taipei": "2025-10-05T19:30:33+08:00",
      "summary": "<p>The communications minister plans to press companies on their legal obligations to protect community safety and procedures to avoid outages</p><p>The federal government will grill the bosses of Australia’s biggest telecommunications companies over the reliability of triple-zero services in the looming summer bushfire season, as Labor fast-tracks laws to protect the emergency call system.</p><p>On the back foot over Labor’s response to <a href=\"https://www.theguardian.com/business/2025/sep/30/optus-triple-zero-outages-anika-wells-meeting-singtel-lot-of-work-to-do\">recent Optus triple-zero outages</a> which have been linked to three deaths, the communications minister, Anika Wells, has ordered the chief executive of the company, as well as the chief executives of Telstra and TPG, the owner of Vodafone, to travel to Canberra on Tuesday to discuss safeguards for the system.</p> <a href=\"https://www.theguardian.com/business/2025/oct/05/australian-telcom-bosses-to-be-grilled-over-triple-zero-service-reliability-ahead-of-summer-bushfire-season\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Georgia’s prime minister announces crackdown on dissent after Tbilisi protests",
      "link": "https://www.theguardian.com/world/2025/oct/05/georgia-irakli-kobakhidze-crackdown-dissent-tbilisi-protests",
      "pub_time_taipei": "2025-10-05T19:25:52+08:00",
      "summary": "<p>Irakli Kobakhidze accused EU ambassador of supporting ‘attempt to overthrow constitutional order’ </p><p>Georgia’s prime minister, Irakli Kobakhidze, has announced a sweeping crackdown on dissent, accusing demonstrators who tried to storm the presidential palace of aiming to topple his government and blaming the European Union for interference in his country.</p><p>Kobakhidze levelled his allegations a day after protesters attempted to breach the presidential palace as local elections were being held. They were stopped by riot police using pepper spray and water cannon.</p> <a href=\"https://www.theguardian.com/world/2025/oct/05/georgia-irakli-kobakhidze-crackdown-dissent-tbilisi-protests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Four killed as Russian drones and missiles bombard Ukrainian city of Lviv",
      "link": "https://www.theguardian.com/world/2025/oct/05/russian-drones-missiles-bombard-attack-ukraine-lviv",
      "pub_time_taipei": "2025-10-05T19:20:59+08:00",
      "summary": "<p>City, which sits just 70km from Polish border, suffers one of its most serious attacks since the start of the war</p><p>Early on Sunday, the western Ukrainian city of Lviv, normally considered one of the safest in the country, suffered one of its most sustained and serious attacks since the start of Vladimir Putin’s full-scale invasion.</p><p>For five hours, Russian Shahed drones and missiles targeted the city, which is about 70km from the Polish border. Large explosions were audible from the centre, a Unesco world heritage site.</p> <a href=\"https://www.theguardian.com/world/2025/oct/05/russian-drones-missiles-bombard-attack-ukraine-lviv\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "René Magritte’s ‘superstar of surrealism’ to go on sale in Paris",
      "link": "https://www.theguardian.com/artanddesign/2025/oct/05/rene-magritte-superstar-of-surrealism-la-magie-noire-to-go-on-sale-in-paris",
      "pub_time_taipei": "2025-10-05T18:43:19+08:00",
      "summary": "<p>La Magie Noire, bought by family of wartime resistance heroine 90 years ago, expected to fetch more than €7m</p><p>A painting by the surrealist artist René Magritte that has been held in a private collection for more than 90 years will go on sale later this month.</p><p>La Magie Noire was bought by the family of the second world war resistance heroine Suzanne Spaak, who were Magritte’s benefactors at a time when he was struggling financially and had failed to sell a single work for two years.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/oct/05/rene-magritte-superstar-of-surrealism-la-magie-noire-to-go-on-sale-in-paris\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump’s hatred for renewables means the US is falling behind the rest of the world",
      "link": "https://www.theguardian.com/environment/2025/oct/05/donald-trump-hatred-renewables-us-falling-behind-world",
      "pub_time_taipei": "2025-10-05T18:00:31+08:00",
      "summary": "<p>As well as embracing ‘beautiful coal’, the president has set about obliterating clean energy projects</p> <a href=\"https://www.theguardian.com/environment/2025/oct/05/donald-trump-hatred-renewables-us-falling-behind-world\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Indigenous people bear the worst of Canada’s historic wildfire season",
      "link": "https://www.washingtonpost.com/world/2025/10/05/canada-wildfires-indigenous-people/",
      "pub_time_taipei": "2025-10-05T18:00:30+08:00",
      "summary": "Indigenous people make up 5 percent of Canada’s population but have made up more than half its wildfire evacuees this year."
    },
    {
      "source": "華盛頓郵報",
      "title": "PTSD and suicides spike among Israeli troops amid devastation of Gaza war",
      "link": "https://www.washingtonpost.com/world/2025/10/05/israel-gaza-soldiers-ptsd-suicide/",
      "pub_time_taipei": "2025-10-05T17:00:15+08:00",
      "summary": "Returning soldiers are confronting PTSD in record numbers, mental health professional say, and the army is scrambling to address an issue once taboo in Israel."
    },
    {
      "source": "衛報",
      "title": "Sussan Ley faces emboldened conservative backbench after Hastie’s resignation, Liberal MPs warn",
      "link": "https://www.theguardian.com/australia-news/2025/oct/05/sussan-ley-faces-emboldened-conservative-backbench-after-hasties-resignation-liberal-mps-warn",
      "pub_time_taipei": "2025-10-05T15:13:06+08:00",
      "summary": "<p>Victorian Liberal Sarah Henderson says Perth MP has been ‘sidelined’ for his immigration views but party’s ‘backbench is a very powerful place to be’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Opposition Leader Sussan Ley faces an increasingly emboldened conservative backbench bloc, Liberal MPs have warned, amid frustration and confusion over the timing of Andrew Hastie’s resignation over immigration policy.</p><p>Hastie <a href=\"https://www.theguardian.com/australia-news/2025/oct/03/andrew-hastie-liberal-mp-quits-coalition-frontbench-over-immigration-policy-dispute\">resigned from the frontbench on Friday</a>, saying Ley had told him he would not have a role in the formation of the Coalition’s immigration policy before the next election, despite holding the home affairs portfolio.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/05/sussan-ley-faces-emboldened-conservative-backbench-after-hasties-resignation-liberal-mps-warn\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "AI lets Russian war widows see their soldier husbands one more time",
      "link": "https://www.washingtonpost.com/world/2025/10/05/russia-ai-digital-resurrection-soldiers/",
      "pub_time_taipei": "2025-10-05T15:00:00+08:00",
      "summary": "A trend has emerged in Russia of using artificial intelligence to create video memorials of the dead, often soldiers, giving a final farewell to their wives and children."
    },
    {
      "source": "衛報",
      "title": "Richard Desmond legal action over National Lottery award to begin at high court",
      "link": "https://www.theguardian.com/uk-news/2025/oct/05/richard-desmond-legal-action-over-national-lottery-award-to-begin-at-high-court",
      "pub_time_taipei": "2025-10-05T14:00:28+08:00",
      "summary": "<p>Billionaire suing Gambling Commission for up to £1.3bn over licence award, with payout potentially funded by the taxpayer</p><p>The media billionaire Richard Desmond will begin a <a href=\"https://www.theguardian.com/uk-news/2022/apr/15/national-lottery-richard-desmond-takes-legal-action-over-licence-award\">bitter courtroom battle</a> with the Gambling Commission this week that could cost taxpayers hundreds of millions of pounds in a row over the licence to run the National Lottery.</p><p>Northern &amp; Shell and The New Lottery Company (TNLC), owned by Desmond, are suing the gambling regulator for up to £1.3bn, alleging “manifest errors” in the labyrinthine competition process for Britain’s largest public sector contract, the lottery licence.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/05/richard-desmond-legal-action-over-national-lottery-award-to-begin-at-high-court\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Afghans awaited U.S. resettlement. Pakistan sent them back to the Taliban.",
      "link": "https://www.washingtonpost.com/world/2025/10/05/pakistan-deports-afghan-refugees-taliban-resettlement/",
      "pub_time_taipei": "2025-10-05T14:00:26+08:00",
      "summary": "More than 1 million Afghans have been pressured to leave or deported by Pakistan. Many were former U.S. contractors approved for U.S. resettlement, now on hold under Trump."
    },
    {
      "source": "衛報",
      "title": "Gisèle Pelicot to attend appeals court as man convicted of raping her contests verdict",
      "link": "https://www.theguardian.com/world/2025/oct/05/gisele-pelicot-to-attend-appeals-court-as-man-convicted-of-raping-her-contests-verdict",
      "pub_time_taipei": "2025-10-05T14:00:26+08:00",
      "summary": "<p>Husamettin Dogan, 44, was sentenced to nine years in prison at trial of 51 men last year where all were found guilty</p><p>Gisèle Pelicot, who survived almost a <a href=\"https://www.theguardian.com/world/2024/sep/17/dominique-pelicot-france-rape-trial-testimony\">decade of rape</a> involving dozens of men after she was drugged by her ex-husband, will attend court in France again on Monday after one of the men convicted of raping her faces a second trial after appealing against his verdict.</p><p>Pelicot became a feminist hero after she decided to waive her right to anonymity in the 2024 trial of her former husband and <a href=\"https://www.theguardian.com/world/2024/dec/19/who-are-the-men-convicted-over-rape-and-assault-of-gisele-pelicot-\">50 other men</a> last year.</p> <a href=\"https://www.theguardian.com/world/2025/oct/05/gisele-pelicot-to-attend-appeals-court-as-man-convicted-of-raping-her-contests-verdict\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pop star turned Islamist militant Fadel Shaker surrenders to Lebanese military after 12 years on the run",
      "link": "https://www.theguardian.com/world/2025/oct/05/pop-star-turned-islamist-militant-fadel-shaker-surrenders-to-lebanese-military-after-12-years-on-the-run",
      "pub_time_taipei": "2025-10-05T13:24:59+08:00",
      "summary": "<p>Shaker, wanted over his connection to deadly shootout between militants and army, had been hiding out in Palestinian refugee camp</p><p>A Lebanese pop star turned wanted Islamist militant handed himself over to the country’s military intelligence service 12 years after going on the run.</p><p>Fadel Shaker had been on the run since the <a href=\"https://www.theguardian.com/world/2013/jun/24/lebanese-troops-cleric-compound-fighting\">bloody street clashes between Sunni Muslim militants and the Lebanese army</a> in June 2013 in the coastal city of Sidon. He was tried in absentia and sentenced to 22 years in prison in 2020 for providing support to a “terrorist group”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/05/pop-star-turned-islamist-militant-fadel-shaker-surrenders-to-lebanese-military-after-12-years-on-the-run\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Liberal frontbencher backs Hastie on immigration – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/05/australia-news-live-hecs-student-debt-mark-butler-albanese-labor-melbourne-metro-nsw-qld-sussan-ley-andrew-hastie-coalition-ntwnfb",
      "pub_time_taipei": "2025-10-05T11:58:36+08:00",
      "summary": "<p>This blog is now closed.</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>James Paterson says Hastie move to backbench part of Liberals’ ‘debate and contest about ideas’</strong></p><p>The sooner the Liberal party can sort out its differences the better but it may take a while after <strong>Andrew</strong> <strong>Hastie</strong>’s departure to the back bench, according to one of the rogue MP’s closest colleagues.</p><p>But we do have to make sure we go through our processes. We have to make sure we have those debates.</p><p>One of the reflections we’ve all had about the last parliamentary term is that there wasn’t enough debate and contest about ideas, that we need to robustly contest policy before we settle on it.</p><p>On the back bench, I’ll continue to advocate for things I believe in.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/05/australia-news-live-hecs-student-debt-mark-butler-albanese-labor-melbourne-metro-nsw-qld-sussan-ley-andrew-hastie-coalition-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US envoys head to Egypt for Gaza ceasefire talks as Trump says ‘we are very close’ to deal",
      "link": "https://www.theguardian.com/us-news/2025/oct/04/trump-gaza-peace-deal",
      "pub_time_taipei": "2025-10-05T11:07:36+08:00",
      "summary": "<p>US president says he will push to finalize agreement in the coming days even as scores of Palestinians killed in latest Israeli attacks</p><p>Donald Trump’s son-in-law and a senior envoy are heading to Egypt to begin ceasefire negotiations, the White House has said, as the Israeli prime minister, Benjamin Netanyahu, said he hoped to bring all remaining hostages home in the coming days.</p><p>A White House official said the US president was sending his envoys, Jared Kushner and Steve Witkoff, to Egypt on Saturday to finalise the technical details of a hostage release and discuss a lasting ceasefire deal a day after <a href=\"https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages\">Hamas said it was ready to free hostages</a> under Trump’s plan to end the two-year-old war. In an interview, Trump said “we are very close” to reaching an agreement.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/04/trump-gaza-peace-deal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hot public holiday expected for Sydney and Brisbane after record rain for parts of NSW and Queensland in September",
      "link": "https://www.theguardian.com/environment/2025/oct/05/hot-public-holiday-expected-for-sydney-and-brisbane-after-record-rain-for-parts-of-nsw-and-queensland-in-september",
      "pub_time_taipei": "2025-10-05T10:40:10+08:00",
      "summary": "<p>Warm weather follows deluges in more than a dozen places in NSW and Queensland which topped daily records for the month</p><ul><li><p>Follow our Australia news live blog for latest updates</p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p></p><p>Sydney and Brisbane are in for a hot public holiday on Monday, with temperatures set to pass 30C in both capitals.</p><p>The warm weather comes after a soaking September on Australia’s east coast smashed monthly rain records across 21 places in Queensland and six in New South Wales following a <a href=\"https://www.theguardian.com/environment/2025/aug/23/august-rain-records-smashed-across-nsw-as-thunderstorms-and-more-rain-loom-in-final-week\">record-breaking rain in August</a>.</p><p>Sydney – sunny, minimum 20C, maximum 31C</p><p>Brisbane – sunny, minimum 15C, maximum 32C</p><p>Melbourne – shower or two, minimum 12C, maximum 16C</p><p>Adelaide – shower or two, minimum 11C, maximum 17C</p><p>Canberra – shower or two, minimum 11C, maximum 23C</p><p>Perth – sunny, minimum 8C, maximum 21C</p><p>Hobart – possible shower, minimum 7C, maximum 14C</p><p>Darwin – partly cloudy minimum 25C, maximum 35C</p> <a href=\"https://www.theguardian.com/environment/2025/oct/05/hot-public-holiday-expected-for-sydney-and-brisbane-after-record-rain-for-parts-of-nsw-and-queensland-in-september\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump authorizes national guard deployment to Chicago, White House says, as border patrol there shoots woman",
      "link": "https://www.theguardian.com/us-news/2025/oct/04/woman-shot-border-patrol-chicago",
      "pub_time_taipei": "2025-10-05T10:02:55+08:00",
      "summary": "<p>Illinois governor JB Pritzker says administration is escalating ‘aggression against Illinois citizens and residents’</p><p>Donald Trump has moved to deploy the national guard in another city by authorizing 300 troops to protect federal officers and assets in Chicago, where the government said border patrol agents shot and injured a woman while firing at someone who tried to run them over.</p><p>White House spokesperson Abigail Jackson confirmed that the president had authorized using Illinois national guard members, citing what she called “ongoing violent riots and lawlessness” that local leaders have not quelled.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/04/woman-shot-border-patrol-chicago\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Judge blocks Trump administration from deploying national guard to Portland",
      "link": "https://www.theguardian.com/us-news/2025/oct/05/judge-blocks-trump-administration-from-deploying-national-guard-to-portland",
      "pub_time_taipei": "2025-10-05T08:37:30+08:00",
      "summary": "<p>US district judge agrees with Oregon assertion that deployment would likely inflame rather than calm protests in city</p><p>A federal judge has blocked the Trump administration from deploying the national guard to Portland, Oregon, according to <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.ord.189270/gov.uscourts.ord.189270.56.0_1.pdf\">court documents</a>.</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> had announced on 27 September that he would deploy troops to <a href=\"https://www.theguardian.com/us-news/portland\">Portland</a>, “authorizing Full Force, if necessary”, ignoring pleas from local officials and the state’s congressional delegation, who suggested that the president was misinformed or lying about the nature and scale of a single, small protest outside one federal immigration enforcement office.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/05/judge-blocks-trump-administration-from-deploying-national-guard-to-portland\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ex-NFL player and Fox Sports star Mark Sanchez arrested after being stabbed",
      "link": "https://www.theguardian.com/sport/2025/oct/04/nfl-mark-sanchez-stabbing-fox",
      "pub_time_taipei": "2025-10-05T06:33:59+08:00",
      "summary": "<p>Circumstances surrounding incident remain unclear with Sanchez still in hospital and not yet booked in detention</p><p></p><p>Police have said that former <a href=\"https://www.theguardian.com/sport/nfl\">NFL</a> quarterback and Fox Sports television star Mark Sanchez has been arrested at the hospital he was taken to after being stabbed late Friday night in downtown Indianapolis.</p><p>The Indianapolis metropolitan police department said in a statement that after investigation and consultation with prosecutors, Sanchez, now a television commentator, was arrested “for battery with injury, unlawful entry of a motor vehicle and public intoxication”, all of which are misdemeanors.</p> <a href=\"https://www.theguardian.com/sport/2025/oct/04/nfl-mark-sanchez-stabbing-fox\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Police make almost 500 arrests at Palestine Action protest in London",
      "link": "https://www.theguardian.com/world/2025/oct/04/palestine-action-protest-police-arrests-london-demo",
      "pub_time_taipei": "2025-10-05T05:27:28+08:00",
      "summary": "<p>Officers arrest activists at silent vigil in support of banned organisation, as demos go ahead despite PM’s pleas</p><p>Police have arrested almost 500 people in London at what organisers hoped would be the biggest demonstration so far against a ban on the proscribed organisation Palestine Action.</p><p>Officers began arresting demonstrators at the silent vigil in support of the group, which has been classed by the UK government as a terror organisation since July this year.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/palestine-action-protest-police-arrests-london-demo\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel, Hamas say they’re ready to talk peace but significant gaps remain",
      "link": "https://www.washingtonpost.com/world/2025/10/04/israel-hamas-war-peace-plan-netanyahu/",
      "pub_time_taipei": "2025-10-05T04:44:27+08:00",
      "summary": "Both sides have backed President Donald Trump’s peace plan to free all Israeli hostages, but key differences remain on how Israel’s military would withdraw from Gaza."
    },
    {
      "source": "衛報",
      "title": "Israel accused of detaining Greta Thunberg in infested cell and making her hold flags",
      "link": "https://www.theguardian.com/world/2025/oct/04/greta-thunberg-israel-gaza-sweden",
      "pub_time_taipei": "2025-10-05T03:51:49+08:00",
      "summary": "<p>Exclusive: Activist tells Swedish officials she has been subjected to harsh treatment, including insufficient food and water</p><p>The environmental campaigner Greta Thunberg has told Swedish officials she is being subjected to harsh treatment in Israeli custody after her detention and removal from a flotilla carrying aid to Gaza, according to correspondence seen by the Guardian.</p><p>According to the correspondence, Israeli forces are also reported by another detainee to have taken photographs where Thunberg was allegedly forced to hold flags. The identity of the flags is unknown.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/greta-thunberg-israel-gaza-sweden\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Time is running out’: Sportsbet offered share of $1m in bonus bets if customers gambled on AFL grand final day",
      "link": "https://www.theguardian.com/australia-news/2025/oct/05/time-is-running-out-sportsbet-offered-share-of-1m-in-bonus-bets-if-customers-gambled-on-afl-grand-final-day",
      "pub_time_taipei": "2025-10-05T03:00:14+08:00",
      "summary": "<p>Online bookmaker’s offer, one of a series texted during finals, was valid only if customer took up a suggested same-game multi bet </p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australia’s largest online bookmaker texted customers offering a guaranteed share of $1m in bonus bets if they gambled on the morning of the AFL grand final.</p><p>The messages were among a series texted to a Victorian man’s phone by Sportsbet during the AFL finals series in an apparent attempt to entice him to gamble more.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/05/time-is-running-out-sportsbet-offered-share-of-1m-in-bonus-bets-if-customers-gambled-on-afl-grand-final-day\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "After 2 years of war, some Gazans are hopeful, others wary of ceasefire plan",
      "link": "https://www.washingtonpost.com/world/2025/10/04/gaza-peace-plan-reaction-trump/",
      "pub_time_taipei": "2025-10-05T02:51:00+08:00",
      "summary": "Previous collapsed ceasefires led to skepticism among some Gazans, while others were hopeful that the latest deal conditionally accepted by Hamas would succeed."
    },
    {
      "source": "衛報",
      "title": "‘I feel like we are in a trap’: Gaza residents hopeful but wary of Trump’s plan",
      "link": "https://www.theguardian.com/world/2025/oct/04/i-feel-like-we-are-in-a-trap-gaza-residents-hopeful-but-wary-of-trumps-peace-plan",
      "pub_time_taipei": "2025-10-05T01:19:11+08:00",
      "summary": "<p>Hamas’s agreement to release all hostages and surrender power hailed internationally as Israeli attacks continue</p><p>When Arij al-Farra heard that Hamas had partially agreed to Donald Trump’s plan and that the US president had <a href=\"https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages\">ordered Israel</a> to stop bombing Gaza, the first thing she felt was a flicker of hope. The second thing she felt was an explosion. An Israeli aircraft had dropped a bomb close to her tent in Khan Younis, southern Gaza.</p><p>Though it was luck that saved Farra from death, she took the attack as a bad omen for the prospects for peace in Gaza.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/i-feel-like-we-are-in-a-trap-gaza-residents-hopeful-but-wary-of-trumps-peace-plan\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel orders military to halt Gaza City campaign but continues strikes on the territory",
      "link": "https://www.theguardian.com/world/2025/oct/04/israel-orders-military-to-halt-campaign-on-gaza-city-amid-ongoing-strikes",
      "pub_time_taipei": "2025-10-04T23:35:22+08:00",
      "summary": "<p>IDF says it was directed to ready for first part of Donald Trump’s plan to end war in Gaza after Hamas agrees to release hostages</p><p>The Israeli military has been ordered to halt its campaign in Gaza City by its political leadership, Israeli army radio reported on Saturday, while it was preparing for the first phase of <a href=\"https://www.theguardian.com/world/2025/sep/29/trump-netanyahu-gaza-peace-plan\">Donald Trump’s plan</a> to end the war in Gaza and release all hostages.</p><p>In a statement, the Israeli military said it was directed to “advance readiness” for the first part of the Trump plan. Army radio reported that operations in Gaza would be reduced to “the minimum” with troops meant only to carry out defensive strikes.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/israel-orders-military-to-halt-campaign-on-gaza-city-amid-ongoing-strikes\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Who are the hostages believed to still be alive in Gaza?",
      "link": "https://www.washingtonpost.com/world/2025/05/12/hamas-gaza-remaining-israel-hostages/",
      "pub_time_taipei": "2025-10-04T23:26:56+08:00",
      "summary": "Fewer than two dozen hostages are believed to be alive in Gaza, including a student, a software tester, a bartender and several soldiers."
    },
    {
      "source": "衛報",
      "title": "Airstrikes reported in Gaza despite Trump’s call for Israel to stop bombing ‘immediately’ – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/04/israel-gaza-hamas-trump-plan-hostages-netanyahu-latest-news-updates",
      "pub_time_taipei": "2025-10-04T22:02:46+08:00",
      "summary": "<p>This blog is now closed, you can <a href=\"https://www.theguardian.com/world/2025/oct/04/israel-orders-military-to-halt-campaign-on-gaza-city-amid-ongoing-strikes\">read more on this story here</a></p><p></p><p><strong>Turkey</strong> said 36 of its citizens were expected to return home via a special flight on Saturday afternoon, after Israel intercepted a Gaza-bound aid flotilla.</p><p>“We expected 36 of our nationals on the Global Sumud Flotilla vessels seized by Israeli forces in international waters will return to our country this afternoon via a special flight,” Turkish foreign ministry spokesman <strong>Oncu Keceli</strong> said on X, adding that the final number has not been finalised.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/04/israel-gaza-hamas-trump-plan-hostages-netanyahu-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas took 251 hostages from Israel into Gaza. Where are they?",
      "link": "https://www.washingtonpost.com/world/interactive/hamas-hostages-israel-war-gaza/",
      "pub_time_taipei": "2025-10-04T20:56:32+08:00",
      "summary": "We’re tracking what happened to the hostages taken by Hamas on Oct. 7, 2023, from Israel. Dozens were freed or killed, and about 20 are believed to be alive in Gaza."
    }
  ]
}