{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-23T20:40:11.809091+08:00",
  "window_end_taipei": "2025-10-24T20:40:11.809091+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Zelenskyy at Downing Street for talks with Starmer and ‘coalition of willing’ after meeting King Charles – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/24/volodmyr-zelenskyy-ukraine-russia-vladimir-putin-sanctions-keir-starmer-coalition-of-the-willing-military-support-europe-live-news",
      "pub_time_taipei": "2025-10-24T20:15:34+08:00",
      "summary": "<p>Volodymyr Zelenskyy set to press case for using frozen Russian assets to fund Ukraine’s defences</p><p>A forthcoming trip by German foreign minister, <strong>Johann Wadephul,</strong> to China has been cancelled amid growing fears that Beijing’s restriction on semiconductor and rare earth exports could paralyse the country’s car industry.</p><p>“We are postponing the journey to a later time,” the spokesperson told a regular press briefing on Friday. <br /><br />\n “The Chinese side was ultimately able to confirm only the appointment with the Chinese foreign minister, and could not confirm any other additional appointments,” a foreign ministry spokesperson said.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/24/volodmyr-zelenskyy-ukraine-russia-vladimir-putin-sanctions-keir-starmer-coalition-of-the-willing-military-support-europe-live-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "No 10 accepts people are ‘disappointed with the pace of change’ as Plaid Cymru celebrates Caerphilly byelection win – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/24/caerphilly-byelection-result-live-reform-plaid-cymru-labour-wales-welsh-government-senedd-latest-voting-news",
      "pub_time_taipei": "2025-10-24T20:13:35+08:00",
      "summary": "<p>Lindsay Whittle seized the Senedd constituency from Labour and resisted a fierce challenge from Reform UK</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/oct/24/plaid-cymru-wins-caerphilly-byelection-result\">Report: Plaid Cymru ousts Labour in Caerphilly</a></p></li><li><p><a href=\"https://www.theguardian.com/politics/2025/oct/24/caerphilly-byelection-result-labour-plaid-cymru-welsh-politics\">Analysis: Parties who do not adapt face defeat</a></p></li></ul><p>Reform UK candidate <strong>Llŷr Powell</strong> denied the campaign had been all about immigration.</p><p>He said: “My campaign has been about government policies and where best to put money into Caerphilly.”</p><p>When you look at where we started, we had a blank slate. We had to go out there and find a lot of voters. We found a lot of support. It’s been a great campaign. The collapse of the Labour vote is there for everyone to see. It’s been a betrayal what Labour has done around here.</p><p>Going into next year we’re in a really good place. A big part of what we were trying to do here is to master our campaigning. We’ve trained so many people up on our systems. We’re now a grassroots campaigning party.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/24/caerphilly-byelection-result-live-reform-plaid-cymru-labour-wales-welsh-government-senedd-latest-voting-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: Trump backs down on sending federal troops to San Francisco",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/first-thing-trump-backs-down-on-sending-federal-troops-to-san-francisco",
      "pub_time_taipei": "2025-10-24T20:11:47+08:00",
      "summary": "<p>Protesters flood streets in show of resistance. Plus, our architecture critic on Trump’s bulletproof ballroom bling</p><p>Good morning.</p><p>Donald Trump has <a href=\"https://www.theguardian.com/us-news/2025/oct/23/san-francisco-federal-immigration-operation\">canceled plans for a deployment of federal troops to San Francisco</a> that had sparked widespread condemnation from California leaders and sent protesters flooding into the streets.</p><p><strong>What did Trump say about his change of mind?</strong> Trump confirmed he had a conversation with mayor, Daniel Lurie, writing on social media: “I spoke to Mayor Lurie last night and he asked, very nicely, that I give him a chance to see if he can turn it around.”</p><p><strong>What are current tariffs on goods from Canada?</strong> Washington originally <a href=\"https://www.theguardian.com/world/2025/apr/03/canada-trump-tariffs-exemption\">imposed a 25% tariff</a> on imports of goods including timber, steel, aluminum and cars in the spring, prompting retaliatory action from Ottawa. The rate was <a href=\"https://www.theguardian.com/us-news/2025/jul/31/trump-canada-tariffs-order\">raised to 35% by Trump</a> in August.</p><p><strong>How did Carney respond to Trump’s fusillade?</strong> His office didn’t immediately respond to a request for comment last night. The prime minister was set to leave on Friday morning for a summit in Asia, while Trump is set to do the same on Friday evening.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/first-thing-trump-backs-down-on-sending-federal-troops-to-san-francisco\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US secretary of state Marco Rubio says ‘Hamas cannot be involved in governing Gaza’ – Middle East live",
      "link": "https://www.theguardian.com/world/live/2025/oct/24/aid-gaza-israel-palestine-benjamin-netanyahu-hamas-ceasefire-west-bank-middle-east-live-news",
      "pub_time_taipei": "2025-10-24T19:54:53+08:00",
      "summary": "<p>Rubio also said the UN agency for Palestinian refugees (Unraw) cannot play a future role in Gaza, claiming it is a ‘subsidiary of Hamas’ </p><p>At least 14 migrants died when their inflatable dinghy capsized in the <strong>Aegean Sea</strong> off the <strong>Turkish</strong> resort of <strong>Bodrum</strong>, the governor’s office said on Friday, raising an earlier toll of seven dead.</p><p>“The lifeless bodies of 14 irregular migrants were recovered,” the office of the <strong>Mugla</strong> governorate said on X, quoting one of the two survivors as saying that 18 people had been on board when the dinghy went down. The fate of the other two remained unclear, reports Agence France-Presse (AFP).</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/24/aid-gaza-israel-palestine-benjamin-netanyahu-hamas-ceasefire-west-bank-middle-east-live-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump accuses Canada of attempting to influence US supreme court with anti-tariff advertising campaign – live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
      "pub_time_taipei": "2025-10-24T19:54:06+08:00",
      "summary": "<p>The US president announced he ended talks in retaliation to an ad featuring Ronald Reagan speaking negatively about tariffs</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/24/trump-says-all-canada-trade-talks-terminated-over-ad-criticising-tariffs\">Trump says all Canada trade talks ‘terminated’ over ad criticizing tariffs</a></p></li></ul><p><strong>The US secretary of state has confirmed Donald Trump’s announcement that all trade negotiations with Canada have been suspended.</strong></p><p>Marco Rubio spoke during a visit to a civil-military coordination centre in southern Israel.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US student handcuffed after AI system apparently mistook bag of chips for firearm",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/baltimore-student-ai-gun-detection-system-doritos",
      "pub_time_taipei": "2025-10-24T19:47:34+08:00",
      "summary": "<p>Baltimore county high schools have gun detection system that alerts police if it sees what it deems suspicious</p><p>An <a href=\"https://www.theguardian.com/technology/artificialintelligenceai\">artificial intelligence system</a> (AI) apparently mistook a high school student’s bag of Doritos for a firearm and called local police to tell them the pupil was armed.</p><p>Taki Allen was sitting with friends on Monday night outside Kenwood high school in <a href=\"https://www.theguardian.com/us-news/baltimore\">Baltimore</a> and eating a snack when police officers with guns approached him.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/baltimore-student-ai-gun-detection-system-doritos\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rishi Sunak only politician to see witness statement in China spy case",
      "link": "https://www.theguardian.com/politics/2025/oct/24/rishi-sunak-only-politician-see-witness-statement-china-spy-case",
      "pub_time_taipei": "2025-10-24T19:37:02+08:00",
      "summary": "<p>Statement from security adviser, viewed by then prime minister, did not describe China as enemy</p><p>Rishi Sunak was the only politician to see a <a href=\"https://www.theguardian.com/world/2025/oct/16/china-spy-row-what-do-the-witness-statements-say-and-what-is-their-significance\">witness statement</a> by the deputy national security adviser at the centre of a controversy about the collapse of a case against two British men accused of spying for China.</p><p>According to letters sent to the joint committee on the national security strategy, the statement from Matthew Collins in December 2023, which was seen by the then prime minister and his advisers, did not describe China as an enemy, another key element of the case.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/24/rishi-sunak-only-politician-see-witness-statement-china-spy-case\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Meta found in breach of EU law over ‘ineffective’ complaints system for flagging illegal content",
      "link": "https://www.theguardian.com/technology/2025/oct/24/instagram-facebook-breach-eu-law-content-flagging",
      "pub_time_taipei": "2025-10-24T19:12:59+08:00",
      "summary": "<p>European Commission initial finding says Facebook and Instagram introduced unnecessary steps for users to submit reports</p><p>Instagram and Facebook have breached EU law by failing to provide users with simple ways to complain or flag illegal content, including child sexual abuse material and terrorist content, the European Commission has said.</p><p>In a preliminary finding on Friday, the EU’s executive body said Meta, the $1.8tn (£1.4tn) California company that runs Instagram and Facebook, had introduced unnecessary steps in processes for users to submit reports.</p> <a href=\"https://www.theguardian.com/technology/2025/oct/24/instagram-facebook-breach-eu-law-content-flagging\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK must resist raising taxes on banks, says NatWest boss as profits leap 30%",
      "link": "https://www.theguardian.com/business/2025/oct/24/uk-must-resist-raising-taxes-on-banks-says-natwest-boss-as-profits-leap",
      "pub_time_taipei": "2025-10-24T19:03:30+08:00",
      "summary": "<p>CEO says fiscal discipline should be balanced with ‘policies that create stability, consistency and support growth’</p><p>NatWest Group’s chief executive has warned the government against increasing taxes on banks in the autumn budget as the high street lender reported a 30% jump in profits.</p><p>Paul Thwaite said he understood the “difficult choices” that the chancellor, Rachel Reeves, had to make in order to help close a potential £30bn shortfall in the public finances but argued she needed to “balance fiscal discipline” with “policies that create stability, consistency and support growth”.</p> <a href=\"https://www.theguardian.com/business/2025/oct/24/uk-must-resist-raising-taxes-on-banks-says-natwest-boss-as-profits-leap\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Widow of man shot at Texas ICE facility wonders if political violence is to blame",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/texas-ice-shooting-miguel-garcia-hernandez-widow",
      "pub_time_taipei": "2025-10-24T19:00:43+08:00",
      "summary": "<p>Stephany Gauffeny lost her husband, Miguel García-Hernández, when he was shot at an ICE center and later died</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/24/dallas-ice-fatal-shooting-widow-interview\">‘He didn’t deserve that’: widow speaks out after husband’s violent death at Ice facility</a></p></li></ul><p>The widow of one of the people killed when a <a href=\"https://www.theguardian.com/us-news/2025/sep/24/dallas-ice-shooting-texas-immigration-center-latest\">gunman opened fire</a> on an Immigration and Customs Enforcement (ICE) facility in Texas last month has spoken out to question whether the <a href=\"https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shooting-political-violence\">political violence</a> rising under the Trump administration played a role in her husband’s death.</p><p>Stephany Gauffeny lost her husband, Miguel García-Hernández, when he became <a href=\"https://www.theguardian.com/us-news/2025/sep/30/victim-dies-dallas-ice-facility-shooting-miguel-angel-garcia-hernandez\">the second</a> of two men to die in the attack outside a detention center in Dallas, after succumbing to his gunshot wounds.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/texas-ice-shooting-miguel-garcia-hernandez-widow\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Drax faces lawsuits over claims workers developed asthma from wood dust",
      "link": "https://www.theguardian.com/business/2025/oct/24/drax-faces-lawsuits-over-claims-workers-developed-asthma-from-wood-dust",
      "pub_time_taipei": "2025-10-24T19:00:02+08:00",
      "summary": "<p>Current and former employees say they were not adequately protected despite knowledge of health risks</p><p>Ten lawsuits have been filed against Drax after diagnoses of asthma allegedly linked to its wood pellet fuel, it has been revealed.</p><p>Current and former workers at the UK’s largest power station claim they have not been adequately protected against sustained exposure to wood dust, which can cause serious health problems including asthma, dermatitis and nasal cancer.</p> <a href=\"https://www.theguardian.com/business/2025/oct/24/drax-faces-lawsuits-over-claims-workers-developed-asthma-from-wood-dust\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Scottish fire engine destined for West Bank may return after 15-month Israeli seizure",
      "link": "https://www.theguardian.com/uk-news/2025/oct/24/scottish-fire-engine-destined-for-west-bank-may-return-after-15-month-israeli-seizure",
      "pub_time_taipei": "2025-10-24T18:51:02+08:00",
      "summary": "<p>Dundee firefighters request return of donated appliance to avoid Nablus officials having to pay £16,000 Ashdod holding fees</p><p>A fully equipped fire engine donated by Dundee firefighters to their counterparts in the West Bank city of Nablus could be sent back to Scotland after being impounded for more than a year by Israeli authorities.</p><p>Firefighters in Dundee, which is twinned with Nablus, have regularly donated kit, equipment and medical supplies to the West Bank over the past 15 years, as well as bringing Palestinian firefighters to Scotland for training.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/24/scottish-fire-engine-destined-for-west-bank-may-return-after-15-month-israeli-seizure\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Plaid Cymru ousts Labour in Caerphilly byelection",
      "link": "https://www.theguardian.com/uk-news/2025/oct/24/plaid-cymru-wins-caerphilly-byelection-result",
      "pub_time_taipei": "2025-10-24T18:43:06+08:00",
      "summary": "<p>Rhun ap Iorwerth’s party seizes Senedd seat, beating Reform UK into second place</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/oct/24/caerphilly-byelection-result-live-reform-plaid-cymru-labour-wales-welsh-government-senedd-latest-voting-news#maincontent\">Caerphilly byelection result – live updates</a></p></li></ul><p>Plaid Cymru has hailed its win at the Caerphilly byelection as a historic moment for Wales, as the dramatic result left the leaders of Labour and Reform UK wounded.</p><p>Rhun ap Iorwerth’s party, which wants independence for Wales, seized the Senedd (Welsh parliament) constituency from Labour and resisted a fierce challenge from Reform UK.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/24/plaid-cymru-wins-caerphilly-byelection-result\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Letitia James expected to plead not guilty in mortgage fraud case",
      "link": "https://www.theguardian.com/us-news/2025/oct/24/letitia-james-mortgage-case-hearing",
      "pub_time_taipei": "2025-10-24T18:00:40+08:00",
      "summary": "<p>New York attorney general to appear in court in Virginia in case brought after Trump called for her prosecution</p><p>The New York state attorney general, <a href=\"https://www.theguardian.com/us-news/letitia-james\">Letitia James</a>, is expected to plead not guilty on Friday to charges of bank fraud and false statements brought after <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> publicly called for her to be prosecuted in a move widely seen as political retribution.</p><p>James is scheduled to made her first appearance in the case and be arraigned in federal district court in <a href=\"https://www.theguardian.com/us-news/virginia\">Virginia</a> before US magistrate judge Jamar Walker at 11am ET, according to court documents.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/24/letitia-james-mortgage-case-hearing\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "India’s $3.9 billion plan to help Modi’s mogul ally after U.S. charges",
      "link": "https://www.washingtonpost.com/world/2025/10/24/india-adani-group-modi-lic/",
      "pub_time_taipei": "2025-10-24T18:00:08+08:00",
      "summary": "Internal documents detail how Indian officials oversaw a plan to steer billions in investments to Gautam Adani’s businesses from the state life insurance agency."
    },
    {
      "source": "華盛頓郵報",
      "title": "On the rise in Germany, anti-immigrant populists reach out to Trump",
      "link": "https://www.washingtonpost.com/world/2025/10/24/trump-germany-honorary-citizen-afd/",
      "pub_time_taipei": "2025-10-24T17:40:32+08:00",
      "summary": "The populist, anti-immigrant Alternative for Germany Party, labeled “extremist” by German authorities, wants to build closer ties to President Trump."
    },
    {
      "source": "衛報",
      "title": "West Bank resistance dies amid fears of becoming Israel’s ‘next Gaza’",
      "link": "https://www.theguardian.com/world/2025/oct/24/west-bank-residents-fear-they-may-be-israels-next-target-after-gaza",
      "pub_time_taipei": "2025-10-24T17:18:48+08:00",
      "summary": "<p>Once known as the ‘martyrs’ capital’ of Palestine, Jenin is now patrolled by Israeli soldiers as weary residents seek quiet life</p><p>Shadi Dabaya’s body bears the scars of the Israeli occupation. The 54-year-old proudly stuck out his jaw to show the chunk of his cheek torn away by Israeli fire and traced the zigzag scar on his arm, the pink, raised flesh marking the bullet’s path through his body.</p><p>“I got these in the second intifada,” said Dabaya, beaming. He pulled up a video of himself a year earlier confronting an Israeli personnel carrier in Jenin camp wielding only a flip-flop.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/west-bank-residents-fear-they-may-be-israels-next-target-after-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: Tornadoes and Storm Benjamin lash northern France",
      "link": "https://www.theguardian.com/world/2025/oct/24/weather-tracker-tornadoes-and-storm-benjamin-lash-northern-france",
      "pub_time_taipei": "2025-10-24T17:10:25+08:00",
      "summary": "<p>More than 100,000 homes lose power in heavy rain and strong winds of storm, following fatal tornado near Paris</p><p>On Monday, a tornado swept through Val-d’Oise in northern France, causing widespread damage across several districts. The town of Ermont, about 12 miles (20km) north-east of Paris, was worst affected. Construction cranes toppled, buildings were damaged, and trees uprooted. One person was killed and four others were critically injured.</p><p>The same day, heavy showers hit parts of the UK, with reports of a possible tornado in Dereham, Norfolk. Several homes were damaged, though no injuries were reported.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/weather-tracker-tornadoes-and-storm-benjamin-lash-northern-france\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two dead and dozens arrested amid Cameroon election crackdown",
      "link": "https://www.theguardian.com/world/2025/oct/24/deaths-arrests-amid-cameroon-election-crackdown",
      "pub_time_taipei": "2025-10-24T17:00:54+08:00",
      "summary": "<p>Wave of unrest as polling suggests victory in presidential race for 92-year-old incumbent Paul Biya</p><p>At least two people have been killed and dozens of protesters arrested in Cameroon as the government cracks down on dissent before the announcement of final results in <a href=\"https://www.theguardian.com/world/2025/oct/12/cameroon-president-paul-biya-favourite-win-election\">this month’s presidential elections</a>.</p><p>Local media reports, citing preliminary data from the electoral commission (Elecam), suggest that victory for the 92-year-old incumbent, Paul Biya, is all but certain. That prospect has provoked anger and disbelief among his opponents, leading to unrest across several regions.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/deaths-arrests-amid-cameroon-election-crackdown\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Republicans who once opposed Trump’s military impulses now lower their guard",
      "link": "https://www.washingtonpost.com/national-security/2025/10/24/trump-military-strikes-republicans-war-powers/",
      "pub_time_taipei": "2025-10-24T17:00:00+08:00",
      "summary": "The president’s talk of further escalating his campaign in Latin America nevertheless poses uncomfortable questions for some in Congress."
    },
    {
      "source": "衛報",
      "title": "Ireland votes for next president as polls predict landslide for Catherine Connolly",
      "link": "https://www.theguardian.com/world/2025/oct/24/ireland-votes-for-next-president-as-polls-predict-landslide-for-catherine-connolly",
      "pub_time_taipei": "2025-10-24T16:53:18+08:00",
      "summary": "<p>Leftwing independent widely expected to succeed Michael D Higgins, but fears grow over low turnout and spoilt ballots </p><p>Irish voters are going to the polls to elect a new president, with final opinion polls predicting a landslide for Catherine Connolly, an outspoken leftwing independent who has captured the imagination of many younger people.</p><p>An opinion poll on Thursday gave Connolly 40% versus 25% for her opponent, Heather Humphreys, a former cabinet minister. When the figures were adjusted for those who are undecided or plan to spoil their vote, Connolly had 55% and Humphreys 35%.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/ireland-votes-for-next-president-as-polls-predict-landslide-for-catherine-connolly\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump says he’s canceling trade negotiations with Canada over anti-tariff ad",
      "link": "https://www.washingtonpost.com/world/2025/10/24/trump-cancel-canada-trade-negotiations-reagan/",
      "pub_time_taipei": "2025-10-24T16:25:06+08:00",
      "summary": "President Donald Trump claimed Canada “fraudulently used” an advertisement that featured audio from a 1987 radio address by President Ronald Reagan criticizing tariffs."
    },
    {
      "source": "華盛頓郵報",
      "title": "Lethal methanol poisoning puts Brazilians off their caipirinhas",
      "link": "https://www.washingtonpost.com/world/2025/10/24/brazil-methanol-poison-outbreak-caipirinha/",
      "pub_time_taipei": "2025-10-24T16:00:00+08:00",
      "summary": "Authorities have confirmed 10 deaths and are investigating seven more. Their theory is criminals have added substances to liquor to increase volume and profits."
    },
    {
      "source": "衛報",
      "title": "India trials Delhi cloud seeding to clean air in world’s most polluted city",
      "link": "https://www.theguardian.com/world/2025/oct/24/india-trial-delhi-cloud-seeding-clean-air-world-polluted-city-bharatiya-janata-party",
      "pub_time_taipei": "2025-10-24T15:25:13+08:00",
      "summary": "<p>Bharatiya Janata party launches first test flight as brown haze blankets city after Diwali – but experts decry ‘gimmick’</p><p>The Delhi regional government is trialling a cloud-seeding experiment to induce artificial rain, in an effort to clean the air in the world’s most polluted city.</p><p>The Bharatiya Janata party (BJP) has been proposing the use of cloud seeding as a way to bring Delhi’s air pollution under control since it was elected to lead the regional government this year.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/india-trial-delhi-cloud-seeding-clean-air-world-polluted-city-bharatiya-janata-party\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK’s biggest weapons firm BAE grounds ‘lifeline’ aircraft delivering food aid",
      "link": "https://www.theguardian.com/global-development/2025/oct/24/bae-ends-support-atp-aircraft-caa-airworthiness-aid-deliveries-south-sudan-somalia-drc",
      "pub_time_taipei": "2025-10-24T15:00:36+08:00",
      "summary": "<p>Exclusive: In the year they announced record profits, Britain’s arms maker has revoked licence to fly for planes taking supplies of food to starving people in South Sudan, Somalia and DRC</p><p>Britain’s biggest weapons manufacturer, BAE Systems, has quietly scrapped support for a fleet of aircraft providing “life-saving” humanitarian aid to some of the world’s poorest countries.</p><p>The decision further reduces the distribution of vital aid to countries facing serious humanitarian crises, including South Sudan, Somalia and the Democratic Republic of Congo (DRC).</p> <a href=\"https://www.theguardian.com/global-development/2025/oct/24/bae-ends-support-atp-aircraft-caa-airworthiness-aid-deliveries-south-sudan-somalia-drc\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Author of EPBC Act review ‘bitterly disappointed’ with Coalition’s stance – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/24/australia-news-live-police-search-colleen-walker-craig-bowraville-river-labor-environment-laws-murray-watt-coalition-greens-ntwnfb",
      "pub_time_taipei": "2025-10-24T14:37:54+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p></p><p>Australian scientists recently observed signs consistent with H5 avian influenza, or bird flu, in elephant seals during a voyage to Heard Island in the sub-Antarctic.</p><p>The <strong>Department of Agriculture, Fisheries and Forestry</strong> (DAFF) said officials had not made a confirmed detection of bird flu but said the findings “reinforces the need for Australia to remain focused on preparing for an outbreak”. Australia is the only continent that does not have the highly contagious strain of H5 bird flu.</p><p>Scientists observed unusual levels of mortality in elephant seals on Heard Island in recent days. There were no observations of unusual levels of mortality in other species present on the island, including penguins and other seabirds.</p><p>Seeing signs consistent with H5 bird flu in wildlife on Heard Island is not unexpected.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/24/australia-news-live-police-search-colleen-walker-craig-bowraville-river-labor-environment-laws-murray-watt-coalition-greens-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Secret report shows likely source of ‘poo balls’ that closed Sydney’s beaches last summer",
      "link": "https://www.theguardian.com/environment/2025/oct/24/source-of-fatbergs-closed-sydney-beaches-revealed-report",
      "pub_time_taipei": "2025-10-24T13:35:10+08:00",
      "summary": "<p><strong>Exclusive</strong>: Fat, oil and grease built up in sewerage pipes before being dislodged by heavy rain and ejected from Malabar outfall</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/24/australia-news-live-police-search-colleen-walker-craig-bowraville-river-labor-environment-laws-murray-watt-coalition-greens-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A secret report reveals the likely source of the fatberg balls that closed a raft of Sydney beaches last summer – with most coming from the deepwater ocean outfall at Malabar.</p><p>The partly redacted scientific report, obtained by Guardian Australia under freedom of information laws, points to a combination of heavy rains and a buildup of fats, oils and greases as the <a href=\"https://www.theguardian.com/australia-news/2025/jan/15/ball-shaped-debris-washes-up-at-sydneys-bondi-coogee-maroubra-and-cronulla-beaches\">likely cause of the “poo balls”</a> being discharged from outfalls at Malabar, Bondi and North Head.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/24/source-of-fatbergs-closed-sydney-beaches-revealed-report\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Kill crew’ allegedly sent photo of kidnapped Sydney woman before murdering her, police say",
      "link": "https://www.theguardian.com/australia-news/2025/oct/24/kill-crew-allegedly-sent-photo-sydney-woman-thi-kim-tran-before-murder-ntwnfb",
      "pub_time_taipei": "2025-10-24T12:36:27+08:00",
      "summary": "<p>Police have charged three more men over the death of 45-year-old Thi Kim Tran</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/24/australia-news-live-police-search-colleen-walker-craig-bowraville-river-labor-environment-laws-murray-watt-coalition-greens-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Three men have been charged with murder after allegedly taking part in the “kill crew” that murdered a 45-year-old woman from suburban Sydney.</p><p>Thi Kim Tran’s body was found bound and gagged in the back of a burnt-out SUV in the city’s south-west on 17 April.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/24/kill-crew-allegedly-sent-photo-sydney-woman-thi-kim-tran-before-murder-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump merges war on drugs with war on terror in Venezuela showdown",
      "link": "https://www.washingtonpost.com/world/2025/10/24/trump-venezuela-maduro-cartels-war-terror/",
      "pub_time_taipei": "2025-10-24T12:00:00+08:00",
      "summary": "The Trump administration’s invocation of al-Qaeda when discussing its South American operations suggests an intent to shrug off standard processes of accountability."
    },
    {
      "source": "衛報",
      "title": "Trump says all Canada trade talks ‘terminated’ over ad criticising tariffs",
      "link": "https://www.theguardian.com/world/2025/oct/24/trump-says-all-canada-trade-talks-terminated-over-ad-criticising-tariffs",
      "pub_time_taipei": "2025-10-24T11:34:11+08:00",
      "summary": "<p>US president accuses Canada of ‘egregious behaviour’ after release of ad featuring Ronald Reagan criticising tariffs</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news\">US politics – live updates</a></p></li></ul><p>Donald Trump has announced an immediate end to “all trade negotiations” with Canada over a <a href=\"https://x.com/fordnation/status/1978779503213052337\">television advertisement opposing US tariffs</a> that quoted the former US president Ronald Reagan.</p><p>The ad, which was paid for by the government of the Canadian province of Ontario, uses excerpts of a 1987 speech where Reagan says “trade barriers hurt every American worker”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/trump-says-all-canada-trade-talks-terminated-over-ad-criticising-tariffs\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Women launch class action against ADF alleging widespread sexual violence, misogyny and harassment",
      "link": "https://www.theguardian.com/australia-news/2025/oct/24/women-launch-class-action-adf-ntwnfb",
      "pub_time_taipei": "2025-10-24T11:12:57+08:00",
      "summary": "<p>Female members of the military shouldn’t have to fight off their colleagues on a daily basis, lawyer says</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/24/australia-news-live-police-search-colleen-walker-craig-bowraville-river-labor-environment-laws-murray-watt-coalition-greens-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Women who allegedly suffered widespread and systemic sexual abuse, harassment, discrimination and victimisation while serving in the Australian defence force are taking part in a class action against the commonwealth.</p><p>There are four applicants in the class action, whose names are withheld for legal reasons, but any woman subjected to sexual violence, sexual harassment or discrimination while working in the ADF between 12 November 2003 and 25 May 2025 is eligible to join them.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/24/women-launch-class-action-adf-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Sacred sanctuary’: North Korea starts building memorial to soldiers killed in Ukraine war",
      "link": "https://www.theguardian.com/world/2025/oct/24/north-korea-building-memorial-to-soldiers-killed-ukraine-war",
      "pub_time_taipei": "2025-10-24T09:09:22+08:00",
      "summary": "<p>At least 600 North Korean soldiers have been killed and thousands more wounded fighting in Russia’s war against Ukraine</p><p>North Korea has begun constructing a memorial for its soldiers killed fighting in Russia’s war on Ukraine, state media reported, as leader <a href=\"https://www.theguardian.com/world/kim-jong-un\">Kim Jong-un</a> hailed a “historic peak” in ties with Moscow.</p><p>The so-called Memorial Museum of Combat Feats will be built in the capital, Pyongyang, where Kim and Russia’s ambassador to North Korea attended a groundbreaking ceremony, according to a reports by the Korean Central News Agency on Thursday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/24/north-korea-building-memorial-to-soldiers-killed-ukraine-war\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "EU leaders fail to agree to use frozen Russian assets to defend Ukraine",
      "link": "https://www.theguardian.com/world/2025/oct/23/zelenskyy-presses-for-eu-decision-on-using-russia-assets-to-defend-ukraine",
      "pub_time_taipei": "2025-10-24T06:44:39+08:00",
      "summary": "<p>Belgium derails proposal to use billions located in Brussels to fund €140bn loan to Ukraine for its war effort</p><p>EU leaders have swerved a decision on using Russia’s frozen assets to fund Ukraine’s defence, despite a plea from Volodymyr Zelenskyy to take swift action to make Moscow pay for its war.</p><p>Hopes of agreeing a new way of funding Ukraine’s war effort were dashed after opposition from Belgium, which hosts most of the Russian central bank funds immobilised in the EU at the Brussels-based institution Euroclear.</p> <a href=\"https://www.theguardian.com/world/2025/oct/23/zelenskyy-presses-for-eu-decision-on-using-russia-assets-to-defend-ukraine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Vance says Knesset votes on annexing West Bank are an ‘insult’ as Netanyahu halts progress",
      "link": "https://www.theguardian.com/world/2025/oct/23/marco-rubio-warning-israel-west-bank-donald-trump",
      "pub_time_taipei": "2025-10-24T06:10:11+08:00",
      "summary": "<p>US vice-president suggests votes were ‘stupid political stunt’ as Israeli PM orders a stop to any further work on bills </p><p>The Israeli prime minister, Benjamin Netanyahu, has ordered a halt to the advancement of parliamentary bills linked to the annexation of the West Bank after the US vice-president, JD Vance, described a vote on two bills in the Knesset as an “insult”.</p><p>The bills applying Israeli law to the occupied West Bank, which would be tantamount to the annexation of land Palestinians want for a state, won preliminary approval from Israel’s parliament on Wednesday, barely a week after Donald Trump pushed through a deal aimed at ending a two-year Israeli offensive in Gaza.</p> <a href=\"https://www.theguardian.com/world/2025/oct/23/marco-rubio-warning-israel-west-bank-donald-trump\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Gold and silver coins stolen from French museum hours after Louvre heist",
      "link": "https://www.washingtonpost.com/world/2025/10/23/france-musem-heist-coins-diderot-louvre/",
      "pub_time_taipei": "2025-10-24T05:37:53+08:00",
      "summary": "The theft of French crown jewels overshadowed the robbery of some $100,000 worth of historical coins from a museum dedicated to philosopher Denis Diderot."
    },
    {
      "source": "華盛頓郵報",
      "title": "Putin says U.S. sanctions are ‘serious’ but won’t make Russia stop war",
      "link": "https://www.washingtonpost.com/world/2025/10/23/russia-trump-sanctions-rosneft-europe/",
      "pub_time_taipei": "2025-10-24T03:25:03+08:00",
      "summary": "President Donald Trump’s sanctions against two of Russia’s largest oil companies come as the European Union passes its 19th package targeting the energy sector."
    },
    {
      "source": "衛報",
      "title": "Palestine rights group seeks prosecution of UK citizens who fought for Israel",
      "link": "https://www.theguardian.com/world/2025/oct/23/palestine-rights-group-seeks-prosecution-of-uk-citizens-who-fought-for-israel",
      "pub_time_taipei": "2025-10-24T02:06:36+08:00",
      "summary": "<p>Highly unusual court application alleges more than 10 individuals breached foreign enlistment laws</p><p>A human rights group has launched an attempt to mount a private prosecution alleging British citizens unlawfully went to fight for Israel.</p><p>An application to a magistrates court for a summons against a named individual was lodged on Monday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/23/palestine-rights-group-seeks-prosecution-of-uk-citizens-who-fought-for-israel\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Colombia urges US to halt strikes on alleged drug-smuggling boats: ‘It is murder’",
      "link": "https://www.theguardian.com/world/2025/oct/23/colombia-us-boat-strikes",
      "pub_time_taipei": "2025-10-24T01:30:09+08:00",
      "summary": "<p>Plea comes after Pete Hegseth announced two new strikes that left at least five people dead</p><p><a href=\"https://www.theguardian.com/world/colombia\">Colombia</a> has condemned US airstrikes on vessels allegedly involved in drug-smuggling off the coast of South America, urging Washington to immediately halt further attacks in the Pacific and Caribbean.</p><p>The plea came after <a href=\"https://www.theguardian.com/us-news/2025/oct/22/military-boat-strike-pacific-pete-hegseth\">Pete Hegseth, the US secretary of defense, announced two new strikes on Wednesday</a>, which were the first to hit the Pacific and left at least five people dead. According to US figures, at least nine attacks have now been carried out since early September, killing 37 people. A broad range of experts have said the campaign is illegal.</p> <a href=\"https://www.theguardian.com/world/2025/oct/23/colombia-us-boat-strikes\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Pressure mounts for Trump to secure release of U.S. teen held by Israel",
      "link": "https://www.washingtonpost.com/world/2025/10/23/israel-mohammed-ibrahim-florida-teen-west-bank/",
      "pub_time_taipei": "2025-10-24T01:26:58+08:00",
      "summary": "As Rubio visits Israel, family members and lawmakers push Trump to demand the return of 16-year-old Mohammed Ibrahim of Florida, detained eight months without trial."
    },
    {
      "source": "衛報",
      "title": "Woman tells spycops inquiry of ‘deep mistrust’ of police after relationship with undercover officer",
      "link": "https://www.theguardian.com/uk-news/2025/oct/23/woman-devastated-when-undercover-officer-ended-relationship-spycops-inquiry-hears",
      "pub_time_taipei": "2025-10-24T00:29:09+08:00",
      "summary": "<p>Ellie, who now lives in Australia, tells policing inquiry she was deceived by officer infiltrating animal rights groups</p><p>A woman has told a public inquiry in London that she was left devastated and deeply mistrustful of police after an undercover officer deceived her into an intimate relationship at a young age.</p><p>The woman, known only as Ellie, who now lives in Australia and is a dual national, told the undercover policing inquiry on Thursday that she had a year-long relationship with James Thomson while he concealed his real identity from her.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/23/woman-devastated-when-undercover-officer-ended-relationship-spycops-inquiry-hears\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brazilian president will seek fourth term at age 80: ‘I’ve got as much energy as when I was 30’",
      "link": "https://www.theguardian.com/world/2025/oct/23/brazil-lula-president-fourth-term",
      "pub_time_taipei": "2025-10-23T23:24:05+08:00",
      "summary": "<p>Luiz Inácio Lula da Silva, who first ran for elected office in 1982, announced he will run again in next year’s election</p><p>The Brazilian president, <a href=\"https://www.theguardian.com/world/luiz-inacio-lula-da-silva\">Luiz Inácio Lula da Silva</a>, has announced he will seek a historic fourth term in next year’s presidential election, potentially extending one of the most remarkable and enduring political careers in modern Latin American history.</p><p>The former metalworker, who returned to the presidency in 2023 after defeating the far-right incumbent, <a href=\"https://www.theguardian.com/world/jair-bolsonaro\">Jair Bolsonaro</a>, confirmed his decision during a speech in <a href=\"https://www.theguardian.com/world/indonesia\">Indonesia</a>’s capital, Jakarta.</p> <a href=\"https://www.theguardian.com/world/2025/oct/23/brazil-lula-president-fourth-term\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "In ‘historic moment,’ King Charles prays with Pope Leo at Sistine Chapel",
      "link": "https://www.washingtonpost.com/world/2025/10/23/king-charles-pope-leo-prayer/",
      "pub_time_taipei": "2025-10-23T22:54:46+08:00",
      "summary": "The royal visit to the Vatican marks the first time in nearly 500 years that a British monarch, head of the Anglican church, has prayed with a Roman Catholic pope."
    }
  ]
}