{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-07T20:40:06.092713+08:00",
  "window_end_taipei": "2025-09-08T20:40:06.092713+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Six people killed in Jerusalem shooting; Israel threatens Gaza City with ‘powerful hurricane’ – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
      "pub_time_taipei": "2025-09-08T20:29:17+08:00",
      "summary": "<p>Israel’s defence minister, Israel Katz, has warned that a ‘powerful hurricane’ will ‘strike the skies of Gaza City’ later today </p><p><em>Sam Jones is Madrid correspondent for the Guardian</em></p><p>Spain’s prime minister, <strong>Pedro Sánchez</strong>, has stepped up <a href=\"https://www.theguardian.com/world/2024/apr/05/spain-ireland-eu-critics-israel-warfare-gaza\">his scathing criticism of Israel’s actions in Gaza</a>, accusing Benjamin Netanyahu’s government of “exterminating a defenceless people” by bombing hospitals and “killing innocent boys and girls with hunger”.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least 16 people killed during protests against Nepal’s social media ban",
      "link": "https://www.theguardian.com/world/2025/sep/08/nepal-bans-26-social-media-sites-including-x-whatsapp-and-youtube",
      "pub_time_taipei": "2025-09-08T20:28:00+08:00",
      "summary": "<p>Free speech demonstrations came after government said Facebook and others failed to follow new regulations</p><p>At least 16 people have been killed during protests in Nepal over a government ban on dozens of social media platforms including Facebook, Instagram, WhatsApp and X.</p><p>The government, led by the prime minister, <a href=\"https://www.theguardian.com/profile/kp-sharma-oli\">KP Sharma Oli</a>, has faced mounting criticism after imposing a ban on 26 prominent social media platforms and messaging apps that it says have failed to comply with new regulations.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/nepal-bans-26-social-media-sites-including-x-whatsapp-and-youtube\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Doorbell prankster that tormented residents of German apartments turns out to be a slug",
      "link": "https://www.theguardian.com/world/2025/sep/08/doorbell-prankster-that-tormented-residents-of-german-apartments-turns-out-to-be-a-slug",
      "pub_time_taipei": "2025-09-08T20:19:51+08:00",
      "summary": "<p>People suspected teenagers playing ding dong ditch and called police, who found animal crawling on the door panel</p><p>Inhabitants of an apartment block in Bavaria, southern Germany, who called police to investigate the relentless buzzing of their doorbells late at night were surprised to find the culprit was not a teenage prankster as they had suspected, but a slug.</p><p>The slug had been sliding up and down the bell plate, creating havoc in the building and tearing angry residents out of their beds long after midnight when they could not sleep for the noise.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/doorbell-prankster-that-tormented-residents-of-german-apartments-turns-out-to-be-a-slug\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New home secretary Shabana Mahmood says she will not run for deputy leader after Labour accused of ‘stitch-up’ over contest – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live",
      "pub_time_taipei": "2025-09-08T20:17:01+08:00",
      "summary": "<p>New home secretary says securing borders is her ‘top priority’ and rules out running as deputy Labour leader</p><p><strong>Paul Nowak</strong>, the TUC general secretary, used his speech to conference this morning to say that the TUC expected the government to deliver its workers’ rights bill “in full”. He said employment rights were “overwhelmingly popular with voters across the political spectrum”.</p><p>And he condemned Reform UK for its stance on employment rights. After saying that Nigel Farage claimed to represent working class people, he went on:</p><p>Here’s the truth – there is a world of difference between what Nigel says and what Nigel does.</p><p>Every single Reform MP, including Mr Farage, voted against outlawing fire and rehire, against banning zero hours contracts and against day one rights for millions of workers.</p><p>Ask yourself this fundamental question. Do you believe in your gut that that Nigel Farage really cares about the people of Clacton when he’s off collecting his speaker’s fees in the United States?</p><p>Do you believe that Richard Tice really worries about the people of Skegness while he’s living it up at home in Dubai, or are they just rightwing conmen lining their own pockets?</p><p>I just have to say this. No amount of TikToks, or ozempic, or expensive haircuts, will ever hide the eager inner ugliness of Robert Jenrick.</p><p>The man who ordered murals painted over in a reception centre for children seeking asylum is indeed a xenophobe, an opportunistic xenophobe hoping to create a political climate that ends up with far right folks laying siege to hotels and black and Asian people being threatened and harassed on our streets.</p><p>If we look at the powerful geopolitical push factors, they’re things like regime change. We think Afghanistan, war, civil conflict. And when we look at people crossing in small boats, where do they come from? Well, the top nationalities: Afghan, Eritrea, Iranian, Syrian, Sudanese – just those five nationalities account for almost two thirds of all small boat arrivals, and these individuals are from some of the most chaotic parts of the world.</p><p>But there are also some pull factors, and the question is, why not claim asylum in France, why come to the UK? A number of reasons recur there when we speak with asylum seekers. It’s the presence of family members, the English language.</p><p>In those circumstances, typically, flagged upon the system, the UK government would be able to issue a speedy refuse refusal and try and effect removal.</p><p>As it is, people arrive, we don’t have that record, so we don’t know who they are.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump tells foreign firms to ‘respect’ immigration laws after Hyundai raid – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
      "pub_time_taipei": "2025-09-08T20:10:18+08:00",
      "summary": "<p>President says he welcomes investments by overseas companies but adds they should ‘hire and train American workers’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul\">300 South Koreans detained at Hyundai plant in US ‘to be released’</a></p></li></ul><p>We can expect to hear from Donald Trump at about <strong>10:10am ET</strong> today. He’ll speak at the Museum of the Bible in DC, and deliver remarks to the <strong>White House religious liberty commission</strong> – which the president created via executive order in May.</p><p><strong>US states that protect unions’ collective bargaining rights have experienced an increase in new union members, while states with anti-union “right to work” laws are responsible for declines in union members, a new <a href=\"https://illinoisupdate.com/wp-content/uploads/2025/08/state-of-the-unions-2025-1.pdf\">report </a>reveals.</strong></p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Court staff cover up Banksy image of judge beating a protester",
      "link": "https://www.theguardian.com/artanddesign/2025/sep/08/court-staff-cover-up-banksy-image-of-judge-beating-a-protester",
      "pub_time_taipei": "2025-09-08T20:07:04+08:00",
      "summary": "<p>Artist’s latest work at Royal Courts of Justice in London is thought to refer to pro-Palestine demonstrations</p><p>A painting by Banksy of a judge using a gavel to beat a helpless protester appeared on the walls of the Royal Courts of Justice before quickly being covered up by guards.</p><p>Banksy <a href=\"https://www.instagram.com/p/DKPUg56MqyT/?img_index=1\">confirmed the artwork </a>was his by posting a picture of it on Instagram on Monday morning.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/sep/08/court-staff-cover-up-banksy-image-of-judge-beating-a-protester\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Europe live: Macron faces new political crisis with France prime minister François Bayrou threatened by confidence vote",
      "link": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
      "pub_time_taipei": "2025-09-08T20:06:22+08:00",
      "summary": "<p>Bayrou would be the third prime minister to lose the post in a year, leaving the president in a difficult political position and an impossible vacancy to fill</p><p><em>in Paris</em></p><p>What <strong>adds even more to the unsettled situation in France</strong> is there is a protest expected to take place next week known as <strong>Block Everything</strong>, which could mean roads and businesses barricaded amid street demonstrations, which will be followed by union-led hospital and rail strikes in coming weeks.</p><p><em>There’s a strong anger at not being listened to, and a feeling that politics is going nowhere.</em></p><p><em>“There is something in the general atmosphere, which is not just French, but almost global: a kind of cold anger because people see an ultra-free-market capitalist system crushing people and making their life all about survival. </em></p><p><em><strong>There’s a sense of injustice and that something is wrong with the system.”</strong></em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "When maps go wrong: from the Great North Run to a phantom Aldi",
      "link": "https://www.theguardian.com/lifeandstyle/2025/sep/08/when-maps-go-wrong-from-the-great-north-run-to-a-phantom-aldi",
      "pub_time_taipei": "2025-09-08T20:04:33+08:00",
      "summary": "<p>Erroneously putting map of Sunderland on medals for Tyneside half marathon is latest in long line of cartological mishaps</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/sep/08/great-north-run-apologises-newcastle-map-medals-sunderland\">Great North Run ‘Newcastle map’ medals actually show Sunderland</a></p></li></ul><p>As the organisers of the Great North Run <a href=\"https://www.theguardian.com/uk-news/2025/sep/08/great-north-run-apologises-newcastle-map-medals-sunderland\">apologise for using a map of Sunderland, rather than Newcastle, on this year’s finisher medals</a>, it is just one in a long line of map mistakes.</p><p>Other blunders have included phantom supermarkets, dangerously misleading mountaineering routes, and geopolitical blunders.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/sep/08/when-maps-go-wrong-from-the-great-north-run-to-a-phantom-aldi\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Actors and directors pledge not to work with Israeli film groups ‘implicated in genocide’",
      "link": "https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians",
      "pub_time_taipei": "2025-09-08T20:01:20+08:00",
      "summary": "<p>Exclusive: Hundreds of film workers sign pledge they say draws inspiration from South African boycott over apartheid</p><p>Hundreds of actors, directors and other film industry professionals have signed a new pledge vowing not to work with Israeli film institutions they say are “implicated in genocide and apartheid against the Palestinian people”.</p><p>“As film-makers, actors, film industry workers, and institutions, we recognise the power of cinema to shape perceptions” <a href=\"https://filmworkersforpalestine.org/#endingcomplicity\">the pledge</a> reads. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”</p> <a href=\"https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "As Bristol and Cardiff airports tussle, is it time for the ‘far-fetched’ Severnside?",
      "link": "https://www.theguardian.com/world/2025/sep/08/as-bristol-and-cardiff-airports-tussle-is-it-time-for-the-far-fetched-severnside",
      "pub_time_taipei": "2025-09-08T20:00:47+08:00",
      "summary": "<p>As the cities clash over their hubs, the case for one facility on an artificial island first proposed in 2003 gets stronger</p><p>It was a bold, ambitious and controversial idea: close Cardiff and Bristol airports and build an international facility on an artificial island. So aspirational, in fact, that the Severnside plan was roundly rejected as far-fetched when it was unveiled more than 20 years ago.</p><p>But now the proposal does not seem nearly as bizarre as a result of the climate crisis and a long-running legal battle between the two airports.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/as-bristol-and-cardiff-airports-tussle-is-it-time-for-the-far-fetched-severnside\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "EU states still fighting over crucial targets in run-up to Cop30, leaked draft shows",
      "link": "https://www.theguardian.com/environment/2025/sep/08/eu-states-still-fighting-over-crucial-targets-in-run-up-to-cop30-leaked-draft-shows",
      "pub_time_taipei": "2025-09-08T20:00:44+08:00",
      "summary": "<p>Exclusive: Experts decry lack of nationally determined contributions in negotiating document with weeks to go before UN-set deadline</p><p>EU member states are still wrangling over crucial commitments on the climate crisis with no sign of agreement, according to a leaked draft text seen by the Guardian.</p><p>With just weeks to go<a href=\"https://www.theguardian.com/environment/2025/aug/19/brazil-issues-last-ditch-plea-for-countries-to-submit-climate-plans-ahead-of-cop30\"> before a UN-set deadline</a>, the European Commission and key member states remain at loggerheads over targets on greenhouse gas emissions, with the prospect of a strong outcome looking increasingly imperilled.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/08/eu-states-still-fighting-over-crucial-targets-in-run-up-to-cop30-leaked-draft-shows\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Spanish PM Pedro Sánchez says Israel is ‘exterminating a defenceless people’",
      "link": "https://www.theguardian.com/world/2025/sep/08/spanish-pm-pedro-sanchez-israel-exterminating-defenceless-people-gaza",
      "pub_time_taipei": "2025-09-08T19:47:45+08:00",
      "summary": "<p>Spain announces raft of measures designed to increase pressure on Benjamin Netanyahu to end Gaza war</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news\">Middle East crisis – live updates</a></p></li></ul><p>Spain’s prime minister, Pedro Sánchez, has stepped up <a href=\"https://www.theguardian.com/world/2024/apr/05/spain-ireland-eu-critics-israel-warfare-gaza\">his scathing criticism of Israel’s actions in Gaza</a>, accusing Benjamin Netanyahu’s government of “exterminating a defenceless people” by bombing hospitals and “killing innocent boys and girls with hunger”.</p><p>Speaking on Monday morning to announce a raft of measures designed to increase the pressure on Netanyahu to stop the military campaign, Sánchez said that while the Spanish government would always support Israel’s right to exist and to defend itself, it felt compelled to try to “stop a massacre”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/spanish-pm-pedro-sanchez-israel-exterminating-defenceless-people-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "French anaesthetist goes on trial accused of poisonings that killed 12 patients",
      "link": "https://www.theguardian.com/world/2025/sep/08/france-anaesthetist-frederic-pechier-trial-accused-of-intentionally-poisoning-patients",
      "pub_time_taipei": "2025-09-08T19:41:21+08:00",
      "summary": "<p>Frédéric Péchier, 53, allegedly targeted 30 children and adults at clinic, some of whom could not be resuscitated</p><p>A French anaesthetist accused of intentionally poisoning 30 child and adult patients between the ages of four and 89, 12 of whom died, has gone on trial in the city where he worked.</p><p>Frédéric Péchier, 53, worked at two clinics in the eastern city of Besançon when patients went into cardiac arrest in suspicious circumstances between 2008 and 2017. Twelve could not be resuscitated.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/france-anaesthetist-frederic-pechier-trial-accused-of-intentionally-poisoning-patients\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Outrage, confusion in South Korea after Georgia immigration raid",
      "link": "https://www.washingtonpost.com/world/2025/09/08/south-korea-us-immigration-raid-tensions/",
      "pub_time_taipei": "2025-09-08T19:38:18+08:00",
      "summary": "South Korea pledged to invest $350 billion in the U.S. in a trade deal. Now the country is reeling at actions many see as counter to the spirit of the alliance."
    },
    {
      "source": "衛報",
      "title": "London tube strike shuts down services, causing congestion on roads",
      "link": "https://www.theguardian.com/uk-news/2025/sep/08/london-tube-strike-tfl-website-rmt",
      "pub_time_taipei": "2025-09-08T19:20:42+08:00",
      "summary": "<p>Commuters in capital forced to find alternative routes to work on first of four days of strike action by RMT union</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/08/chinese-export-growth-slowest-six-months-shipments-us-fall-amid-tariff-tensions-oil-prices-climb-business-live\">Business live – latest updates</a></p></li></ul><p>Strikes by the RMT union have closed the London Underground, with people crowding on to other transport and roads congested at the start of four days of commuter misery.</p><p>Transport for London’s website was out of action for much of the morning as commuters in the capital looked for alternative routes to work.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/08/london-tube-strike-tfl-website-rmt\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Palestinian gunmen kill six people at Jerusalem bus stop",
      "link": "https://www.theguardian.com/world/2025/sep/08/gunmen-jerusalem-shooting-bus-stop-ramot",
      "pub_time_taipei": "2025-09-08T19:19:26+08:00",
      "summary": "<p>At least 12 others injured in attack at Ramot intersection during morning rush hour</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news\">Middle East crisis – live updates</a></p></li></ul><p>Palestinian attackers opened fire at a crowded bus stop in the northern outskirts of Jerusalem, killing six people and injuring 12 others, Israeli officials have said.</p><p>Police said two gunmen targeted people waiting for a bus at a busy intersection during the morning rush hour on Monday before being shot dead by an off-duty soldier and a civilian who were at the scene.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/gunmen-jerusalem-shooting-bus-stop-ramot\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US union membership declining in ‘right-to-work’ states, report reveals",
      "link": "https://www.theguardian.com/us-news/2025/sep/08/us-union-membership-report",
      "pub_time_taipei": "2025-09-08T19:00:42+08:00",
      "summary": "<p>Growing divide across US as membership increasing – and wages higher – in states that protect workers’ rights</p><p>Add another growing split to the increasingly divided United States: union membership.</p><p>US states that protect unions’ collective bargaining rights have experienced an increase in new union members, while states with anti-union “right to work” laws are responsible for declines in union members, a new <a href=\"https://illinoisupdate.com/wp-content/uploads/2025/08/state-of-the-unions-2025-1.pdf\">report </a>reveals.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/08/us-union-membership-report\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hopes rise for green economy boom at Africa Climate Summit",
      "link": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
      "pub_time_taipei": "2025-09-08T18:38:22+08:00",
      "summary": "<p>Renewables are thriving, with Africa breaking solar energy records – but action is needed to plug financing gap</p><p>The first signs of a takeoff of Africa’s green economy are raising hopes that a transformation of the continent’s fortunes may be under way, driven by solar power and an increase in low-carbon investment.</p><p>African leaders are meeting this week in Addis Ababa, Ethiopia, for the <a href=\"https://africaclimatesummit2.et/\">Africa Climate Summit</a>, a precursor to the <a href=\"https://www.theguardian.com/environment/2025/aug/19/brazil-issues-last-ditch-plea-for-countries-to-submit-climate-plans-ahead-of-cop30\">global UN Cop30 in November</a>. They will call for an increase in support from rich countries for Africa’s green resurgence, without which they will warn it could be fragile and spread unevenly.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: 300 South Koreans detained at Hyundai plant in US to be released, says Seoul",
      "link": "https://www.theguardian.com/us-news/2025/sep/08/first-thing-300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul",
      "pub_time_taipei": "2025-09-08T18:37:36+08:00",
      "summary": "<p>The arrest of workers has strained relations between Seoul and Washington. Plus, the Myanmar scam centers thought to hold 100,000 trafficked people</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\">Don’t already get First Thing in your inbox? Sign up here</a></p></li></ul><p>Good morning.</p><p>Approximately 300 <a href=\"https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul\">South Korean workers detained in an immigration raid</a> in Georgia will be released and flown home, Seoul has said.</p><p><strong>What did Donald Trump say about the raid?</strong> “I would say that they were illegal aliens and Ice was just doing its job,” he said, potentially fanning the flames.</p><p><strong>How much will tariff costs US households?</strong> Economists expect around $2,400 annually.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/08/first-thing-300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The US supreme court may address Trump’s tariffs. Does he want to win?",
      "link": "https://www.theguardian.com/us-news/2025/sep/08/trump-tariffs-supreme-court",
      "pub_time_taipei": "2025-09-08T18:00:43+08:00",
      "summary": "<p>The president has claimed any decision against him would ‘destroy’ the ‘financial fabric of our country’</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has upended the global economy, imposing steep tariffs on US allies and rivals, dismissing fears of higher prices, and promising his strategy will yield a new “golden age”. All the president needs to do now is prove he’s allowed to do it.</p><p>Legal experts say he may face an uphill battle.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/08/trump-tariffs-supreme-court\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Do you care about our kids?’ Minnesota parents demand gun ban after deadly shooting",
      "link": "https://www.theguardian.com/us-news/2025/sep/08/minnesota-school-shooting-gun-safety",
      "pub_time_taipei": "2025-09-08T18:00:42+08:00",
      "summary": "<p>Families say they will ‘settle for nothing less’ than instant ban on semi-automatic rifles and high-capacity magazines</p><p>Some parents whose children were wounded in the recent <a href=\"https://www.theguardian.com/us-news/2025/aug/27/minneapolis-active-shooter-school\">deadly school shooting</a> in Minnesota are demanding greater gun safety measures as the divided legislature gets ready to debate the state’s response this week.</p><p>Mothers and fathers have gone public to highlight the acute suffering being endured by their children in the aftermath of last month’s <a href=\"https://www.theguardian.com/us-news/minneapolis-school-shooting\">attack by a shooter</a> that killed two children and injured 17 others while they were at prayer at the Annunciation Catholic school, <a href=\"https://www.theguardian.com/us-news/2025/aug/27/minneapolis-annunciation-catholic-school-shooting\">traumatizing the community</a> in south Minneapolis.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/08/minnesota-school-shooting-gun-safety\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Simón Bolívar, dead nearly 200 years, rallies Venezuelans against U.S.",
      "link": "https://www.washingtonpost.com/world/2025/09/08/venezuela-ai-bolivar-maduro/",
      "pub_time_taipei": "2025-09-08T18:00:00+08:00",
      "summary": "As tensions with the United States grow, Nicolas Maduro is reviving Venezuela’s heroes with AI to encourage citizens to join militias."
    },
    {
      "source": "華盛頓郵報",
      "title": "At least 5 killed, 11 injured in shooting attack on bus in Jerusalem",
      "link": "https://www.washingtonpost.com/world/2025/09/08/jerusalem-bus-shooting-israel/",
      "pub_time_taipei": "2025-09-08T17:41:11+08:00",
      "summary": "The two attackers were killed at the scene, police said, after a security officer and a civilian returned fire."
    },
    {
      "source": "衛報",
      "title": "Minns backtracks on right to hunt over fears it could lead to US-style gun future",
      "link": "https://www.theguardian.com/australia-news/2025/sep/08/chris-minns-backtracks-nsw-right-to-hunt-shooters-and-fishers-bill",
      "pub_time_taipei": "2025-09-08T17:16:41+08:00",
      "summary": "<p>NSW premier initially supported the controversial bill which would have allowed recreational hunters to shoot feral animals on public lands</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The New South Wales premier has backtracked on a central element of a Shooters and Fishers’ <a href=\"https://www.theguardian.com/australia-news/2025/jun/14/minns-government-backs-bill-promoting-hunting-in-nsws-state-forests-and-crown-land\">private member’s bill</a> – enshrining a right to hunt – saying it could undermine gun control and send the state down the US path of a right to bear arms.</p><p>“We won’t be supporting any provision in [the bill] that will water down gun laws in NSW. They’ve been important pieces of keeping the community safe for a long period of time,” Chris Minns said.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/08/chris-minns-backtracks-nsw-right-to-hunt-shooters-and-fishers-bill\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hawke urges Nampijinpa Price to say sorry for ‘real damage’ her migration comments caused Indian Australians",
      "link": "https://www.theguardian.com/australia-news/2025/sep/08/alex-hawke-calls-for-jacinta-nampijinpa-price-apology-to-indian-community",
      "pub_time_taipei": "2025-09-08T17:13:18+08:00",
      "summary": "<p>Sussan Ley under pressure to repair ties with diaspora group after NT senator claimed without evidence Labor was bringing in migrants to win votes</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Liberal MP Alex Hawke has called on Jacinta Nampijinpa Price to apologise for the “real damage” her comments have caused the Indian community as the fallout continues internally and externally for the party.</p><p>The opposition has scrambled to repair ties with Indian Australians after Price’s remarks. On Monday, the Liberal leader, Sussan Ley, convened a roundtable with community leaders the day before she toured Sydney’s Harris Park – known as “Little India”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/08/alex-hawke-calls-for-jacinta-nampijinpa-price-apology-to-indian-community\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chinese state media accuses Wong and Marles of ‘stirring up tensions’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
      "pub_time_taipei": "2025-09-08T17:04:11+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/08/alex-hawke-calls-for-jacinta-nampijinpa-price-apology-to-indian-community\">Hawke urges Nampijinpa Price to say sorry for ‘real damage’ her migration comments caused Indian Australians</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Victoria’s supreme court will hand down the triple-murderer <strong>Erin Patterson’s</strong> sentence shortly. The state’s supreme court will allow a television camera inside the courtroom to broadcast the sentencing hearing – with a 10 second delay – for the first time.</p><p>Patterson, 50, faces the prospect of spending the rest of her life in prison. Justice <strong>Christopher Beale</strong> will deliver her sentence from 9.30am in a hearing expected to last about 30 minutes.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russia bombs Ukraine almost every night. This is what it sounds like.",
      "link": "https://www.washingtonpost.com/world/interactive/2025/ukraine-bombing-sounds-war-sirens-russia/",
      "pub_time_taipei": "2025-09-08T17:00:52+08:00",
      "summary": "This summer the Kremlin’s air campaign killed 518 civilians with a record 11,739 drones and 433 missiles, an analysis by The Washington Post found."
    },
    {
      "source": "衛報",
      "title": "Families ‘shattered’ and community ‘terrified’ as police hunt alleged Melbourne machete murderers",
      "link": "https://www.theguardian.com/australia-news/2025/sep/08/families-shattered-and-community-terrified-as-police-continue-to-hunt-alleged-cobblebank-machete-murderers-ntwnfb",
      "pub_time_taipei": "2025-09-08T16:47:47+08:00",
      "summary": "<p>Premier says government stands with South Sudanese community in ‘fight against the cancer of youth gang crime’ after Cobblebank killings</p><p>The families of <a href=\"https://www.theguardian.com/australia-news/2025/sep/07/two-boys-fatally-stabbed-melbourne-ntwnfb\">two children allegedly murdered</a> in Melbourne’s outer west on the weekend are “shattered” and the community “terrified” as police continue to hunt the perpetrators responsible for the machete killings.</p><p>It comes as the Victorian premier promised the government would stand with the South Sudanese community “in their fight against the cancer of youth gang crime that is breaking their community’s heart”, announcing she would convene an existing working group.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/08/families-shattered-and-community-terrified-as-police-continue-to-hunt-alleged-cobblebank-machete-murderers-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "France poised to oust another prime minister, deepening Macron’s troubles",
      "link": "https://www.washingtonpost.com/world/2025/09/08/france-no-confidence-vote-macron/",
      "pub_time_taipei": "2025-09-08T16:14:11+08:00",
      "summary": "If the National Assembly votes Monday to force François Bayrou to resign, it will mark France’s second government collapse in less than a year."
    },
    {
      "source": "華盛頓郵報",
      "title": "How Taiwan took the American convenience store — and turbocharged it",
      "link": "https://www.washingtonpost.com/world/2025/09/08/taiwan-convenience-store-7-eleven/",
      "pub_time_taipei": "2025-09-08T16:00:26+08:00",
      "summary": "Convenience stores in Asia give new meaning to the term: Customers can pay bills, ship packages, eat a nutritious meal and — in some locations — work out."
    },
    {
      "source": "衛報",
      "title": "Bruce Lehrmann launches legal challenge against national anti-corruption commission head and federal minister",
      "link": "https://www.theguardian.com/australia-news/2025/sep/08/bruce-lehrmann-launches-a-legal-challenge-against-national-anti-corruption-commission-ntwnfb",
      "pub_time_taipei": "2025-09-08T15:58:18+08:00",
      "summary": "<p>Proceedings filed against the commissioner of the national anti-corruption commissioner, Paul Brereton, and federal special minister of state, Don Farrell</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Despite being on the brink of bankruptcy as a result of court proceedings, embattled former Liberal staffer Bruce Lehrmann has lodged legal action against the head of a corruption watchdog and a federal minister.</p><p>The legal action was filed by Lehrmann personally at 9.30pm on Thursday under the classification of a “judicial review”, which asks the court to review the legality of a governmental decision.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/08/bruce-lehrmann-launches-a-legal-challenge-against-national-anti-corruption-commission-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
      "link": "https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police",
      "pub_time_taipei": "2025-09-08T15:01:03+08:00",
      "summary": "<p>Phillips, who has been on the run with his children for four years, was shot by police after officers came under fire while investigating burglary in Piopio, authorities said</p><p>A fugitive father who had been hiding in New Zealand’s rugged wilderness with his three children for nearly four years has been shot dead by police investigating an armed burglary, police said on Monday.</p><p>The whereabouts of Tom Phillips has attracted headlines around the world since just before Christmas 2021, when he <a href=\"https://www.theguardian.com/world/2024/jan/05/new-zealands-two-year-search-in-wilderness-for-fugitive-father-and-three-missing-children\">fled into the Waikato wilderness with his children</a> Ember, now 9, Maverick, 10, and Jayda, 12, following a custody dispute with their mother.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fugitive father shot dead by police – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
      "pub_time_taipei": "2025-09-08T14:17:21+08:00",
      "summary": "<p>This blog is now closed. Our full report is here: <a href=\"https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police\">Tom Phillips shot dead after attempted burglary, NZ police confirm</a></p><p>The mayor of Waitomo, <strong>John Robertson</strong>, told the Guardian this morning’s events were the worst possible outcome for the community.</p><p>“I’m shattered, to be honest, and there will be many in the community that are devastated that this was the outcome after three and a half, four years,” he said.</p><p>So it’s just devastating news. Really the worst outcome we could have expected.</p><p>No day that goes by that I don’t think about all four of them.</p><p>It hurts every time I see photos of the children and of you, and see some of your stuff that is still here, thinking what could have been if you had not gone away.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Australian woman gets life in prison for ‘mushroom murders’",
      "link": "https://www.washingtonpost.com/world/2025/09/08/mushroom-murder-erin-patterson-life-sentence/",
      "pub_time_taipei": "2025-09-08T13:33:58+08:00",
      "summary": "Erin Patterson was convicted of killing three relatives with a lunch laced with death cap mushrooms. The judge called her actions “an enormous betrayal of trust.”"
    },
    {
      "source": "衛報",
      "title": "Japan’s next PM will face a problem that won’t go away with Shigeru Ishiba’s resignation",
      "link": "https://www.theguardian.com/world/2025/sep/08/japan-shigeru-ishiba-resignation-next-pm-will-face-problem-that-wont-go-away",
      "pub_time_taipei": "2025-09-08T13:25:34+08:00",
      "summary": "<p>The ruling Liberal Democratic party is still grappling with the fallout from a years-old funding scandal that may see it go into opposition for just the third time in its history</p><p>The precise timing of Japanese prime minister <a href=\"https://www.theguardian.com/world/2025/sep/07/japan-pm-shigeru-ishiba-resign\">Shigeru Ishiba’s resignation announcement</a> – on a Sunday evening – took many by surprise; but the countdown to his departure arguably began just weeks after he took office.</p><p>Having won the presidency of the Liberal Democratic party (LDP) – a formidable political force that has governed <a href=\"https://www.theguardian.com/world/japan\">Japan</a> for much of the past seven decades – Ishiba called a snap election in search of a public mandate after a <a href=\"https://www.theguardian.com/world/2024/apr/28/anger-at-party-funding-scandal-in-japan-threatens-to-bring-down-pm-kishida\">major funding scandal</a>, and to silence his opponents on the right of the party.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/japan-shigeru-ishiba-resignation-next-pm-will-face-problem-that-wont-go-away\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "In Sudan and Afghanistan, disaster upon disaster",
      "link": "https://www.washingtonpost.com/world/2025/09/08/sudan-afghanistan-humanitarian-natural-disaster/",
      "pub_time_taipei": "2025-09-08T12:00:42+08:00",
      "summary": "The interlocking crises facing Sudan and Afghanistan come at a moment when societies in the West are turning their backs on welcoming refugees and offering international humanitarian aid."
    },
    {
      "source": "衛報",
      "title": "Protests expected as 51 Israeli arms makers among exhibitors at London trade fair",
      "link": "https://www.theguardian.com/world/2025/sep/08/protests-expected-as-51-israeli-arms-makers-among-exhibitors-at-london-trade-fair",
      "pub_time_taipei": "2025-09-08T12:00:40+08:00",
      "summary": "<p>Campaign Against Arms Trade says UK government has hit ‘peak complicity in genocide’ in allowing the firms to exhibit</p><p>Fifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.</p><p>Their presence will be the focus for hundreds planning to demonstrate outside the four-day arms fair, at which the defence secretary, John Healey, is expected to speak alongside senior British military officials.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/protests-expected-as-51-israeli-arms-makers-among-exhibitors-at-london-trade-fair\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "South Korea announces deal to repatriate workers detained in Hyundai raid",
      "link": "https://www.washingtonpost.com/world/2025/09/07/hyundai-workers-release-deal-south-korea/",
      "pub_time_taipei": "2025-09-08T08:12:10+08:00",
      "summary": "South Korea said it intends to repatriate the more than 300 of its nationals who were detained during an immigration raid on a Hyundai factory in Georgia."
    },
    {
      "source": "衛報",
      "title": "Trump issues ‘last warning’ to Hamas to accept Gaza ceasefire deal",
      "link": "https://www.theguardian.com/us-news/2025/sep/07/trump-gaza-israeli-hostages",
      "pub_time_taipei": "2025-09-08T08:01:42+08:00",
      "summary": "<p>President says ‘the Israelis have accepted my terms’ and urges release of hostages to secure peace agreement</p><p>Donald Trump on Sunday issued what he called his “last warning” to Hamas, urging the Palestinian militant group to accept a deal to release hostages from Gaza.</p><p>“The Israelis have accepted my Terms. It is time for Hamas to accept as well,” Trump said in a post on his Truth Social platform. “I have warned Hamas about the consequences of not accepting. This is my last warning, there will not be another one!”</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/07/trump-gaza-israeli-hostages\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New business secretary Peter Kyle going to China for trade talks this week",
      "link": "https://www.theguardian.com/politics/2025/sep/07/uk-business-secretary-peter-kyle-visit-beijing",
      "pub_time_taipei": "2025-09-08T05:31:50+08:00",
      "summary": "<p>Former science secretary promoted in reshuffle to continue UK efforts to revitalise trade relationship with Beijing </p><p>The UK’s new business secretary, Peter Kyle, will fly to Beijing this week as part of Keir Starmer’s continuing efforts to revitalise the UK’s trade relationship with China and provide growth to the British economy.</p><p>The former science and technology secretary, who was promoted in Friday’s <a href=\"https://www.theguardian.com/politics/2025/sep/05/who-will-replace-angela-rayner-the-role-changes-in-labours-reshuffle\">government reshuffle</a>, is expected to land in China on Wednesday, picking up the schedule of his predecessor, Jonathan Reynolds, who is now the chief whip.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/07/uk-business-secretary-peter-kyle-visit-beijing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "300 South Koreans detained at Hyundai plant in US to be released, says Seoul",
      "link": "https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul",
      "pub_time_taipei": "2025-09-08T02:08:24+08:00",
      "summary": "<p>Footage of raid by US immigration officials showed detained workers in handcuffs and with chains around their ankles</p><p>South Korea announced on Sunday that the roughly 300 of its nationals detained during an immigration raid in Georgia would be released and flown home, as the sudden detention of workers appeared to strain the longstanding diplomatic and economic relationship between the two nations.</p><p>Nearly 500 workers, among them at least 300 South Koreans and at least 23 Mexicans, were arrested at the Hyundai-LG battery plant in the city of Ellabell on Thursday.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/07/300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russia’s largest-ever air attack on Ukraine burns Kyiv government building",
      "link": "https://www.washingtonpost.com/world/2025/09/07/ukraine-russia-attacks-missile-kyiv/",
      "pub_time_taipei": "2025-09-08T00:31:16+08:00",
      "summary": "Russia unleashed a massive air assault on Ukraine early Sunday, setting the main government building in Kyiv ablaze for the first time during the war."
    },
    {
      "source": "衛報",
      "title": "Republican condemns Vance for ‘despicable’ comments on Venezuelan boat strike",
      "link": "https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul",
      "pub_time_taipei": "2025-09-07T23:56:23+08:00",
      "summary": "<p>Rand Paul decries ‘thoughtless’ comment after vice-president defends strike against alleged drug traffickers</p><p>The Republican senator who heads the homeland security committee has criticized JD Vance for “despicable” comments apparently in support of extrajudicial military killings.</p><p>“Killing cartel members who poison our fellow citizens is the highest and best use of our military,” the vice-president said in an X post on Saturday, in defense of Tuesday’s US military <a href=\"https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike\">strike</a> against a Venezuelan boat in the Caribbean Sea, which killed 11 people the administration alleged were drug traffickers.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/07/jd-vance-venezuelan-boat-strike-rand-paul\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Germany’s latest prep for war: A national ravioli reserve",
      "link": "https://www.washingtonpost.com/world/2025/09/07/germany-war-preparation-ravioli-reserve/",
      "pub_time_taipei": "2025-09-07T21:40:25+08:00",
      "summary": "Wary of a warmongering Russia, Germany is refitting its military, buying weapons, recruiting soldiers and also contemplating new strategic reserves of canned food."
    },
    {
      "source": "華盛頓郵報",
      "title": "As LGBTQ+ pilgrims cross Vatican’s Holy Door, some see church in transition",
      "link": "https://www.washingtonpost.com/world/2025/09/07/gay-pilgrimage-pope-leo-vatican/",
      "pub_time_taipei": "2025-09-07T21:36:16+08:00",
      "summary": "About 1,450 participants from 22 countries hoped for a sign from Pope Leo XIV that he would continue the LGBTQ+ outreach of his predecessor."
    }
  ]
}