{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-15T20:40:07.242198+08:00",
  "window_end_taipei": "2025-09-16T20:40:07.242198+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Robert Redford, Oscar-winning actor and director, dies aged 89",
      "link": "https://www.theguardian.com/film/2025/sep/16/robert-redford-oscar-winning-actor-and-director-dies",
      "pub_time_taipei": "2025-09-16T20:24:47+08:00",
      "summary": "<p>Redford achieved huge critical and commercial success in the 60s and 70s with a string of hits including Butch Cassidy and the Sundance Kid, The Way We Were and The Sting, before becoming an Oscar-winning director</p><p>Robert Redford, star of Hollywood classics including Butch Cassidy and the Sundance Kid, The Sting and All the President’s Men, has died aged 89.</p><p>In a statement to <a href=\"https://www.nytimes.com/2025/09/16/movies/robert-redford-dead.html\">the New York Times</a>, his publicist said the actor died in his sleep at his home in Utah.</p> <a href=\"https://www.theguardian.com/film/2025/sep/16/robert-redford-oscar-winning-actor-and-director-dies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mandelson ‘subcontracted his conscience for money’, MPs told, as Davis leads emergency debate on ex-US ambassador — UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/16/starmer-cabinet-resignation-paul-ovenden-news-updates-uk-politics-live",
      "pub_time_taipei": "2025-09-16T20:24:16+08:00",
      "summary": "<p>Davis says Mandelson’s ‘abiding flaws’ should have disqualified him from ambassador’s job</p><p><em>Vikram Dodd is the Guardian’s crime correspondent.</em></p><p>Police expect to arrest 50 more people following Saturday’s large far-right-led march through London, the commissioner of the Metropolitan police said this morning.</p><p>If you are Conservative right-minded, then the future is Reform. The country is going to change a lot. The same people who thought that Brexit would not happen think that Reform will not happen. They are in for a shock.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/16/starmer-cabinet-resignation-paul-ovenden-news-updates-uk-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Spain says it will withdraw from 2026 Eurovision song contest if Israel takes part — Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/16/zelenskyy-trump-sanctions-russia-news-updates-europe-live",
      "pub_time_taipei": "2025-09-16T20:23:41+08:00",
      "summary": "<p>Spain is the first of the ‘Big Five’ countries to threaten withdrawal from the competition following vote at state broadcaster RTVE</p><p><strong>EU commissioners will on Wednesday agree to impose new sanctions against Israel over its war in Gaza</strong>, a spokesperson for the commission said on Tuesday.</p><p>“Tomorrow, <strong>commissioners will be adopting a package of measures on Israel,</strong>” spokesperson Paula Pinho said, as reported by Reuters.</p><p><em>“Specifically, <strong>a proposal to suspend certain trade provisions in the agreements between the EU and Israel.</strong>”</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/16/zelenskyy-trump-sanctions-russia-news-updates-europe-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sweden to implement nationwide mobile phone ban in schools",
      "link": "https://www.theguardian.com/world/2025/sep/16/sweden-nationwide-mobile-phone-ban-schools",
      "pub_time_taipei": "2025-09-16T20:23:38+08:00",
      "summary": "<p>From autumn 2026 all schools and after-school clubs must collect and hold students’ phones until the end of the day</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/16/zelenskyy-trump-sanctions-russia-news-updates-europe-live\">Europe live – latest updates</a></p></li></ul><p>Sweden is to implement a nationwide mobile phone ban in all schools in an attempt to improve security and study conditions for students.</p><p>From the next school year, starting in autumn 2026, it will be compulsory for all schools and after-school clubs to collect students’ phones and hold them until the end of the day.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/sweden-nationwide-mobile-phone-ban-schools\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump accuses NYT of being ‘mouthpiece’ for Democratic party as he announces defamation action — US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
      "pub_time_taipei": "2025-09-16T20:19:41+08:00",
      "summary": "<p>In Truth Social post, US president denounces publication as ‘one of the worst and most degenerate newspapers’ in US; Vance and Miller announce crackdown on ‘far left’ groups</p><p>The Trump administration will <strong>appeal the court decision blocking Donald Trump’s bid to fire Federal Reserve governor Lisa Cook</strong>, the White House said on Tuesday.</p><p>“The President lawfully removed Lisa Cook for cause. The Administration will appeal this decision and looks forward to ultimate victory on the issue,” White House spokesman Kush Desai said.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel turning Gaza City into mass graveyard, Palestinian foreign ministry says, as IDF launches ground offensive - latest updates",
      "link": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
      "pub_time_taipei": "2025-09-16T20:18:03+08:00",
      "summary": "<p>Palestinian foreign ministry accuses IDF of deliberately targeting civilians</p><p>Wafa, the Palestinian news agency, <a href=\"https://english.wafa.ps/Pages/Details/161389\">has been told</a> by medical sources that at least 38 Palestinian people, including women and children, have been killed by Israeli forces since dawn today.</p><p>As well as facing relentless bombardments, Gaza City, the biggest built-up area of the territory, is being gripped by a famine caused by Israel’s restrictions on aid.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK state pension likely to rise by 4.7% under triple lock",
      "link": "https://www.theguardian.com/business/2025/sep/16/uk-labour-market-pay-growth-job-losses-rachel-reeves",
      "pub_time_taipei": "2025-09-16T20:10:13+08:00",
      "summary": "<p>Increase will put further pressure on Rachel Reeves as ONS figures show pay growth slowing and job losses rising</p><ul><li><p><a href=\"https://www.theguardian.com/business/2025/sep/16/uk-pay-growth-unemployment-wages\">UK pay growth stays high – but Britons are feeling the pinch</a></p></li><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/16/uk-wage-growth-slows-jobs-market-cools-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Millions of people are poised for an above-inflation 4.7% increase in their state pension payments, adding to pressure on the government finances as Rachel Reeves explores raising taxes at the autumn budget.</p><p>Labour has committed to retaining the triple lock on the state pension, which guarantees annual increases in line with whichever is the higher of 2.5%, inflation in September or annual earnings growth in the three months to July.</p> <a href=\"https://www.theguardian.com/business/2025/sep/16/uk-labour-market-pay-growth-job-losses-rachel-reeves\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Spain first of Eurovision ‘big five’ to decide on boycott if Israel participates",
      "link": "https://www.theguardian.com/tv-and-radio/2025/sep/16/spain-eurovision-boycott-israel-gaza-war",
      "pub_time_taipei": "2025-09-16T19:57:21+08:00",
      "summary": "<p>State broadcaster says it will withdraw from next year’s contest in Vienna unless Israel is excluded over Gaza war</p><p>Spain has become the latest country to say it will not take part in next year’s Eurovision song contest if Israel participates.</p><p>Board members of the state broadcaster RTVE voted in majority favour of boycotting the contest if Israel is among the countries fielding an entry next year.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/16/spain-eurovision-boycott-israel-gaza-war\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel has committed genocide in Gaza, says UN commission of inquiry | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/sep/16/first-thing-israel-has-committed-genocide-in-gaza-says-un-commission-of-inquiry",
      "pub_time_taipei": "2025-09-16T19:50:24+08:00",
      "summary": "<p>The commission also accused Benjamin Netanyahu of inciting genocide. Plus, Donald Trump files $15bn lawsuit against the New York Times</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>A UN commission of inquiry has <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-committed-genocide-in-gaza-says-un-inquiry\">concluded that Israel is committing genocide</a> in Gaza and accused senior Israeli officials including Benjamin Netanyahu of inciting it.</p><p><strong>What did it conclude?</strong> That Israel has committed the following acts with intent to destroy the Palestinians, in whole or in part: killing; causing serious bodily or mental harm; deliberately inflicting conditions of life calculated to bring about the destruction of the Palestinians; and imposing measures intended to prevent births.</p><p><strong>What’s the latest in Gaza?</strong> Israel on Tuesday launched its long-threatened <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-launches-ground-offensive-deep-inside-gaza-city\">ground offensive</a> into the densely packed streets of Gaza City. The IDF said it believes 40% of the estimated 1 million population of Gaza City and its outskirts have so far left after Israeli evacuation orders. Israel told those remaining to flee southwards.</p><p><strong>This is a developing story.</strong> <a href=\"https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates\">Follow our liveblog here</a>.</p><p><strong>What do we know about the shooter’s political motivations?</strong> They remain unclear. Bullet casings found with the shooter’s gun were inscribed with references to video games and online culture.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/16/first-thing-israel-has-committed-genocide-in-gaza-says-un-commission-of-inquiry\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "JD Vance backs mass ‘doxing’ campaign to find and harass Charlie Kirk critics",
      "link": "https://www.theguardian.com/us-news/2025/sep/16/jd-vance-doxing-charlie-kirk-critics",
      "pub_time_taipei": "2025-09-16T19:50:22+08:00",
      "summary": "<p>US vice-president encourages ‘calling out’ anyone who celebrates Kirk’s murder, including notifying employers</p><p>A mass “doxing” effort to track down, intimidate and harass people perceived not to have sufficiently mourned the <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">killing</a> of the rightwing activist Charlie Kirk was <a href=\"https://www.theguardian.com/us-news/2025/sep/15/jd-vance-charlie-kirk-podcast\">endorsed</a> on Monday night by <a href=\"https://www.theguardian.com/us-news/jd-vance\">JD Vance</a>.</p><p>The US vice-president guest-hosted Kirk’s podcast on Monday and said that people who “see someone celebrating Charlie’s murder” should “call them out”. He added: “Hell, call their employer. We don’t believe in political violence, but we do believe in civility, and there is no civility in the celebration of political assassination.”</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/16/jd-vance-doxing-charlie-kirk-critics\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Maria Caulfield becomes latest senior Tory to defect to Reform UK",
      "link": "https://www.theguardian.com/politics/2025/sep/16/tories-defect-reform-uk-maria-caulfield",
      "pub_time_taipei": "2025-09-16T19:38:33+08:00",
      "summary": "<p>Former health minister announces decision a day after MP Danny Kruger joined Nigel Farage’s party</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/16/starmer-cabinet-resignation-paul-ovenden-news-updates-uk-politics-live\">UK politics live – latest updates</a></p></li></ul><p>Another senior Conservative has defected to Reform UK, with the former health minister Maria Caulfield saying she signed up to Nigel Farage’s party a month ago.</p><p>Although Caulfield is no longer an MP after losing her Lewes seat to the Liberal Democrats last year, it is another blow for the Tories, a day after Danny Kruger, a sitting Tory MP and the shadow work and pensions minister, <a href=\"https://www.theguardian.com/politics/2025/sep/15/danny-kruger-mp-says-tory-party-is-over-after-he-defects-to-reform\">announced he had</a> moved to Reform.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/16/tories-defect-reform-uk-maria-caulfield\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israeli military begins ground invasion of Gaza City",
      "link": "https://www.washingtonpost.com/world/2025/09/16/israel-gaza-city-ground-invasion/",
      "pub_time_taipei": "2025-09-16T19:28:24+08:00",
      "summary": "Palestinians in Gaza City reported a night of heavy bombardment. A U.N. commission said Israel was committing genocide in Gaza; Israel rejected it as “falsehoods.”"
    },
    {
      "source": "衛報",
      "title": "Sky puts 900 roles at risk in shake-up to compete with US streaming services",
      "link": "https://www.theguardian.com/business/2025/sep/16/sky-roles-at-risk-us-streaming-services",
      "pub_time_taipei": "2025-09-16T19:24:39+08:00",
      "summary": "<p>Company expects consultation process to result in about 600 roles being cut out of 23,000 UK staff</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/16/uk-wage-growth-slows-jobs-market-cools-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Sky has put 900 roles at risk as the broadcaster continues to reshape its business in the streaming era.</p><p>The company, which employs about 23,000 staff in the UK, expects the consultation process to result in about 600 roles being cut, with 300 redeployed.</p> <a href=\"https://www.theguardian.com/business/2025/sep/16/sky-roles-at-risk-us-streaming-services\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Progressive groups fear ‘McCarthy era’ attacks in wake of Charlie Kirk shooting",
      "link": "https://www.theguardian.com/us-news/2025/sep/16/charlie-kirk-shooting-trump-progressive-groups",
      "pub_time_taipei": "2025-09-16T19:00:04+08:00",
      "summary": "<p>Advocacy groups say Trump and allies’ calls for investigations represent attempt to ‘quash dissent’</p><p>The president, vice-president and members of Congress have begun calling for the government to investigate progressive organizations in the wake of the Charlie Kirk murder, in terms those targeted say are reminiscent of the House Un-American Activities Committee and the “red scare” of the 1950s.</p><p>Donald Trump, speaking to Fox &amp; Friends on Friday, presented “vicious and horrible” radicals on the left of US politics as a roadblock to the country coming together politically after the shooting. On Sunday, he amplified his attack on political enemies by declaring that “a lot of people that you would traditionally say are on the left … [are] already under investigation”.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/16/charlie-kirk-shooting-trump-progressive-groups\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "America and Britain were pillars of the world order. The world has changed.",
      "link": "https://www.washingtonpost.com/world/2025/09/16/america-britain-trump-world-order/",
      "pub_time_taipei": "2025-09-16T18:50:32+08:00",
      "summary": "President Trump will meet King Charles III and Prime Minister Keir Starmer on a state visit to Britain, against a backdrop of global division, disarray and destruction."
    },
    {
      "source": "衛報",
      "title": "Kenya seeks arrest of former British soldier over alleged murder of Agnes Wanjiru",
      "link": "https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru",
      "pub_time_taipei": "2025-09-16T18:46:54+08:00",
      "summary": "<p>High court judge issues arrest warrant, saying a suspect has been charged in relation to 2012 death of 21-year-old</p><p>A warrant has been issued for the arrest of a British national on suspicion of the murder of the Kenyan woman Agnes Wanjiru, who was found dead in the grounds of a hotel near an army base in 2012.</p><p>The high court judge Alexander Muteti issued the arrest warrant earlier on Tuesday in Kenya, with the prosecution telling the court a suspect had been charged with murder, and seeking the application for a warrant of arrest to facilitate his extradition to Kenya.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/16/kenya-seeks-arrest-former-british-soldier-alleged-agnes-wanjiru\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "South Korea to examine Georgia ICE raid for possible human rights abuses",
      "link": "https://www.washingtonpost.com/world/2025/09/16/outh-korea-hyundai-lg-ice/",
      "pub_time_taipei": "2025-09-16T18:36:04+08:00",
      "summary": "South Korea vowed to investigate whether U.S. Immigration and Customs Enforcement violated human rights after it detained hundreds at a Hyundai-LG plant."
    },
    {
      "source": "華盛頓郵報",
      "title": "Health scare leads mom to world record: Barefoot run on Lego bricks. On purpose.",
      "link": "https://www.washingtonpost.com/lifestyle/2025/09/16/lego-bricks-sprint-world-record/",
      "pub_time_taipei": "2025-09-16T18:15:00+08:00",
      "summary": "Feeling like she had a new lease on life, Gabrielle Wall sprinted the length of a football field barefoot on Lego bricks to clinch a new Guinness World Record."
    },
    {
      "source": "衛報",
      "title": "UK public has paid £200bn to shareholders of key industries since privatisation",
      "link": "https://www.theguardian.com/politics/2025/sep/16/uk-public-paid-200bn-to-shareholders-of-key-industries-since-privatisation-study",
      "pub_time_taipei": "2025-09-16T18:00:35+08:00",
      "summary": "<p>Analysis reveals ‘privatisation premium’ of £250 per household per year paid to owners of water, rail, bus, energy and mail services since 2010</p><ul><li><p>‘<a href=\"https://www.theguardian.com/uk-news/2025/sep/16/there-are-no-buses-privatisation-dead-end-ludlow\">Birmingham is up the road but there are no buses’</a></p></li></ul><p>The public has paid almost £200bn to the shareholders who own key British industries since they were privatised, research reveals.</p><p>The transfer of tens of billions of pounds to the owners of the privatised water, rail, bus, energy and mail services comes as families face soaring bills, polluted rivers and seas, and expensive and unreliable trains and buses.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/16/uk-public-paid-200bn-to-shareholders-of-key-industries-since-privatisation-study\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russia has network of 200 camps for ‘brainwashing’ Ukrainian children – report",
      "link": "https://www.theguardian.com/global-development/2025/sep/16/russia-has-network-of-200-camps-for-brainwashing-ukrainian-children-report",
      "pub_time_taipei": "2025-09-16T17:50:54+08:00",
      "summary": "<p>Investigation uncovers documents and satellite imagery that confirm children being taken to sites for patriotic indoctrination, weapons training and combat drills</p><p>Russia is running an extensive network of more than 200 camps to re-educate, Russify and militarise Ukrainian children, a new investigation has found.</p><p>The facilities, across Russia and occupied Ukraine, include camps as well as schools, military bases, medical facilities, religious sites and universities.</p> <a href=\"https://www.theguardian.com/global-development/2025/sep/16/russia-has-network-of-200-camps-for-brainwashing-ukrainian-children-report\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel launches ground offensive deep inside Gaza City",
      "link": "https://www.theguardian.com/world/2025/sep/16/israel-launches-ground-offensive-deep-inside-gaza-city",
      "pub_time_taipei": "2025-09-16T17:48:55+08:00",
      "summary": "<p>Overnight advance aimed at ‘dismantling Hamas’s grip’ as Israel accused of genocide in UN human rights report</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates\">Middle East crisis – live updates</a></p></li></ul><p>Israel has launched its long-threatened <a href=\"https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates\">ground offensive</a> into the densely packed streets of Gaza City, military officials have confirmed.</p><p>One Israel Defense Forces (IDF) official said that troops had begun what he called the “main phase” of the offensive, with an overnight advance from the outskirts towards the city centre.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-launches-ground-offensive-deep-inside-gaza-city\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "China unveils sweeping plans to boost domestic economy as Trump tariffs hit",
      "link": "https://www.washingtonpost.com/world/2025/09/16/china-services-stimulus-economy-growth-slows/",
      "pub_time_taipei": "2025-09-16T17:41:41+08:00",
      "summary": "With growth slowing in the world’s second largest economy, Beijing is trying to stoke demand in sectors as varied as health care, tourism, education and sports."
    },
    {
      "source": "衛報",
      "title": "Queensland government to ban pill testing in move criticised by health advocates",
      "link": "https://www.theguardian.com/australia-news/2025/sep/16/queensland-government-to-ban-pill-testing-in-move-criticised-by-health-advocates",
      "pub_time_taipei": "2025-09-16T17:01:00+08:00",
      "summary": "<p>Liberal National party expected to legislate ban this week, putting an end to testing of illicit drugs at festivals</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Queensland’s state government is expected to ban pill testing, including at festivals, by attaching amendments to an unrelated bill in parliament in a move criticised by health advocates.</p><p>Under the previous Labor government, Queensland was the first state to establish a fixed pill-testing strategy on an ongoing basis, in 2024. Clinics were opened on the Gold Coast and in Brisbane.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/16/queensland-government-to-ban-pill-testing-in-move-criticised-by-health-advocates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "To fight the narcos, Mexico tries a new approach: A song contest",
      "link": "https://www.washingtonpost.com/world/2025/09/16/mexico-canta-narco-corrido-contest/",
      "pub_time_taipei": "2025-09-16T17:00:00+08:00",
      "summary": "A Eurovision-style competition to counter narcocorridos, popular songs that romanticize the drug trade, draws viewers — and skeptics."
    },
    {
      "source": "衛報",
      "title": "Woman, 81, spoke to undercover agent about animal euthanasia drugs to kill people, court hears",
      "link": "https://www.theguardian.com/australia-news/2025/sep/16/elaine-arch-rowe-spoke-to-undercover-agent-about-supplying-animal-euthanasia-drugs-to-kill-people-court-hears-ntwnfb",
      "pub_time_taipei": "2025-09-16T16:33:50+08:00",
      "summary": "<p>Coroner ordered police investigation after postmortem of Gold Coast man revealed lethal dose of animal life-ending drug pentobarbitone</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>An 81-year-old woman accused of supporting a dodgy euthanasia service that provided a Gold Coast victim with a life-ending veterinary drug has been released from police custody.</p><p>Elaine Arch-Rowe was one of three people – including a father and son – charged over a police probe into the alleged assisted suicide of a Gold Coast man, with about 20 other deaths being investigated.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/16/elaine-arch-rowe-spoke-to-undercover-agent-about-supplying-animal-euthanasia-drugs-to-kill-people-court-hears-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Wong says Netanyahu government ‘more isolated than ever’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb",
      "pub_time_taipei": "2025-09-16T16:15:24+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/16/senior-liberal-warns-frontbench-exodus-over-party-net-zero-policy\">Liberal senator warns Ley of potential frontbench ‘exodus’ over party’s net zero policy</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Matt Canavan says landmark climate assessment a ‘cynical attempt to spread fear and panic’</strong></p><p>Nationals senator <strong>Matt Canavan</strong> discounted the headlines behind the <a href=\"https://www.theguardian.com/australia-news/2025/sep/15/millions-of-australians-at-risk-from-rising-sea-levels-and-heat-deaths-could-soar-landmark-climate-report-warns\">landmark national climate risk assessment</a>, saying the government had conveniently timed the report while calling the document a “cynical attempt to spread fear and panic among people”.</p><p>The problem is the headline figures are never as bad as the detailed science that underlies it. …</p><p>It reads like the Book of Daniel, not a government report. I mean, I like government reports that are sober and reasonable. … I think Australians like a government, that just tell them the truth and not try and scare them. We saw that during Covid. People are trying to scare you because they’ve got an agenda, right?</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sydney’s west on frontline for most extreme heat and biggest health risks – but inner city faces water threat",
      "link": "https://www.theguardian.com/australia-news/2025/sep/16/climate-sydney-west-suburbs-most-extreme-heat-biggest-health-risks-inner-city-flooding",
      "pub_time_taipei": "2025-09-16T15:41:07+08:00",
      "summary": "<p>Western suburbs, where temperatures are often 5C warmer, need shaded bus stops, more green space and better environmental standards in rented homes, locals say</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/audio/2025/sep/15/sea-level-rise-and-soaring-heat-deaths-will-climate-action-match-the-risks-full-story-podcast\">Full Story: Rising sea levels and soaring heat deaths: will climate action match the risks?</a></p></li><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li></ul><p>Bud Moses is all too aware of the longer, hotter summers impacting his community in Sydney’s west.</p><p>As black summer bushfires raged on 4 January 2020, Penrith was sweltering in temperatures of 48.9C, making it the hottest place on the planet that day. It was just one of a growing number of above-40C days Moses has witnessed in recent years.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/16/climate-sydney-west-suburbs-most-extreme-heat-biggest-health-risks-inner-city-flooding\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel has committed genocide in Gaza, says UN commission of inquiry",
      "link": "https://www.theguardian.com/world/2025/sep/16/israel-committed-genocide-in-gaza-says-un-inquiry",
      "pub_time_taipei": "2025-09-16T15:34:28+08:00",
      "summary": "<p>Report cites scale of killings and aid blockages and accuses Benjamin Netanyahu of inciting commission of genocide</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates\">Middle East crisis – live updates</a></p></li></ul><p>A UN commission of inquiry has concluded that Israel is committing genocide in Gaza and accused senior Israeli officials including Benjamin Netanyahu of inciting it.</p><p>The United Nations independent international commission of inquiry (COI), which does not speak on behalf of the UN and has been criticised strongly by Israel, cited the scale of the killings, aid blockages, forced displacement and the destruction of a fertility clinic in the territory to support its finding of genocide.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-committed-genocide-in-gaza-says-un-inquiry\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Up to 185,000 Queensland homes could be at ‘very high risk’ with many uninsurable if global heating unchecked",
      "link": "https://www.theguardian.com/australia-news/2025/sep/16/climate-change-queensland-properties-high-risk-natural-disaster-heatwaves-flooding-cyclones-bushfires-homes-uninsurable",
      "pub_time_taipei": "2025-09-16T13:43:39+08:00",
      "summary": "<p>State faces more frequent heatwaves, floods, cyclones and bushfires as world warms, national climate risk assessment warns</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/audio/2025/sep/15/sea-level-rise-and-soaring-heat-deaths-will-climate-action-match-the-risks-full-story-podcast\">Full Story: Rising sea levels and soaring heat deaths: will climate action match the risks?</a></p></li><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li></ul><p>Up to 185,000 properties in Queensland would be considered at “very high risk” of natural disaster if global heating continues unabated, according to a new report that warns that many of those homes would also become uninsurable.</p><p>The federal government’s <a href=\"https://www.theguardian.com/australia-news/2025/sep/15/millions-of-australians-at-risk-from-rising-sea-levels-and-heat-deaths-could-soar-landmark-climate-report-warns\">national climate risk assessment report</a> – released on Monday – says climate-related natural disasters would occur more frequently if global temperatures increase.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/16/climate-change-queensland-properties-high-risk-natural-disaster-heatwaves-flooding-cyclones-bushfires-homes-uninsurable\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australia-PNG defence treaty: countries to agree to defend each other from military attack as China’s Pacific influence grows",
      "link": "https://www.theguardian.com/australia-news/2025/sep/16/australia-png-papua-new-guinea-military-defence-treaty-agreement-as-china-pacific-influence-grows",
      "pub_time_taipei": "2025-09-16T12:28:39+08:00",
      "summary": "<p>Anthony Albanese and Papua New Guinea’s defence minister downplayed the delay to the Pukpuk defence treaty being formalised</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australia and Papua New Guinea will agree to defend each other in the event of a military attack, part of a landmark defence agreement due to be signed on the sidelines of celebrations to commemorate the country’s independence this week.</p><p>Anthony Albanese and PNG’s defence minister, Billy Joseph, both downplayed a delay to the deal being formalised, insisting the plan known as a Pukpuk treaty won’t affect sovereignty in the former Australian colony.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/16/australia-png-papua-new-guinea-military-defence-treaty-agreement-as-china-pacific-influence-grows\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pacific leaders gather to celebrate 50th anniversary of Papua New Guinea’s independence",
      "link": "https://www.theguardian.com/world/2025/sep/16/papua-new-guinea-independence-50th-anniversary-png-world-leaders",
      "pub_time_taipei": "2025-09-16T10:30:58+08:00",
      "summary": "<p>Celebrations and events have been held across the country to mark the milestone</p><ul><li><p><a href=\"https://www.theguardian.com/world/series/png-independence--50-years-on\">PNG independence: 50 years on</a></p></li></ul><p>Pacific leaders have gathered in Port Moresby to celebrate Papua New Guinea’s 50th anniversary of independence from Australia, as prime minster James Marape reflected on the moment and voiced his optimism for the future despite the country’s challenges.</p><p>Papua New Guinea was <a href=\"https://www.naa.gov.au/help-your-research/fact-sheets/independence-papua-new-guinea#australian-admin\">administered by Australia as a single territory from 1945</a>. The territory included the former British protectorate of Papua and the former German colony of New Guinea. In 1975, Papua New Guinea was granted independence.</p> <a href=\"https://www.theguardian.com/world/2025/sep/16/papua-new-guinea-independence-50th-anniversary-png-world-leaders\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump announces deadly US strike on another alleged Venezuelan drug boat",
      "link": "https://www.theguardian.com/us-news/2025/sep/15/trump-strike-venezuela-drug-cartel-vessel",
      "pub_time_taipei": "2025-09-16T09:26:57+08:00",
      "summary": "<p>President says three people killed in strike against vessel he said was transporting drugs ‘headed to the US’</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> said on Monday that the United States had carried out a strike on a second <a href=\"https://www.theguardian.com/world/venezuela\">Venezuelan</a> boat and killed three alleged terrorists he claimed were transporting drugs, expanding his administration’s war against drug cartels and the scope of lethal military force to stop them.</p><p>The US president gave few details about the strike, saying in a social media post that the action was on his orders and that it had happened earlier in the morning. The post was accompanied by a video clip showing the boat, which appeared to be stationary, erupting into a fireball.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/15/trump-strike-venezuela-drug-cartel-vessel\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. kills 3 in strike on alleged drug boat from Venezuela, Trump says",
      "link": "https://www.washingtonpost.com/national-security/2025/09/15/trump-venezuela-drug-strike/",
      "pub_time_taipei": "2025-09-16T07:50:11+08:00",
      "summary": "The president also signaled that his administration was preparing to take military action against Latin American cartels that move narcotics over land."
    },
    {
      "source": "衛報",
      "title": "First ‘one in, one out’ deportation flight reportedly takes off without migrants",
      "link": "https://www.theguardian.com/uk-news/2025/sep/15/first-one-in-one-out-deportation-flight-reportedly-takes-off-without-migrants",
      "pub_time_taipei": "2025-09-16T06:46:19+08:00",
      "summary": "<p>Group of people who crossed Channel by boat understood not to have been on Air France plane after legal challenge</p><p>The first flight to France carrying people who crossed the Channel under Keir Starmer’s “one in, one out” deal has not taken place as planned, according to reports.</p><p>A small group of individuals were removed from an Air France flight on Monday due to travel from Heathrow to Paris after a legal challenge, according to multiple newspaper reports.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/15/first-one-in-one-out-deportation-flight-reportedly-takes-off-without-migrants\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gulf leaders call on Trump to rein in Israel after Qatar emergency summit",
      "link": "https://www.theguardian.com/world/2025/sep/15/gulf-leaders-call-on-trump-to-rein-in-israel-after-qatar-emergency-summit",
      "pub_time_taipei": "2025-09-16T05:38:00+08:00",
      "summary": "<p>Arab states say US should use its leverage and influence as they promise to ‘activate joint defence mechanisms’ </p><p>Gulf leaders meeting at an emergency summit in Qatar have called on the Trump administration to use its leverage to rein in Israel following the unprecedented Israeli attempt last Tuesday <a href=\"https://www.theguardian.com/world/2025/sep/09/israel-targets-top-hamas-members-in-qatar-for-gaza-ceasefire-talks\">to assassinate Hamas negotiators in Doha</a>.</p><p>Speaking after the meeting of the Gulf Cooperation Council (GCC), the group’s secretary general, Jasem Mohamed al-Budaiwi, said: “We … expect our strategic partners in the United States to use their influence on Israel in order for it to stop this behaviour … they have leverage and influence on Israel, and it’s about time that this leverage and influence be used.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/15/gulf-leaders-call-on-trump-to-rein-in-israel-after-qatar-emergency-summit\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Why the U.S. military is striking boats from Venezuela",
      "link": "https://www.washingtonpost.com/podcasts/post-reports/why-the-us-military-is-striking-boats-from-venezuela/",
      "pub_time_taipei": "2025-09-16T05:11:05+08:00",
      "summary": "Nearly two weeks after a deadly U.S. strike on a boat in the Caribbean, questions loom over Trump’s new war on terror and drugs. This afternoon, Trump announced another strike on a boat from Venezuela."
    },
    {
      "source": "衛報",
      "title": "First group of children from Gaza arrive in UK for life-saving NHS treatment",
      "link": "https://www.theguardian.com/world/2025/sep/15/first-group-of-children-from-gaza-arrive-in-uk-for-life-saving-nhs-treatment",
      "pub_time_taipei": "2025-09-16T04:46:05+08:00",
      "summary": "<p>Care and support package, including housing, will help 30-50 young Palestinians for an initial two years</p><p>The first group of children from Gaza have arrived in the UK for specialist life-saving treatment on the NHS, the Guardian understands.</p><p>Yvette Cooper, the foreign secretary, informed the parliamentary Labour party on Monday evening about the development. On arrival in the UK, the patients and their families have been granted access to NHS treatment, appropriate housing and comprehensive support services for an initial two-year period.</p> <a href=\"https://www.theguardian.com/world/2025/sep/15/first-group-of-children-from-gaza-arrive-in-uk-for-life-saving-nhs-treatment\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Rubio downplays U.S. tensions with Israel, plans to visit Qatar after strike",
      "link": "https://www.washingtonpost.com/national-security/2025/09/15/rubio-israel-qatar/",
      "pub_time_taipei": "2025-09-16T01:50:03+08:00",
      "summary": "Israel’s strike on Hamas negotiators in Doha outraged much of the Arab Middle East. President Donald Trump distanced the U.S. from the attack."
    },
    {
      "source": "衛報",
      "title": "Cuban prisoners forced to work making cigars and charcoal for export to Europe, report claims",
      "link": "https://www.theguardian.com/world/2025/sep/15/cuba-prisoners-forced-labour-cigars-charcoal-report",
      "pub_time_taipei": "2025-09-16T00:01:13+08:00",
      "summary": "<p>Madrid-based NGO estimates at least 60,000 inmates subject to forced labour with little or no pay in Cuban jails</p><p>Prisoners in <a href=\"https://www.theguardian.com/world/cuba\">Cuba</a> are forced to work producing the country’s world-famous cigars and marabu charcoal sold to European consumers, according to a new report.</p><p>The Madrid-based NGO <a href=\"https://www.prisonersdefenders.org/\">Prisoners Defenders</a> estimates that at least 60,000 people are being forced to work with little or no pay, under threats, in exhausting conditions and without adequate equipment, with reports of violence including the sexual abuse of female detainees.</p> <a href=\"https://www.theguardian.com/world/2025/sep/15/cuba-prisoners-forced-labour-cigars-charcoal-report\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two men found guilty of witchcraft plot to kill Zambia’s president",
      "link": "https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president",
      "pub_time_taipei": "2025-09-15T22:23:32+08:00",
      "summary": "<p>Conviction comes as Hakainde Hichilema faces growing criticism for suppressing political opposition</p><p>Two men have been convicted in Zambia of planning to use witchcraft to kill the president, Hakainde Hichilema.</p><p>Leonard Phiri, a village chief, and Jasten Mabulesse Candunde, a Mozambican citizen, were arrested in December after a cleaner reported hearing strange noises. Authorities said they were found to be in possession of a live chameleon and other “assorted charms”, including a red cloth, an unidentified white powder and an animal’s tail.</p> <a href=\"https://www.theguardian.com/world/2025/sep/15/two-men-found-guilty-of-witchcraft-plot-to-kill-zambias-president\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Nvidia broke antitrust law, China says on second day of U.S. trade talks",
      "link": "https://www.washingtonpost.com/world/2025/09/15/china-nvidia-antitrust/",
      "pub_time_taipei": "2025-09-15T21:41:37+08:00",
      "summary": "Beijing’s targeting of Nvidia, the American AI chip giant, ratcheted up tensions as negotiators for the two countries met for trade talks in Spain."
    },
    {
      "source": "衛報",
      "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
      "link": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
      "pub_time_taipei": "2025-09-15T21:24:59+08:00",
      "summary": "<p>Slowing growth in factory output and retail sales prompts calls for fresh economic stimulus</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates#top-of-blog\"><strong>Business live – latest updates</strong></a></p></li></ul><p></p><p>China’s economy showed further signs of weakness last month as it comes under strain from Donald Trump’s trade wars and domestic problems, with factory output and consumer spending rising at their slowest pace for about a year.</p><p>The disappointing data adds pressure on Beijing to roll out more stimulus to fend off a sharp slowdown, with a debt crisis denting the country’s once-booming property sector and exports facing stronger headwinds.</p> <a href=\"https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows\">Continue reading...</a>"
    }
  ]
}