{
  "mode": "last_24h",
  "window_start_taipei": "2025-08-27T20:40:03.839370+08:00",
  "window_end_taipei": "2025-08-28T20:40:03.839370+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "UK and EU summon top Russian diplomats after strikes hit British Council and EU offices in deadly attack on Kyiv - Europe live",
      "link": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
      "pub_time_taipei": "2025-08-28T20:20:03+08:00",
      "summary": "<p>Overnight raid kills more than a dozen people as European leaders condemn ‘deliberate’ targeting of civilians and institutions</p><p>Ukrainian prime minister <strong>Yulia Svyrydenko</strong> has now responded to the overnight Russian attacks on Kyiv, <strong>criticising Moscow for “horrific and deliberate killing of civilians.”</strong></p><p>“The Russians are not choosing to end the war, only constant expansion of atrocities,” she said.</p><p><em>“Overnight in Kyiv, dozens of buildings were hit: residential houses, office centers, civilian enterprises. Among them also the building where the European Union Delegation to Ukraine is located. </em></p><p><em><strong>Russians now believe that they have paralyzed Ukraine’s allies with feigned plans for ‘negotiations’</strong> and endless delays that only serve as methods to buy time with the true goal only of preventing sanctions.</em></p><p><em>“My <strong>thoughts are with all those affected by the senseless Russian strikes on Kyiv</strong> which have damaged the British Council building. </em></p><p><em>Putin is killing children and civilians, and sabotaging hopes of peace. </em></p> <a href=\"https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Minister refuses to deny reports Rachel Reeves considering tax increase for landlords in budget – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
      "pub_time_taipei": "2025-08-28T20:18:32+08:00",
      "summary": "<p>Stephen Morgan says Labour focus is on driving growth after reports of a national insurance tax on rental income</p><p>A Reform council leader’s decision to ban his councillors from engaging with a prominent local newspaper is a “massive attack on local democracy” and a sign of things to come should the party form the next government, the outlet’s editor has warned.</p><p>In an unprecedented move, <strong>Nottinghamshire county council</strong>’s four-month-old Reform administration has said it will no longer deal with the <strong><a href=\"https://www.theguardian.com/uk/nottingham\">Nottingham</a> Post</strong>, its online edition and a team of <strong>BBC</strong>-funded local democracy journalists that it manages.</p><p>I’ve been a journalist for 20 years. We have had our ups and downs with all kinds of councils. We managed to get along fine, because most elected officials accept this is par for the course. You are going to get some negative press. What you don’t do is shut the shop up.</p><p>This is a worrying sign of potentially things to come if Reform wins the next election. What you’re seeing here in Nottinghamshire is probably a microcosm of how it will be across the whole of the UK if Nigel Farage becomes prime minister. You are just going to see this kind of shutting down of questioning.</p> <a href=\"https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "CDC chief Susan Monarez refuses to resign amid ‘targeted’ ousting – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
      "pub_time_taipei": "2025-08-28T20:15:19+08:00",
      "summary": "<p>Monarez issues statement saying she had ‘neither resigned nor received notification’ of her termination from the White House, plunging public health agency into chaos</p><p>Hello, I’m Shrai Popat, and welcome to today’s coverage of US politics live.</p><p><strong>The US’s top public health agency was plunged into chaos on Wednesday after the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> moved to oust its leader, Susan Monarez, sworn in less than a month ago. But her lawyers said she would not resign and that she was being “targeted” for her pro-science stance.</strong></p><p><strong><a href=\"https://www.theguardian.com/politics/2025/aug/27/tony-blair-attends-white-house-meeting-with-trump-on-postwar-gaza\">Former British prime minister Tony Blair has attended a White House meeting with Donald Trump to discuss plans for postwar Gaza, the Guardian understands</a></strong>. After stepping down as prime minister in 2007, Blair took on the role of Middle East envoy until 2015 and spent time in Jerusalem trying to formulate a plan for a two-state solution.</p><p><strong><a href=\"https://www.theguardian.com/us-news/2025/aug/27/kilmar-abrego-garcia-deportation-trump-asylum\">A federal judge ruled on Wednesday that Kilmar Ábrego García, who was already wrongfully deported once, cannot be deported again until at least early October</a></strong>.</p><p><strong><a href=\"https://www.theguardian.com/us-news/2025/aug/27/trump-national-guard-beautification-dc\">National guard troops have spent their last days of the summer mulching cherry trees, collecting trash and clearing homeless camps across Washington DC</a></strong>, as Donald Trump’s federal takeover of the capital evolved the guard from makeshift cops to armed jacks of all trades.</p><p><strong><a href=\"https://www.theguardian.com/us-news/2025/aug/27/california-democrats-republicans-redraw-maps\">Republicans in California are proposing a “two-state solution” for the Golden state,</a></strong> in a move that is unlikely to go anywhere but is reflective of partisan divisions amid a nationwide battle over control of Congress.</p><p><strong><a href=\"https://www.theguardian.com/us-news/2025/aug/27/fda-new-covid-19-vaccines-restrictions\">The US Food and Drug Administration has approved updated Covid vaccines</a></strong> but has placed new restrictions on who can get them.</p><p><strong><a href=\"https://www.theguardian.com/us-news/2025/aug/27/alligator-alcatraz-immigration-detention-florida-desantis\">Florida’s immigration jail known as “Alligator Alcatraz” will probably be empty of detainees within days,</a></strong><a href=\"https://www.theguardian.com/us-news/2025/aug/27/alligator-alcatraz-immigration-detention-florida-desantis\"> </a>a state official has said, indicating compliance with a judge’s order last week that the facility <a href=\"https://www.theguardian.com/us-news/2025/aug/21/trump-alligator-alcatraz-judge-ruling\">must close</a>.</p><p><strong><a href=\"https://www.theguardian.com/us-news/2025/aug/27/fulton-county-commissioners-jail-time-election-board-appointments\">The Fulton county commission in Georgia will be fined $10,000 a day for violating a court order to appoint two Republicans</a> </strong>associated with Trump-aligned groups pushing voter fraud conspiracies to the county’s election board.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK weather: heavy rain to make end of summer a washout in southern England and Wales",
      "link": "https://www.theguardian.com/uk-news/2025/aug/28/uk-weather-heavy-rain-to-make-end-of-summer-a-washout-in-southern-england-and-wales-met-office",
      "pub_time_taipei": "2025-08-28T20:10:53+08:00",
      "summary": "<p>Met Office issues yellow weather warnings and says flooding and travel disruption likely in parts</p><p>Heavy showers and flooding will mean that the end of this year’s summer is a washout.</p><p>Yellow weather warnings have been put in place by the Met Office across parts of southern England and Wales from Thursday evening to noon on Friday</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/28/uk-weather-heavy-rain-to-make-end-of-summer-a-washout-in-southern-england-and-wales-met-office\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Minnneapolis wakes to aftermath of Catholic school shooting",
      "link": "https://www.theguardian.com/us-news/2025/aug/28/minnneapolis-wakes-to-aftermath-of-catholic-school-shooting",
      "pub_time_taipei": "2025-08-28T20:10:39+08:00",
      "summary": "<p>Officials say critically injured people expected to survive after attack that killed two children during mass at church</p><p>Minneapolis woke on Thursday to the aftermath of the mass shooting at a Catholic school in which two children were killed and 17 people injured, <a href=\"https://www.theguardian.com/us-news/2025/aug/27/minneapolis-annunciation-catholic-school-shooting\">stunning the close-knit community</a> and prompting the FBI to investigate the act as domestic terrorism and a hate crime targeting Catholics.</p><p>A shooter at the Annunciation Catholic school in the south of the city killed two children, aged eight and 10, in church pews during morning mass. Fourteen other children, aged six to 15, were injured, two of them critically, though officials said they were expected to survive. The shooter killed themself.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/28/minnneapolis-wakes-to-aftermath-of-catholic-school-shooting\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: Two children killed and 17 injured in Minneapolis Catholic school shooting",
      "link": "https://www.theguardian.com/us-news/2025/aug/28/first-thing-two-children-killed-and-17-injured-in-minneapolis-catholic-school-shooting",
      "pub_time_taipei": "2025-08-28T20:07:30+08:00",
      "summary": "<p>The shooter fired through church windows during a service. Plus, Gavin Newsom warns that Trump is serious about pursuing a third term</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>Two child<a href=\"https://www.theguardian.com/us-news/2025/aug/27/minneapolis-active-shooter-school\">in a mass shooting on Wednesday</a> at a Catholic school in Minneapolis, Minnesota.</p><p><strong>What have the authorities said about motivations?</strong> The FBI said it was investigating the shooting as “an act of domestic terrorism and hate crime targeting Catholics”.</p><p><strong>Did the shooter obtain their weapon legally?</strong> Yes – Westman had lawfully purchased a rifle, a shotgun and a pistol recently.</p><p><strong>What has the reaction been? </strong>The HHS announcement triggered at least three other CDC leaders to publicly resign.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/28/first-thing-two-children-killed-and-17-injured-in-minneapolis-catholic-school-shooting\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Asda says new business taxes mean customers are ‘feeling it’ at the till",
      "link": "https://www.theguardian.com/business/2025/aug/28/asda-business-taxes-customers-feeling-it-till",
      "pub_time_taipei": "2025-08-28T20:05:36+08:00",
      "summary": "<p>Discounter to invest in keeping prices down and putting more staff on the shop floor as it reports drop in sales</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/28/tesla-sales-fall-across-europe-byd-bond-market-shares-ftse-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>New business taxes mean that “the consumer is feeling it” as companies pass on their costs to shoppers, according to the boss of Asda.</p><p>However, Allan Leighton said the supermarket chain was investing to keep a lid on prices to attract cash-strapped shoppers.</p> <a href=\"https://www.theguardian.com/business/2025/aug/28/asda-business-taxes-customers-feeling-it-till\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Humans inhale as much as 68,000 microplastic particles daily, study finds",
      "link": "https://www.theguardian.com/environment/2025/aug/28/microplastics-in-hair-study",
      "pub_time_taipei": "2025-08-28T20:00:52+08:00",
      "summary": "<p>Particles are small enough to burrow into lungs, says report, with health impacts ‘more substantial than we realize’</p><p>Every breath people take in their homes or car probably contains significant amounts of microplastics small enough to burrow deep into lungs, new <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0328011#abstract0\">peer-reviewed research</a> finds, bringing into focus a little understood route of exposure and health threat.</p><p>The study, published in the journal Plos One, estimates humans can inhale as much as 68,000 tiny plastic particles daily. Previous studies have identified larger pieces of airborne microplastics, but those are not as much of a health threat because they do not hang in the air as long, or move as deep into the pulmonary system.</p> <a href=\"https://www.theguardian.com/environment/2025/aug/28/microplastics-in-hair-study\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "How Elon Musk’s billionaire Doge lieutenant took over the US’s biggest MDMA company",
      "link": "https://www.theguardian.com/technology/ng-interactive/2025/aug/28/elon-musk-antonio-gracias-mdma-psychedelics-company",
      "pub_time_taipei": "2025-08-28T20:00:51+08:00",
      "summary": "<p>Antonio Gracias is part of the growing movement among Silicon Valley’s right wing enamored with the therapeutic and commercial potential of drugs like MDMA</p><p>Months before Antonio Gracias took a leading role in the “department of government efficiency’s” dismantling of the federal government, he was at Burning Man.</p><p>In the dusty Nevada desert, Gracias, a billionaire private equity investor and one of Elon Musk’s closest friends, attended Nova Heaven, a sunrise rave tribute to victims of the Hamas-led 7 October terrorist attack, and found himself dancing next to Rick Doblin – the US’s most prominent advocate for psychedelic drugs.</p> <a href=\"https://www.theguardian.com/technology/ng-interactive/2025/aug/28/elon-musk-antonio-gracias-mdma-psychedelics-company\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Top Boy actor Micheal Ward appears in court on rape and sexual assault charges",
      "link": "https://www.theguardian.com/uk-news/2025/aug/28/top-boy-actor-micheal-ward-appears-in-court-on-and-sexual-assault-charges",
      "pub_time_taipei": "2025-08-28T20:00:31+08:00",
      "summary": "<p>Bafta-winning actor did not enter plea to charges relating to one woman that are alleged to have taken place in January 2023</p><p>Micheal Ward, the Bafta-winning actor who starred in Top Boy and Blue Story, has appeared in court on charges of rape and sexual assault.</p><p>Ward, 27, who is also known for roles in shows and films including Small Axe, The Old Guard and Empire of Light, appeared at Thames magistrates court on Thursday wearing dark glasses and a black jacket. He spoke to confirm his name, address and date of birth during a short hearing.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/28/top-boy-actor-micheal-ward-appears-in-court-on-and-sexual-assault-charges\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rwanda accepts seven people from US as part of deportation deal",
      "link": "https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal",
      "pub_time_taipei": "2025-08-28T19:58:49+08:00",
      "summary": "<p>Trump administration pushing controversial deal to send people to non-home countries, including South Sudan and Eswatini</p><p>Seven people have arrived in Rwanda as part of a deal to accept deportees from the US, the Rwandan government has said.</p><p>The Trump administration has been negotiating controversial arrangements to send people to third countries, including <a href=\"https://www.theguardian.com/world/2025/jul/09/south-sudan-us-deported-men\">South Sudan</a> and <a href=\"https://www.theguardian.com/us-news/2025/jul/16/trump-administration-deports-five-migrants-to-eswatini-in-southern-africa\">Eswatini</a>, formerly Swaziland, as part of its wider deportation drive.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/rwanda-accepts-seven-people-us-deportation-deal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Treasury ‘considering taxing landlords’ rent’ to raise £2bn",
      "link": "https://www.theguardian.com/money/2025/aug/28/uk-landlords-could-face-tax-from-rents",
      "pub_time_taipei": "2025-08-28T19:14:53+08:00",
      "summary": "<p>Proposals for autumn budget would mean expanding national insurance to include rental income</p><ul><li><p><a href=\"https://www.theguardian.com/business/2025/aug/28/property-tax-threat-slow-down-housing-market-uk-agents\">Property tax threat ‘is slowing down housing market’</a></p></li></ul><p>The Treasury is reportedly considering a tax on landlords that will target income from rents in the autumn budget.</p><p>The proposals are centred on the expansion of national insurance to include rental income, which is currently exempt from the levy, as part of a broader push to plug a potential £40bn shortfall in the public finances.</p> <a href=\"https://www.theguardian.com/money/2025/aug/28/uk-landlords-could-face-tax-from-rents\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Taipei City council in the dog house over Chinese-made patrol robot",
      "link": "https://www.theguardian.com/world/2025/aug/28/taipei-city-council-in-the-dog-house-over-chinese-made-patrol-robot",
      "pub_time_taipei": "2025-08-28T19:01:43+08:00",
      "summary": "<p>Opposition councillor in Taiwanese capital accuses authorities of sending ‘Trojan horse’ into citizens’ daily lives</p><p>Taipei City council has come under fire after admitting that a robot dog it bought to help patrol city streets using surveillance cameras was made by a Chinese companylinked to the Chinese military.</p><p>Hammer Lee, the deputy mayor of Taiwan’s capital, introduced a “new patrol partner” for the management and repair of pedestrian areas in a <a href=\"https://www.facebook.com/permalink.php?story_fbid=pfbid0tF7rw8xmkrjggHK2hLquQNQJQx2QWCiNM6fVrMMhkuQHgfDZUg2du2N4UxMdFwtUl&amp;id=100051818071280\">post</a> on Facebook on Tuesday.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/taipei-city-council-in-the-dog-house-over-chinese-made-patrol-robot\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tesla sales in Europe slump 40% as BYD new car registrations more than triple",
      "link": "https://www.theguardian.com/technology/2025/aug/28/tesla-sales-in-europe-slump-byd-new-car-registrations-more-than-triple-elon-musk",
      "pub_time_taipei": "2025-08-28T18:57:09+08:00",
      "summary": "<p>Electric car business run by Elon Musk continues to lose ground to Chinese rival despite recent revamp of Model Y</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/28/tesla-sales-fall-across-europe-byd-bond-market-shares-ftse-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Tesla sales slumped 40% across Europe in July compared with a year earlier as Elon Musk’s electric car company faces increasingly tough competition from its Chinese rival BYD.</p><p>There were 8,837 sales of Tesla cars last month across the EU, the European Free Trade Association and the UK, according to figures from the European Automobile Manufacturers’ Association (ACEA). That compared with 14,769 at the same point last year.</p> <a href=\"https://www.theguardian.com/technology/2025/aug/28/tesla-sales-in-europe-slump-byd-new-car-registrations-more-than-triple-elon-musk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russian missile and drone attack on Kyiv kills at least 14 people",
      "link": "https://www.theguardian.com/world/2025/aug/28/russia-launches-kyiv-attack-ukraine-capital-deaths-injuries",
      "pub_time_taipei": "2025-08-28T18:48:56+08:00",
      "summary": "<p>Zelenskyy says Moscow ‘chooses ballistics instead of the negotiating table’ after strikes on more than 20 locations</p><p>• <a href=\"https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest\">Europe live – latest updates</a></p><p>Russian airstrikes on Kyiv have killed at least 14 people and wounded dozens in the most deadly night raid on the Ukrainian capital since the Alaska summit between Vladimir Putin and Donald Trump.</p><p>Twelve people were reported killed when a five-storey residential building in the eastern Darnytskyi district was struck in the middle of the night, said Ukraine’s interior minister, Ihor Klymenko.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/russia-launches-kyiv-attack-ukraine-capital-deaths-injuries\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Final arguments conclude in Jimmy Lai national security trial in Hong Kong",
      "link": "https://www.theguardian.com/world/2025/aug/28/jimmy-lai-national-security-trial-hong-kong-media-democracy",
      "pub_time_taipei": "2025-08-28T18:40:51+08:00",
      "summary": "<p>Government-picked judges consider verdict in high-profile case against pro-democracy media mogul</p><p>Final arguments have concluded in the national security trial of the pro-democracy media tycoon Jimmy Lai in Hong Kong.</p><p>Government-picked judges are retiring to consider their verdict in the case, seen internationally as a crucial test of the rule of law in the city.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/jimmy-lai-national-security-trial-hong-kong-media-democracy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Overcrowding in NSW hospitals ‘worst’ some doctors have seen as winter illnesses clog emergency departments",
      "link": "https://www.theguardian.com/australia-news/2025/aug/28/overcrowding-in-nsw-hospitals-worst-some-doctors-have-seen-as-winter-illnesses-clog-emergency-departments",
      "pub_time_taipei": "2025-08-28T18:02:41+08:00",
      "summary": "<p>State health minister Ryan Park says there have been more than 45,000 presentations to EDs over the past five days</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The New South Wales health minister has encouraged people to call the health hotline instead of going to emergency departments as a spike in winter illnesses has doctors saying overcrowding is the “worst they have ever seen”.</p><p>In a statement released Thursday, Ryan Park said there had been more than 45,000 presentations to EDs over the past five days.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/28/overcrowding-in-nsw-hospitals-worst-some-doctors-have-seen-as-winter-illnesses-clog-emergency-departments\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Expelled ambassador says allegations against Iran ‘baseless’ during Sydney airport exit",
      "link": "https://www.theguardian.com/australia-news/2025/aug/28/iran-ambassador-ahmad-sadeghi-leaves-australia-airport",
      "pub_time_taipei": "2025-08-28T17:54:47+08:00",
      "summary": "<p>Ahmad Sadeghi faced media questioning at the airport before boarding a flight out of Australia</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Iran’s former ambassador to Australia – now persona non grata – has denied allegations his government was behind two antisemitic arson attacks in Australia, describing the accusations as “baseless” as he left the country.</p><p>Ahmad Sadeghi faced media questioning at Sydney airport before boarding a flight out of Australia.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/28/iran-ambassador-ahmad-sadeghi-leaves-australia-airport\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labor accused of trying to ‘sneak through’ law change to strip non-citizens of fair process",
      "link": "https://www.theguardian.com/australia-news/2025/aug/28/labor-accused-of-trying-to-sneak-through-law-change-to-strip-non-citizens-of-fair-process",
      "pub_time_taipei": "2025-08-28T17:22:32+08:00",
      "summary": "<p>Greens’ David Shoebridge calls amendment ‘one of the nastiest, meanest attacks’ on multicultural Australia</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/28/australian-politics-live-usman-khawaja-gambling-ads-anthony-albanese-sussan-ley-labor-coalition-question-time-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li></ul><p>Refugee and human rights groups will launch a campaign demanding the federal government scrap a controversial migration amendment to explicitly remove procedural fairness in deportation decisions for foreign-born criminals, a proposal which advocates say is causing alarm among migrants.</p><p>The Senate on Thursday rejected a Greens push for an inquiry into the legislation, which the senator David Shoebridge slammed as “one of the nastiest, meanest attacks” on multicultural Australia.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/28/labor-accused-of-trying-to-sneak-through-law-change-to-strip-non-citizens-of-fair-process\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Lehrmann demands access to Facebook messages Network 10 defamation case solicitor allegedly sent to rape victim",
      "link": "https://www.theguardian.com/australia-news/2025/aug/28/lehrmann-demands-access-to-facebook-messages-network-10-defamation-case-solicitor-allegedly-sent-to-victim-ntwnfb",
      "pub_time_taipei": "2025-08-28T17:05:37+08:00",
      "summary": "<p>Lehrmann’s solicitor Zali Burrows claims alleged victim was sent messages by lead solicitor in Network 10’s defence against an unrelated defamation case</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Bruce Lehrmann will demand access to Facebook messages his legal team claims were sent by a Network 10 solicitor to the alleged victim in his rape case.</p><p>Lehrmann, who is on bail and yet to formally enter a plea, is accused of raping a woman twice during the morning of 10 October 2021.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/28/lehrmann-demands-access-to-facebook-messages-network-10-defamation-case-solicitor-allegedly-sent-to-victim-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Controversial domestic violence laws pass Queensland parliament as experts warn they could be weaponised against victims",
      "link": "https://www.theguardian.com/australia-news/2025/aug/28/queensland-mps-vote-on-controversial-plan-to-give-police-power-to-issue-on-the-spot-domestic-violence-orders",
      "pub_time_taipei": "2025-08-28T16:43:26+08:00",
      "summary": "<p>Police to have power to issue ‘on-the-spot’ DV orders despite experts and advocacy groups warning victims could be misidentified as perpetrators</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/28/australian-politics-live-usman-khawaja-gambling-ads-anthony-albanese-sussan-ley-labor-coalition-question-time-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Queensland parliament has passed controversial legislation permitting police to issue on-the-spot domestic violence orders despite warnings from experts and advocacy group that the laws could be weaponised against victim-survivors.</p><p>Liberal National party members of state parliament voted to pass legislation granting police the power to issue “police protection directives”, with conditions similar to other domestic violence protection orders.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/28/queensland-mps-vote-on-controversial-plan-to-give-police-power-to-issue-on-the-spot-domestic-violence-orders\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Iran faces return of sweeping sanctions from UK, France and Germany",
      "link": "https://www.theguardian.com/world/2025/aug/28/iran-return-sanctions-uk-france-germany",
      "pub_time_taipei": "2025-08-28T14:52:57+08:00",
      "summary": "<p>Decision by European powers follows Iran’s failure to readmit UN inspectors to all of its nuclear sites</p><p>The UK, France and Germany are expected to announce on Thursday that they will reimpose sweeping sanctions on Iran for failing to readmit UN inspectors into all of its nuclear sites.</p><p>The decision, under consideration for months, is likely to provoke the worst crisis in Iran’s relations with the west since Israel’s <a href=\"https://www.theguardian.com/world/2025/jun/21/israel-and-iran-launch-new-attacks-as-tehran-says-it-will-not-negotiate-nuclear-programme-while-under-threat\">attacks on the country’s nuclear sites</a> in June. Iran is already preparing countermeasures.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/iran-return-sanctions-uk-france-germany\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Malawi set to run out of TB drugs in a month after US, UK and others cut aid",
      "link": "https://www.theguardian.com/global-development/2025/aug/28/health-malawi-tuberculosis-tb-drugs-shortages-poverty-aid-cuts-who",
      "pub_time_taipei": "2025-08-28T14:00:25+08:00",
      "summary": "<p>Gains in cutting deaths from tuberculosis at risk as health officials warn clinics forced to ration drugs and testing</p><p>Malawi is facing a critical shortage of tuberculosis drugs, with health officials warning that stocks will run out by the end of September.</p><p>It comes just months after the World Health Organization (WHO) revealed that the country had <a href=\"https://www.afro.who.int/news/african-region-records-further-decline-tb-deaths-cases\">successfully reduced tuberculosis (TB) cases by 40%</a> over the past decade.</p> <a href=\"https://www.theguardian.com/global-development/2025/aug/28/health-malawi-tuberculosis-tb-drugs-shortages-poverty-aid-cuts-who\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Putin and Kim to join Xi at Chinese military parade in show of defiance to the west",
      "link": "https://www.theguardian.com/world/2025/aug/28/vladimir-putin-kim-jong-un-join-president-xi-chinese-military-parade-defiance-to-west",
      "pub_time_taipei": "2025-08-28T12:49:05+08:00",
      "summary": "<p>The Victory Day parade in Beijing on 3 September will mark the formal surrender of Japan during the second world war. No western leaders will attend</p><p>Vladimir Putin and Kim Jong-un are among the world leaders who will attend a military parade with President Xi Jinping in Beijing next week, in a show of collective defiance amid western pressure.</p><p>No western leaders will be among the 26 foreign heads of state and government attending the parade next week – with the exception of Robert Fico, prime minister of Slovakia, a member of the European Union – according to the Chinese foreign ministry.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/vladimir-putin-kim-jong-un-join-president-xi-chinese-military-parade-defiance-to-west\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ontario premier Doug Ford’s party spent nearly $300,000 on novelty ‘Canada is not for sale’ hats",
      "link": "https://www.theguardian.com/world/2025/aug/28/ontario-premier-doug-ford-spent-six-figures-canada-not-for-sale-hats",
      "pub_time_taipei": "2025-08-28T07:49:07+08:00",
      "summary": "<p>The Progressive Conservative party of Ontario reportedly paid C$278,910.71 on the viral hats during the province’s election campaign</p><p>Dealing with the unprecedented threats from Donald Trump’s threats to Canada’s economy and sovereignty have required unconventional strategies from federal and provincial leaders, including barring liquor sales and cancelling contracts with Tesla.</p><p>But among the more unorthodox strategies to <a href=\"https://www.theguardian.com/world/2025/aug/22/canada-counter-tariffs-trump\">hit back against the US</a> is spending hundreds of thousands of dollars on novelty hats.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/ontario-premier-doug-ford-spent-six-figures-canada-not-for-sale-hats\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Japanese town wants residents to limit smartphone use to two hours a day",
      "link": "https://www.theguardian.com/world/2025/aug/28/japanese-town-toyoake-proposes-smartphone-limit-residents-two-hours-day",
      "pub_time_taipei": "2025-08-28T07:30:16+08:00",
      "summary": "<p>Draft ordinance in Toyoake has triggered a backlash from locals, with some calling it an attack on individual freedom</p><p>A town in <a href=\"https://www.theguardian.com/world/japan\">Japan</a> is to urge all residents to restrict their smartphone use to two hours a day in an attempt to tackle online addiction and sleep deprivation.</p><p>Officials in Toyoake, Aichi prefecture, said the measure would target not only children but also adults, amid <a href=\"https://www.theguardian.com/society/2025/jun/18/teenagers-social-media-mobile-phones-video-games-mental-health\">growing concern about the physical and psychological toll excessive smartphone use</a> is taking on people of all ages.</p> <a href=\"https://www.theguardian.com/world/2025/aug/28/japanese-town-toyoake-proposes-smartphone-limit-residents-two-hours-day\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tony Blair attends White House meeting with Trump on postwar Gaza",
      "link": "https://www.theguardian.com/politics/2025/aug/27/tony-blair-attends-white-house-meeting-with-trump-on-postwar-gaza",
      "pub_time_taipei": "2025-08-28T06:28:59+08:00",
      "summary": "<p>Former prime minister in Washington DC on Wednesday for talks that reportedly also included Jared Kushner</p><p>The former British prime minister Tony Blair has attended a White House meeting with Donald Trump to discuss plans for postwar Gaza, the Guardian understands.</p><p>After stepping down as prime minister in 2007, Blair took on <a href=\"https://www.theguardian.com/politics/2015/may/27/tony-blair-resigns-as-middle-east-peace-envoy-report\">the role of Middle East envoy until 2015</a> and spent time in Jerusalem trying to formulate a plan for a two-state solution.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/27/tony-blair-attends-white-house-meeting-with-trump-on-postwar-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "How hard will Trump’s 50% tariff hit India, and what is Delhi doing about it?",
      "link": "https://www.theguardian.com/us-news/2025/aug/27/trump-50-percent-tariff-india-explainer",
      "pub_time_taipei": "2025-08-28T01:57:58+08:00",
      "summary": "<p>Likened to a ‘trade embargo’ and an ‘earthquake’, it could cut exports from affected sectors by as much as 70%</p><p>Donald Trump’s tariffs of 50% <a href=\"https://www.theguardian.com/us-news/2025/aug/27/trump-tariff-india-russian-oil-purchase\">have come into force on most US imports from India</a>. The US president followed through on his threat to punish one of the world’s largest economies for its purchases of discounted Russian oil.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/27/trump-50-percent-tariff-india-explainer\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pope demands ‘collective punishment’ end in Gaza as 10 more die of hunger",
      "link": "https://www.theguardian.com/world/2025/aug/27/ten-palestinians-have-died-from-starvation-in-last-24-hours-says-gaza-health-ministry",
      "pub_time_taipei": "2025-08-28T01:27:37+08:00",
      "summary": "<p>Latest deaths announced by Gaza health ministry bring starvation toll to 313, including 119 children</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/aug/27/children-make-up-third-of-outpatients-in-msf-hospitals-in-gaza-statistics-show\">Children make up a third of outpatients treated for wounds at MSF Gaza hospitals, data shows</a></p></li></ul><p>Ten Palestinians including two children have died from starvation in the last 24 hours, health authorities in Gaza said on Wednesday, as Pope Leo XIV demanded that Israel stop its “collective punishment” of the population in the besieged territory.</p><p>At least 313 people have died from hunger, including 119 children, since the war in Gaza began and Israel intensified its siege on the Palestinian territory. Last week a UN-backed monitoring body <a href=\"https://www.theguardian.com/world/2025/aug/22/ipc-declares-famine-gaza-city\">confirmed</a> that Gaza was in the throes of famine and warned that without more aid, increasing numbers of people would lose access to food.</p> <a href=\"https://www.theguardian.com/world/2025/aug/27/ten-palestinians-have-died-from-starvation-in-last-24-hours-says-gaza-health-ministry\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Macron backs Bayrou and calls on budget critics to show responsibility",
      "link": "https://www.theguardian.com/world/2025/aug/27/emmanuel-macron-backs-francois-bayrou-france",
      "pub_time_taipei": "2025-08-28T01:09:21+08:00",
      "summary": "<p>Spokesperson says government in ‘fighting spirit’ after PM called confidence vote he is expected to lose</p><p>Emmanuel Macron has given his “full support” to France’s beleaguered prime minister, François Bayrou, who is <a href=\"https://www.theguardian.com/world/2025/aug/26/france-political-crisis-francois-bayrou-prime-minister\">expected to lose a confidence vote</a> next month, which would be likely to cause the government to collapse.</p><p>Macron chaired a cabinet meeting on Wednesday as France faces a <a href=\"https://www.theguardian.com/world/2025/aug/27/french-prime-ministers-confidence-vote-and-its-possible-consequences\">fresh political crisis</a>. The government spokesperson, Sophie Primas, said after the meeting that Macron fully supported Bayrou and the government was in a “fighting spirit”.</p> <a href=\"https://www.theguardian.com/world/2025/aug/27/emmanuel-macron-backs-francois-bayrou-france\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Return of UN nuclear inspectors to Iran met with protests by MPs",
      "link": "https://www.theguardian.com/world/2025/aug/27/return-of-un-nuclear-inspectors-to-iran-met-with-protests-by-mps",
      "pub_time_taipei": "2025-08-28T00:21:33+08:00",
      "summary": "<p>Some Iranian officials say readmission breaches law passed after Israel and the US attacked the country in June</p><p>The partial return of UN inspectors to Iran for the first time since Israel and the US attacked Iran’s nuclear sites has been met with protests by officials in Tehran, who claim the strict preconditions they set have been breached. Some even described the return as criminal.</p><p>Abbas Araghchi, Iran’s foreign minister, tried to quell the backlash by saying the inspectors from the International Atomic Energy Agency (IAEA) would not be visiting any of the bombed sites and that discussions about these were still to be had.</p> <a href=\"https://www.theguardian.com/world/2025/aug/27/return-of-un-nuclear-inspectors-to-iran-met-with-protests-by-mps\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Middle East crisis: Israeli military carries out raid in West Bank city of Nablus – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
      "pub_time_taipei": "2025-08-28T00:07:24+08:00",
      "summary": "<p>Soldiers and armoured vehicles enter city in northern occupied West Bank, confirms Israeli military, as residents say soldiers are searching houses</p><p>Al Jazeera reports that the <strong>prime minister of Belgium</strong> has begun a meeting with his deputies on the topic of <strong>recognising the state of Palestine.</strong></p><p><strong>Bart De Wever</strong> said in a statement yesterday that it does not make sense to recognise the Palestinian state unless certain conditions are satisfied.</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Old master painting looted by Nazis disappears from home in Argentina",
      "link": "https://www.theguardian.com/world/2025/aug/27/old-master-painting-looted-by-nazis-disappears-from-home-in-argentina",
      "pub_time_taipei": "2025-08-27T22:50:32+08:00",
      "summary": "<p>Search for artwork seen in estate agent’s photo continues after police raid on house finds tapestry hanging in its place</p><p>Argentinian police have said they will continue hunting for an old master painting looted by the Nazis and <a href=\"https://www.theguardian.com/world/2025/aug/26/old-master-painting-giuseppe-ghislandi-looted-by-nazis-argentina-property-listing\">spotted by chance in an estate agent’s listing</a> after a search of the property in the seaside town of Mar del Plata failed to uncover the work.</p><p>“The painting is not in the house … but we’re going to keep searching for it,” the federal prosecutor Carlos Martínez <a href=\"https://www.lacapital.com.ar/informacion-general/descubren-una-casa-mar-del-plata-un-cuadro-robado-el-nazismo-n10215239.html\">told local media</a>. He said items that could be useful for the investigation, including two firearms, engravings and prints, had been seized.</p> <a href=\"https://www.theguardian.com/world/2025/aug/27/old-master-painting-looted-by-nazis-disappears-from-home-in-argentina\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "A third of outpatients treated for wounds at MSF’s Gaza hospitals in 2024 were children, figures show",
      "link": "https://www.theguardian.com/world/2025/aug/27/children-make-up-third-of-outpatients-in-msf-hospitals-in-gaza-statistics-show",
      "pub_time_taipei": "2025-08-27T22:03:11+08:00",
      "summary": "<p>Explosive weapons designed to be used in battle are being used in urban areas, says Médecins Sans Frontières</p><p></p><p>Children under 15 years old made up almost a third of outpatients treated for wounds in field hospitals run by Médecins Sans Frontières (MSF) in <a href=\"https://www.theguardian.com/world/gaza\">Gaza</a> last year, statistics published in The Lancet reveal.</p><p>The figures were released by MSF in correspondence <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(25)01386-8/fulltext#tbl1\">with the respected medical journal</a> and come from six health facilities in Gaza supported by the international medical NGO. The facilities are predominantly in the south and centre of the devastated territory.</p> <a href=\"https://www.theguardian.com/world/2025/aug/27/children-make-up-third-of-outpatients-in-msf-hospitals-in-gaza-statistics-show\">Continue reading...</a>"
    }
  ]
}