{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-26T20:40:03.618970+08:00",
  "window_end_taipei": "2025-09-27T20:40:03.618970+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Labour conference chance to show alternative to ‘toxic divide and decline’ offered by Reform, says Starmer – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/27/railway-operators-trains-public-ownership-labour-party-conference-uk-politics-live-latest-news",
      "pub_time_taipei": "2025-09-27T20:34:42+08:00",
      "summary": "<p>Labour party conference ‘really big opportunity to make our case to the country’, says PM</p><p>Hundreds of thousands more children are to receive a free breakfast through a government scheme, <strong>Bridget Phillipson</strong> has announced.</p><p>On Saturday, education secretary, said that 500,000 more children across <strong>England</strong> will soon benefit from the government’s role out of free breakfast clubs</p><p>The start of the national rollout of free breakfast clubs will be an historic change in working families’ daily routines and is another example of this Labour government making good on its promises to deliver the change the British people voted for.</p><p>This is Labour choosing a path of renewal towards a fairer country – breaking down the barriers to opportunity and ensuring every child starts school ready to learn.</p><p>I have worked hard as a councillor for Langside for the past three years to build a better community and now I can’t wait to be the voice of change across our great communities in the constituency.</p><p>As your candidate for Glasgow Southside, I will always put people and planet before corporate greed, I will fight back against the millionaires who are pushing racist anti-migrant narratives and I will call out the horrific genocide in Gaza.</p><p>Since then, she’s been a great voice for the local community and I have no doubt that she’ll be a fantastic candidate for the constituency.</p><p>Green support in Glasgow Southside has been growing steadily in recent years and we’re looking forward to the campaign for Holyrood, in Southside, across Glasgow and throughout the country.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/27/railway-operators-trains-public-ownership-labour-party-conference-uk-politics-live-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "State department appoints official to handle case of American-Palestinian teen detained by Israel",
      "link": "https://www.theguardian.com/world/2025/sep/27/mohammed-ibrahim-case-state-department",
      "pub_time_taipei": "2025-09-27T20:29:47+08:00",
      "summary": "<p>Moves marks escalation in diplomatic efforts in case of Mohammed Ibrahim, 16, who is being held in an Israeli military prison</p><p>The US state department is appointing a dedicated official to handle the case of Mohammed Ibrahim, a 16-year-old dual American-Palestinian citizen who has been held in an Israeli military prison for more than seven months.</p><p>Ibrahim is scheduled to meet with the new state department point person next week, marking an escalation in diplomatic efforts surrounding the Florida teenager’s imprisonment at the Ofer military prison in the Israeli-occupied West Bank.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/mohammed-ibrahim-case-state-department\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Education unions urge Keir Starmer to scrap ‘cruel’ two-child benefit cap",
      "link": "https://www.theguardian.com/politics/2025/sep/27/education-unions-urge-keir-starmer-scrap-cruel-two-child-benefit-cap",
      "pub_time_taipei": "2025-09-27T20:23:06+08:00",
      "summary": "<p>A letter to the prime minister on the eve of the Labour conference warns of ‘critical need’ to abandon the policy</p><p>Teaching unions have written to the prime minister asking him to scrap the two-child benefit cap ahead of Labour’s annual conference, which begins in Liverpool on Sunday.</p><p>In a letter to Keir Starmer, the unions described the policy as “cruel” and said it must be fully abandoned as part of the government’s delayed child poverty strategy, expected to be published before Christmas.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/27/education-unions-urge-keir-starmer-scrap-cruel-two-child-benefit-cap\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Polish climber makes history skiing down Everest without bottled oxygen",
      "link": "https://www.theguardian.com/sport/2025/sep/27/skier-makes-history-skiing-down-everest-without-bottled-oxygen",
      "pub_time_taipei": "2025-09-27T19:58:27+08:00",
      "summary": "<p>Poland’s PM hails Andrzej Bargiel’s completion of the challenge after two previous failed attempts</p><p>A Polish adventure skier has made history by becoming the first person to climb up and ski down Mount Everest without the use of additional oxygen.</p><p>The ascent was Andrzej Bargiel’s third attempt at climbing Everest – the tallest mountain on earth at 8,849 metres (29,032ft) high – after dangerous conditions forced the 37-year-old to abandon earlier attempts in 2019 and 2022.</p> <a href=\"https://www.theguardian.com/sport/2025/sep/27/skier-makes-history-skiing-down-everest-without-bottled-oxygen\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Denmark reports new drone sightings over its biggest military base",
      "link": "https://www.theguardian.com/world/2025/sep/27/denmark-new-drone-sightings-biggest-military-base",
      "pub_time_taipei": "2025-09-27T19:08:02+08:00",
      "summary": "<p>Unidentified drones spotted at several military sites including the Karup airbase on Friday night </p><p>Unidentified drones flew over Danish military sites including its biggest base during Friday night, the latest in a slew of sightings officials have called a “hybrid attack” and hinted at possible Russian involvement.</p><p>Drones were spotted at several military sites, a Danish military spokesperson told Agence France-Presse, refusing to provide other details.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/denmark-new-drone-sightings-biggest-military-base\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump brags of ‘massive’ oil deal in Pakistan – but drilling has not found any",
      "link": "https://www.theguardian.com/world/2025/sep/27/pakistan-us-oil-deal-analysis-trump",
      "pub_time_taipei": "2025-09-27T19:00:42+08:00",
      "summary": "<p>Announcement of deal baffles experts and former ministers, who say there is no sign of any untapped reserves</p><p>The newfound camaraderie between the US and Pakistan was on full display this week as Donald Trump welcomed Pakistan’s prime minister, Shehbaz Sharif, and the country’s powerful army chief, Asim Munir, into the Oval Office, heralding them both as “great leaders”.</p><p>Having been cold-shouldered by successive US presidents, this was the first time a Pakistani prime minister had been invited to Washington in more than six years. It was also the unprecedented second time this year that Munir – who holds no official government role – held an intimate meeting with Trump, which many took as a telling signal of where the power to cut deals really lies in Pakistan.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/pakistan-us-oil-deal-analysis-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kamala Harris’s new book details her steep challenges without acknowledging her failures",
      "link": "https://www.theguardian.com/us-news/2025/sep/27/amala-harris-107-days-analysis-biden-walz",
      "pub_time_taipei": "2025-09-27T19:00:42+08:00",
      "summary": "<p>In 107 Days, Harris leaves little room for nuance – nor is she afflicted with a surplus of self-awareness</p><p><a href=\"https://www.theguardian.com/us-news/kamala-harris\">Kamala Harris’s</a> book <a href=\"https://www.theguardian.com/us-news/2025/sep/18/kamala-harris-book-tim-walz\">107 Days</a> confirms two truths: Joe Biden never should have sought re-election and she did not belong on a national ticket.</p><p>Biden was snared by Father Time and hubris. The 46th president was not the transformational figure he saw in the mirror. <a href=\"https://news.gallup.com/poll/654878/americans-think-history-rate-biden-presidency-negatively.aspx\">More than half</a> the US rated him a failure.</p><p>107 Days <a href=\"https://bookshop.org/p/books/untitled-s-s-nf-to-be-confirmed-simon-schuster/577e0cf201a3828c?ean=9781668211656&amp;next=t\">is published</a> in the US by Simon &amp; Schuster</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/27/amala-harris-107-days-analysis-biden-walz\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labour seeks ‘ambitious’ youth mobility scheme with EU",
      "link": "https://www.theguardian.com/world/2025/sep/27/labour-seeks-youth-mobility-scheme-with-eu",
      "pub_time_taipei": "2025-09-27T18:38:01+08:00",
      "summary": "<p>Chancellor says plan would allow thousands of young Europeans to temporarily live and work in UK, and vice versa</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/27/railway-operators-trains-public-ownership-labour-party-conference-uk-politics-live-latest-news\">UK politics live – latest updates</a></p></li></ul><p>Labour will seek an “ambitious” youth mobility scheme with the EU, allowing thousands of young Europeans to temporarily live and work in the UK, Rachel Reeves has said.</p><p>The chancellor told <a href=\"https://www.thetimes.com/uk/politics/article/uk-needs-ambitious-eu-youth-migration-deal-says-rachel-reeves-ctb7fv5mg\">the Times</a> the scheme would be “good for the economy, good for growth and good for business”, but stopped short of specifying who would be eligible.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/labour-seeks-youth-mobility-scheme-with-eu\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two women die trying to cross Channel from France",
      "link": "https://www.theguardian.com/world/2025/sep/27/people-die-trying-cross-channel-from-france",
      "pub_time_taipei": "2025-09-27T18:35:22+08:00",
      "summary": "<p>French authorities say about 100 people were attempting to reach the UK on a makeshift boat</p><p>Two women have died while trying to cross the Channel to Britain, French authorities said.</p><p>The incident occurred south of the beaches of Neufchâtel-Hardelot, where about 100 people were trying to get to the UK on a makeshift boat.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/people-die-trying-cross-channel-from-france\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli strikes kill at least 32 people as military continues Gaza City attack",
      "link": "https://www.theguardian.com/world/2025/sep/27/israeli-strikes-kill-people-gaza-city-attack",
      "pub_time_taipei": "2025-09-27T18:20:35+08:00",
      "summary": "<p>Health officials report 25 dead in the strip’s largest city, where hundreds of thousands are trapped and starving</p><p>Israeli strikes killed at least 32 people in Gaza overnight, according to health officials in the territory, including 25 people in Gaza City.</p><p>The Israeli military continues to press ahead with an attack on the strip’s largest city, where hundreds of thousands of Palestinians are trapped and starving, despite international pressure for a ceasefire.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/israeli-strikes-kill-people-gaza-city-attack\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "State Department revokes visa for Colombian President Gustavo Petro",
      "link": "https://www.washingtonpost.com/world/2025/09/27/gustavo-petro-colombia-visa-gaza/",
      "pub_time_taipei": "2025-09-27T18:06:23+08:00",
      "summary": "The State Department accused Petro of urging U.S. soldiers to disobey orders in remarks at a pro-Palestinian rally in New York."
    },
    {
      "source": "衛報",
      "title": "FCA faces battle over £1m ad campaign rejecting car loan claims firms",
      "link": "https://www.theguardian.com/business/2025/sep/27/fca-faces-battle-over-1m-ad-campaign-rejecting-car-loan-claims-firms",
      "pub_time_taipei": "2025-09-27T18:00:43+08:00",
      "summary": "<p>City watchdog aims to tell drivers they will not need to use companies to apply for share of £18bn compensation scheme</p><p>The City regulator is facing a battle with claims companies over a £1m advertising campaign designed to discourage drivers from using their services to get payouts over the <a href=\"https://www.theguardian.com/law/2025/aug/01/car-loan-scandal-what-the-supreme-court-ruling-means-for-drivers-and-the-uk-economy\">car loan scandal</a>.</p><p>The Financial Conduct Authority (FCA) announced this month that it would roll out a series of online and radio adverts, telling drivers they will not need to use claims management companies (CMCs) or law firms to apply for their share of the regulator’s proposed £18bn compensation scheme.</p> <a href=\"https://www.theguardian.com/business/2025/sep/27/fca-faces-battle-over-1m-ad-campaign-rejecting-car-loan-claims-firms\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Hell on earth’: immigrants held in new California detention facility beg for help",
      "link": "https://www.theguardian.com/us-news/2025/sep/27/immigrants-california-detention-facility",
      "pub_time_taipei": "2025-09-27T18:00:43+08:00",
      "summary": "<p>Six people at a remote Ice facility in California City describe medical problems and filthy conditions, which operator CoreCivic denies</p><p>Immigrants locked up in California’s newest federal detention center have described the facility as a “a torture chamber”, “a zoo” and “hell on earth”, saying they were confined in filthy cells and suffered medical crises without help.</p><p>Six people detained at the California City detention center, which opened in late August and is now the state’s largest Immigration and Customs Enforcement (Ice) detention center, shared accounts with the Guardian of poor conditions and alleged mistreatment by staff.</p><p>staff were not consistently giving people daily medications, and some detainees fell unconscious due to health issues;</p><p>some toilets and sinks were backed up or not functioning properly, creating a stench;</p><p>detainees were left to clean their own cells, but not given proper supplies;</p><p>detainees were confined to cells for hours, and when they were allowed outdoors, it was sometimes only for 30 minutes a day in a dusty area with nothing to do;</p><p>small food portions left people hungry, with some saying they rationed meals and feared the water they were drinking was dirty.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/27/immigrants-california-detention-facility\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kido nursery hackers threaten to publish more children’s profiles",
      "link": "https://www.theguardian.com/technology/2025/sep/26/kido-nursery-hackers-radiant-threaten-publish-children-profiles",
      "pub_time_taipei": "2025-09-27T17:22:33+08:00",
      "summary": "<p>Criminals calling themselves Radiant say they will post additional private data online unless they are paid</p><p>Hackers with pictures and the private information of thousands of nursery children have threatened to publish more material online unless they are paid.</p><p>Criminals calling themselves Radiant hacked the UK-based Kido nursery chain and <a href=\"https://www.theguardian.com/technology/2025/sep/25/cybercriminals-steal-pictures-and-details-of-8000-children-from-nursery-chain\">posted profiles of 10 children online</a> on Thursday. Their website on the dark web has posted a “data leakage roadmap” that sets out how the “next steps for us will be to release 30 more profiles of each child and 100 employees’ private data”.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/26/kido-nursery-hackers-radiant-threaten-publish-children-profiles\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New York man charged with parents’ murders after TV confession",
      "link": "https://www.theguardian.com/us-news/2025/sep/27/new-york-man-murder-confession-tv-news",
      "pub_time_taipei": "2025-09-27T17:00:39+08:00",
      "summary": "<p>Lorenz Kraus, 53, tells WRGB in Albany he killed elderly parents as act of mercy and buried bodies in back yard</p><p>A man confessed to killing his parents and then burying them in their back yard during a recent interview with a local television news channel in upstate <a href=\"https://www.theguardian.com/us-news/new-york\">New York</a>, leading authorities to charge him with two counts of murder.</p><p>Lorenz Kraus’s remarkable interview with WRGB aired pn Thursday, shortly after police discovered two bodies at his family’s home in Albany – and about eight years after his parents were last seen alive before apparently vanishing without a trace.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/27/new-york-man-murder-confession-tv-news\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "NBA basketball was huge in China. The league is hoping for a rebound.",
      "link": "https://www.washingtonpost.com/world/2025/09/26/nba-returns-china/",
      "pub_time_taipei": "2025-09-27T17:00:00+08:00",
      "summary": "The Brooklyn Nets and Phoenix Suns will play the first games in the lucrative Chinese market since the Houston Rockets controversy of 2019."
    },
    {
      "source": "衛報",
      "title": "Keir Starmer to warn Labour that battle with Reform is ‘fight for soul of the nation’",
      "link": "https://www.theguardian.com/politics/2025/sep/26/keir-starmer-warn-labour-battle-reform-fight-soul-nation",
      "pub_time_taipei": "2025-09-27T16:10:05+08:00",
      "summary": "<p>Exclusive: PM says history will not forgive his government if it fails to confront and defeat the populist right  </p><p>Keir Starmer will warn the Labour party that it is in a “fight for the soul of the nation” and that history will not forgive his government if it fails to confront and defeat Reform UK and the populist right.</p><p>Speaking to the Guardian ahead of a vital conference for his leadership, he said he would tell disgruntled party members that now was “not the time for introspection” and infighting.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/26/keir-starmer-warn-labour-battle-reform-fight-soul-nation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Moldovan diaspora critical in elections as country battles Russian vote-buying, says former minister",
      "link": "https://www.theguardian.com/world/2025/sep/27/moldova-diaspora-critical-in-elections-as-country-battles-russian-vote-buying-says-former-minister",
      "pub_time_taipei": "2025-09-27T16:00:37+08:00",
      "summary": "<p>Watchdogs say Russia offering overseas voters cash for evidence of voter fraud in possible ploy to declare election rigged</p><p>The Moldovan diaspora will hold a critical role in Sunday’s high-stakes parliamentary elections as the country battles against an unprecedented Russian vote-buying operation to try to unseat the incumbent pro-European party, said the former deputy prime minister.</p><p>Civilian foreign interference watchdogs say Russia is flooding the overseas voter communities with cash, including one advertising campaign offering people<strong> </strong>€500 to be election observers in the EU with the lure of “bonuses of up to €30,000” for evidence of voter fraud.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/moldova-diaspora-critical-in-elections-as-country-battles-russian-vote-buying-says-former-minister\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘A donkey cart out of El Fasher costs more than a new car’: how 500 days under siege is tearing the city apart",
      "link": "https://www.theguardian.com/global-development/2025/sep/27/el-fasher-darfur-sudan-rsf-donkey-cart-costs-more-than-a-car",
      "pub_time_taipei": "2025-09-27T16:00:36+08:00",
      "summary": "<p>The ongoing attacks on North Darfur’s capital has left its people facing starvation, blockade and bombardment, with scant hope of relief</p><p><strong>Special report:</strong> <a href=\"https://www.theguardian.com/global-development/2025/sep/24/siege-sudan-city-el-fasher-rsf\"><strong>‘We will never, ever escape’: inside the ever-tightening siege of the Sudanese city of El Fashe</strong>r</a></p><p>For 17 months, since May 2024, El Fasher, North Darfur’s capital, has been trapped in one of <a href=\"https://www.theguardian.com/global-development/2025/sep/24/siege-sudan-city-el-fasher-rsf\">the longest urban sieges of modern warfare</a>, a slow war of attrition that recalls the destruction of Stalingrad and the starvation of Leningrad, combining both cruelties in a single city.</p><p>The siege, progressively <a href=\"https://news.un.org/en/story/2025/08/1165731\">tightened by the Rapid Support Forces (RSF)</a>, has transformed the city. Trenches cut through neighbourhoods. Civilians move block by block in search of safety, while self-defence groups fight alongside entrenched garrisons.</p> <a href=\"https://www.theguardian.com/global-development/2025/sep/27/el-fasher-darfur-sudan-rsf-donkey-cart-costs-more-than-a-car\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mother and baby whale trapped in shark net off Queensland’s Rainbow Beach",
      "link": "https://www.theguardian.com/australia-news/2025/sep/27/mother-and-baby-whale-trapped-in-shark-net-off-queenslands-rainbow-beach",
      "pub_time_taipei": "2025-09-27T14:03:18+08:00",
      "summary": "<p>The humpback whales, which were caught in a net 245km north of Brisbane, were among nine whale entanglements in past nine days </p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Two humpback whales, a mother and her calf, were entangled in a shark net off Queensland’s Rainbow Beach on Saturday, prompting urgent calls to rescue officials from members of the public.</p><p>The state’s Department of Primary Industries (DPI) said it heard reports of the entanglements just before 6am and members with the agency’s shark control program and marine animal release team (MART) were on the scene at Rainbow Beach, about 245km north of Brisbane, around 10.30am to start work on freeing the animals.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/27/mother-and-baby-whale-trapped-in-shark-net-off-queenslands-rainbow-beach\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "E.U. and Russia battle over Moldova’s future as elections loom",
      "link": "https://www.washingtonpost.com/world/2025/09/27/moldova-elections-eu-russia/",
      "pub_time_taipei": "2025-09-27T14:00:00+08:00",
      "summary": "Moldova’s parliamentary elections Sunday are attracting deep interest as the small nation’s fate is seen as key to Europe’s future."
    },
    {
      "source": "衛報",
      "title": "US revokes visa for Colombian president Gustavo Petro after ‘reckless’ actions in New York",
      "link": "https://www.theguardian.com/us-news/2025/sep/27/us-revokes-visa-for-colombian-president-gustavo-petro-after-reckless-actions-in-new-york",
      "pub_time_taipei": "2025-09-27T13:41:52+08:00",
      "summary": "<p>At a pro-Palestine protest, Petro urged US soldiers to ‘disobey Trump’s order’ and ‘not point their rifles at humanity’</p><p>The US state department said on Friday it would revoke the visa of <a href=\"https://www.theguardian.com/world/colombia\">Colombian</a> leftist president Gustavo Petro for his “incendiary actions” during a pro-Palestinian street protest in New York.</p><p>“Earlier today, Colombian president @petrogustavo stood on a NYC street and urged US soldiers to disobey orders and incite violence,” the state department said on X.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/27/us-revokes-visa-for-colombian-president-gustavo-petro-after-reckless-actions-in-new-york\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Don’t trust Trump’: how UK health experts are fighting back against a war on medicine",
      "link": "https://www.theguardian.com/news/ng-interactive/2025/sep/27/dont-trust-trump-how-uk-health-experts-fighting-back-war-medicine",
      "pub_time_taipei": "2025-09-27T13:00:38+08:00",
      "summary": "<p>Ministers and medical groups have acted quickly to limit fallout after US president made unproven link between paracetamol and autism</p><p>Wes Streeting, the UK health secretary, was in a government car heading back into central London from a flag-raising to mark the UK’s recognition of Palestine when he saw the <a href=\"https://www.theguardian.com/uk-news/2025/sep/22/london-flag-raising-at-embassy-marks-long-overdue-step-for-palestinians\">news</a>. “He was aghast,” an aide said. Streeting was reading on his phone that Donald Trump had just <a href=\"https://www.theguardian.com/us-news/2025/sep/22/trump-administration-autism-causes\">warned women</a> not to take Tylenol – known outside the US as paracetamol – during pregnancy.</p><p>The US president had alleged without evidence that the common painkiller caused autism in children. “Don’t take Tylenol,” Trump said about a drug also known as acetaminophen.</p> <a href=\"https://www.theguardian.com/news/ng-interactive/2025/sep/27/dont-trust-trump-how-uk-health-experts-fighting-back-war-medicine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gay Malaysian man rejected for Australian protection visa could face persecution over sexuality, tribunal says",
      "link": "https://www.theguardian.com/australia-news/2025/sep/27/gay-malaysian-man-rejected-for-australian-protection-visa-could-face-persecution-over-sexuality-tribunal-says",
      "pub_time_taipei": "2025-09-27T12:52:40+08:00",
      "summary": "<p>Home affairs to reconsider application after review finds man could be subject to physical harm, conversion practices and prosecution under sharia law</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australia’s home affairs department rejected a gay Malaysian man’s bid for a protection visa, saying he did not provide enough evidence that he was an LGBT person.</p><p>But the administrative review tribunal subsequently accepted the man is gay and could face persecution in Malaysia, sending the man’s visa application back to the department for reconsideration last month.</p><p>This article was amended on 27 September 2025 with the correct pronoun for administrative review tribunal member Li Luo.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/27/gay-malaysian-man-rejected-for-australian-protection-visa-could-face-persecution-over-sexuality-tribunal-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Clive Palmer ordered to pay $13m after claim of being ‘foreign investor’ in Australian mining project thrown out",
      "link": "https://www.theguardian.com/australia-news/2025/sep/27/clive-palmer-ordered-to-pay-13m-after-claim-of-being-foreign-investor-in-australian-mining-project-thrown-out",
      "pub_time_taipei": "2025-09-27T12:44:48+08:00",
      "summary": "<p>Attorney general says mining magnate is ‘not a foreign investor’ and is ‘not entitled to any benefits under Australia’s free trade and investment agreements’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Australian mining magnate Clive Palmer has been ordered to pay more than $13m after his claim of being a “foreign investor” was dismissed by an international tribunal after a dispute lasting more than a decade.</p><p>The permanent court of arbitration, established by international treaties, rejected Palmer’s claim as it had no jurisdiction over the dispute between a national government and one of its citizens, the attorney general, Michelle Rowland, said on Saturday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/27/clive-palmer-ordered-to-pay-13m-after-claim-of-being-foreign-investor-in-australian-mining-project-thrown-out\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Cradle Mountain tourist dies after walking group overwhelmed by extreme weather at national park",
      "link": "https://www.theguardian.com/australia-news/2025/sep/27/cradle-mountain-tourist-dies-after-walking-group-overwhelmed-by-extreme-weather-at-national-park",
      "pub_time_taipei": "2025-09-27T10:27:18+08:00",
      "summary": "<p>Tasmania police say four Chinese nationals were found by another group of walkers on Friday but one woman tragically died</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A tourist has died after her walking group faced sudden extreme weather conditions at Cradle Mountain national park in Tasmania on Friday.</p><p>Police on Saturday confirmed that one woman among the group of four Chinese nationals visiting the state had died but said the other three were in good condition.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/27/cradle-mountain-tourist-dies-after-walking-group-overwhelmed-by-extreme-weather-at-national-park\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump urges Microsoft to fire lawyer who ran investigation into attempt to overturn 2020 US election – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
      "pub_time_taipei": "2025-09-27T10:05:55+08:00",
      "summary": "<p>This blog is closed. Read more <a href=\"https://www.theguardian.com/us-news/2025/sep/26/james-comey-indictment-reaction\">here</a></p><p><strong>Well, the president is awake.</strong></p><p>Donald Trump has posted the following on his Truth Social social media network:</p><p>JAMES COMEY IS A DIRTY COP. MAKE AMERICA GREAT AGAIN!</p><p>Whether you like Corrupt James Comey or not, and I can’t imagine too many people liking him, HE LIED! It is not a complex lie, it’s a very simple, but IMPORTANT one. There is no way he can explain his way out of it. He is a Dirty Cop, and always has been, but he was just assigned a Crooked Joe Biden appointed Judge, so he’s off to a very good start. Nevertheless, words are words, and he wasn’t hedging or in dispute. He was very positive, there was no doubt in his mind about what he said, or meant by saying it. He left himself ZERO margin of error on a big and important answer to a question. He just got unexpectedly caught. James “Dirty Cop” Comey was a destroyer of lives. He knew exactly what he was saying, and that it was a very serious and far reaching lie for which a very big price must be paid! President DJT</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.N. to reimpose sanctions on Iran after weeks of failed diplomacy",
      "link": "https://www.washingtonpost.com/national-security/2025/09/26/iran-sanctions-witkoff-nuclear-un/",
      "pub_time_taipei": "2025-09-27T09:04:06+08:00",
      "summary": "Rebuffed by the Trump administration, Iran failed Friday in a last-ditch effort to prevent the “snapback” of global sanctions that were lifted as part of the 2015 nuclear deal."
    },
    {
      "source": "衛報",
      "title": "Dezi Freeman search has hit the one-month mark. How long might police continue the manhunt?",
      "link": "https://www.theguardian.com/australia-news/2025/sep/27/dezi-freeman-search-one-month-on-how-long-police-continue-manhunt-porepunkah-shooting-ntwnfb",
      "pub_time_taipei": "2025-09-27T08:00:28+08:00",
      "summary": "<p>Hunt for suspected Porepunkah shooter ‘cannot go on for infinitum’, one retired detective says. ‘It has to have a line in the sand somewhere’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>As the search for fugitive Dezi Freeman hits the one-month mark, questions are growing about when police may draw “a line in the sand” and call it quits.</p><p>The suspected Porepunkah police killer, also known as Desmond Filby, has been on the run since 26 August, when he <a href=\"https://www.theguardian.com/australia-news/2025/sep/10/victoria-police-condemns-release-of-footage-taken-when-alleged-porepunkah-killer-dezi-freeman-shot-two-officers-dead-ntwnfb\">allegedly shot and killed two officers</a> who were part of a group executing a search warrant at his residence in Victoria’s north-east.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/27/dezi-freeman-search-one-month-on-how-long-police-continue-manhunt-porepunkah-shooting-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Assata Shakur, Black Power militant who fled to Cuba, dies at 78",
      "link": "https://www.washingtonpost.com/obituaries/2025/09/26/assata-shakur-dead/",
      "pub_time_taipei": "2025-09-27T07:03:34+08:00",
      "summary": "Convicted of murdering a New Jersey state trooper, she escaped prison and fled the country. She called herself “a 20th-century escaped slave.”"
    },
    {
      "source": "華盛頓郵報",
      "title": "Netanyahu tells U.N. that war will continue amid global backlash",
      "link": "https://www.washingtonpost.com/national-security/2025/09/26/israel-netanyahu-un-speech-gaza/",
      "pub_time_taipei": "2025-09-27T06:13:56+08:00",
      "summary": "Benjamin Netanyahu castigated his “weak-kneed” critics and vowed to continue fighting Israel’s enemies until they are “gone” in a speech at the United Nations."
    },
    {
      "source": "華盛頓郵報",
      "title": "Canada Post to end home delivery; workers strike in protest",
      "link": "https://www.washingtonpost.com/world/2025/09/26/canada-post-home-delivery-strike/",
      "pub_time_taipei": "2025-09-27T04:28:13+08:00",
      "summary": "Canada Post is on pace to lose $1 billion this year, officials say. The Canadian Union of Postal Workers says it was blindsided by cost-cutting measures."
    },
    {
      "source": "華盛頓郵報",
      "title": "Eric Adams meets with Netanyahu amid mayoral race shaped by war in Gaza",
      "link": "https://www.washingtonpost.com/world/2025/09/26/eric-adams-benjamin-netanyahu-zohran-mamdani-united-nations/",
      "pub_time_taipei": "2025-09-27T03:39:32+08:00",
      "summary": "New York Mayor Eric Adams said he was “proud” to meet with Israeli Prime Minister Benjamin Netanyahu. His leading challenger has called for the Israeli leader’s arrest."
    },
    {
      "source": "衛報",
      "title": "Assata Shakur, an icon of Black liberation who was exiled to Cuba, dies aged 78",
      "link": "https://www.theguardian.com/us-news/2025/sep/26/assata-shakur-dies-aged-78",
      "pub_time_taipei": "2025-09-27T02:09:54+08:00",
      "summary": "<p>Shakur spent decades exiled after she was convicted of killing a state trooper in 1977 and escaped from prison</p><p>On 25 September, Assata Shakur, a former member of the Black Liberation Army, died aged 78 in Havana, Cuba, according to <a href=\"https://cubaminrex.cu/es/nota-de-prensa-del-ministerio-relaciones-exteriores\">Cuba’s Ministry of Foreign Affairs</a>. Cuban officials cited the reason for her death as old age and health conditions. Shakur, a longstanding symbol of resistance and Black liberation, spent several decades exiled in Cuba after she was convicted of killing a New Jersey state trooper in 1977 and escaped from prison.</p><p>“At approximately 1:15pm on September 25th, my mother, Assata Shakur, took her last earthly breath,” her daughter Kakuya Shakur wrote on <a href=\"https://www.facebook.com/kakuya/posts/pfbid02fi1n9xdApUzVmycCQF4HizBEhL4twDXZdxY5v7ii7v1JJUr6sdFBKvoJ1Ci71yEql\">Facebook</a>. “Words cannot describe the depth of loss that I’m feeling at this time.”</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/26/assata-shakur-dies-aged-78\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "World must deny Israel ‘tools of genocide’, says growing alliance of activist states",
      "link": "https://www.theguardian.com/world/2025/sep/26/world-must-deny-israel-tools-of-genocide-says-growing-alliance-of-activist-states",
      "pub_time_taipei": "2025-09-27T01:37:47+08:00",
      "summary": "<p>New York meeting of Hague Group warns of shared responsibility to prevent genocide and proposes steps to isolate Israel</p><p>The international community has a legal and moral duty to deny Israel “the tools of genocide”, the Malaysian foreign minister, Mohamad Hasan, said at a meeting in New York of the <a href=\"https://thehaguegroup.org/home/\">Hague Group</a>, the growing alliance of countries dedicated to coordinating practical economic and legal steps to isolate Israel over the war in Gaza.</p><p>The group, co-chaired by South Africa and Colombia, has become a central exchange for practical steps to try to pressure Israel, including stepping up collective action at ports and airports to prevent the transfer of weapons and goods to Israel, including dual-use heavy machinery.</p> <a href=\"https://www.theguardian.com/world/2025/sep/26/world-must-deny-israel-tools-of-genocide-says-growing-alliance-of-activist-states\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Canada postal workers strike after government orders end to door-to-door delivery",
      "link": "https://www.theguardian.com/world/2025/sep/26/canada-postal-workers-strike",
      "pub_time_taipei": "2025-09-27T00:49:57+08:00",
      "summary": "<p>Union says it’s ‘outraged and appalled’ by government’s order of sweeping changes to the national service</p><p>Postal workers in <a href=\"https://www.theguardian.com/world/canada\">Canada</a> have gone on strike after the government warned of an “existential crisis” and ordered sweeping changes to the national service – including an end to door-to-door delivery within the decade.</p><p>The union representing Canada Post employees described the proposed changes as “an attack” on its workers who have struggled to compete with a surge in private courier services.</p> <a href=\"https://www.theguardian.com/world/2025/sep/26/canada-postal-workers-strike\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Netanyahu tells UN that Israel ‘must finish the job’ in Gaza after dozens of delegates walk out in protest - as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live",
      "pub_time_taipei": "2025-09-27T00:12:40+08:00",
      "summary": "<p>Israeli PM rebuked Western nations for embracing Palestinian statehood after scores of delegates left the hall in protest. This live blog is closed</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/26/benjamin-netanyahu-un-speech-gaza\">Netanyahu vows to ‘finish job’ in Gaza during UN speech as delegates walk out</a></p></li></ul><p><strong>Palestinians</strong> living in poverty were also affected, the Palestinian prime minister’s spokesperson <strong>Mohammad Abu al-Rob</strong> told Agence France-Presse (AFP), with their numbers rising by more than 150% since the start of the <strong>Gaza</strong> war, and with cash assistance not paid out in more than two months.</p><p>An increase in the number of <strong>Israeli</strong> checkpoints in the <strong>West Bank</strong>, and a reduction in work permits for West Bank Palestinians seeking work inside Israel have had a drastic impact.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli loudspeakers broadcast Netanyahu’s speech to UN into Gaza",
      "link": "https://www.theguardian.com/world/2025/sep/26/israeli-loudspeakers-broadcast-netanyahu-speech-to-un-gaza",
      "pub_time_taipei": "2025-09-26T23:33:45+08:00",
      "summary": "<p>Operation prompts outrage as Israeli PM criticises western countries for recognising Palestine as a state and pledges to continue war</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/26/benjamin-netanyahu-un-speech-gaza\">Netanyahu vows to ‘finish job’ in Gaza during UN speech as delegates walk out</a></p></li></ul><p>Israeli military loudspeaker systems have broadcast Benjamin Netanyahu’s speech to the UN into Gaza in an unprecedented operation that immediately prompted controversy and outrage.</p><p>In a statement on Friday, an Israeli government spokesperson said: “As part of the public diplomacy effort, the prime minister’s office has directed civilian elements, in cooperation with the [Israel Defense Forces], to place loudspeakers on the backs of trucks on the Israeli side of the Gaza border so that Prime Minister Netanyahu’s historic UN general assembly speech will be heard in the Gaza Strip.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/26/israeli-loudspeakers-broadcast-netanyahu-speech-to-un-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ladakh statehood activist arrested days after violent crackdown by Modi",
      "link": "https://www.theguardian.com/world/2025/sep/26/activist-arrested-ladakh-crackdown-modi-sonam-wangchuk",
      "pub_time_taipei": "2025-09-26T23:25:54+08:00",
      "summary": "<p>Sonam Wangchuk, who has been agitating against the government, was on his way to speak at a press briefing</p><p>A renowned environmentalist at the forefront of a protest movement in the Indian region of Ladakh has been arrested amid a wider crackdown on dissent under the prime minister, Narendra Modi.</p><p>Sonam Wangchuk, an activist, engineer and inventor, has been leading a lengthy agitation against the Modi government, calling for statehood and greater protections to be granted to his home region of Ladakh. He was arrested on Friday afternoon, on his way to address a press conference.</p> <a href=\"https://www.theguardian.com/world/2025/sep/26/activist-arrested-ladakh-crackdown-modi-sonam-wangchuk\">Continue reading...</a>"
    }
  ]
}