{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-08T20:40:03.783559+08:00",
  "window_end_taipei": "2025-09-09T20:40:03.783559+08:00",
  "items": [
    {
      "source": "華盛頓郵報",
      "title": "Russian strike kills at least 23 in eastern Ukraine village",
      "link": "https://www.washingtonpost.com/world/2025/09/09/ukraine-russia-glide-bomb-yarova/",
      "pub_time_taipei": "2025-09-09T20:33:01+08:00",
      "summary": "Since June, Russia has attacked Ukrainian cities nightly, launching at times hundreds of attack drones and dozens of missiles, and killing hundreds of civilians."
    },
    {
      "source": "衛報",
      "title": "Lucy Powell to stand for Labour deputy leadership after reshuffle sacking – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/09/bridget-phillipson-labour-deputy-leader-uk-politics-latest-news-updates-keir-starmer",
      "pub_time_taipei": "2025-09-09T20:27:54+08:00",
      "summary": "<p>Former leader of the Commons joins Emily Thornberry, Bridget Phillipson and Bell Ribeiro-Addy in race</p><p><strong>Kemi Badenoch</strong> has just delivered a speech offering to help Labour with legislationg for welfare cuts. I will post key points soon.</p><p>She is now taking questions.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/09/bridget-phillipson-labour-deputy-leader-uk-politics-latest-news-updates-keir-starmer\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK ‘not concluded’ Israel committing genocide in Gaza, Lammy says",
      "link": "https://www.theguardian.com/world/2025/sep/09/uk-not-concluded-israel-committing-genocide-in-gaza-lammy-says",
      "pub_time_taipei": "2025-09-09T20:23:42+08:00",
      "summary": "<p>Government position set out in letter to select committee as No 10 prepares for visit by Israeli president</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news\">Middle East crisis – live updates</a></p></li></ul><p>The UK has<strong> </strong>not concluded that Israel is committing genocide in Gaza, nor that any of the British-made parts for F-35 jets sold to Israel have directly led to breaches of international humanitarian law, ministers have told parliament.</p><p>Ministers have also rejected calls for an independent audit of UK arms sales, but admitted they were not in a position to say if Israel’s assault in Gaza had led to any breaches of humanitarian law owing to the complexity of the fighting terrain.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/uk-not-concluded-israel-committing-genocide-in-gaza-lammy-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Birthday note apparently from Trump to Epstein branded ‘sickening’ – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news",
      "pub_time_taipei": "2025-09-09T20:21:43+08:00",
      "summary": "<p>White House officials seek to discredit note and claim Donald Trump signature is false</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/08/trump-epstein-birthday-letter\">House committee release picture of apparent Trump birthday note to Epstein</a></p></li></ul><p>We’ll hear from Donald Trump at <strong>4:30pm ET today</strong>, when he signs a proclamation in the Oval Office. The press will be permitted, and we can expect a series of questions: from fallout over his alleged Epstein “birthday book” contribution, to the ramping up of immigration enforcement in Chicago.</p><p>Before that, White House press secretary Karoline Leavitt will hold a briefing at <strong>1pm ET</strong>, where reporters will get an opportunity to probe the administration. We’ll bring you the latest as it happens.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bayrou heads to Élysée to hand in resignation as France’s PM – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
      "pub_time_taipei": "2025-09-09T20:16:57+08:00",
      "summary": "<p>Emmanuel Macron to name successor ‘within days’ as political crisis grips France</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/08/francois-bayrou-ousted-as-french-pm-after-losing-confidence-vote\">France to get third PM in a year</a></p></li></ul><p><strong>Lithuania</strong> has also said it will strengthen its borders with <strong>Belarus</strong> and <strong>Russia</strong> during the Zapad military exercise, the country’s border guard <a href=\"https://vsat.lrv.lt/lt/naujienos/pratybu-zapad-2025-metu-lietuvos-vsat-dar-labiau-sustiprins-sienos-apsauga-foto-CnG/\">said today.</a></p><p>The authorities said <strong>they would carry “even more active border monitoring, patrols, and other border control measures,”</strong> looking for any potential border violations and provocations against Lithuania.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Banksy mural of judge beating protester will be removed, London court says",
      "link": "https://www.washingtonpost.com/world/2025/09/09/banksy-mural-judge-gavel-london-palestine/",
      "pub_time_taipei": "2025-09-09T20:13:28+08:00",
      "summary": "The mural on the Royal Courts of Justice building in London appeared after a protest against the ban of a pro-Palestinian group where nearly 900 people were arrested."
    },
    {
      "source": "衛報",
      "title": "Israel’s expanded assault on Gaza City will endanger lives of ‘countless civilians’, charity warns – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
      "pub_time_taipei": "2025-09-09T20:10:21+08:00",
      "summary": "<p>Warning from ActionAid comes after Benjamin Netanyahu and the Israeli army told residents of Gaza City to leave </p><p><em>Dan Sabbagh is the Guardian’s defence and security editor</em></p><p>Fifty-one Israeli arms makers and the US defence giant behind the F-35 fighters used to bomb Gaza are among the 1,600 exhibitors at the biennial DSEI trade show that begins in London’s Docklands on Tuesday.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kerry Stokes ordered to pay Ben Roberts-Smith’s $13.5m legal costs after failed defamation suit",
      "link": "https://www.theguardian.com/australia-news/2025/sep/09/kerry-stokes-ordered-to-pay-ben-roberts-smiths-135m-legal-costs-after-failed-defamation-suit",
      "pub_time_taipei": "2025-09-09T19:52:30+08:00",
      "summary": "<p>Seven boss handed bill by federal court after backing the disgraced former soldier in action against Nine Newspapers</p><ul><li><p><strong>Get our </strong><a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\"><strong>breaking news email</strong></a><strong>, </strong><a href=\"https://app.adjust.com/w4u7jx3\"><strong>free app</strong></a><strong> or </strong><a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\"><strong>daily news podcast</strong></a></p></li></ul><p>Seven West Media’s chair, Kerry Stokes, has been ordered to pay $13.5m in legal costs to companies who were unsuccessfully sued for defamation by disgraced former soldier Ben Roberts-Smith.</p><p>On Tuesday, a federal court registrar ordered that Australian Capital Equity Pty Ltd (ACE), Stokes’ private company, pay costs fixed at almost $13.3m, and a further $225,000 in relation to the costs assessment, bringing the total bill to $13.5m.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/09/kerry-stokes-ordered-to-pay-ben-roberts-smiths-135m-legal-costs-after-failed-defamation-suit\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Nepal’s prime minister resigns after deadly protests over social media ban",
      "link": "https://www.washingtonpost.com/world/2025/09/09/nepal-social-media-protests-prime-minister-resigns/",
      "pub_time_taipei": "2025-09-09T19:30:13+08:00",
      "summary": "K.P. Sharma Oli stepped down hours after a ban on social media was overturned, amid demonstrations dubbed “Gen Z protests” due to the youth of many participants."
    },
    {
      "source": "衛報",
      "title": "Girl saved sister’s life by shielding her from Southport attacker, inquiry hears",
      "link": "https://www.theguardian.com/uk-news/2025/sep/09/girl-saved-sisters-life-by-shielding-her-from-southport-attacker-inquiry-hears",
      "pub_time_taipei": "2025-09-09T19:24:43+08:00",
      "summary": "<p>Mother tells how elder daughter was stabbed multiple times while protecting little sister in July 2024 attack</p><p>A “hero” girl saved her younger sister’s life by shielding her from the Southport attacker despite being stabbed in the chest and arm, the inquiry into the atrocity has heard.</p><p>The mother of the young siblings, who were both stabbed multiple times, said they showed “a level of bravery that no child should ever need to show” on 29 July last year.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/09/girl-saved-sisters-life-by-shielding-her-from-southport-attacker-inquiry-hears\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ethiopia inaugurates Africa’s largest hydroelectric dam as Egypt rift deepens",
      "link": "https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens",
      "pub_time_taipei": "2025-09-09T19:24:17+08:00",
      "summary": "<p>Ethiopian PM says dam will electrify entire region but Egypt fears it could restrict water supply during droughts</p><p>Ethiopia has officially inaugurated Africa’s largest hydroelectric dam, a project that will provide energy to millions of Ethiopians while deepening a rift with downstream Egypt that has unsettled the region.</p><p>Ethiopia, the continent’s second most populous nation with more than 120 million people, sees the $5bn (£3.7bn) Grand Ethiopian Renaissance dam (Gerd) on a tributary of the Nile River as central to its economic ambitions. The dam’s power has gradually increased since the first turbine was turned on in 2022, reaching its maximum capacity of 5,150MW on Tuesday. That puts it among the 20 biggest hydroelectric dams in the world – about one-quarter of the capacity of China’s Three Gorges dam.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/ethiopia-inaugurates-africa-largest-hydroelectric-dam-egypt-rift-deepens\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Burning on England’s deep peat banned",
      "link": "https://www.theguardian.com/uk-news/2025/sep/09/burning-on-englands-deep-peat-banned",
      "pub_time_taipei": "2025-09-09T19:14:58+08:00",
      "summary": "<p>New rules come into force from 30 September in order to restore habitats and reduce flooding</p><p>Burning on England’s deep peat will be banned in order to restore habitats for rare wildlife and reduce air pollution and flooding, the government has said.</p><p>England’s peatlands are in poor shape due to having been burned, intensively drained and used as grouse moors. They naturally act like a sponge, with layers of moss and other vegetation, and store vast amounts of carbon: an estimated 3.2bn tonnes in the UK alone.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/09/burning-on-englands-deep-peat-banned\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Alarm as WHO accepts increasing amount of dark money from corporate donors",
      "link": "https://www.theguardian.com/world/2025/sep/09/who-foundation-dark-money",
      "pub_time_taipei": "2025-09-09T19:00:23+08:00",
      "summary": "<p>Experts say millions in corporate funding and concealment of donors’ identities raises key conflict-of-interest concerns</p><p>The World Health Organization Foundation took an increasing amount of dark money from corporate donors during the three years since its 2020 inception, research has shown, raising concerns among some experts and campaigners that big business is playing a larger role shaping the institution’s policies.</p><p>Through the end of 2023, the last year for which records were available, the foundation had taken about $83m in corporate donations, and concealed the identity of donors for about 60% of the sum, a <a href=\"https://gh.bmj.com/content/10/7/e018932#ref-list-1\">new report</a> into the issue states.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/who-foundation-dark-money\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ed Miliband accused of subsidising ‘wasteful and dangerous’ electric SUVs",
      "link": "https://www.theguardian.com/environment/2025/sep/09/electric-suvs-subsidies-ed-miliband-climate-policy",
      "pub_time_taipei": "2025-09-09T19:00:22+08:00",
      "summary": "<p>MPs criticise ‘inconsistent’ climate policy that includes grants of up to £3,750 for ‘supersized status symbols’ </p><p>Ed Miliband has been accused by MPs of subsidising dangerous and polluting “supersized status symbols” as his department hands grants to people who buy electric SUVs.</p><p>The Labour government is giving discounts of up to £3,750 on new electric cars, but Guardian analysis reveals 12 of the 37 eligible models are SUVs.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/09/electric-suvs-subsidies-ed-miliband-climate-policy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel orders Gaza City residents to leave as military prepares to occupy city",
      "link": "https://www.theguardian.com/world/2025/sep/09/israel-orders-gaza-city-residents-to-leave-as-military-prepares-to-occupy-city",
      "pub_time_taipei": "2025-09-09T18:54:33+08:00",
      "summary": "<p>About 1 million people face being displaced again or risk staying as bombing worsens despite international outrage</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news\">Middle East crisis – live updates</a></p></li></ul><p>The Israeli military has issued an evacuation order covering the entirety of Gaza City for the first time during the current round of fighting, ahead of a planned offensive to take over and occupy the city.</p><p>The order on Tuesday caused a scramble in the densely populated city and placed the fate of its 1 million residents in limbo, as they decided whether to be displaced once again or stay amid intensifying Israeli bombing.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/israel-orders-gaza-city-residents-to-leave-as-military-prepares-to-occupy-city\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Lachlan finally has control of Murdoch empire but deal is a win for sibling rivals",
      "link": "https://www.theguardian.com/media/2025/sep/09/lachlan-control-murdoch-empire-but-deal-win-sibling-rivals",
      "pub_time_taipei": "2025-09-09T18:49:06+08:00",
      "summary": "<p>Eldest son has succession Rupert craved after agreement for much higher payout to his brother and sisters</p><p>As a keen rock climber, Lachlan Murdoch knows a thing or two about the importance of clinging on to perilous terrain. After the toughest ascent of his life – rising to the top of his father’s business empire – he has finally ensured that his place at its summit is assured.</p><p>The deal Rupert Murdoch’s eldest son <a href=\"https://www.theguardian.com/us-news/2025/sep/08/rupert-murdoch-lachlan-family-succession-deal\">has struck with his oldest siblings, Prudence, Elisabeth and James</a>, will mean they give up their shares in the family business, handing Lachlan the long-term control that he and his father craved.</p> <a href=\"https://www.theguardian.com/media/2025/sep/09/lachlan-control-murdoch-empire-but-deal-win-sibling-rivals\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Peru accused of violating human rights after government rejects reserve for uncontacted people",
      "link": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
      "pub_time_taipei": "2025-09-09T18:32:15+08:00",
      "summary": "<p>Campaigners shocked after ministers voted against the 1.2m-hectare Yavari Mirim reserve after 20 years of debate</p><p>Campaigners have accused the Peruvian government of violating international human rights law and putting lives at risk in the Amazon after it rejected a vast new territory to protect some of the world’s most isolated Indigenous communities.</p><p>After two decades of political debate, a government-led commission voted on Friday against creating the Yavari Mirim Indigenous reserve, a 1.2m-hectare (2.9m-acre) expanse of pristine rainforest along the border with Brazil. The tally was decisive: eight against, five in favour, with three members absent from the crucial vote.</p> <a href=\"https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brittany Higgins ordered to pay 80% of Linda Reynolds’ legal costs after defamation ruling",
      "link": "https://www.theguardian.com/law/2025/sep/09/brittany-higgins-ordered-to-pay-80-per-cent-of-linda-reynolds-legal-costs-after-defamation-ruling-ntwnfb",
      "pub_time_taipei": "2025-09-09T18:29:13+08:00",
      "summary": "<p>Total amount former Liberal staffer has been ordered to pay is not known but is expected to be in the order of hundreds of thousands of dollars</p><p>Brittany Higgins has been ordered to pay 80% of her former boss Linda Reynold’s legal costs from <a href=\"https://www.theguardian.com/australia-news/2025/aug/28/the-reynolds-v-higgins-defamation-ruling-concludes-a-protracted-legal-battle-but-when-will-the-saga-end-ntwnfb\">their high-profile defamation fight</a>.</p><p>Last month, Western Australian supreme court judge Paul Tottle ruled the former defence minister’s reputation was damaged by a 2022 social media post from Higgins’ partner David Sharaz, which Higgins responded to, and an Instagram story published by Higgins in July 2023.</p> <a href=\"https://www.theguardian.com/law/2025/sep/09/brittany-higgins-ordered-to-pay-80-per-cent-of-linda-reynolds-legal-costs-after-defamation-ruling-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Herald Sun failed to seek response from Victorian MP Sam Groth and wife before article that invaded privacy, court documents claim",
      "link": "https://www.theguardian.com/law/2025/sep/09/herald-sun-failed-to-seek-response-from-victorian-mp-sam-groth-and-wife-before-article-that-invaded-privacy-court-documents-claim",
      "pub_time_taipei": "2025-09-09T18:18:04+08:00",
      "summary": "<p>Groth and wife Brittany are suing a News Corp paper for defamation and breach of privacy over incorrect claims of inappropriate relationship</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Herald Sun failed to seek a response from Brittany Groth, the wife of Sam Groth, the Victorian Liberals deputy leader and former tennis star, before wrongly outing her as a victim of child sexual assault who was preyed upon by her now-husband when he was her coach, the couple allege in federal court documents.</p><p>The Herald and Weekly Times, along with reporter Stephen Drill, who wrote the articles, and his editor Sam Weir, are being sued in the federal court by Brittany Groth, in the first test of a new statutory tort for serious invasions of privacy, and by Sam Groth for defamation.</p> <a href=\"https://www.theguardian.com/law/2025/sep/09/herald-sun-failed-to-seek-response-from-victorian-mp-sam-groth-and-wife-before-article-that-invaded-privacy-court-documents-claim\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "University of Melbourne law professor’s allegedly racist emails were protected ‘political opinion’, court hears",
      "link": "https://www.theguardian.com/australia-news/2025/sep/09/university-of-melbourne-law-professor-eric-descheemaeker-emails-were-protected-political-opinion-court-hears-ntwnfb",
      "pub_time_taipei": "2025-09-09T18:02:24+08:00",
      "summary": "<p>Lawyer argues university’s move to fire Dr Eric Descheemaeker breached Fair Work Act and freedom of academic expression policy</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A law professor at the centre of a leaked email controversy says the University of Melbourne attempted to expel him over his political expression after it unearthed allegedly racist emails which included references to First Nations people.</p><p>Dr Eric Descheemaeker launched legal action against Australia’s top-ranked university over his proposed dismissal earlier this year, alleging he was suspended over his political opinion.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/09/university-of-melbourne-law-professor-eric-descheemaeker-emails-were-protected-political-opinion-court-hears-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nepal’s prime minister resigns after social media ban sparks deadly protests",
      "link": "https://www.theguardian.com/world/2025/sep/09/nepal-protests-social-media-ban-lifted-gen-z-kathmandu",
      "pub_time_taipei": "2025-09-09T17:42:54+08:00",
      "summary": "<p>Thousands defy curfew as ‘Gen Z’ demonstrations against ban and political corruption continue</p><p>Nepal’s prime minister, KP Sharma Oli, has resigned after some of the worst unrest in decades rocked the country this week, set off by a ban on social media and discontentment at political corruption and nepotism.</p><p>At least 19 people were killed and hundreds were injured on Monday after protests against a ban on 26 prominent social media sites and corruption issues was met with deadly force by police.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/nepal-protests-social-media-ban-lifted-gen-z-kathmandu\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Flotilla boat carrying aid to Gaza struck by flaming object, video shows",
      "link": "https://www.theguardian.com/world/2025/sep/09/flotilla-carrying-aid-to-gaza-struck-by-flaming-object-video-shows-sidi-bou-said-port-tunisia",
      "pub_time_taipei": "2025-09-09T17:05:54+08:00",
      "summary": "<p>Global Sumud Flotilla says one of its vessels was hit by drone at Sidi Bou Said port in Tunisia, sustaining fire damage</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news\"><strong>Israel issues large-scale evacuation order for Gaza City ahead of expanded offensive – Middle East crisis live</strong></a></p></li></ul><p>A flotilla carrying aid for Gaza and pro-Palestinian activists has published a video showing one of its boats being struck by a flaming object at Sidi Bou Said port in Tunisia.</p><p>The Global Sumud Flotilla (GSF) said the boat had been hit by a drone and that it sustained fire damage to its main deck and below-deck storage, though all six passengers and crew were safe.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/flotilla-carrying-aid-to-gaza-struck-by-flaming-object-video-shows-sidi-bou-said-port-tunisia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "France to get third PM in a year as Bayrou to resign after confidence vote",
      "link": "https://www.theguardian.com/world/2025/sep/09/francois-bayrou-france-block-everything-protests-macron",
      "pub_time_taipei": "2025-09-09T16:50:57+08:00",
      "summary": "<p>Prime minister to hand in resignation after thousands of protesters gather to celebrate ousting and plan day of action</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates\">Bayrou to resign – latest updates</a></p></li></ul><p>The French prime minister, François Bayrou, will hand in his resignation on Tuesday after <a href=\"https://www.theguardian.com/world/2025/sep/08/francois-bayrou-ousted-as-french-pm-after-losing-confidence-vote\">losing a confidence vote</a> that has plunged France into government collapse and <a href=\"https://www.theguardian.com/news/ng-interactive/2025/sep/07/frances-political-crisis-reveals-deep-rift-between-the-people-and-their-politicians\">political crisis</a>.</p><p>Emmanuel Macron has said he will appoint a new prime minister in the coming days, who would then have to form a new government. This will be the third French prime minister in a year, whose first task will be the major challenge of agreeing a budget among a divided parliament.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/francois-bayrou-france-block-everything-protests-macron\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Peter Mandelson called Jeffrey Epstein ‘my best pal’ in 50th birthday letter",
      "link": "https://www.theguardian.com/politics/2025/sep/09/peter-mandelson-called-jeffrey-epstein-my-best-pal-in-50th-birthday-letter",
      "pub_time_taipei": "2025-09-09T16:27:31+08:00",
      "summary": "<p>Letter from UK ambassador to deceased billionaire paedophile released by US lawmakers </p><p>The UK ambassador to the US, Peter Mandelson, called the deceased billionaire paedophile Jeffrey Epstein “my best pal” in a letter included within an alleged birthday book released by US lawmakers.</p><p>The handwritten note, which is interspersed with photographs of Lord Mandelson, Epstein and some of his properties, was provided to the House committee on oversight and reform, the main investigating committee in the US House of Representatives.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/09/peter-mandelson-called-jeffrey-epstein-my-best-pal-in-50th-birthday-letter\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "In Syria’s new era, like the old, a family watches another son disappear",
      "link": "https://www.washingtonpost.com/world/2025/09/09/syria-disappearance-sweida-assad/",
      "pub_time_taipei": "2025-09-09T16:00:56+08:00",
      "summary": "That Syrians are still going missing — during outbreaks of violence or the settling of old scores — has been too much for victims’ families to bear."
    },
    {
      "source": "華盛頓郵報",
      "title": "At least 19 killed, hundreds injured in protests after Nepal social media ban",
      "link": "https://www.washingtonpost.com/world/2025/09/08/nepal-protests-social-media-ban/",
      "pub_time_taipei": "2025-09-09T15:15:58+08:00",
      "summary": "The demonstrations in Nepal over government corruption and restrictions to apps such as WhatsApp and Facebook were driven by widespread anger among young people."
    },
    {
      "source": "華盛頓郵報",
      "title": "Europe’s slacker nation — Germany now works less than Greece and Portugal",
      "link": "https://www.washingtonpost.com/world/2025/09/09/germany-work-hours-existential-crisis/",
      "pub_time_taipei": "2025-09-09T15:02:59+08:00",
      "summary": "Long known for industriousness, Germany is facing an economic and existential crisis as its population works fewer and fewer hours."
    },
    {
      "source": "衛報",
      "title": "Apple to debut new, thinner iPhone at ‘awe-dropping’ annual product event",
      "link": "https://www.theguardian.com/technology/2025/sep/09/apple-iphone-17",
      "pub_time_taipei": "2025-09-09T15:00:07+08:00",
      "summary": "<p>Company also planning to reveal Apple Watch series 11 and update to AirPods earbuds</p><p>Expect Apple’s latest iPhone to look slimmer when it debuts on Tuesday. The company is slated to unveil its thinnest iPhone yet at its annual product showcase, promoted with the title “awe-dropping”. The event will take place at its Cupertino headquarters in the Steve Jobs Theater at 10am PT.</p><p>Apple’s iPhone 17 lineup is expected to include standard, Pro, and Pro Max editions, along with a newcomer to the family, the iPhone Air. This newest edition of the iPhone is christened to be Apple’s lightest flagship phone to date in the lineage of its line of slim MacBook laptops, observers have predicted. Apple has not denied the reports of what’s to come.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/09/apple-iphone-17\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Albanese went to Vanuatu to sign a $500m agreement – but leaves empty-handed thanks to concerns about China",
      "link": "https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china",
      "pub_time_taipei": "2025-09-09T14:31:43+08:00",
      "summary": "<p>Vanuatu’s PM says ‘more discussions’ needed on Nakamal agreement due to concerns over his nation’s ability to seek infrastructure funding from other countries</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-protection-laws-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The federal government is racing to save a major new agreement with Vanuatu, after Anthony Albanese’s plans to sign the deal were rebuffed over concerns about infrastructure funding from China.</p><p>Speaking alongside Vanuatu’s prime minister, Jotham Napat, on Tuesday, Albanese said he was confident the Nakamal agreement will be “able to be signed soon”, talking up cooperation and proper process with Vanuatu’s governing coalition.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/09/albanese-went-to-vanuatu-to-sign-a-500m-agreement-but-leaves-empty-handed-thanks-to-concerns-about-china\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
      "link": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
      "pub_time_taipei": "2025-09-09T12:33:45+08:00",
      "summary": "<p>Case centred on claims that he had not properly served a sentence for corruption and abuse of power, which was handed down in 2023</p><p>Thailand’s former prime minister Thaksin Shinawatra must serve one year in jail, the country’s supreme court has ruled, in a major blow to one of the country’s most prominent and polarising politicians.</p><p>The court ruled that Thaksin had not properly served an eight-year sentence for corruption and abuse of power, which was handed down when <a href=\"https://www.theguardian.com/world/2023/aug/22/thaksin-shinawatra-anger-and-anticipation-in-thailand-as-exiled-former-pm-expected-to-return\">he returned to the country from self-imposed exile in 2023</a>. After arriving back in the country, Thaksin spent less than 24 hours in jail, but was moved to the<a href=\"https://www.theguardian.com/world/2023/sep/11/air-con-a-fridge-and-sofa-thaksin-shinawatras-vvip-prison-life-in-thailand\"> VIP wing of a hospital</a> on health grounds, where he stayed for six months before he was released on parole.<br /><br />\n In its judgment, the supreme court found that the arrangement allowing Thaksin to stay at hospital was unlawful. “The defendant knows his sickness was not an urgent matter, and staying in hospital cannot count as a prison term,” said the ruling read out by a judge.<br /><br />\n “The court will issue a jail warrant and an official from Bangkok Remand Prison will take him,” the judge said.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Images of Tom Phillips’ remote campsite revealed a day after fugitive father shot dead by New Zealand police",
      "link": "https://www.theguardian.com/world/2025/sep/09/tom-phillips-new-zealand-remote-campsite-images-pictures-revealed",
      "pub_time_taipei": "2025-09-09T12:06:31+08:00",
      "summary": "<p>After four years on the run with their father, Phillips’ three children have all been located and are ‘doing well under the circumstances’, say authorities</p><p>Police in New Zealand have released images and given details of the campsite where two of fugitive Tom Phillips’ children were found, after their father was shot and killed by police on Monday.</p><p>Phillips had spent nearly four years hiding in the wilderness with his children. He was <a href=\"https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police\">killed</a> in an exchange of fire with police after reports of a burglary in the remote town of Piopio. A police officer is recovering in hospital after being shot in the head by Phillips with a high-powered rifle in the standoff. About 11 hours after Phillips was killed, two of his children were found safe and well at the campsite in Waitomo. It is understood the third child was with Phillips at the time of the shooting.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/tom-phillips-new-zealand-remote-campsite-images-pictures-revealed\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Majority in EU’s biggest states believes bloc ‘sold out’ in US tariff deal, poll finds",
      "link": "https://www.theguardian.com/world/2025/sep/09/majority-in-eu-biggest-states-believes-bloc-sold-out-in-us-tariff-deal-poll-donald-trump",
      "pub_time_taipei": "2025-09-09T12:00:04+08:00",
      "summary": "<p>Average of 77% of respondents across five countries thought agreement would benefit US economy above all</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/09/cheese-producers-trump-tariffs-bite-will-theres-a-whey\">Where there’s a will there’s a whey: cheese producers lean into their craft as Trump tariffs bite</a></p></li></ul><p>A majority of people across the EU’s five biggest member states believe the European Commission sold citizens out when negotiating a “humiliating” tariff deal with Donald Trump that “benefits the US” far more than Europe, a survey has shown.</p><p><a href=\"https://legrandcontinent.eu/fr/2025/09/09/10-points-eurobazooka/\">The poll, by Cluster17</a> for the European affairs debate platform Le Grand Continent, found 77% of respondents – ranging from 89% in France to 50% in Poland – thought the deal would benefit above all the US economy, with only 2% believing it would benefit Europe’s.</p> <a href=\"https://www.theguardian.com/world/2025/sep/09/majority-in-eu-biggest-states-believes-bloc-sold-out-in-us-tariff-deal-poll-donald-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Billy Porter recovering from ‘serious case of sepsis’ as Broadway show closes early",
      "link": "https://www.theguardian.com/culture/2025/sep/09/billy-porter-sepsis-broadway-cabaret",
      "pub_time_taipei": "2025-09-09T10:55:55+08:00",
      "summary": "<p>The 55-year-old actor has been playing Emcee in Cabaret, which will now shut a month earlier than planned</p><p>Billy Porter is “recovering from a serious case of sepsis”, forcing the early closure of Broadway’s revival of Cabaret in which he played a leading role.</p><p>The show’s producers announced on Sunday that Porter “is recovering from a serious case of sepsis” that will prevent him from returning to the stage.</p> <a href=\"https://www.theguardian.com/culture/2025/sep/09/billy-porter-sepsis-broadway-cabaret\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Norway’s Labour party wins election after seeing off populist surge",
      "link": "https://www.theguardian.com/world/2025/sep/08/norways-labour-party-holds-narrow-lead-in-early-election-results",
      "pub_time_taipei": "2025-09-09T05:48:16+08:00",
      "summary": "<p>Success for party of the prime minister, Jonas Gahr Støre, despite increased support for rightwing Progress party</p><p>The Norwegian Labour party has secured four more years in government after seeing off a surge of support for the populist right in a polarised election.</p><p>Soon after the polls closed,<strong> </strong>the centre left was projected to win with 89 seats with the centre right taking 80 seats. A minimum of 85 seats are needed for a majority.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/norways-labour-party-holds-narrow-lead-in-early-election-results\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Hegseth in Puerto Rico as Pentagon eyes island for military usage",
      "link": "https://www.washingtonpost.com/national-security/2025/09/08/puerto-rico-hegseth-cartels/",
      "pub_time_taipei": "2025-09-09T05:45:22+08:00",
      "summary": "The unannounced trip coincides with the Trump administration’s plan to dramatically ramp up operations targeting Latin American drug cartels."
    },
    {
      "source": "華盛頓郵報",
      "title": "France ousts another prime minister, deepening Macron’s troubles",
      "link": "https://www.washingtonpost.com/world/2025/09/08/france-no-confidence-vote-macron/",
      "pub_time_taipei": "2025-09-09T05:35:45+08:00",
      "summary": "The National Assembly voted to force François Bayrou to resign, France’s second government collapse in less than a year, which sets the stage for the fourth premier in 20 months."
    },
    {
      "source": "衛報",
      "title": "As it happened: result of Norwegian election ‘very close’ but centre-left in lead – expert",
      "link": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
      "pub_time_taipei": "2025-09-09T05:00:40+08:00",
      "summary": "<p>Latest projection gives leftwing bloc 91 seats in the next parliament, with the rightwing bloc at 78 </p><p>And over in Brussels, <strong>EU diplomats have been briefing journalists that the European Commission is expected to propose a 19th package of sanctions against Russia by Friday</strong>, Reuters said.</p><p>The EU has stepped up its listings and is <strong>no longer shying away from larger entities in third countries</strong>, and it could list banks in two central Asian countries too, they said.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.K. police arrest over 800 people at pro-Palestinian demonstration",
      "link": "https://www.washingtonpost.com/world/2025/09/08/arrest-uk-protest-gaza-israel-arms-palestine/",
      "pub_time_taipei": "2025-09-09T04:17:34+08:00",
      "summary": "Speech advocates called the arrests of demonstrators holding “I support Palestine Action” signs of a “new low” for protest rights."
    },
    {
      "source": "衛報",
      "title": "‘Leave now,’ Netanyahu tells Gaza City residents as he says Israeli forces readying for ground ‘manoeuvre’ – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
      "pub_time_taipei": "2025-09-09T03:59:57+08:00",
      "summary": "<p>This live blog is now closed. You can read our latest reporting here:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/08/gunmen-jerusalem-shooting-bus-stop-ramot\">Palestinian gunmen kill six people at Jerusalem bus stop</a></p></li></ul><p></p><p><em>Sam Jones is Madrid correspondent for the Guardian</em></p><p>Spain’s prime minister, <strong>Pedro Sánchez</strong>, has stepped up <a href=\"https://www.theguardian.com/world/2024/apr/05/spain-ireland-eu-critics-israel-warfare-gaza\">his scathing criticism of Israel’s actions in Gaza</a>, accusing Benjamin Netanyahu’s government of “exterminating a defenceless people” by bombing hospitals and “killing innocent boys and girls with hunger”.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Actors and directors pledge not to work with Israeli film groups ‘implicated in genocide’",
      "link": "https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians",
      "pub_time_taipei": "2025-09-09T02:54:27+08:00",
      "summary": "<p>Exclusive: Hundreds of film workers join new boycott initiative criticized by Israeli producers’ group as ‘misguided’</p><p>Hundreds of actors, directors and other film industry professionals have signed a new pledge vowing not to work with <a href=\"https://www.theguardian.com/world/israel\">Israeli</a> film institutions they say are “implicated in genocide and apartheid against the Palestinian people”.</p><p>“As film-makers, actors, film industry workers, and institutions, we recognise the power of cinema to shape perceptions” <a href=\"https://filmworkersforpalestine.org/#endingcomplicity\">the pledge</a> reads. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”</p> <a href=\"https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Gunmen kill 6 in shooting attack at Jerusalem bus stop, police say",
      "link": "https://www.washingtonpost.com/world/2025/09/08/jerusalem-bus-shooting-israel/",
      "pub_time_taipei": "2025-09-09T02:24:18+08:00",
      "summary": "Israeli authorities identified the two gunmen, who were killed at the scene, as Palestinians from the West Bank."
    },
    {
      "source": "衛報",
      "title": "Boris Johnson was paid £240,000 after Maduro meeting, invoice shows",
      "link": "https://www.theguardian.com/uk-news/2025/sep/08/boris-johnson-nicolas-maduro-meeting-invoice",
      "pub_time_taipei": "2025-09-09T02:12:48+08:00",
      "summary": "<p>Johnson’s office sent invoice to hedge fund manager, which was paid, weeks after meeting Venezuelan leader last year</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/sep/08/revealed-how-boris-johnson-traded-pm-contacts-for-global-business-deals\">Revealed: how Boris Johnson traded PM contacts for global business deals</a></p></li></ul><p>From a private jet somewhere over the Caribbean Sea in February last year, Boris Johnson called his old political adversary David Cameron, then the foreign secretary, to notify him of a visit.</p><p>Johnson had taken a day out from a family holiday in the Dominican Republic for an unlikely meeting with the leftwing president of Venezuela, Nicolás Maduro, a man whom Johnson, when in office, had likened to a “dictator of an evil regime”.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/08/boris-johnson-nicolas-maduro-meeting-invoice\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Argentinians deliver electoral blow to Milei’s scandal-rocked government",
      "link": "https://www.theguardian.com/world/2025/sep/08/argentina-election-javier-milei",
      "pub_time_taipei": "2025-09-09T00:44:16+08:00",
      "summary": "<p>President touted contest in Buenos Aires province – 40% of electorate – as ‘life or death battle’ but won only 34% of vote</p><p><a href=\"https://www.theguardian.com/world/argentina\">Argentina</a>’s president, <a href=\"https://www.theguardian.com/world/javier-milei\">Javier Milei</a>, has suffered his worst electoral defeat since taking office, as he faces his administration’s most serious corruption scandal and signs that the economy is slowing.</p><p>In local legislative elections on Sunday for Buenos Aires province – home to almost 40% of the country’s electorate – the coalition led by the self-styled anarcho-capitalist was beaten by the opposition by 47% to 34%.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/argentina-election-javier-milei\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least 19 killed in ‘gen Z’ protests against Nepal’s social media ban",
      "link": "https://www.theguardian.com/world/2025/sep/08/nepal-bans-26-social-media-sites-including-x-whatsapp-and-youtube",
      "pub_time_taipei": "2025-09-08T23:32:49+08:00",
      "summary": "<p>Many demonstrators say they are also on the streets over corruption and nepotism they allege is rampant </p><p>At least 19 people have been killed during protests in Nepal over a government ban on dozens of online platforms including Facebook, Instagram, WhatsApp and X.</p><p>The government has faced mounting criticism after imposing a ban on 26 prominent social media platforms and messaging apps last week because they had missed a deadline to register under new regulations.</p> <a href=\"https://www.theguardian.com/world/2025/sep/08/nepal-bans-26-social-media-sites-including-x-whatsapp-and-youtube\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Fugitive dad killed in police shootout after years on the run with 3 kids",
      "link": "https://www.washingtonpost.com/world/2025/09/08/tom-phillips-new-zealand-fugitive/",
      "pub_time_taipei": "2025-09-08T22:17:43+08:00",
      "summary": "Tom Phillips went missing with his children in 2021, sparking a New Zealand search. His children were found unharmed."
    }
  ]
}