{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-27T20:40:08.592911+08:00",
  "window_end_taipei": "2025-10-28T20:40:08.592911+08:00",
  "items": [
    {
      "source": "華盛頓郵報",
      "title": "Prunella Scales, comic battle-ax of ‘Fawlty Towers,’ dies at 93",
      "link": "https://www.washingtonpost.com/obituaries/2025/10/28/prunella-scales-dead-fawlty-towers/",
      "pub_time_taipei": "2025-10-28T20:35:51+08:00",
      "summary": "The British actress had her most indelible role as the formidable innkeeper Sybil Fawlty, opposite John Cleese in the beloved 1970s sitcom “Fawlty Towers.”"
    },
    {
      "source": "衛報",
      "title": "Tilda Swinton and Gary Oldman return to stage for Royal Court’s 70th anniversary",
      "link": "https://www.theguardian.com/stage/2025/oct/28/royal-court-70th-anniversary-tilda-swinton-gary-oldman",
      "pub_time_taipei": "2025-10-28T20:27:43+08:00",
      "summary": "<p>Tilda Swinton’s performance marks 30 years since audiences last saw her tread the boards, meanwhile Gary Oldman will be in Krapp’s Last Tape</p><p>Tilda Swinton will return to the stage for the first time in more than 30 years as part of the Royal Court’s 70th anniversary programme in a reprisal of her 1988 one-woman performance in <a href=\"https://www.theguardian.com/stage/2015/aug/03/manfred-karge-theatre-berliner-ensemble-man-to-man-interview\">Manfred Karge’s Man to Man</a>.</p><p>Swinton’s return in the role where she plays a widow who takes on the identity of her deceased husband is one of two star names in David Byrne’s third season as artistic director, which also features Gary Oldman in another revival: Samuel Beckett’s Krapp’s Last Tape that was first performed in 1958.</p> <a href=\"https://www.theguardian.com/stage/2025/oct/28/royal-court-70th-anniversary-tilda-swinton-gary-oldman\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Three more Reform UK councillors expelled from party over ‘dishonest’ behaviour after leaked video meeting – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/28/labour-asylum-seekers-military-sites-keir-starmer-rachel-reeves-reform-uk-yvette-cooper-uk-politics-live-news-latest-updates",
      "pub_time_taipei": "2025-10-28T20:26:54+08:00",
      "summary": "<p>Footage of online meeting showed Kent county council leader remonstrating with councillors</p><p>Earlier I pointed out that, in his Today interview this morning, the Reform MP <strong>Danny Kruger</strong> was strangely reticent when it came to explaining why the size of the civil service has grown so much in recent years. (See<a href=\"https://www.theguardian.com/politics/live/2025/oct/28/labour-asylum-seekers-military-sites-keir-starmer-rachel-reeves-reform-uk-yvette-cooper-uk-politics-live-news-latest-updates?page=with%3Ablock-6900a0858f084e54fb1012d8#block-6900a0858f084e54fb1012d8\"> 11.09am</a>.)</p><p>In his speech this morning Kruger was a bit more forthcoming. He said:</p><p>Let me be very clear. The growth of the civil service will be reversed. After falling in the wake of the global financial crisis, the headcount of the civil service rose again after Brexit – shame on the Tories – and it passed 500,000 in 2023.</p><p>Nothing works properly. It’s impossible to build anything. The streets are dirty and unsafe. Taxes and prices are far too high. Immigration is changing our country for the worse and far too fast. And we’re becoming poor, sick and unhappy. There is a malaise over Britain.</p><p>These problems are complex. But the effective cause of them is simple. Since 1997 we have had governments that, firstly don’t share the attitude of the country they govern, and secondly, they aren’t properly in charge of the state.</p><p>This announcement only reinforces climate policy as a dividing line in our politics, rather than being the unifying issue it once was.</p><p>And, for the Conservative party, it risks chasing votes from Reform at the expense of the wider electorate.</p><p>By undermining the judiciary we further erode public trust in the institutions of our democracy and therefore in democracy itself.</p><p>So I say to those seeking to villainise a judiciary that cannot easily answer back, who wilfully discredit our legal system for their own expediency – it’s time to show responsible leadership.</p><p>This is not just about short-term decisions to make it easier to deal with public concerns about immigration.</p><p>Our support for human rights has its origin in Magna Carta. How we deal with issues of human rights is fundamental to our ability to deal with autocracies and dictatorships.</p><p>In the world of power where the club of strong men want to carve the world up in their own interests, populism and polarisation are enablers.</p><p>And those politicians in the Western world who use populism and polarisation for their own short-term political ends risk handing a victory to our enemies.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/28/labour-asylum-seekers-military-sites-keir-starmer-rachel-reeves-reform-uk-yvette-cooper-uk-politics-live-news-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump and new Japanese prime minister share praise and vow to strengthen ‘remarkable’ relationship – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/28/donald-trump-sanae-takaichi-japan-trade-national-guard-us-politics-live",
      "pub_time_taipei": "2025-10-28T20:24:37+08:00",
      "summary": "<p>The president also suggested he could deploy the National Guard in more US cities at an address aboard the US naval base</p><p>In a <a href=\"https://democrats-judiciary.house.gov/sites/evo-subsites/democrats-judiciary.house.gov/files/evo-media-document/2025-10-27-raskin-et-al-to-bondi-blanche-woodward-doj-re-trump-230m-payout_0.pdf\">new letter</a>, House Democrats are warning three top Justice Department officials—including two who previously defended Donald Trump in criminal proceedings—that they could face prosecution if they approve Donald Trump’s suggestion of a $230 million payment from American taxpayers.</p><p>They are calling it “perhaps the most brazen violation” of constitutional anti-corruption provisions in US history.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/28/donald-trump-sanae-takaichi-japan-trade-national-guard-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Von der Leyen says EU ‘cannot tolerate’ disruption of airspace, calling balloons over Lithuania a ‘provocation’ – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/28/zelenskyy-ukraine-peace-talks-putin-russia-alexander-lukashenko-belarus-europe-live-news-latest-updates",
      "pub_time_taipei": "2025-10-28T20:21:53+08:00",
      "summary": "<p>She also added they back plans to step up EU investment in military equipment and they are ready to cover the financing needs of Ukraine</p><p>EU’s <strong>von der Leyen</strong> also gets asked about the balloons disrupting the Lithuanian airspace.</p><p>She says she wants to <strong>“express my full solidarity” with Lithuania</strong>, and calls it <strong>“a provocation, a hybrid threat,”</strong> which “we cannot tolerate.”</p><p><em>We’re in for the long haul. <strong>We are ready to cover the financing needs of Ukraine, so that we are standing by Ukraine for as long as it takes.</strong></em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/28/zelenskyy-ukraine-peace-talks-putin-russia-alexander-lukashenko-belarus-europe-live-news-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mass killings reported in Sudanese city seized by paramilitary group",
      "link": "https://www.theguardian.com/world/2025/oct/28/mass-killings-reported-el-fasher-sudan-paramilitary-group-rapid-support-forces",
      "pub_time_taipei": "2025-10-28T20:14:38+08:00",
      "summary": "<p>Rapid Support Forces accused of killing more than 2,000 unarmed civilians in El Fasher in recent days</p><p>Reports of ethnically motivated mass killings and other atrocities are emerging from El Fasher after the paramilitary Rapid Support Forces <a href=\"https://www.theguardian.com/world/2025/oct/27/fears-civilians-sudan-paramilitary-rsf-capture-el-fasher\">took control of the city</a> in Sudan’s western Darfur region last week.</p><p>Video released by local activists showed a fighter known for executing civilians in RSF-controlled areas shooting a group of unarmed civilians sitting on the ground at point-blank range.</p> <a href=\"https://www.theguardian.com/world/2025/oct/28/mass-killings-reported-el-fasher-sudan-paramilitary-group-rapid-support-forces\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "‘Stable chaos’ — Ukraine’s fortress city of Pokrovsk holds out, barely",
      "link": "https://www.washingtonpost.com/world/2025/10/28/ukraine-pokrovsk-russia-infiltrating-holding-out/",
      "pub_time_taipei": "2025-10-28T20:01:27+08:00",
      "summary": "It was supposed to fall more than a year ago, but Pokrovsk is still holding on, even as street fighting has erupted inside the city after Russian troops infiltrated."
    },
    {
      "source": "華盛頓郵報",
      "title": "Japan’s new leader tries to charm Trump with gold, golf and deal on rare minerals",
      "link": "https://www.washingtonpost.com/politics/2025/10/27/trump-japan-critical-minerals-china/",
      "pub_time_taipei": "2025-10-28T20:01:13+08:00",
      "summary": "Japanese Prime Minister Sanae Takaichi and President Donald Trump inked a rare-earth minerals deal ahead of Trump’s meeting with China’s Xi Jinping."
    },
    {
      "source": "衛報",
      "title": "Ben & Jerry’s owner stopped brand developing flavour for peace in Gaza",
      "link": "https://www.theguardian.com/business/2025/oct/28/ben-jerrys-donald-trump-ice-cream-gaza-ben-cohen",
      "pub_time_taipei": "2025-10-28T20:00:34+08:00",
      "summary": "<p><strong>Exclusive:</strong> Co-founder accuses ice-cream brand’s parent of taking part in ‘corporate butt kissing’ of Donald Trump</p><p>The co-founder of Ben &amp; Jerry’s has accused its owner of being part of a movement of “corporate butt kissing” of Donald Trump and says management blocked the ice-cream brand from producing a flavour in support of peace in Gaza.</p><p>Ben Cohen told the Guardian that Unilever was pursuing a “corporate attack on free speech” by blocking the development of a special flavour in solidarity with the Palestine people. It is understood the flavour had been approved by Ben &amp; Jerry’s independent board and first mooted about a year ago.</p> <a href=\"https://www.theguardian.com/business/2025/oct/28/ben-jerrys-donald-trump-ice-cream-gaza-ben-cohen\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "BT ‘considering low-cost mobile brand’ as Revolut and Monzo plan launches",
      "link": "https://www.theguardian.com/business/2025/oct/28/bt-low-cost-mobile-brand-revolut-monzo",
      "pub_time_taipei": "2025-10-28T19:47:00+08:00",
      "summary": "<p>Move into budget market could involve creating new brand in-house or buying virtual network operator</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/28/uk-productivity-downgrade-tax-rise-speculation-reeves-hsbc-pharma-business-live\">Business live – latest updates</a></p></li></ul><p>BT is reportedly considering the launch of new a low-cost mobile brand, as the telecoms group explores ways to compete with new rivals in the market including the <a href=\"https://www.theguardian.com/money/2025/aug/18/monzo-plans-to-launch-uk-mobile-phone-service\">fintech companies Revolut and Monzo.</a></p><p>The group is exploring options to enter the budget market, which could involve creating a new brand in-house or buying an existing virtual network operator, <a href=\"https://www.ft.com/content/05f2f64c-0e20-4268-8cba-dadf08940bf2\">according to the Financial Times.</a></p> <a href=\"https://www.theguardian.com/business/2025/oct/28/bt-low-cost-mobile-brand-revolut-monzo\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "HSBC warns it could take years to settle Madoff case as bank takes $1.1bn hit",
      "link": "https://www.theguardian.com/business/2025/oct/28/hsbc-bernie-madoff-case-bank-lawsuit-profits",
      "pub_time_taipei": "2025-10-28T19:37:45+08:00",
      "summary": "<p>Lawsuit over Ponzi scheme drags on London-headquartered lender, whose profits plunge by 14%</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/28/uk-productivity-downgrade-tax-rise-speculation-reeves-hsbc-pharma-business-live\">Business live – latest updates</a></p></li></ul><p>HSBC has warned it could take years to finally settle a lawsuit over the <a href=\"https://www.theguardian.com/us-news/2021/apr/14/bernie-madoff-dies-prison-ponzi-scheme\">Bernard Madoff Ponzi scheme</a>, as the bank’s profits fell 14% after it took a $1.1bn (£830m) hit on the 2009 scandal.</p><p>The London-headquartered bank’s finance chief issued the warning as the provision for the case dragged on HSBC profits, offsetting a jump in income in the three months to the end of September.</p> <a href=\"https://www.theguardian.com/business/2025/oct/28/hsbc-bernie-madoff-case-bank-lawsuit-profits\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "As Netherlands goes to the polls again, Geert Wilders faces isolation",
      "link": "https://www.theguardian.com/world/2025/oct/28/netherlands-polls-geert-wilders-faces-political-isolation",
      "pub_time_taipei": "2025-10-28T19:28:42+08:00",
      "summary": "<p>With other parties refusing to govern with the far-right leader, months of political deadlock may lie ahead</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/21/dutch-election-key-players-and-main-issues-snap-poll\">Dutch election: the key players and main issues</a></p></li></ul><p>Voters in the Netherlands return to the polls on Wednesday less than two years after Geert Wilders led his party to a <a href=\"https://www.theguardian.com/world/2023/nov/22/far-right-party-set-to-win-most-seats-in-dutch-elections-exit-polls-show\">shock election win</a> that the anti-immigration agitator could well repeat – but this time, with little chance of his party ending up in government.</p><p>Polls suggest that Wilders’ far-right Freedom party (PVV) could again finish first in a vote triggered when <a href=\"https://www.theguardian.com/world/2025/jun/03/netherlands-government-collapse-geert-wilders\">he pulled it out of</a> a fractious and ineffectual four-party rightwing coalition last June in a row over his 10-point plan for a radical crackdown on refugees.</p> <a href=\"https://www.theguardian.com/world/2025/oct/28/netherlands-polls-geert-wilders-faces-political-isolation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "House of Dynamite writer ‘respectfully disagrees’ with Pentagon’s complaints about nuclear missile thriller",
      "link": "https://www.theguardian.com/film/2025/oct/28/house-of-dynamite-accuracy-pentagon-nuclear-missile-noah-oppenheim",
      "pub_time_taipei": "2025-10-28T19:15:51+08:00",
      "summary": "<p>Noah Oppenheim responded to complaints from the Pentagon over the accuracy of the film’s depiction of the US’s defence systems</p><p><strong>Warning: contains a spoiler for the plot of House of Dynamite</strong></p><p>Noah Oppenheim, the writer of Kathryn Bigelow’s nuclear-missile thriller House of Dynamite has <a href=\"https://www.msnbc.com/the-weekend/watch/-a-house-of-dynamite-director-responds-to-pentagon-accusing-nuclear-doomsday-film-of-inaccuracy-250648133910\">responded to complaints</a> from the Pentagon over the accuracy of its depiction of the US’s defence systems, saying he “respectfully disagree[s]”.</p><p>In an internal memo dated 16 October <a href=\"https://www.bloomberg.com/news/articles/2025-10-25/-house-of-dynamite-nuclear-missile-defense-fail-has-pentagon-worried?srnd=phx-politics&amp;embedded-checkout=true\">obtained by Bloomberg</a>, the Missile Defense Agency (MDA) said: “The fictional interceptors in the movie miss their target and we understand this is intended to be a compelling part of the drama intended for the entertainment of the audience,” but results from real-world testing “tell a vastly different story.”</p> <a href=\"https://www.theguardian.com/film/2025/oct/28/house-of-dynamite-accuracy-pentagon-nuclear-missile-noah-oppenheim\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Steeper UK productivity cut of more than £20bn makes tax rises more likely",
      "link": "https://www.theguardian.com/business/2025/oct/28/rachel-reeves-uk-productivity-obr-tax-rises-budget",
      "pub_time_taipei": "2025-10-28T18:58:28+08:00",
      "summary": "<p>Rachel Reeves faces bigger-than-expected hit in 26 November budget from revised OBR forecast</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/28/uk-productivity-downgrade-tax-rise-speculation-reeves-hsbc-pharma-business-live\">Business live – latest updates</a></p></li></ul><p>Rachel Reeves will have to account for a bigger-than-expected £20bn hit to the UK public finances in next month’s budget, increasing the likelihood that the chancellor will breach a key Labour’s manifesto pledge not to raise income tax.</p><p>The Treasury’s forecaster is preparing a steeper than anticipated cut to UK productivity for the next five years, the Guardian understands.</p> <a href=\"https://www.theguardian.com/business/2025/oct/28/rachel-reeves-uk-productivity-obr-tax-rises-budget\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "All fail Caesar: students at eight schools taught wrong topic for final year 12 history exam",
      "link": "https://www.theguardian.com/australia-news/2025/oct/28/brisbane-state-high-school-wrong-caesar-year-12-exam",
      "pub_time_taipei": "2025-10-28T18:37:18+08:00",
      "summary": "<p>Queensland checking all 172 schools sitting exam with pupils expected to claim special consideration after studying the wrong Roman emperor</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/28/federal-parliament-algae-report-senate-social-media-age-assurance-labor-coalition-anthony-albanese-sussan-ley-barnaby-joyce-telco-penalties-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Year 12 students from at least eight schools in Queensland were taught the wrong topic for their final history exams and authorities are now checking with 172 schools to see if any more were affected.</p><p>Students were meant to study Julius Caesar, but the affected pupils instead learned about his nephew Augustus, according to the Queensland Curriculum and Assessment Authority.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/28/brisbane-state-high-school-wrong-caesar-year-12-exam\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Japanese PM promises golden age in relations with US during Trump visit",
      "link": "https://www.theguardian.com/world/2025/oct/28/donald-trump-sanae-takaichi-japan-prime-minister-rare-earths-agreement",
      "pub_time_taipei": "2025-10-28T18:28:08+08:00",
      "summary": "<p>Sanae Takaichi says she will nominate Trump for peace prize as two leaders sign agreement on rare earths</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/17/rare-earths-critical-minerals-explained\">What are rare earths – explained in 30 seconds</a></p></li></ul><p>Japan’s new prime minister, Sanae Takaichi, has pledged to realise a “golden age” in relations with the US and to “fundamentally reinforce” her country’s defence posture at the start of a visit by Donald Trump.</p><p>The US president, who is in Japan on the second leg of a week-long <a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-asia-tour-key-questions-xi-jinping-china-japan-south-korea-malaysia\">tour of Asia</a>, and Takaichi quickly signed an agreement laying out a framework to secure the mining and processing of rare earths and other minerals.</p> <a href=\"https://www.theguardian.com/world/2025/oct/28/donald-trump-sanae-takaichi-japan-prime-minister-rare-earths-agreement\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Woman in her 80s found dead on Great Barrier Reef’s Lizard Island after failing to return to cruise ship",
      "link": "https://www.theguardian.com/australia-news/2025/oct/28/woman-in-her-80s-found-dead-on-great-barrier-reefs-lizard-island-after-failing-to-return-to-cruise-ship",
      "pub_time_taipei": "2025-10-28T18:27:40+08:00",
      "summary": "<p>Police say death was ‘sudden and non-suspicious’ as investigations into incident continue</p><p>A woman in her 80s has been found dead after failing to board a cruise ship anchored off an island in the Great Barrier Reef.</p><p>Queensland police confirmed the woman had died on Lizard Island, about 240km from Cairns. Her death was described as “sudden and non-suspicious”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/28/woman-in-her-80s-found-dead-on-great-barrier-reefs-lizard-island-after-failing-to-return-to-cruise-ship\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jacinta Nampijinpa Price ‘didn’t care’ about making false claims, defamation trial told",
      "link": "https://www.theguardian.com/australia-news/2025/oct/28/jacinta-nampijinpa-price-didnt-care-about-making-false-claims-defamation-trial-told",
      "pub_time_taipei": "2025-10-28T18:26:30+08:00",
      "summary": "<p>The Liberal senator ‘tarnished’ reputation of Central Land Council chief, court hears, but she says there was public interest</p><ul><li><p><strong>Get our </strong><a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\"><strong>breaking news email</strong></a><strong>, </strong><a href=\"https://app.adjust.com/w4u7jx3\"><strong>free app</strong></a><strong> or </strong><a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\"><strong>daily news podcast</strong></a></p></li></ul><p>A Liberal senator accused of defaming the head of a large Aboriginal land council was an evasive witness who made baseless allegations and gave “illogical and self-serving” answers, a court has been told.</p><p>Jacinta Nampijinpa Price has been sued by Central Land Council chief executive, Lesley Turner, over an allegedly defamatory media release in July 2024 that claimed there had been a failed no-confidence motion against him.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/28/jacinta-nampijinpa-price-didnt-care-about-making-false-claims-defamation-trial-told\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Atlanta journalist says he ‘won’t be the only’ one deported by Trump officials",
      "link": "https://www.theguardian.com/us-news/2025/oct/28/journalist-mario-guevara-trump-ice-deportations",
      "pub_time_taipei": "2025-10-28T18:00:25+08:00",
      "summary": "<p>Emmy award-winner Mario Guevara warns administration ‘has the power’ after he was arrested and sent to El Salvador</p><p>Mario Guevara has said he may have been “the first” immigrant journalist whom Donald Trump’s administration <a href=\"https://www.theguardian.com/us-news/2025/oct/03/journalist-mario-guevara-ice-deportation\">deported</a> from the US while working – but the Emmy award-winner added: “I don’t think [I’ll] be the only one.”</p><p>“Just be careful because [immigration agents are] very aggressive,” Guevara recently said from El Salvador in a virtual <a href=\"https://www.youtube.com/watch?v=8Hqf_ld8woI\">interview with the US Freedom of the Press Tracker</a>, during which he was asked whether he had any message for other immigrant colleagues in the industry. “They showed they are – they don’t care about journalists. They don’t believe in the media.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/28/journalist-mario-guevara-trump-ice-deportations\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As Hong Kong waged shadow war in Britain, ex-Royal Marine became a casualty",
      "link": "https://www.washingtonpost.com/world/2025/10/28/hong-kong-dissidents-britain-spying/",
      "pub_time_taipei": "2025-10-28T17:00:06+08:00",
      "summary": "U.K. officials have tracked what they describe as an escalating campaign of surveillance and intimidation against Hong Kong exiles living in Britain."
    },
    {
      "source": "衛報",
      "title": "Queensland puberty blocker ban reinstated by health minister hours after supreme court overturned it",
      "link": "https://www.theguardian.com/australia-news/2025/oct/28/queenslands-controversial-puberty-blocker-ban-overturned-by-supreme-court",
      "pub_time_taipei": "2025-10-28T16:26:09+08:00",
      "summary": "<p>Move comes after parent successfully challenged LNP’s previous ban on new patients under 18 accessing hormone treatments for gender dysphoria</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Queensland health minister has issued a new order banning the prescription of puberty blockers for transgender patients, just hours after the state’s supreme court ruled the government’s first attempt was unlawful.</p><p>On Tuesday, Justice Peter Callaghan ruled in favour of a challenge by the parent of a transgender child, judging that the January <a href=\"https://www.theguardian.com/australia-news/2025/oct/22/queensland-puberty-blocker-ban-unlawful-due-to-political-interference-and-lack-of-consultation-court-hears\">directive establishing the ban was made improperly</a> and was unlawful.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/28/queenslands-controversial-puberty-blocker-ban-overturned-by-supreme-court\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Expanded state powers on fossil fuel projects and water ‘betrayal’ of Australians, nature law critics say",
      "link": "https://www.theguardian.com/australia-news/2025/oct/28/nature-laws-epbc-expanded-fossil-fuel-water-powers-betrayal-australians",
      "pub_time_taipei": "2025-10-28T16:13:23+08:00",
      "summary": "<p>Extracts of planned changes to the EPBC Act prompt ‘anger’ from conservation organisations that fear nature protection will be weakened</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>State governments could be given expanded powers to make decisions on fossil fuel developments under Labor’s proposed overhaul of environment law, prompting “shock and anger” from community-based conservation organisations that fear nature protection would be weakened.</p><p>The Albanese government plans to introduce its planned changes to the national law – the Environment Protection and Biodiversity Conservation (EPBC) Act – to parliament later this week, and has been <a href=\"https://www.theguardian.com/environment/2025/oct/27/environment-minister-could-approve-projects-at-odds-with-nature-laws-under-labor-overhaul\">briefing interest groups on its plans</a>.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/28/nature-laws-epbc-expanded-fossil-fuel-water-powers-betrayal-australians\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "World’s climate plans fall drastically short of action needed, analysis shows",
      "link": "https://www.theguardian.com/environment/2025/oct/28/worlds-climate-plans-fall-drastically-short-of-action-needed-analysis-shows",
      "pub_time_taipei": "2025-10-28T15:00:22+08:00",
      "summary": "<p>Recent plans submitted to UN by more than 60 countries would cut carbon by only 10%, a sixth of what is needed</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/oct/28/change-course-now-humanity-has-missed-15c-climate-target-says-un-head\">‘Change course now’: humanity has missed 1.5C climate target, says UN head</a></p></li></ul><p>Recently drafted climate plans from scores of countries fall drastically short of what is needed to stave off the worst effects of climate breakdown, analysis has shown.</p><p>More than 60 countries have so far submitted national plans on greenhouse gas emissions to the UN, setting out how they will curb carbon for the next decade.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/28/worlds-climate-plans-fall-drastically-short-of-action-needed-analysis-shows\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First person arrives on Nauru triggering Australia’s $2.5bn deal with island nation",
      "link": "https://www.theguardian.com/australia-news/2025/oct/28/nauru-australia-deal-payment-as-first-man-arrives-nzyq",
      "pub_time_taipei": "2025-10-28T13:06:07+08:00",
      "summary": "<p>Deal between federal government and Nauru expected to last 30 years and apply to around 350 people released under high court’s NZYQ ruling</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/28/federal-parliament-algae-report-senate-social-media-age-assurance-labor-coalition-anthony-albanese-sussan-ley-barnaby-joyce-telco-penalties-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australia has commenced its <a href=\"https://www.theguardian.com/australia-news/2025/sep/03/nzyq-cohort-potentially-hostile-reception-nauru\">$2.5bn deal with Nauru</a> to offload more than 350 people from the NZYQ cohort after the home affairs minister, Tony Burke, confirmed the first arrival had landed on the tiny Pacific island last week.</p><p>Burke said Nauruan authorities had confirmed the arrival on Friday, <a href=\"https://www.abc.net.au/news/2025-10-28/first-nzyq-member-deported-to-nauru/105919846\">as reported by the ABC</a>, triggering the first yearly instalment of $408m.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/28/nauru-australia-deal-payment-as-first-man-arrives-nzyq\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK military equipment used by militia accused of genocide found in Sudan, UN told",
      "link": "https://www.theguardian.com/global-development/2025/oct/28/uk-military-equipment-rapid-support-forces-rsf-militia-accused-genocide-found-sudan-united-nations",
      "pub_time_taipei": "2025-10-28T13:00:20+08:00",
      "summary": "<p>Exclusive: two dossiers of material seen by the security council raise questions over export of British arms to the UAE, which has been accused of supplying weapons to paramilitary RSF group</p><p>British military equipment has been found on battlefields in Sudan, used by the Rapid Support Forces (RSF), a <a href=\"https://2021-2025.state.gov/genocide-determination-in-sudan-and-imposing-accountability-measures/\">paramilitary group accused of genocide</a>, according to documents seen by the UN security council.</p><p>UK-manufactured small-arms target systems and British-made engines for armoured personnel carriers have been recovered from combat sites in a conflict that has now caused the <a href=\"https://www.theguardian.com/world/2025/apr/15/sudan-in-worlds-largest-humanitarian-crisis-after-two-years-of-civil-war\">world’s biggest humanitarian catastrophe</a>.</p> <a href=\"https://www.theguardian.com/global-development/2025/oct/28/uk-military-equipment-rapid-support-forces-rsf-militia-accused-genocide-found-sudan-united-nations\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Change course now’: humanity has missed 1.5C climate target, says UN head",
      "link": "https://www.theguardian.com/environment/2025/oct/28/change-course-now-humanity-has-missed-15c-climate-target-says-un-head",
      "pub_time_taipei": "2025-10-28T08:01:12+08:00",
      "summary": "<p>Exclusive: ‘Devastating consequences’ now inevitable but emissions cuts still vital, says António Guterres in sole interview before Cop30</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/oct/28/waja-xipai-indigenous-journalist-interview-antonio-guterres-cop30\">I am the first Indigenous journalist to exclusively interview António Guterres. How many others will listen?</a></p></li></ul><p>Humanity has failed to limit global heating to 1.5C and must change course immediately, the secretary general of the UN has warned.</p><p>In his only interview before next month’s Cop30 climate summit, António Guterres acknowledged it is now “inevitable” that humanity will overshoot the target in the Paris climate agreement, with “devastating consequences” for the world.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/28/change-course-now-humanity-has-missed-15c-climate-target-says-un-head\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jamaicans take shelter as Hurricane Melissa bears down as category 5 storm",
      "link": "https://www.theguardian.com/world/2025/oct/27/jamaicans-take-shelter-as-hurricane-melissa-bears-down-as-category-5-storm",
      "pub_time_taipei": "2025-10-28T07:35:00+08:00",
      "summary": "<p>Landfall expected in coming hours amid warnings of catastrophic flooding, and landslides</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/28/hurricane-melissa-live-updates-category-5-storm-jamaica-landfall-latest-news\">Hurricane Melissa – follow latest updates live</a></p></li></ul><p>Jamaicans have started to take shelter from Hurricane Melissa as the category 5 storm neared the coast amid warnings of <a href=\"https://x.com/NHC_Atlantic/status/1983048088974463049\">catastrophic flooding</a>, landslides and extensive infrastructure damage.</p><p>The slow-moving giant, the strongest hurricane to hit Jamaica since records began in 1851, is set to make landfall early on Tuesday and to linger over the island.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/jamaicans-take-shelter-as-hurricane-melissa-bears-down-as-category-5-storm\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Hurricane Melissa collides with U.S. military mission in Caribbean",
      "link": "https://www.washingtonpost.com/national-security/2025/10/27/hurricane-melissa-trump-venezuela-disaster-military/",
      "pub_time_taipei": "2025-10-28T07:11:54+08:00",
      "summary": "President Donald Trump’s military campaign against drug cartels in Latin America could soon be forced to reckon with the devastating impact of Hurricane Mellissa."
    },
    {
      "source": "衛報",
      "title": "‘China is watching’: Finland warns defeating Russia’s invasion of Ukraine key to stability in Indo-Pacific",
      "link": "https://www.theguardian.com/world/2025/oct/28/china-is-watching-finland-warns-defeating-russias-invasion-of-ukraine-key-to-stability-in-indo-pacific",
      "pub_time_taipei": "2025-10-28T07:07:45+08:00",
      "summary": "<p>Defence minister says Xi Jinping should note resolve to stay the course by global democratic alliance, including Australia</p><p>Defeating <a href=\"https://www.theguardian.com/world/2025/oct/24/zelenskyy-ukraine-russia-london-meeting-european-leaders\">Russia’s invasion of Ukraine</a> is critical to restraining China in the Indo-Pacific, Finland’s defence minister has said, warning Europe and democratic partners, including Australia, face a fight of global consequences.</p><p>Antti Häkkänen praised Donald Trump’s decision to impose <a href=\"https://www.theguardian.com/us-news/2025/oct/22/us-sanctions-russia-oil-vladimir-putin-refusal-ukraine-war\">sanctions on two Russian oil companies</a> last week, calling the move a major sign of resolve by the US president against Vladimir Putin’s three-year long war.</p> <a href=\"https://www.theguardian.com/world/2025/oct/28/china-is-watching-finland-warns-defeating-russias-invasion-of-ukraine-key-to-stability-in-indo-pacific\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Monster hurricane to hit Jamaica: ‘I have been on my knees in prayer’",
      "link": "https://www.washingtonpost.com/weather/2025/10/27/hurricane-melissa-jamaica/",
      "pub_time_taipei": "2025-10-28T06:26:11+08:00",
      "summary": "Hurricane Melissa rapidly intensified on its way toward Jamaica, where it may become the country’s strongest storm on record when it hits late Monday."
    },
    {
      "source": "衛報",
      "title": "New Yorkers sue state elections board as battle over House maps intensifies",
      "link": "https://www.theguardian.com/us-news/2025/oct/27/new-york-elections-board-lawsuit-map",
      "pub_time_taipei": "2025-10-28T05:49:39+08:00",
      "summary": "<p>Lawsuit alleges congressional map illegally dilutes voting power of Black and Latino residents of Staten Island </p><p>A group of New Yorkers has filed a lawsuit against the state’s board of elections alleging that its congressional map unconstitutionally dilutes the voting power of Black and Latino residents of Staten Island.</p><p><a href=\"https://www.democracydocket.com/wp-content/uploads/2025/10/2025-10-27-Petition.pdf\">The complaint</a>, filed Monday, is another volley in the battle between Democrats and Republicans to redraw congressional districts in a way that favors their party in advance of the midterm elections.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/27/new-york-elections-board-lawsuit-map\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hamas returns remains of Israeli hostage after Red Cross’s help in search",
      "link": "https://www.theguardian.com/world/2025/oct/27/red-cross-accompanies-hamas-in-search-for-bodies-of-israeli-hostages-in-gaza",
      "pub_time_taipei": "2025-10-28T05:34:50+08:00",
      "summary": "<p>Exclusive: Red Cross acts as ‘neutral intermediary’ to recover hostages’ remains in areas under Israeli control</p><p>The International Committee of the Red Cross has accompanied members of Hamas inside areas of Gaza still under the control of the Israeli military to facilitate the search for the bodies of Israeli hostages, as the Palestinian militant group delivered the remains of another captive.</p><p>Under the US-brokered ceasefire, which took effect on 10 October, Hamas is required to return the remains of all Israeli hostages as soon as possible. In exchange, Israel has agreed to hand over 15 Palestinian bodies for each Israeli.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/red-cross-accompanies-hamas-in-search-for-bodies-of-israeli-hostages-in-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump comments about a third term spark concern – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/27/donald-trump-japan-sanae-takaichi-asia-canada-trade-news-updates-us-politics-live",
      "pub_time_taipei": "2025-10-28T04:11:26+08:00",
      "summary": "<p>This live blog is now closed</p><p>As Republican states launch more redistricting efforts, Democrats in blue states are still deciding how or if they will respond.</p><p>House minority leader <strong>Hakeem Jeffries is said to be headed to Illinois today</strong> to meet with local leaders about redrawing the congressional maps. <a href=\"https://punchbowl.news/article/campaigns/jeffries-ill-push/\">Punchbowl reports</a> that Jeffries will meet with the Illinois Legislative Black caucus and Black members of Congress, a nod to the fact that Black lawmakers will be needed to pass a new map.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/27/donald-trump-japan-sanae-takaichi-asia-canada-trade-news-updates-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Alassane Ouattara wins landslide fourth term as Ivory Coast’s president",
      "link": "https://www.theguardian.com/world/2025/oct/27/alassane-ouattara-wins-landslide-fourth-term-as-ivory-coasts-president",
      "pub_time_taipei": "2025-10-28T03:48:07+08:00",
      "summary": "<p>Low turnout said to have made for most peaceful election in years, as 83-year-old accused of clampdown on dissent wins 89.77% of vote</p><p>Alassane Ouattara has been declared the winner of the presidential election in Ivory Coast by a landslide.</p><p>According to provisional results announced by the Independent Electoral Commission (CIE) on Monday evening, the 83-year-old won a fourth term as head of the west African country with 89.77% or 3.75m votes.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/alassane-ouattara-wins-landslide-fourth-term-as-ivory-coasts-president\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ten people go on trial in Paris accused of online harassment of Brigitte Macron",
      "link": "https://www.theguardian.com/world/2025/oct/27/trial-paris-brigitte-macron-online-harassment-jean-michel-trogneux",
      "pub_time_taipei": "2025-10-28T02:51:04+08:00",
      "summary": "<p>Trial is latest phase in legal battle against false claim that French first lady is a man named Jean-Michel Trogneux</p><p>Ten people have gone on trial in Paris charged with online harassment of Brigitte Macron – the latest phase of a legal battle on both sides of the Atlantic against the <a href=\"https://www.theguardian.com/world/2025/jul/26/emmanuel-brigitte-macron-candace-owens-conspiracy-theory-jean-michel-trogneux\">false claim</a> that the French first lady is a man named Jean-Michel Trogneux.</p><p>The president, Emmanuel Macron, and his wife filed a defamation lawsuit in the US at the end of July, in connection with a rumour amplified and repeated online that Brigitte Macron was born a man.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/trial-paris-brigitte-macron-online-harassment-jean-michel-trogneux\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK in £8bn deal to sell Typhoon jets to Turkey despite human rights concerns",
      "link": "https://www.theguardian.com/business/2025/oct/27/uk-in-8bn-deal-to-sell-typhoon-jets-to-turkey-despite-human-rights-concerns",
      "pub_time_taipei": "2025-10-28T02:41:42+08:00",
      "summary": "<p>Starmer’s announcement on visit to Ankara comes as jailed opposition leader Ekrem İmamoğlu faces fresh charges</p><p>Britain has agreed to sell 20 Typhoon fighter jets to Turkey in an £8bn deal despite concerns about alleged human rights violations by its government.</p><p>Keir Starmer signed the deal during a visit on Monday to Ankara to meet the country’s president, Recep Tayyip Erdoğan. The prime minister said the deal would boost the Nato alliance, despite criticism of Turkey’s increasingly authoritarian administration.</p> <a href=\"https://www.theguardian.com/business/2025/oct/27/uk-in-8bn-deal-to-sell-typhoon-jets-to-turkey-despite-human-rights-concerns\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Warming oceans probably fueling Hurricane Melissa’s rapid intensification",
      "link": "https://www.theguardian.com/world/2025/oct/27/hurricane-melissa-warming-oceans-climate-crisis",
      "pub_time_taipei": "2025-10-28T01:16:09+08:00",
      "summary": "<p>Climate scientists have long warned that warming oceans are making explosive storm development more common</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/28/hurricane-melissa-live-updates-category-5-storm-jamaica-landfall-latest-news\">Hurricane Melissa – latest updates</a></p></li></ul><p>The extraordinary intensification of Hurricane Melissa, set to be one of the strongest storms to ever hit Jamaica, is probably a symptom of the rapid heating of the world’s oceans, scientists have said.</p><p>Melissa was a tropical storm on Saturday, before exploding in strength to a category 4 hurricane early on Sunday. The storm’s winds escalated from 70mph to 140mph in just a day, one of the fastest intensifications on record in the Atlantic Ocean.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/hurricane-melissa-warming-oceans-climate-crisis\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump’s bailout threat may have been key to Milei’s electoral triumph in Argentina",
      "link": "https://www.theguardian.com/world/2025/oct/27/trump-javier-mileis-electoral-triumph-argentina",
      "pub_time_taipei": "2025-10-28T00:30:26+08:00",
      "summary": "<p>Voters appear to have responded to idea that US president’s ‘generosity’ would evaporate if Milei failed to win</p><p>“The dollar always talks in the end,” Donald Trump wrote in his 1987 bestseller The Art of the Deal.</p><p>Javier Milei’s surprise <a href=\"https://www.theguardian.com/world/2025/oct/27/javier-milei-president-far-right-party-wins-argentina-midterm-elections\">triumph in Argentina’s midterm elections</a> – after Trump bailed him out <a href=\"https://www.theguardian.com/world/2025/oct/25/argentina-president-javier-milei-polls-economic-crisis-trump\">with 40bn </a>of them – suggests there may be some truth to that assertion.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/trump-javier-mileis-electoral-triumph-argentina\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Javier Milei hails ‘tipping point’ as his far-right party wins Argentina’s midterm elections",
      "link": "https://www.theguardian.com/world/2025/oct/27/javier-milei-president-far-right-party-wins-argentina-midterm-elections",
      "pub_time_taipei": "2025-10-28T00:28:56+08:00",
      "summary": "<p>Result falls short of giving Milei a congressional majority but surprises many analysts after series of scandals</p><p>The party of Argentina’s far-right president, Javier Milei, has won Sunday’s midterm elections after a campaign in which <a href=\"https://www.theguardian.com/world/2025/oct/25/argentina-president-javier-milei-polls-economic-crisis-trump\">Donald Trump announced a $40bn bailout</a> for the country and made continued aid <a href=\"https://www.theguardian.com/us-news/2025/oct/14/trump-threatens-to-cut-us-aid-to-argentina-if-milei-loses-election\">conditional on the victory</a> of his Argentinian counterpart.</p><p>With more than 99% of ballots counted, La Libertad Avanza secured 40.8% of the nationwide vote, in an election widely seen as a de facto referendum on the <a href=\"https://www.theguardian.com/world/2023/nov/20/who-is-javier-milei-argentina-new-president-far-right-what-does-he-stand-for\">self-styled anarcho-capitalist’s</a> nearly two years in power. The Peronist opposition, Fuerza Patria, secured 31.7%.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/javier-milei-president-far-right-party-wins-argentina-midterm-elections\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "After U.S. bailout, Argentine voters give Milei a friendlier Congress",
      "link": "https://www.washingtonpost.com/world/2025/10/26/argentina-midterm-election-milei-trump-bailout/",
      "pub_time_taipei": "2025-10-27T23:00:31+08:00",
      "summary": "The vote in Sunday’s midterms came as the United States finalized an up to $40 billion bailout package for Argentina, an effort to boost President Javier Milei."
    },
    {
      "source": "衛報",
      "title": "World’s oldest serving head of state declared winner in Cameroon election",
      "link": "https://www.theguardian.com/world/2025/oct/27/cameroon-paul-biya-oldest-serving-head-of-state-declared-winner-in-election",
      "pub_time_taipei": "2025-10-27T22:47:44+08:00",
      "summary": "<p>Paul Biya, 92, said to have won 53.66% of vote after volatile two weeks since election when opponent claimed victory</p><p>Paul Biya, the world’s oldest serving head of state, has been declared the winner of Cameroon’s election, granting him an eighth term that could keep him in office until he is nearly 100.</p><p>The country’s constitutional council said Biya had won 53.66% of the vote, while his former ally turned challenger, Issa Tchiroma Bakary, got 35.19%.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/cameroon-paul-biya-oldest-serving-head-of-state-declared-winner-in-election\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump rebukes Putin for testing new missiles, tells him to end the war",
      "link": "https://www.washingtonpost.com/world/2025/10/27/russia-us-trump-putin-missile-test/",
      "pub_time_taipei": "2025-10-27T22:45:03+08:00",
      "summary": "Russia tested a nuclear-powered cruise missile that it said is capable of traveling thousands of miles. Trump countered that there is a U.S. nuclear submarine off Russia’s coast."
    },
    {
      "source": "衛報",
      "title": "Grave fears for civilians after Sudanese paramilitary claims capture of El Fasher",
      "link": "https://www.theguardian.com/world/2025/oct/27/fears-civilians-sudan-paramilitary-rsf-capture-el-fasher",
      "pub_time_taipei": "2025-10-27T22:38:41+08:00",
      "summary": "<p>RSF says it has seized control of army’s main base in Darfur, home to famine-stricken displacement camp</p><p>Fears are growing for hundreds of thousands of civilians trapped in El Fasher, Sudan, after the paramilitary Rapid Support Forces said it had captured the city, which it has been besieging for more than a year in the country’s civil war.</p><p>The group said on Sunday that it had seized control of the army’s main base in the city in Darfur, where <a href=\"https://www.theguardian.com/global-development/article/2024/aug/01/sudan-el-fasher-darfur-famine-starvation-declared-fews-net\">famine was declared</a> in a displacement camp last year. It then released a statement saying it had “extended control over the city of El Fasher from the grip of mercenaries and militias”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/fears-civilians-sudan-paramilitary-rsf-capture-el-fasher\">Continue reading...</a>"
    }
  ]
}