{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-13T20:40:10.414195+08:00",
  "window_end_taipei": "2025-09-14T20:40:10.414195+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Scale of ‘Unite the Kingdom’ march shows free speech ‘alive and well’ in UK, says minister – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/14/unite-the-kingdom-march-tommy-robinson-peter-mandelson-labour-deputy-leader-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-09-14T20:26:26+08:00",
      "summary": "<p>Peter Kyle said he was not ‘disturbed’ by huge Tommy Robinson-organised far-right protest but condemns violence against the police</p><p><em>This report was written by my colleagues <a href=\"https://www.theguardian.com/profile/peterwalker\">Peter Walker</a>, <a href=\"https://www.theguardian.com/profile/eleni-courea\">Eleni Courea</a><strong> </strong>and <a href=\"https://www.theguardian.com/profile/pippacrerar\">Pippa Crerar</a></em>:</p><p><strong>Keir Starmer</strong> has been warned that time is running out to repair his faltering leadership, with Labour MPs beginning to ask whether he could be challenged as prime minister.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/14/unite-the-kingdom-march-tommy-robinson-peter-mandelson-labour-deputy-leader-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Georgia freezes bank accounts of parents of jailed former aide to de facto leader",
      "link": "https://www.theguardian.com/world/2025/sep/14/georgia-freezes-bank-accounts-parents-jailed-former-aide-bidzina-ivanishvili",
      "pub_time_taipei": "2025-09-14T20:12:56+08:00",
      "summary": "<p>Move made on same day as Guardian published interview with ex-aide’s mother who criticised Bidzina Ivanishvili</p><p>The mother of a jailed former aide to Georgia’s de facto leader, Bidzina Ivanishvili has had her bank accounts frozen after she publicly accused Ivanishvili of pursuing a vendetta against her son.</p><p>The prosecutor’s office in Georgia acted against Marina Ramazashvili and her husband, Alexander, on the same day that the Guardian <a href=\"https://www.theguardian.com/world/2025/sep/13/former-aide-to-de-facto-leader-of-georgia-being-held-as-personal-prisoner-mother-claims\">published an interview</a> with her in which she criticised the billionaire and called for help from the west.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/georgia-freezes-bank-accounts-parents-jailed-former-aide-bidzina-ivanishvili\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ricky Hatton, former boxing world champion, dies aged 46",
      "link": "https://www.theguardian.com/sport/2025/sep/14/ricky-hatton-former-boxing-world-champion-dies",
      "pub_time_taipei": "2025-09-14T20:03:01+08:00",
      "summary": "<p>Hatton, known throughout his career as the Hitman, was one of the best-known British fighters of his generation</p><p>The British former world boxing champion Ricky Hatton has been found dead at his home at the age of 46.</p><p>Hatton, known throughout his career as the Hitman, was one of the best-known British fighters of his generation and won several world titles.</p> <a href=\"https://www.theguardian.com/sport/2025/sep/14/ricky-hatton-former-boxing-world-champion-dies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Racism or celebration? What England’s flag-hoisters are saying – and what others are hearing",
      "link": "https://www.theguardian.com/world/2025/sep/14/racism-or-celebration-what-englands-flag-hoisters-are-saying-and-what-others-are-hearing",
      "pub_time_taipei": "2025-09-14T20:00:34+08:00",
      "summary": "<p>Speaking to those who are uneasy with the proliferation of flags and those who support it is a journey of discovery</p><p>If it started anywhere it was among the suburban streets off a large roundabout in Weoley Castle, known by local people in this part of south-west Birmingham’s urban sprawl as “the square”.</p><p>From Falkirk to Folkestone, Harwich to Holyhead, fluttering off the Angel of the North and marked out on a Wiltshire white horse, the national colours of England and the United Kingdom, <a href=\"https://www.theguardian.com/uk-news/2025/sep/06/reclaim-our-flag-saltire-cultural-battleground-tensions-asylum-housing\">and Scotland</a> and Wales to a lesser extent, have been on show across the country in recent weeks.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/racism-or-celebration-what-englands-flag-hoisters-are-saying-and-what-others-are-hearing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "How the US rightwing is taking over news media and choking press freedom",
      "link": "https://www.theguardian.com/us-news/2025/sep/14/rightwing-news-media-journalism",
      "pub_time_taipei": "2025-09-14T20:00:34+08:00",
      "summary": "<p>Takeover of broadcast companies by Donald Trump’s allies is harbinger of media capitulation to authoritarian leanings</p><p>The US right has appeared to increase its influence on mainstream media in America in recent weeks, especially in television news which has been a major target of the Donald Trump administration.</p><p>CBS News – once home to legends of US journalism like Walter Cronkite and Edward R Murrow – installed a Trump ally as its ombudsman, weeks after the family of <a href=\"https://www.theguardian.com/us-news/2025/sep/11/who-is-larry-ellison-richest-person-oracle\">Larry Ellison</a>, one of the world’s richest men, and a friend of the US president, sealed control over Paramount, the owner of CBS.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/14/rightwing-news-media-journalism\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Utah campus concealed carry permit under fresh scrutiny after Kirk shooting",
      "link": "https://www.theguardian.com/us-news/2025/sep/14/utah-campus-concealed-carry-permit",
      "pub_time_taipei": "2025-09-14T20:00:33+08:00",
      "summary": "<p>HB 128, passed in August, allows people with the proper permit to openly carry  firearms on college campuses</p><p>As authorities at the federal and state levels parse the details of the fatal shooting of far-right activist Charlie Kirk at a university in Utah, a recently passed state bill that allows people with concealed-carry permits to carry firearms on college campuses has drawn fresh <a href=\"https://www.sltrib.com/news/education/2025/09/11/utah-campus-gun-law-breaking-down/\">scrutiny</a>.</p><p>Utah has allowed for permitless open and concealed carry of weapons since 2021. But before the <a href=\"https://attheu.utah.edu/facultystaff/new-rules-for-concealed-weapons-on-campus/\">passage of HB 128</a>, firearms had to be concealed when carried on college campuses. The law allowed people with the proper permit to carry them openly.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/14/utah-campus-concealed-carry-permit\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Medics in southern Gaza sound alarm over wave of newly displaced Palestinians",
      "link": "https://www.theguardian.com/world/2025/sep/14/southern-gaza-nasser-medics-displaced-palestinians-fleeing",
      "pub_time_taipei": "2025-09-14T19:59:45+08:00",
      "summary": "<p>Doctors at Nasser medical complex say it will not be able to cope with large numbers of people fleeing Gaza City</p><p>Doctors and medical staff at the largest big hospital still functioning in Gaza say they will be overwhelmed by a wave of new wounded and sick patients if hundreds of thousands of Palestinians flee the north of the devastated territory in the face of an intensifying Israeli offensive.</p><p>Dr Mohammed Saqr, the director of nursing at the Nasser medical complex near Khan Younis, in the south of Gaza, said there were not enough staff to cope with even existing demand and that supplies of medicine and fuel were running low.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/southern-gaza-nasser-medics-displaced-palestinians-fleeing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Far-right AfD forecast to make gains as North Rhine-Westphalia goes to polls",
      "link": "https://www.theguardian.com/world/2025/sep/14/germany-north-rhine-westphalia-local-elections-vote",
      "pub_time_taipei": "2025-09-14T19:11:39+08:00",
      "summary": "<p>Elections in Germany’s most populous state pose first significant test at ballot box for Friedrich Merz as chancellor</p><p>Germany’s far-right Alternative für Deutschland (AfD)party is expected to make significant gains as voters in the country’s most populous state go to the polls in local elections that are seen as Friedrich Merz’s first significant electoral test since he took office as chancellor four months ago.</p><p>North Rhine-Westphalia, home to almost a quarter of Germany’s citizens and made up of swathes of agricultural land, post-industrial towns and cities with large multi-ethnic and student populations, is viewed as something of a bellwether for the country as a whole.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/germany-north-rhine-westphalia-local-elections-vote\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mandelson seen as ‘worth the risk’ as US ambassador, minister says",
      "link": "https://www.theguardian.com/politics/2025/sep/14/mandelson-was-worth-the-risk-as-us-ambassador-business-secretary-says",
      "pub_time_taipei": "2025-09-14T19:08:27+08:00",
      "summary": "<p>Peter Kyle says ‘singular talents’ of Mandelson were balanced against warnings over links with Jeffrey Epstein</p><p>Peter Mandelson had “singular talents” which meant his appointment as US ambassador had been seen as “worth the risks” despite warnings in the vetting process over his links with Jeffrey Epstein, the business secretary has said.</p><p><a href=\"https://www.theguardian.com/politics/2025/sep/11/keir-starmer-sacks-peter-mandelson-over-jeffrey-epstein-revelations\">The dismissal of Mandelson</a> as ambassador after new revelations about his close contact with the financier after he was convicted of child sex offences has caused fury in the Labour party about the slowness of Number 10’s response, as well as a major headache ahead of the US president Donald Trump’s arrival this week for a state visit.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/14/mandelson-was-worth-the-risk-as-us-ambassador-business-secretary-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russian drone incursion into Poland ‘was Kremlin test on Nato’",
      "link": "https://www.theguardian.com/world/2025/sep/14/russian-drone-incursion-poland-nato-ukraine-europe",
      "pub_time_taipei": "2025-09-14T19:07:27+08:00",
      "summary": "<p>Polish foreign minister says Vladimir Putin seeks to test west’s reactions without triggering full-scale war</p><p>Poland’s foreign minister, Radosław Sikorski, has said last week’s <a href=\"https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military\">Russian drone incursion into Polish airspace</a> was an attempt by the Kremlin to test Nato’s reactions by incremental escalations without prompting a full-scale response.</p><p>Sikorski confirmed that while the drones used in the incursion were capable of carrying ammunition, those that reached Poland were not loaded with explosives. “Interestingly, they were all duds, which suggests to me that Russia tried to test us without starting a war,” Sikorski told the Guardian in Kyiv.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/russian-drone-incursion-poland-nato-ukraine-europe\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Epstein birthday book renews questions about links to rich and powerful men",
      "link": "https://www.theguardian.com/us-news/2025/sep/14/epstein-birthday-book-donald-trump",
      "pub_time_taipei": "2025-09-14T19:00:34+08:00",
      "summary": "<p>Book compiled by Ghislaine Maxwell contains multiple innuendo-laden letters – including one from Donald Trump</p><p>After House Democrats released a scrapbook gifted to <a href=\"https://www.theguardian.com/us-news/2019/jul/08/jeffrey-epstein-sex-trafficking-charges-court\">Jeffrey Epstein</a> for his 50th birthday, questions have emerged about whether the late child-sex trafficker’s proclivities were an open secret or, at the very least, rumored in the circle of powerful and rich people that surrounded him.</p><p>Indeed, the so-called birthday book, which was compiled by Epstein accomplice <a href=\"https://www.theguardian.com/us-news/ghislaine-maxwell\">Ghislaine Maxwell</a>, contains multiple letters that are laden with sexual innuendo – including one alleged missive from Donald Trump.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/14/epstein-birthday-book-donald-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Charlie Kirk’s death raises fears of ‘beginning of a darker chapter’ for US violence",
      "link": "https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-death-us-violence",
      "pub_time_taipei": "2025-09-14T19:00:33+08:00",
      "summary": "<p>Social media and widespread availability of lethal weapons make this era more dangerous than the 1960s – and the violence may increase</p><p><a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">Charlie Kirk’s</a> killing came amid a rise in political violence in the US, the kind now so frequent that it moves swiftly out of news cycles it would once have dominated.</p><p>The list is long and growing. From the two assassination attempts on <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> during his campaign last year to Pennsylvania Governor Josh Shapiro’s home <a href=\"https://www.theguardian.com/us-news/2025/apr/15/josh-shapiro-arson-suspect-domestic-abuse\">burnt in an arson attack</a> in April and the Democratic Minnesota state lawmaker and her husband <a href=\"https://www.theguardian.com/us-news/2025/jun/14/democratic-lawmakers-minnesota-shot\">gunned down</a> by a man dressed as a police officer in June, to name a few.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-death-us-violence\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘It’s dying in front of our eyes’: how the UK’s largest lake became an ecological disaster",
      "link": "https://www.theguardian.com/uk-news/2025/sep/14/its-dying-in-front-of-our-eyes-how-the-uks-largest-lake-became-an-ecological-disaster",
      "pub_time_taipei": "2025-09-14T19:00:32+08:00",
      "summary": "<p>Signs tout a natural paradise, but pollution from over-farming has left Northern Ireland’s Lough Neagh choked by toxic algae</p><p>The bright, cheery signs dot the shoreline like epistles from another era, a time before the calamity.</p><p>“Ballyronan marina is a picturesque boating and tourist facility on the shores of Lough Neagh,” says one. “Contours of its historical past embrace the virginal shoreline.”</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/14/its-dying-in-front-of-our-eyes-how-the-uks-largest-lake-became-an-ecological-disaster\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Florida vaccine mandate rollback falters after Trump criticism",
      "link": "https://www.theguardian.com/us-news/2025/sep/14/florida-vaccine-joseph-ladapo-trump",
      "pub_time_taipei": "2025-09-14T19:00:32+08:00",
      "summary": "<p>Surgeon general Joseph Ladapo retreats on his plans after the US president says: ‘You have vaccines that work’</p><p>It took barely two days, and some huffs of disapproval from the White House, before Joseph Ladapo’s bold plan to <a href=\"https://www.theguardian.com/us-news/2025/sep/03/florida-vaccine-mandate\">eliminate all vaccine mandates</a> in Florida began to deflate.</p><p>The action, the fervently religious state surgeon general had asserted at a fire and brimstone press conference in Tampa, came straight from the heavens: “Who am I, as a man standing here now, to tell you what you should put in your body?” he opined, framing the freedom to reject vaccines as a “reflection of God’s light against the darkness of tyranny and oppression”.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/14/florida-vaccine-joseph-ladapo-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rubio arrives in Israel amid tensions over strike on Hamas leaders in Qatar",
      "link": "https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas",
      "pub_time_taipei": "2025-09-14T17:48:49+08:00",
      "summary": "<p>US secretary of state says Trump ‘not happy’ about Israeli attack that targeted Hamas officials in Doha for Gaza talks</p><p>The US secretary of state, Marco Rubio, has arrived in Israel seeking to mend a rift with Washington’s other allies in the region over <a href=\"https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas\">Israel’s attempted assassination of Hamas leaders in Qatar</a> and the accelerated expansion of settlements in the occupied West Bank.</p><p>In talks with the Israeli prime minister, Benjamin Netanyahu, Rubio will try to balance criticism of the Israeli airstrike on a Doha building, which killed aides to a Hamas leader and a Qatari security officer, with a message of overall support for Israel before the expected formal recognition of Palestine by a number of other US allies, including the UK, France, Canada, Australia and Belgium.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brazilian musician identified as victim of 1976 killing by Argentina military",
      "link": "https://www.theguardian.com/world/2025/sep/14/francisco-tenorio-cerqueira-junior-murdered-argentina-military",
      "pub_time_taipei": "2025-09-14T17:00:29+08:00",
      "summary": "<p>The bossa nova pianist Francisco Tenório Cerqueira Júnior went out for cigarettes after a concert in Buenos Aires – a forensic team has finally revealed his fate</p><p>Early on 18 March 1976, Francisco Tenório Cerqueira Júnior, <a href=\"https://www.youtube.com/watch?v=lwFTynDaoB4\">a Brazilian pianist</a> who had played alongside some of Latin America’s greatest musicians, disappeared from the streets of Buenos Aires.</p><p>For nearly 50 years, his fate has remained a mystery, sparking desperate searches, raising suspicions of government complicity, and inspiring international documentaries. Now the mystery has been solved, with forensic scientists formally identifying Tenório Júnior’s body – and confirming he was a victim of Argentina’s bloody dictatorship.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/francisco-tenorio-cerqueira-junior-murdered-argentina-military\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "England’s King Charles III lives another, slower life in Transylvania",
      "link": "https://www.washingtonpost.com/world/2025/09/14/englands-king-charles-iii-lives-another-slower-life-transylvania/",
      "pub_time_taipei": "2025-09-14T17:00:01+08:00",
      "summary": "For decades, Charles has returned regularly to Romanian villages that are lost in time."
    },
    {
      "source": "衛報",
      "title": "‘A facility for them’: Labor says WA shipyard to be used by US for sub maintenance as it commits $12bn",
      "link": "https://www.theguardian.com/world/2025/sep/14/a-facility-for-them-labor-says-wa-shipyard-to-be-used-by-us-for-sub-maintenance-as-it-commits-12bn",
      "pub_time_taipei": "2025-09-14T15:29:40+08:00",
      "summary": "<p>Defence minister says Henderson naval shipyard south of Perth ‘very much an Australian sovereign capability’ but admits US will use it too</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The US will be able to use a major naval precinct in Western Australia to dock and maintain its own nuclear-powered submarines, the federal government has confirmed, after committing $12bn to upgrade the shipyard.</p><p>The prime minister, Anthony Albanese, on Sunday insisted the shipyard was an “Australian facility” as he downplayed suggestions the announcement was timed to appease US demands for increased Australian defence spending ahead of a potential face-to-face meeting with Donald Trump.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/a-facility-for-them-labor-says-wa-shipyard-to-be-used-by-us-for-sub-maintenance-as-it-commits-12bn\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Boosted by summits in Alaska and China, Putin moves against Europe, Ukraine",
      "link": "https://www.washingtonpost.com/world/2025/09/14/putin-trump-summits-alaska-china-ukraine/",
      "pub_time_taipei": "2025-09-14T15:00:00+08:00",
      "summary": "Russia has been emboldened in its strategy of splitting the U.S. from Europe while pushing ever harder to gain a military victory in Ukraine."
    },
    {
      "source": "衛報",
      "title": "The question for the NSW Liberals after the Kiama drubbing is: can anyone do better than Mark Speakman?",
      "link": "https://www.theguardian.com/australia-news/2025/sep/14/the-question-for-the-nsw-liberals-after-the-kiama-drubbing-is-can-anyone-do-better-than-mark-speakman",
      "pub_time_taipei": "2025-09-14T14:08:07+08:00",
      "summary": "<p>Kellie Sloane has ruled out moving a spill and James Griffin isn’t eager. Alister Henskens is thought to lack the numbers. So, for now, the leader might be safe</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Byelections are usually a referendum on the government. But Saturday’s Kiama byelection – and the <a href=\"https://www.theguardian.com/australia-news/2025/sep/13/labor-claims-win-in-kiama-byelection-with-katelin-mcinerney-to-replace-convicted-rapist-gareth-ward\">poor performance of the New South Wales Liberals</a> – has deepened angst within the opposition party regarding Mark Speakman’s leadership.</p><p>In Kiama, Labor increased its primary vote – a feat in itself in a byelection – and looks set to achieve an impressive swing on a two-party-preferred basis. Labor’s Katelin McInerney is on track for <a href=\"https://results.elections.nsw.gov.au/SB2502/Kiama/Parliamentary/TwoCandidatesPreferredReport.html\">a thumping 60% to 40%</a> 2PP victory over the Liberal candidate Serena Copley.</p><p>Anne Davies is Guardian Australia’s NSW state correspondent</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/14/the-question-for-the-nsw-liberals-after-the-kiama-drubbing-is-can-anyone-do-better-than-mark-speakman\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chinese carmakers told to improve locking devices for UK market",
      "link": "https://www.theguardian.com/business/2025/sep/14/chinese-carmakers-told-improve-locking-devices-uk-market",
      "pub_time_taipei": "2025-09-14T14:00:26+08:00",
      "summary": "<p>UK insurers require critical modifications for sale in country with higher levels of car theft than China</p><p>British authorities may have <a href=\"https://www.theguardian.com/environment/2025/apr/29/source-of-data-are-electric-cars-vulnerable-to-cyber-spies-and-hackers\">well-founded concerns</a> about the cyber-spying threat from vehicles made in China, but it turns out the country’s manufacturers have security worries of their own.</p><p>Insurers have told Chinese carmakers they need certain critical modifications for vehicles on British streets: namely, tougher locking devices to make them harder to steal.</p> <a href=\"https://www.theguardian.com/business/2025/sep/14/chinese-carmakers-told-improve-locking-devices-uk-market\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sussan Ley announces shadow ministry reshuffle after Nampijinpa Price demotion – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/14/australia-news-live-albanese-papua-new-guinea-aldi-solar-environment-richard-marles-sunday-ntwnfb",
      "pub_time_taipei": "2025-09-14T12:59:51+08:00",
      "summary": "<p>This blog is now closed.</p><p><strong>‘We’ve got an eye to recruiting out of PNG into the defence force’ – Marles</strong></p><p>Marles is asked about statements from his PNG counterpart about what may or may not be in the agreement, including more integration between PNG and Australian defences forces, and specifically whether there has been any confusion.</p><p>I’m very pleased to see the excitement that [the PNG defence minister] Billy [Joseph] is bringing to this and it does, to be honest, reflect the way in which we have been going about this agreement since the moment that he and I first met to do this refresh back in January this year and it has turned into something much more than a refresh.</p><p>It is a really significant agreement that we will be signing, but it does reflect the fact that we are doing so many more exercises together, so many more operations together. We are really working hand in glove as two defence forces and I think this is profoundly important.</p><p>I think what you can take, though, is that this is a really important statement from Papua New Guinea and indeed from Australia, to each other, and I think this is Papua New Guinea making it really clear that traditional partners, and they’ve talked about this a lot, the traditional partners is where they look to in terms of their security, and from an Australian point of view, PNG is obviously on our northern flank.</p><p>It really matters that we have the very best relationship that we can have with PNG in a security sense, and I’m really excited about the fact that this agreement is going to give expression to that.</p><p>We’re doing so much more with PNG now. I think it is fair to say that as we’ve walked down that path over the course of the last few months, and we’ve been doing it with a view to signing this agreement in conjunction with the 50th anniversary of PNG’s independence, it is fair to say a lot more ambition has been brought to this agreement and we are really excited about the agreement that we will be signing in the next few days.</p><p>It certainly will transform the defence relationship between Australia and PNG, but beyond that, if you look at the various defence agreements we have with countries around the world, actually, it is hugely significant in that context.</p><p>The prime minister will be signing this in the next few days, so I will let the prime minister make those announcements and you will see them shortly enough.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/14/australia-news-live-albanese-papua-new-guinea-aldi-solar-environment-richard-marles-sunday-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Porepunkah travel warnings eased after ‘largest ever’ tactical police operation in search for Dezi Freeman",
      "link": "https://www.theguardian.com/australia-news/2025/sep/14/porepunkah-travel-warnings-eased-after-search-for-dezi-freeman-involving-largest-ever-tactical-policing-operation-ntwnfb",
      "pub_time_taipei": "2025-09-14T12:28:44+08:00",
      "summary": "<p>More than 125 specialist officers search ‘abandoned structures, mineshafts and huts’ with Victoria police urging locals to remain vigilant</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/14/australia-news-live-albanese-papua-new-guinea-aldi-solar-environment-richard-marles-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Victorian authorities have lifted travel restrictions in the Porepunkah area, days after mounting Australia’s “largest ever” tactical policing operation to sweep the rugged bushland searching for fugitive Dezi Freeman.</p><p>Suspected police killer Freeman has been sought since 26 August, when he allegedly shot and killed two officers who were executing a search warrant at his residence in Victoria’s north-east.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/14/porepunkah-travel-warnings-eased-after-search-for-dezi-freeman-involving-largest-ever-tactical-policing-operation-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Romania reports Russian drone in its airspace as Poland scrambles jets again",
      "link": "https://www.theguardian.com/world/2025/sep/14/romania-reports-russian-drone-in-its-airspace-as-poland-scrambles-jets-again",
      "pub_time_taipei": "2025-09-14T08:51:40+08:00",
      "summary": "<p>Volodymyr Zelenskyy says drone incursions are ‘an obvious expansion of the war by Russia’ as neighbouring countries deploy air defences</p><ul><li><p><a href=\"https://www.theguardian.com/world/ukraine\">See all our Ukraine war coverage</a></p></li></ul><p>Romania became the latest Nato member state to report a drone incursion into its airspace , with Poland scrambling aircraft in response to fresh Russian drone strikes just over the border in Ukraine.</p><p>Romania’s defence ministry said on Saturday its airspace had been breached by a drone during a Russian attack on infrastructure in neighbouring Ukraine. Romania scrambled two F-16 fighter jets late on Saturday to monitor the situation after the strikes, the ministry said in statement.</p> <a href=\"https://www.theguardian.com/world/2025/sep/14/romania-reports-russian-drone-in-its-airspace-as-poland-scrambles-jets-again\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN condemns reported Haitian village massacre by armed gangs",
      "link": "https://www.theguardian.com/world/2025/sep/13/un-condemns-reported-haitian-village-massacre-by-armed-gangs",
      "pub_time_taipei": "2025-09-14T06:26:51+08:00",
      "summary": "<p>Fishing village of Labodrie reportedly set on fire after killing of a gang leader in sign of rising violence outside capital</p><p>The UN secretary-general has condemned the reported killing of at least 40 people during an attack by armed gangs in a fishing village north of Haiti’s capital.</p><p>Media in Haiti widely reported that the attack took place on Thursday night in Labodrie. It is another sign of escalating gang violence that has spread outside the capital.</p> <a href=\"https://www.theguardian.com/world/2025/sep/13/un-condemns-reported-haitian-village-massacre-by-armed-gangs\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Oscar-winning Palestinian says home in West Bank raided by Israeli soldiers",
      "link": "https://www.theguardian.com/world/2025/sep/13/oscar-winning-palestinian-says-home-in-west-bank-raided-by-israeli-soldiers",
      "pub_time_taipei": "2025-09-14T05:35:58+08:00",
      "summary": "<p>Director Basel Adra reports his property was stormed while he was at a hospital with relatives injured in settler attacks</p><p>Palestinian Oscar-winning director Basel Adra has said that Israeli soldiers have conducted a raid at his West Bank home, searching for him and going through his wife’s phone.</p><p>Israeli settlers attacked his village on Saturday, injuring two of his brothers and one cousin, Adra told the Associated Press. He accompanied them to the hospital. While there, he said that he heard from family in the village that nine Israeli soldiers had stormed his home.</p> <a href=\"https://www.theguardian.com/world/2025/sep/13/oscar-winning-palestinian-says-home-in-west-bank-raided-by-israeli-soldiers\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Belgium prime minister attends concert of Israeli conductor axed by festival",
      "link": "https://www.theguardian.com/world/2025/sep/13/belgium-prime-minister-attends-concert-of-israeli-conductor-axed-by-festival",
      "pub_time_taipei": "2025-09-14T04:01:59+08:00",
      "summary": "<p>Bart De Wever travelled to Essen, Germany to hear performance conducted by Lahav Shani, the music director of the Israel Philharmonic</p><p>Belgium’s prime minister, Bart De Wever, has said he attended a concert by a German orchestra that was uninvited from a Belgian festival to show support for its Israeli conductor.</p><p>The cancellation of a planned performance at the Flanders festival Ghent by the Munich Philharmonic over concerns about its Israeli future chief conductor, Lahav Shani, has triggered a storm of criticism and accusations of antisemitism.</p> <a href=\"https://www.theguardian.com/world/2025/sep/13/belgium-prime-minister-attends-concert-of-israeli-conductor-axed-by-festival\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "After four decades of stalled attempts, there’s a new plan to ‘transform’ Sydney’s ugliest road",
      "link": "https://www.theguardian.com/australia-news/2025/sep/14/after-four-decades-of-stalled-attempts-theres-a-new-plan-to-transform-sydneys-ugliest-road",
      "pub_time_taipei": "2025-09-14T04:00:15+08:00",
      "summary": "<p>NSW government to rezone Parramatta Road corridor and make room for 8,000 new homes – but plan omits mooted light rail</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/14/australia-news-live-albanese-papua-new-guinea-aldi-solar-environment-richard-marles-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Sydney’s “ugliest road” is again being touted as the next development hotspot, with plans by the Minns government to rezone and develop about 8,000 new homes along Parramatta Road in Leichhardt and Camperdown, in the city’s inner west.</p><p>The state government and Inner West councillors have agreed to partner on rezoning along the Parramatta Road corridor to deliver a major boost to housing close to the CBD.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/14/after-four-decades-of-stalled-attempts-theres-a-new-plan-to-transform-sydneys-ugliest-road\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Billion-dollar coffins? New technology could make oceans transparent and Aukus submarines vulnerable",
      "link": "https://www.theguardian.com/australia-news/2025/sep/14/aukus-australian-submarines-vulnerable-new-technology",
      "pub_time_taipei": "2025-09-14T04:00:14+08:00",
      "summary": "<p>Quantum sensing, satellite tracking and AI are part of an accelerating arms race in detection that should prompt a re-evaluation of Australia’s defence strategy</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/14/australia-news-live-albanese-papua-new-guinea-aldi-solar-environment-richard-marles-sunday-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Military history is littered with the corpses of apex predators.</p><p>The Gatling gun, the battleship, the tank. All once possessed unassailable power – then were undermined, in some cases wiped out, by the march of new technology.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/14/aukus-australian-submarines-vulnerable-new-technology\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mexican congressional staffer resigns after TV comments about Charlie Kirk",
      "link": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-mexican-congressional-staffer-resigns",
      "pub_time_taipei": "2025-09-14T03:59:09+08:00",
      "summary": "<p>News network Milenio releases public apology after US deputy secretary of state threatens to revoke Mexican visas</p><p>A congressional staffer from Mexico’s ruling party has resigned after being called out online for comments he made on a major Mexican television news program about Turning Point USA executive director <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">Charlie Kirk’s murder</a>.</p><p>The news network, Milenio, also released a public apology after the United States’ deputy secretary of state – a former ambassador to Mexico – evidently threatened to have Donald Trump’s presidential administration revoke any US visas on which it may count.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-mexican-congressional-staffer-resigns\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pakistan security forces kill 35 militants in raids on Pakistani Taliban",
      "link": "https://www.theguardian.com/world/2025/sep/13/pakistan-security-forces-kill-pakistani-taliban-militants",
      "pub_time_taipei": "2025-09-13T23:46:18+08:00",
      "summary": "<p>Twelve soldiers also killed during raids on two TTP hideouts on border with Afghanistan</p><p>Fierce clashes broke out in Pakistan near the border with Afghanistan when Pakistani security forces raided two hideouts of the Pakistani Taliban, killing 12 soldiers and 35 militants, the military said on Saturday.</p><p>Twenty-two militants were killed in the first raid in Bajaur, a district in north-western Khyber Pakhtunkhwa province. Thirteen more were killed in a separate operation in South Waziristan district.</p> <a href=\"https://www.theguardian.com/world/2025/sep/13/pakistan-security-forces-kill-pakistani-taliban-militants\">Continue reading...</a>"
    }
  ]
}