{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-10T20:40:07.335817+08:00",
  "window_end_taipei": "2025-10-11T20:40:07.335817+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Militia strikes kill at least 60 in Sudan displacement camp, says El Fasher group",
      "link": "https://www.theguardian.com/world/2025/oct/11/militia-drone-strike-kills-people-at-displacement-shelter-in-sudan-says-local-group",
      "pub_time_taipei": "2025-10-11T20:16:50+08:00",
      "summary": "<p>Drone and artillery strikes by RSF paramilitary group hit Dar al-Arqam shelter in western city, says resistance committee</p><p>Militia drone and artillery strikes have killed at least 60 people at a displacement shelter in the besieged city of El Fasher in western Sudan, a local activist group said.</p><p>The Resistance Committee for El Fasher said the Rapid Support Forces (RSF) paramilitary group hit the Dar al-Arqam displacement centre, which is in the grounds of a university.</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/militia-drone-strike-kills-people-at-displacement-shelter-in-sudan-says-local-group\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump says ‘for the most part, there is consensus’ on next stages of Gaza ceasefire plan – live",
      "link": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
      "pub_time_taipei": "2025-10-11T20:16:48+08:00",
      "summary": "<p>US president adds Hamas were gathering the hostages now, as displaced Palestinians return to northern Gaza</p><p><strong><a href=\"https://www.theguardian.com/profile/malak-a-tantesh\">Malak A Tantesh</a></strong>, a young reporter who has contributed to the Guardian’s coverage, has written about a harrowing two years in besieged <strong>Gaza</strong>. You can read her account here:</p><p>The <strong>Trump</strong> plan calls for <strong>Israel</strong> to maintain an open-ended military presence inside <strong>Gaza</strong>, along its border with Israel. An international force, comprised largely of <strong>troops from Arab and Muslim countries</strong>, would be responsible for security inside Gaza. The <strong>US</strong> would lead a large internationally funded reconstruction effort, reports the Associated Press (AP).<br /><br />\n The plan envisions an eventual role for the <strong>Palestinian Authority</strong> – something Israeli prime minister <strong>Benjamin Netanyahu</strong> has long opposed. But it requires the authority, which administers parts of the <strong>West Bank</strong>, to undergo a sweeping reform programme that could take years.<br /><br />\n According to the AP, the <strong>Trump</strong> plan is even more vague about a future <strong>Palestinian state</strong>, which Netanyahu firmly rejects.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "North Korea flaunts nuclear arsenal at military parade in challenge to West",
      "link": "https://www.washingtonpost.com/world/2025/10/09/north-korea-kim-jong-un-military-parade/",
      "pub_time_taipei": "2025-10-11T20:12:18+08:00",
      "summary": "Kim Jong Un showed off new weapons systems at a parade in Pyongyang, with Chinese and Russian guests of honor, in their latest display of solidarity."
    },
    {
      "source": "衛報",
      "title": "‘Page one of the authoritarian playbook’: how Trump and allies are exploiting Kirk’s killing",
      "link": "https://www.theguardian.com/us-news/2025/oct/11/charlie-kirk-trump-maga-allies",
      "pub_time_taipei": "2025-10-11T20:00:23+08:00",
      "summary": "<p>The president and his Maga allies have used the rightwing influencer’s killing to justify attacks on critics, experts say</p><p>Donald Trump and Maga allies have capitalized on the killing of rightwing influencer Charlie Kirk to expand attacks on liberal groups, donors, Democrats, and others by tarring many critics as the “enemy within” and “radical left” in a move that legal scholars and historians call authoritarian and anti-democratic.</p><p>Kirk’s killing by a lone gunman spurred Trump and top allies to quickly launch conspiratorial charges against a bevy of political foes and an investigation of billionaire liberal donor George Soros. They also threatened legal action against TV network ABC after their late-night star Jimmy Kimmel’s suspension over clumsy comments about Kirk ended.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/11/charlie-kirk-trump-maga-allies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘It’s a question of humanity’: how a small Spanish town made headlines over its immigration stance",
      "link": "https://www.theguardian.com/world/2025/oct/11/small-spanish-town-headlines-immigration-villamalea",
      "pub_time_taipei": "2025-10-11T20:00:22+08:00",
      "summary": "<p>Mayor explains why Villamalea unanimously backed call to regularise undocumented migrants – across party lines</p><p>Flanked by farmland and nestled among the deep valleys of central Spain, few in Villamalea, a town of 4,200 people, expected to find their tranquil home splashed across Spanish media this summer.</p><p>“I’ve never been contacted by so many media outlets in my life,” said José Núñez Pérez, the conservative mayor of Villamalea. With a laugh, he added: “It made me question, just what have we done here?”</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/small-spanish-town-headlines-immigration-villamalea\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tony Blair met Jeffrey Epstein in No 10 on advice of Peter Mandelson, documents reveal",
      "link": "https://www.theguardian.com/politics/2025/oct/11/tony-blair-met-jeffrey-epstein-in-no-10-on-advice-of-peter-mandelson-documents-reveal",
      "pub_time_taipei": "2025-10-11T19:49:09+08:00",
      "summary": "<p>National Archives papers show how then MP pushed for 2002 meeting between PM and ‘young and vibrant’ financier</p><p>Sir Tony Blair met Jeffrey Epstein in Downing Street while he was prime minister after a recommendation by Peter Mandelson, newly released papers from the National Archives show.</p><p>Epstein visited Blair on 14 May 2002, after the suggestion by Lord Mandelson to the prime minister’s then chief of staff, Jonathan Powell.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/11/tony-blair-met-jeffrey-epstein-in-no-10-on-advice-of-peter-mandelson-documents-reveal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Revealed: Labour-run council using legal loophole to serve families with no-fault evictions",
      "link": "https://www.theguardian.com/society/2025/oct/11/lambeth-council-legal-loophole-no-fault-evictions",
      "pub_time_taipei": "2025-10-11T19:17:33+08:00",
      "summary": "<p>Exclusive: London council created an arm’s-length body to manage some of its housing stock</p><p>A Labour-run council is using a legal loophole to issue dozens of families with no-fault evictions, despite Keir Starmer’s manifesto pledge to outlaw the practice.</p><p><a href=\"https://www.theguardian.com/money/article/2024/sep/06/labour-moves-to-end-no-fault-evictions-within-months\">Scrapping no-fault evictions</a> “immediately” was one of Labour’s main manifesto pledges before its 2024 election win, but more than a year on, the party’s flagship renters’ rights bill has not been made law.</p> <a href=\"https://www.theguardian.com/society/2025/oct/11/lambeth-council-legal-loophole-no-fault-evictions\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Widow of man conned out of pension savings to lose half the compensation to tax",
      "link": "https://www.theguardian.com/politics/2025/oct/11/norton-motorcycles-pension-scandal-victims-widow-to-lose-almost-half-of-payout-tax-rule",
      "pub_time_taipei": "2025-10-11T19:00:22+08:00",
      "summary": "<p>Robert Dewar’s widow, Susan, is a leading campaigner over multimillion-pound Norton Motorcycles fraud</p><p>The family of a deceased man, who was conned out of his retirement savings after investing in the Norton Motorcycles pension scam, is to lose almost half the subsequent compensation award because of a little-known tax rule.</p><p>A long-running battle to win an award from the Fraud Compensation Fund (FCF) meant that Robert Dewar’s pension was not reimbursed until 2024, five years after his death at the age of 64.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/11/norton-motorcycles-pension-scandal-victims-widow-to-lose-almost-half-of-payout-tax-rule\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Democrats refuse to fold over shutdown as Republican outrage builds",
      "link": "https://www.theguardian.com/us-news/2025/oct/11/republicans-democrats-us-government-shutdown",
      "pub_time_taipei": "2025-10-11T18:00:21+08:00",
      "summary": "<p>Party sticks to its guns on healthcare and says it’s willing to hold out – much to the delight of its progressive supporters</p><p>When he sat down to talk about the US government shutdown with reporters from a closely read political newsletter this week, Chuck Schumer sounded as if he was relishing his standoff with the Republicans.</p><p>“Every day gets better for us,” he told Punchbowl News. As the shutdown got under way, Schumer explained, the Republican part believed that Democrats would quickly fold and vote to reopen the government, but instead they had stuck to their guns for a week and a half, demanding an array of concessions on healthcare and other issues.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/11/republicans-democrats-us-government-shutdown\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Man will plead guilty to threatening Pride event after Charlie Kirk’s death",
      "link": "https://www.theguardian.com/us-news/2025/oct/11/texas-man-threaten-pride-event-charlie-kirk",
      "pub_time_taipei": "2025-10-11T18:00:21+08:00",
      "summary": "<p>Joshua Wayne Cole to admit in court to making online posts about shooting people at an LGBTQ+ parade in Texas</p><p>A <a href=\"https://www.theguardian.com/us-news/texas\">Texas</a> man has agreed to plead guilty to going on social media and <a href=\"https://www.theguardian.com/us-news/2025/sep/27/fbi-arrest-man-texas-pride-parade\">threatening to shoot people at an LGBTQ+ parade</a> as vengeance for the murder of conservative political activist Charlie Kirk.</p><p>Joshua Wayne Cole signed federal court filings indicating that he planned to plead guilty to a charge of interstate threatening communications at a hearing tentatively set for 16 October, about a month after he was arrested in connection with online posts threatening to open fire on a Pride parade in Abilene, Texas.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/11/texas-man-threaten-pride-event-charlie-kirk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Is London in the grip of a crime wave? It’s not so simple",
      "link": "https://www.theguardian.com/uk-news/2025/oct/11/is-london-in-the-grip-of-a-wave-its-not-so-simple",
      "pub_time_taipei": "2025-10-11T18:00:20+08:00",
      "summary": "<p>Perception of runaway crime partly blamed for ‘driving away the super-rich’ but in reality some high-profile offences such as watch theft are falling</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2024/oct/09/they-rob-you-visibly-with-no-repercussions-the-unstoppable-rise-of-phone-theft\">‘Snatch theft’: the unstoppable rise of phone theft</a></p></li></ul><p></p><p>London is no longer a safe place to live, at least in the eyes of some of its richest residents – and the 47th president of the United States.</p><p>“I think he’s done a terrible job,” Donald Trump said during his state visit to the UK last month, in his latest broadside at London’s mayor, Sadiq Khan. “Crime in London is through the roof.”</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/11/is-london-in-the-grip-of-a-wave-its-not-so-simple\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Germany, where beer is sacred, now leads world in nonalcoholic brews",
      "link": "https://www.washingtonpost.com/world/2025/10/11/germany-nonalcoholic-beer-sales-boom/",
      "pub_time_taipei": "2025-10-11T17:41:29+08:00",
      "summary": "Germany, long known for traditional brewing, has seen a boom in nonalcoholic beers, which are being embraced by young people and athletes as a healthy alternative."
    },
    {
      "source": "華盛頓郵報",
      "title": "China’s demographic crisis means it’s going to run out of workers",
      "link": "https://www.washingtonpost.com/world/interactive/2025/china-population-decline-worker-crisis/",
      "pub_time_taipei": "2025-10-11T17:00:05+08:00",
      "summary": "China is experiencing unprecedented, and probably irreversible, population decline that will hamper its economic growth and its ambitions to rival the United States."
    },
    {
      "source": "華盛頓郵報",
      "title": "Gazans will return to a shattered city after Israel leveled its high-rises",
      "link": "https://www.washingtonpost.com/world/interactive/2025/gaza-city-bombing-high-rise-towers/",
      "pub_time_taipei": "2025-10-11T17:00:01+08:00",
      "summary": "Israeli bombardment punched large holes in Gaza City’s skyline by repeatedly demolishing high-rise buildings containing hundreds of homes and businesses."
    },
    {
      "source": "衛報",
      "title": "Number of wild bee species at risk of extinction in Europe doubles in 10 years",
      "link": "https://www.theguardian.com/environment/2025/oct/11/number-of-wild-bee-species-at-risk-of-extinction-in-europe-doubles-in-10-years",
      "pub_time_taipei": "2025-10-11T16:45:18+08:00",
      "summary": "<p>Number of endangered butterfly species also surging amid habitat destruction and global heating, finds study</p><p>The number of wild bee species in Europe at risk of extinction has more than doubled over the past decade, while the number of endangered butterfly species has almost doubled.</p><p>The jeopardy facing crucial pollinators was revealed by scientific studies for the <a href=\"https://www.iucnredlist.org/\">International Union for Conservation of Nature (IUCN) red list of threatened species</a>, which found that at least 172 bee species out of 1,928 were at risk of extinction in Europe.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/11/number-of-wild-bee-species-at-risk-of-extinction-in-europe-doubles-in-10-years\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tony Blair and Nick Clegg hosted dinner giving tech bosses access to UK minister",
      "link": "https://www.theguardian.com/politics/2025/oct/11/tony-blair-and-nick-clegg-hosted-dinner-giving-tech-bosses-access-to-uk-minister",
      "pub_time_taipei": "2025-10-11T16:05:07+08:00",
      "summary": "<p>Exclusive: Six tech leaders dined with investment minister, documents reveal, underlining growing influence of ex-PM’s consultancy</p><p>Tony Blair and Nick Clegg hosted a private dinner earlier this year at which a select group of technology entrepreneurs were given access to a key minister, official documents have revealed.</p><p>The former prime minister, who is a champion of the tech industry, held the dinner in an upmarket London hotel in his capacity as the head of the<strong> </strong>Tony Blair Institute (TBI) political consultancy.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/11/tony-blair-and-nick-clegg-hosted-dinner-giving-tech-bosses-access-to-uk-minister\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘The Algarve is Chega’s kingdom’: resort city’s voters tempted by far-right party",
      "link": "https://www.theguardian.com/world/2025/oct/11/algarve-albufeira-chega-far-right-local-elections-portugal",
      "pub_time_taipei": "2025-10-11T15:00:17+08:00",
      "summary": "<p>Chega supporters in Albufeira hope party can use Sunday’s local elections as springboard for nationwide takeover</p><p>The road into Albufeira is thronged with billboards. Some, such as the faded one on a roundabout leading to the centre of the southern Portuguese resort city, offer sun-bleached glimpses of enticing real estate, golden beaches and vibrant nightlife. Others that have sprung up before Sunday’s local elections peddle promises of a different kind.</p><p>By far the most numerous are those belonging to the far-right Chega party. Its political posters feature one-line grievances about the state of public health, education and housing and tell passing drivers that all these problems will be solved once Chega is in charge.</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/algarve-albufeira-chega-far-right-local-elections-portugal\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Why Qatar is building an air force training facility at a U.S. military base",
      "link": "https://www.washingtonpost.com/national-security/2025/10/11/qatar-air-foce-facility-us-idaho/",
      "pub_time_taipei": "2025-10-11T14:50:46+08:00",
      "summary": "Defense Secretary Pete Hegseth said Mountain Home Air Force Base in Idaho will host Qatari pilots at the military facility. The base will remain under U.S. jurisdiction."
    },
    {
      "source": "衛報",
      "title": "International journalists urge Israel to allow reporters into Gaza after ceasefire deal",
      "link": "https://www.theguardian.com/media/2025/oct/11/international-journalists-gaza-israel-press-freedom",
      "pub_time_taipei": "2025-10-11T14:30:15+08:00",
      "summary": "<p>Foreign Press Association joins long list of global media agencies demanding press freedom in devastated territory</p><p>International journalists in Israel have called for reporters to be granted immediate access to Gaza after the rapidly negotiated ceasefire came into effect, joining a long list of international media organizations demanding press freedom in the devastated territory.</p><p>In a statement <a href=\"https://x.com/FPAIsPal/status/1976580864172597276/photo/1\">released</a> on Friday, the Foreign Press Association (FPA) urged Israel to “immediately open the borders and allow international media free and independent access to the Gaza Strip” now that hostilities have ceased. The organization also noted that the supreme court is expected to hear arguments on 23 October, “after more than a year in which the state has been allowed to delay its response”.</p> <a href=\"https://www.theguardian.com/media/2025/oct/11/international-journalists-gaza-israel-press-freedom\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hackers leak Qantas data containing 5 million customer records after ransom deadline passes",
      "link": "https://www.theguardian.com/business/2025/oct/11/hackers-leak-qantas-data-containing-5-million-customer-records-after-ransom-deadline-passes",
      "pub_time_taipei": "2025-10-11T13:03:52+08:00",
      "summary": "<p>Hacker collective Scattered Lapsus$ Hunters demanded payment in return for preventing the stolen data of nearly 40 companies from being shared</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Hackers say they have leaked the personal records of 5 million Qantas customers on the dark web, after a ransom deadline set by the cybercriminals passed.</p><p>The airline is one of more than 40 firms globally caught up in the hack, reported to contain up to 1 billion customer records.</p> <a href=\"https://www.theguardian.com/business/2025/oct/11/hackers-leak-qantas-data-containing-5-million-customer-records-after-ransom-deadline-passes\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Three people dead after light plane crashes on take-off near Wollongong",
      "link": "https://www.theguardian.com/australia-news/2025/oct/11/three-people-dead-after-light-plane-crashes-on-take-off-near-wollongong",
      "pub_time_taipei": "2025-10-11T11:41:25+08:00",
      "summary": "<p>The aircraft caught on fire soon after taking off from Shellharbour airport at about 10am on Saturday</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Three people have died after a light plane crashed at Shellharbour Airport on Saturday morning near Wollongong in New South Wales.</p><p>The plane took-off at about 10am before crashing and catching fire.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/11/three-people-dead-after-light-plane-crashes-on-take-off-near-wollongong\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Unease at slow pace of change in Nepal one month on from gen Z protests",
      "link": "https://www.theguardian.com/world/2025/oct/11/nepal-gen-z-protests-one-month-on-slow-change",
      "pub_time_taipei": "2025-10-11T11:00:11+08:00",
      "summary": "<p>Promised crackdown on corruption is not happening fast enough for many who saw government toppled within a day of protests</p><p>Prakash Bohora was one of the first of Nepal’s gen Z protesters to feel the sting of a police bullet. Like thousands of other young people, he had taken to the streets of the capital last month to <a href=\"https://www.theguardian.com/world/2025/sep/08/nepal-bans-26-social-media-sites-including-x-whatsapp-and-youtube\">protest against corruption</a> and a draconian ban on social media.</p><p>He had no idea that day in Kathmandu would escalate into what is now described as Nepal’s gen Z revolution, which saw the <a href=\"https://www.theguardian.com/world/2025/sep/09/nepal-protests-social-media-ban-lifted-gen-z-kathmandu\">toppling of the government</a> within a day, the dissolution of parliament and appointment of a new interim prime minister, the anti-corruption hardliner Sushila Karki, by the end of the week.</p> <a href=\"https://www.theguardian.com/world/2025/oct/11/nepal-gen-z-protests-one-month-on-slow-change\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "After uproar, Pete Hegseth clarifies Qatari air force facility in Idaho is not a foreign base – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
      "pub_time_taipei": "2025-10-11T10:03:11+08:00",
      "summary": "<p>Earlier, Pentagon chief shared that location would host ‘contingent of Qatari F-15s and pilots’. This blog is now closed.</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/10/federal-workers-pay-government-shutdown\">White House announces federal worker layoffs as government shutdown nears third week</a></p></li></ul><p>As the shutdown enters its 10th day, and both chambers are out of session today, House speaker <strong>Mike Johnson</strong> has defended not passing a separate bill that would keep members of the military paid throughout the shutdown.</p><p>“Republicans have voted to OPEN the government and get our troops, Border Patrol, TSA, and veterans PAID,” Johnson said, before blaming Democratic leadership for refusing to pass the House-passed continuing resolution. “Chuck Schumer is terrified of a challenge from the Marxist left – so he and the Democrats voted to CLOSE the government-and to STOP PAYCHECKS from being issued.”</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump completes ‘semiannual’ physical before traveling to Middle East",
      "link": "https://www.theguardian.com/us-news/2025/oct/10/trump-physical-walter-reed",
      "pub_time_taipei": "2025-10-11T10:02:24+08:00",
      "summary": "<p>White House had described doctor visit as ‘routine yearly checkup’ although president had annual physical in April</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> – the oldest person ever to be elected US president – had what he has described as a “semiannual physical” at the Walter Reed national military medical center on Friday.</p><p>The visit, which the White House announced earlier this week, comes as Trump is preparing to travel to the Middle East on the heels of a ceasefire deal in the <a href=\"https://www.theguardian.com/world/israel-hamas-war\">Israel-Hamas war</a>. The White House press secretary, Karoline Leavitt, described it as a “routine yearly checkup”, although the president had his annual physical in April.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/10/trump-physical-walter-reed\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "France’s Macron reappoints prime minister days after he quit",
      "link": "https://www.washingtonpost.com/world/2025/10/10/macron-lecornu-reappointment-prime-minister-france/",
      "pub_time_taipei": "2025-10-11T07:17:27+08:00",
      "summary": "Sébastien Lecornu resigned as French prime minister this week after less than a month in office, and less than a day after forming a cabinet. Now he’s back."
    },
    {
      "source": "華盛頓郵報",
      "title": "María Corina Machado, Venezuelan opposition leader, wins Nobel Peace Prize",
      "link": "https://www.washingtonpost.com/world/2025/10/10/maria-machado-nobel-peace-prize-venezuela/",
      "pub_time_taipei": "2025-10-11T05:40:19+08:00",
      "summary": "The Nobel Prize Committee honored Machado, who is in hiding, for keeping “the flame of democracy burning.” The White House accused members of “placing politics over peace.”"
    },
    {
      "source": "衛報",
      "title": "Macron reappoints Sébastien Lecornu as French prime minister",
      "link": "https://www.theguardian.com/world/2025/oct/10/macron-reappoints-sebastien-lecornu-as-french-prime-minister",
      "pub_time_taipei": "2025-10-11T05:24:01+08:00",
      "summary": "<p>Lecornu, who resigned as PM on Monday, is tasked with urgently delivering a budget to parliament</p><p>The French president, Emmanuel Macron, has reappointed his centrist ally Sébastien Lecornu as prime minister – days after Lecornu dramatically resigned and his new government collapsed after only 14 hours.</p><p>Lecornu said he accepted returning to the role “out of duty” and would do “everything possible to provide France with a budget by the end of the year and to address the daily life issues of our fellow citizens”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/macron-reappoints-sebastien-lecornu-as-french-prime-minister\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump threatens 100% China tariffs as Beijing restricts rare-earth exports",
      "link": "https://www.theguardian.com/us-news/2025/oct/10/trump-china-tariffs",
      "pub_time_taipei": "2025-10-11T05:11:36+08:00",
      "summary": "<p>President accuses China of ‘very hostile’ moves and says additional tariffs could come on 1 November ‘or sooner’</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has threatened to impose additional US tariffs of 100% on China from next month, accusing Beijing of “very hostile” moves to restrict exports of rare earths needed for American industry.</p><p>Wall Street fell sharply after the US president reignited public tensions with the Chinese government, and raised the prospect of another acrimonious trade war between the world’s two largest economies.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/10/trump-china-tariffs\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hamas praises Trump but says Tony Blair not welcome in post-war Gaza role – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news",
      "pub_time_taipei": "2025-10-11T03:04:41+08:00",
      "summary": "<p>This blog is now closed. You can read our latest reporting here:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/10/palestinians-displaced-gaza-home-ceasefire-israel-hamas\">Full report: Palestinians begin journey home as ceasefire comes into effect</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/oct/10/blair-kushner-trump-who-are-the-key-people-behind-the-gaza-ceasefire\">Blair, Kushner, Trump: who are the key people behind the Gaza ceasefire?</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/oct/10/i-expect-to-find-a-ghost-city-gaza-residents-on-the-long-arduous-journey-back-home\">‘I expect to find a ghost city’: Gaza residents on the long journey home</a></p></li></ul><p>Israeli military has said that the ceasefire agreement has come into effect, as troops have now retreated to the deployment lines agreed upon.</p><p>In a statement released on Telegram, the IDF says troops “began positioning themselves along the updated deployment lines” from midday local time.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Peru’s president removed amid rising crime, corruption allegations",
      "link": "https://www.washingtonpost.com/world/2025/10/10/peru-president-dina-boluarte-impeached-jose-jeri/",
      "pub_time_taipei": "2025-10-11T02:56:38+08:00",
      "summary": "After Dina Boluarte’s ouster, acting president José Jerí promised a war on crime."
    },
    {
      "source": "衛報",
      "title": "Nobel peace prize officials investigate surge in bets for winner",
      "link": "https://www.theguardian.com/world/2025/oct/10/nobel-peace-prize-bets-polymarket",
      "pub_time_taipei": "2025-10-11T01:52:35+08:00",
      "summary": "<p>Bets for Maria Corina Machado spiked on Polymarket gambling site hours before she was awarded prize</p><p>Norwegian officials who oversee the <a href=\"https://www.theguardian.com/world/nobelpeaceprize\">Nobel peace prize</a> are investigating suspicious online betting for this year’s winner that suggests a rare leak from the secretive committee that hands out the prize.</p><p>Online bets for the <a href=\"https://www.theguardian.com/world/2025/oct/10/venezuelan-politician-maria-corina-machado-wins-nobel-peace-prize\">Venezuelan opposition leader Maria Corina Machado</a> spiked on the Polymarket gambling site shortly after midnight on Thursday, Norwegian time, according to the information on its <a href=\"https://polymarket.com/event/nobel-peace-prize-winner-2025?tid=1760100706538\">website.</a></p> <a href=\"https://www.theguardian.com/world/2025/oct/10/nobel-peace-prize-bets-polymarket\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Palestinians displaced to southern Gaza begin journey home as ceasefire comes into effect",
      "link": "https://www.theguardian.com/world/2025/oct/10/palestinians-displaced-gaza-home-ceasefire-israel-hamas",
      "pub_time_taipei": "2025-10-11T01:30:30+08:00",
      "summary": "<p>Thousands walk north along coastal road after Israel-Hamas agreement puts stop to fighting for first time in six months</p><p>Tens of thousands of displaced Palestinians in Gaza have begun to return to the ruins of their homes after the ceasefire rapidly negotiated in recent days between Hamas and Israel came into effect at noon local time on Friday – the first relief from relentless violence that inhabitants of the devastated territory have had since March.</p><p>Israeli troops withdrew to new agreed-upon positions during Friday morning and Hamas is expected to release the 20 living Israeli hostages it is holding early next week, after which Israel will free 250 Palestinians serving long-term sentences in Israeli prisons, as well as 1,700 others detained during the war.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/palestinians-displaced-gaza-home-ceasefire-israel-hamas\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "What to know about the Gaza ceasefire deal as it takes effect",
      "link": "https://www.washingtonpost.com/world/2025/10/10/gaza-ceasefire-trump-israel-hamas/",
      "pub_time_taipei": "2025-10-11T00:26:41+08:00",
      "summary": "Israel began to reposition troops Friday as the clock started on the first phase of an agreement for the release of hostages in exchange for Palestinian prisoners."
    },
    {
      "source": "衛報",
      "title": "Venezuelan politician María Corina Machado wins Nobel peace prize",
      "link": "https://www.theguardian.com/world/2025/oct/10/venezuelan-politician-maria-corina-machado-wins-nobel-peace-prize",
      "pub_time_taipei": "2025-10-10T22:59:33+08:00",
      "summary": "<p>Opponent of Maduro regime receives award and praise for keeping ‘flame of democracy burning’</p><p>The Venezuelan opposition politician María Corina Machado has won the Nobel peace prize for her dogged struggle to rescue the South American country from its fate as “a brutal, authoritarian state”.</p><p>Machado, 58, a conservative often described as Venezuela’s Iron Lady, has spent the last year living in hiding after her political movement was widely believed to have <a href=\"https://www.theguardian.com/world/article/2024/sep/09/edmundo-gonzalez-exile-spain-venezuela-opposition-nicolas-maduro\">beaten the country’s president, Nicolás Maduro</a>, in the July 2024 presidential election.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/venezuelan-politician-maria-corina-machado-wins-nobel-peace-prize\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Seven people killed after twin earthquakes off coast of Philippines",
      "link": "https://www.theguardian.com/world/2025/oct/10/tsunami-warning-philippines-indonesia-earthquake-mindanao",
      "pub_time_taipei": "2025-10-10T22:53:35+08:00",
      "summary": "<p>Quakes of 7.4 and 6.8 magnitude trigger tsunami alerts as people living near coast advised to evacuate</p><p>Two powerful offshore earthquakes struck off the coast of the southern Philippines on Friday, killing at least seven people, while towns near the epicentre faced structural damage and authorities warned of strong aftershocks.</p><p>The first quake of magnitude 7.4, in waters off the town of Manay in the province of Davao Oriental, triggered a tsunami alert for coasts within 186 miles (300km) of the epicentre, but the warnings for the Philippines and Indonesia were subsequently lifted.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/tsunami-warning-philippines-indonesia-earthquake-mindanao\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hamas will be disarmed, Netanyahu vows after ceasefire begins",
      "link": "https://www.theguardian.com/world/2025/oct/10/what-does-gaza-deal-hamas-mean-for-benjamin-netanyahu-future",
      "pub_time_taipei": "2025-10-10T22:38:07+08:00",
      "summary": "<p>In combative speech, Israeli prime minister says Gaza will be demilitarised ‘the easy way or the hard way’</p><p>Benjamin Netanyahu repeated his pledge to force Hamas to disarm in a defiant and combative speech on Friday just an hour after a ceasefire began in Gaza.</p><p>In a <a href=\"https://www.timesofisrael.com/liveblog-october-10-2025/\">televised address</a>, Israel’s prime minister said he had resisted intense domestic and international pressure to achieve his aim of ensuring “the security of Israel”, and he lambasted his critics and reiterated a threat to return to war if necessary.</p> <a href=\"https://www.theguardian.com/world/2025/oct/10/what-does-gaza-deal-hamas-mean-for-benjamin-netanyahu-future\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Baby numbats spotted at two wildlife sanctuaries in hopeful sign for one of Australia’s rarest marsupials",
      "link": "https://www.theguardian.com/environment/2025/oct/11/baby-numbats-australia-rarest-marsupial-hopeful-sign",
      "pub_time_taipei": "2025-10-10T22:01:00+08:00",
      "summary": "<p>Video shows some of the juveniles exploring outside their den at Mallee Cliffs national park in south-western NSW</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li></ul><p>Baby numbats have been spotted at two wildlife sanctuaries in south-western New South Wales, sparking hope for one of Australia’s rarest marsupials.</p><p>Video captured by the Australian Wildlife Conservancy (AWC) shows some of the juveniles exploring outside their den at Mallee Cliffs national park.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/11/baby-numbats-australia-rarest-marsupial-hopeful-sign\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Crocodile made famous by Steve Irwin ‘wrongfully arrested’ and should be returned to wild, traditional owners say",
      "link": "https://www.theguardian.com/australia-news/2025/oct/11/old-faithful-crocodile-wrongfully-arrested-queensland-rinyirru-aboriginal-corporation-says",
      "pub_time_taipei": "2025-10-10T22:00:59+08:00",
      "summary": "<p><strong>Exclusive</strong>: ‘Old Faithful’ was captured after Queensland authorities deemed him ‘a problem crocodile’, but Rinyirru Aboriginal Corporation says the government is mistaken</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Traditional owners have called on the Queensland environment minister to return an iconic saltwater crocodile to the wild, arguing his capture was a “wrongful arrest” – but that his case could prove “a landmark” in redefining consultation with First Nations people and the management of crocodiles.</p><p>Rinyirru (Lakefield) Aboriginal Corporation chair, Alwyn Lyall, wrote to the environment minister, Andrew Powell, on Friday saying the removal of a crocodile longer than 4 metres, known as “Old Faithful”, from Rinyirru – or Lakefield national park – last month was based on a “flawed and outdated” test of his behaviour and highlighted “a bigger problem in how crocodiles are managed”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/11/old-faithful-crocodile-wrongfully-arrested-queensland-rinyirru-aboriginal-corporation-says\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump offers measured response after missing out on Nobel Prize",
      "link": "https://www.washingtonpost.com/world/2025/10/10/trump-nobel-peace-prize-norway/",
      "pub_time_taipei": "2025-10-10T21:18:33+08:00",
      "summary": "After the Nobel Peace Prize was awarded to Venezuelan opposition leader María Corina Machado, a senior White House aide said the committee had placed “politics over peace.”"
    },
    {
      "source": "衛報",
      "title": "Baby giant tortoises thrive in Seychelles after first successful artificial incubation",
      "link": "https://www.theguardian.com/environment/2025/oct/10/baby-giant-tortoises-thrive-seychelles-first-successful-artificial-incubation",
      "pub_time_taipei": "2025-10-10T21:00:54+08:00",
      "summary": "<p>Exclusive: Trial that has produced 13 hatchlings could help other threatened species avoid extinction</p><p>The slow-motion pitter-patter of tiny giant tortoise feet has been worryingly rare in recent years, but that looks set to change thanks to the first successful hatching of the species with artificial incubation.</p><p>One week after the intervention, the 13 babies are building up their strength on a diet of banana slices and leafy greens in Seychelles, which is home to one of the last remaining populations of the tortoise.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/10/baby-giant-tortoises-thrive-seychelles-first-successful-artificial-incubation\">Continue reading...</a>"
    }
  ]
}