{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-26T20:40:16.901816+08:00",
  "window_end_taipei": "2025-10-27T20:40:16.901816+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Lithuania closes border with Belarus after balloons shut down Vilnius airport – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/27/lithuania-airport-russia-belarus-viktor-orban-pope-leo-europe-live-news-updates",
      "pub_time_taipei": "2025-10-27T20:26:58+08:00",
      "summary": "<p>Lithuanian PM says ‘no hybrid attack will be tolerated’ and pledges to shoot down balloons after 66 objects spotted by radar overnight</p><p>Meanwhile over in the Czech Republic, <strong>the country’s president Petr Pavel has tasked the populist billionaire Andrej Babiš with leading talks on forming the new government after recent parliamentary election.</strong></p><p>Babiš told the president – who defeated him in the 2023 presidential elections – that <strong>the coalition talks were already under way, and “promised to hand over the text of the coalition agreement and programme priorities” later this week</strong>, according to <a href=\"https://www.hrad.cz/cs/pro-media/tiskove-zpravy/aktualni-tiskove-zpravy/prezident-republiky-pozval-predsedu-hnuti-ano-andreje-babise-na-prazsky-hrad-18849\">a readout</a> issued by the presidential office.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/27/lithuania-airport-russia-belarus-viktor-orban-pope-leo-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Minister insists government will get asylum seekers out of hotels and expects progress ‘within weeks’ - UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/27/asylum-hotel-report-steve-reed-wes-streeting-epping-offender-prison-news-updates-politics-live",
      "pub_time_taipei": "2025-10-27T20:25:03+08:00",
      "summary": "<p>Housing secretary says purpose built ‘modular’ structures on sites like ex military bases is the answer to ending reliance on hotels</p><p>The Guardian would like to hear from parents who have had to live in temporary accommodation with children. There is more about the call-out here, including a form where you can submit a response.</p><p>But the <strong>Commons home affairs committee</strong>’s <a href=\"https://committees.parliament.uk/publications/49900/documents/268016/default/\">report </a>is also critical of some aspects of what the Home Office has been doing on asylum hotels since Labour took power. Here are some of the points it makes about Labour’s record on this issue.</p><p><strong>The committee expresses concerns about the government’s plan to move asylum seekers out of hotels and place them in “large sites” instead, such as former military bases.</strong> (See<a href=\"https://www.theguardian.com/politics/live/2025/oct/27/asylum-hotel-report-steve-reed-wes-streeting-epping-offender-prison-news-updates-politics-live?page=with%3Ablock-68ff25898f0837a8ea394310#block-68ff25898f0837a8ea394310\"> 9.23am</a>.) It says:</p><p>The [Home Office] is considering the use of large sites in its approach to asylum accommodation, having previously said it would move away from their use. In principle, large sites can provide suitable temporary accommodation. However, they have generally proved more costly to deliver than hotel accommodation and will not enable the department to drive down costs in the same way as expanding dispersal accommodation. If the department chooses to pursue large sites, it needs to fully understand and accept this trade off. It must learn the lessons from its previous mistakes in rushing to deliver short-term solutions that later unravel.</p><p><strong>It says the government has still not set out a “clear strategy” for asylum accommodation.</strong></p><p>The government has committed to reducing the cost of the asylum system and ending the use of hotels by 2029. This is a stated Government priority, but making promises to appeal to popular sentiment without setting out a clear and fully articulated plan for securing alternative accommodation risks under-delivery and consequently undermining public trust still further. The Home Office has failed to share a clear strategy for the long-term delivery of asylum accommodation.</p><p><strong>It says the number of asylum seekers in hotels went up during Labour’s first 12 months in office.</strong> It says:</p><p>The number of asylum seekers in hotels is currently significantly lower than during the peak of hotel use—32,059 people as of June 2025, compared to 56,042 in September 2023—although the number of asylum seekers accommodated in hotels was 8% higher in June 2025 compared to June 2024.</p><p><strong>It says it is “extremely disappointing” that the Home Office abandoned a pilot programme giving refugees 56 days to find alternative accommodation if they have to leave Home Office housing (like a hotel) because their asylum application has been accepted. </strong>The Home Office has reverted to 28 days’ notice, even though the 56 days’s notice system was said to reduce the number or refugees finding themselves homeless. It says:</p><p>Given the high level of support we received for the 56 day move on period in the evidence we received, this decision is extremely disappointing.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/27/asylum-hotel-report-steve-reed-wes-streeting-epping-offender-prison-news-updates-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Donald Trump ‘would love’ unconstitutional third term but rules out running for VP",
      "link": "https://www.theguardian.com/us-news/2025/oct/27/donald-trump-third-term-vice-president",
      "pub_time_taipei": "2025-10-27T20:23:59+08:00",
      "summary": "<p>Presidents are constitutionally limited to two elected terms but some had suggested unorthodox gambit to stay in office</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/27/donald-trump-japan-sanae-takaichi-asia-canada-trade-news-updates-us-politics-live\">US politics – live updates</a></p></li></ul><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> said on Monday morning that he would rule out running for the vice-presidency in the 2028 US election, an unorthodox approach that some of his supporters have floated to allow the Republican US president to serve a third term in the White House.</p><p>“I’d be allowed to do that,” Trump said, in an exchange with reporters aboard Air Force One while traveling from Kuala Lumpur, Malaysia, to Tokyo, Japan, on Monday, the latest leg of a five-day trip to Asia which he hopes to cap with an agreement on a <a href=\"https://www.theguardian.com/us-news/2025/oct/27/us-china-framework-trade-deal-xi-trump-meeting\">trade war truce</a> with the Chinese president, <a href=\"https://www.theguardian.com/world/xi-jinping\">Xi Jinping</a>.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/27/donald-trump-third-term-vice-president\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Oil and gas firm Petrofac files for administration, putting thousands of jobs at risk",
      "link": "https://www.theguardian.com/business/2025/oct/27/oil-gas-petrofac-files-for-administration-jobs-north-sea",
      "pub_time_taipei": "2025-10-27T20:19:12+08:00",
      "summary": "<p>North Sea contractor says move applies only to its ultimate holding company and it will continue to trade</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/27/global-stocks-rally-us-china-trade-greencore-bakkavor-deal-uk-competition-business-live-news\">Business live – latest updates</a></p></li></ul><p>Petrofac, one of the biggest North Sea oil and gas contractors, has filed for administration, putting more than 2,000 jobs in Scotland at risk.</p><p>The energy services provider said it had applied to the high court of England and Wales to appoint administrators, after it lost a big offshore wind project over its failure to meet contractual obligations.</p> <a href=\"https://www.theguardian.com/business/2025/oct/27/oil-gas-petrofac-files-for-administration-jobs-north-sea\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jack DeJohnette, versatile jazz drummer known for Miles Davis fusion recordings, dies aged 83",
      "link": "https://www.theguardian.com/music/2025/oct/27/jack-dejohnette-versatile-jazz-drummer-miles-davis-fusion-dies-aged-83",
      "pub_time_taipei": "2025-10-27T20:18:52+08:00",
      "summary": "<p>Drummer played on Bitches Brew and other landmark recordings, as well as making numerous albums as a bandleader</p><p>Jack DeJohnette, the jazz drummer celebrated as one of the genre’s true greats – who worked with stars including Miles Davis, Sonny Rollins and Charles Lloyd – has died aged 83. A press representative for ECM, the record label that released many of his recordings, confirmed the news though no cause of death was given.</p><p>Able to bring dynamic, highly musical playing to open-minded free jazz, R&amp;B-leaning instrumental grooves and everything in between, DeJohnette is perhaps best known as the drummer in Davis’s fusion period, contributing to albums such as Bitches Brew, Jack Johnson and On the Corner. He was also celebrated as a regular sideman and bandleader on elegant, progressive fusion releases from ECM in the 1980s.</p> <a href=\"https://www.theguardian.com/music/2025/oct/27/jack-dejohnette-versatile-jazz-drummer-miles-davis-fusion-dies-aged-83\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Red Cross accompanies Hamas in search for bodies of Israeli hostages in Gaza",
      "link": "https://www.theguardian.com/world/2025/oct/27/red-cross-accompanies-hamas-in-search-for-bodies-of-israeli-hostages-in-gaza",
      "pub_time_taipei": "2025-10-27T20:14:30+08:00",
      "summary": "<p>Exclusive: Red Cross acts as ‘neutral intermediary’ to recover hostages’ remains in areas under Israeli control</p><p>The International Committee of the Red Cross (ICRC) accompanied members of Hamas inside areas of Gaza still under the control of the Israeli military to facilitate the search for the bodies of Israeli hostages, an official from the ICRC told the Guardian.</p><p>Under the US-brokered ceasefire, which took effect on 10 October, Hamas is required to return the remains of all Israeli hostages as soon as possible. In exchange, Israel has agreed to hand over 15 Palestinian bodies for each Israeli.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/red-cross-accompanies-hamas-in-search-for-bodies-of-israeli-hostages-in-gaza\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Hurricane Melissa threatens Jamaica with worst-case scenario as Category 5",
      "link": "https://www.washingtonpost.com/weather/2025/10/27/hurricane-melissa-jamaica/",
      "pub_time_taipei": "2025-10-27T20:04:07+08:00",
      "summary": "Hurricane Melissa rapidly intensified on its way toward Jamaica, where it may become the country’s strongest storm on record when it hits late Monday."
    },
    {
      "source": "衛報",
      "title": "Trump cuts likely hindered warning process for Alaska storm that displaced hundreds, experts say",
      "link": "https://www.theguardian.com/us-news/2025/oct/27/alaska-storm-emergency-response-trump-cuts",
      "pub_time_taipei": "2025-10-27T20:00:40+08:00",
      "summary": "<p>Reductions in weather balloon launches could have degraded forecasts that residents depend on to prepare</p><p>A faltering federal response to one of the worst storms in <a href=\"https://www.theguardian.com/us-news/alaska\">Alaska</a>’s history, which caused hundreds of people to become homeless, is drawing further scrutiny over the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a>’s efforts to dismantle federal weather and climate protections.</p><p><a href=\"https://www.theguardian.com/us-news/2025/oct/15/alaska-typhoon-halong-aftermath\">The powerful remnants of Typhoon Halong hit remote communities</a> in the Yukon-Kuskokwim delta of south-west Alaska on 12 October, inundating a vast low-lying area of tundra that is home to some of the most remote and inaccessible communities in the country.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/27/alaska-storm-emergency-response-trump-cuts\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "World’s oldest serving head of state declared winner in Cameroon election",
      "link": "https://www.theguardian.com/world/2025/oct/27/cameroon-paul-biya-oldest-serving-head-of-state-declared-winner-in-election",
      "pub_time_taipei": "2025-10-27T19:53:22+08:00",
      "summary": "<p>Paul Biya, 92, said to have won 53.66% of vote after volatile two weeks since election, when opponent claimed victory</p><p>Paul Biya, the world’s oldest serving head of state, has been declared the winner of Cameroon’s election, granting him an eighth term that could keep him in office until he is nearly 100.</p><p>The country’s constitutional council said Biya won 53.66% of the vote, while his former ally turned challenger, Issa Tchiroma Bakary, got 35.19%.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/cameroon-paul-biya-oldest-serving-head-of-state-declared-winner-in-election\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Donald Trump greeted by Emperor Naruhito in Japan before meeting new prime minister – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/27/donald-trump-japan-sanae-takaichi-asia-canada-trade-news-updates-us-politics-live",
      "pub_time_taipei": "2025-10-27T19:51:19+08:00",
      "summary": "<p>First meeting between the US president and prime minister Takaichi will focus on trade as Trump continues his five-day Asia trip</p><p><strong><a href=\"https://www.theguardian.com/us-news/gavin-newsom\">Gavin Newsom</a>, <a href=\"https://www.theguardian.com/us-news/california\">California</a>’s Democratic governor, <a href=\"https://www.cbsnews.com/news/newsom-says-he-will-consider-white-house-run-after-2026-elections/?linkId=872056531\">told </a>CBS News Sunday Morning he plans to make a decision on whether to run for president in 2028 once the 2026 midterm elections are over.</strong></p><p>“Yeah, I’d be lying otherwise,” Newsom said in response to a question on whether he would give serious thought to a White House bid after the 2026 elections. “I’d just be lying. And I’m not – I can’t do that.”</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/27/donald-trump-japan-sanae-takaichi-asia-canada-trade-news-updates-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US and China agree ‘framework’ for trade deal ahead of Xi-Trump meeting | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/oct/27/first-thing-us-and-china-agree-framework-for-trade-deal-ahead-of-xi-trump-meeting",
      "pub_time_taipei": "2025-10-27T19:40:25+08:00",
      "summary": "<p>US treasury secretary anticipates tariff truce with China will be extended, and that Beijing will revive substantial purchases of US soybeans. Plus, is Wikipedia’s Jimmy Wales the last decent tech baron?</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>The US and China have <a href=\"https://www.theguardian.com/us-news/2025/oct/27/us-china-framework-trade-deal-xi-trump-meeting\">agreed a framework for a trade deal</a> only days before Donald Trump and the Chinese president, Xi Jinping, are due to meet.</p><p><strong>What about other trade deals that are still up in the air?</strong> There were hopes of a truce between the US and Brazil after what President Luiz Inácio Lula da Silva described as a positive meeting with Trump in Malaysia. He said their respective teams would start discussing tariffs and other matters “immediately”.</p><p><strong>And Canada?</strong> Trump said Saturday that he would <a href=\"https://www.theguardian.com/us-news/2025/oct/25/trump-tariffs-canada-ronald-reagan\">raise US tariffs by 10%</a> in retaliation for an <a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-canada-trade-negotations-ontario-tariffs\">advertisement</a> sponsored by the Ontario government that accurately quoted Ronald Reagan at length saying tariffs don’t work.</p><p><strong>How many people have been killed in the airstrikes?</strong> US forces in recent weeks have carried out at least eight strikes against boats in the Caribbean off Venezuela’s coast, killing about 40 people that the Trump administration has insisted were involved in smuggling drugs.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/27/first-thing-us-and-china-agree-framework-for-trade-deal-ahead-of-xi-trump-meeting\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump describes Russia’s new cruise missile test as ‘not appropriate’",
      "link": "https://www.theguardian.com/world/2025/oct/27/russia-cruise-missile-test-trump-putin",
      "pub_time_taipei": "2025-10-27T19:36:29+08:00",
      "summary": "<p>US president says Vladimir Putin should focus on ending war with Ukraine rather than testing missiles</p><p>Donald Trump has described Vladimir Putin’s announcement of a nuclear-powered cruise missile test as “not appropriate” amid growing tensions between Moscow and Washington.</p><p>Putin said on Sunday that Russia had successfully tested its “unique” nuclear-capable Burevestnik cruise missile, which the Kremlin described as part of efforts to “ensure the country’s national security”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/russia-cruise-missile-test-trump-putin\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kaye Adams says her name was ‘dragged through the mud’ after BBC Scotland suspension",
      "link": "https://www.theguardian.com/uk-news/2025/oct/27/kaye-adams-name-dragged-through-mud-bbc-scotland-suspension",
      "pub_time_taipei": "2025-10-27T19:32:35+08:00",
      "summary": "<p>Radio host removed from morning show after what broadcaster reported as ‘a conduct complaint’</p><p>The award-winning broadcaster Kaye Adams has spoken of her distress after she was <a href=\"https://www.theguardian.com/uk-news/2025/oct/23/kaye-adams-yet-to-hear-complaint-two-weeks-after-being-taken-off-bbc-radio-scotland\">taken off air</a> by BBC Radio Scotland as a result of an unspecified “conduct complaint”, resulting in relentless media speculation.</p><p>In her first public comment on the matter, Adams said: “After three of the most distressing weeks of my professional life and seeing my previously untarnished name publicly dragged through the mud, BBC Scotland has still not provided me with any details of the allegations which have been made against me.”</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/27/kaye-adams-name-dragged-through-mud-bbc-scotland-suspension\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Javier Milei hails ‘tipping point’ as his far-right party wins Argentina’s midterm elections",
      "link": "https://www.theguardian.com/world/2025/oct/27/javier-milei-president-far-right-party-wins-argentina-midterm-elections",
      "pub_time_taipei": "2025-10-27T19:29:43+08:00",
      "summary": "<p>Result falls short of giving Milei a congressional majority but surprises many analysts after series of scandals</p><p>The party of Argentina’s far-right president, Javier Milei, has won Sunday’s midterm elections after a campaign in which <a href=\"https://www.theguardian.com/world/2025/oct/25/argentina-president-javier-milei-polls-economic-crisis-trump\">Donald Trump announced a $40bn bailout</a> for the country and made continued aid <a href=\"https://www.theguardian.com/us-news/2025/oct/14/trump-threatens-to-cut-us-aid-to-argentina-if-milei-loses-election\">conditional on the victory</a> of his Argentinian counterpart.</p><p>With more than 99% of ballots counted, La Libertad Avanza secured 40.8% of the nationwide vote, in an election widely seen as a de facto referendum on the <a href=\"https://www.theguardian.com/world/2023/nov/20/who-is-javier-milei-argentina-new-president-far-right-what-does-he-stand-for\">self-styled anarcho-capitalist’s</a> nearly two years in power. The Peronist opposition, Fuerza Patria, secured 31.7%.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/javier-milei-president-far-right-party-wins-argentina-midterm-elections\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ten people go on trial in Paris for online harassment of Brigitte Macron",
      "link": "https://www.theguardian.com/world/2025/oct/27/trial-paris-brigitte-macron-online-harassment-jean-michel-trogneux",
      "pub_time_taipei": "2025-10-27T18:23:38+08:00",
      "summary": "<p>Trial is latest phase in legal battle against false claim that French first lady is a man named Jean-Michel Trogneux</p><p>Ten people are to go on trial in Paris on Monday for online harassment of Brigitte Macron – the latest phase in a legal battle on both sides of the Atlantic against the <a href=\"https://www.theguardian.com/world/2025/jul/26/emmanuel-brigitte-macron-candace-owens-conspiracy-theory-jean-michel-trogneux\">false claim</a> that the French first lady is a man named Jean-Michel Trogneux.</p><p>The French trial comes after the president, Emmanuel Macron, and his wife filed a defamation lawsuit in the US at the end of July, in connection with a rumour amplified and repeated online that Brigitte Macron was born a man.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/trial-paris-brigitte-macron-online-harassment-jean-michel-trogneux\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Man arrested on suspicion of racially aggravated rape in Walsall",
      "link": "https://www.theguardian.com/uk-news/2025/oct/27/man-arrested-racially-aggravated-rape-walsall",
      "pub_time_taipei": "2025-10-27T18:20:34+08:00",
      "summary": "<p>Suspect, 32, apprehended in Birmingham after urgent appeal by police over alleged incident on Saturday</p><p>A man has been arrested on suspicion of rape after police believe a woman was the victim of a racially aggravated attack.</p><p>West Midlands police were called to the Park Hall area of Walsall just after 7.15pm on Saturday after a woman was reported to be distressed in the street.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/27/man-arrested-racially-aggravated-rape-walsall\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hurricane Melissa strengthens to category 5 as evacuations ordered in Jamaica’s capital",
      "link": "https://www.theguardian.com/world/2025/oct/26/hurricane-melissa-strengthens-into-category-4-approaches-jamaica",
      "pub_time_taipei": "2025-10-27T18:05:37+08:00",
      "summary": "<p>Storm could intensify further, threatening to cause catastrophic flooding in northern Caribbean</p><p>• <a href=\"https://www.theguardian.com/world/live/2025/oct/27/hurricane-melissa-jamaica-cuba-caribbean-haiti-dominican-republic-live-news-latest-updates\">Hurricane Melissa – follow latest updates live</a></p><p>Hurricane Melissa strengthened into a powerful category 5 hurricane on Monday, threatening days of catastrophic winds and rain in the northern Caribbean, while Jamaica’s government ordered mandatory evacuations for vulnerable areas across the country including in the capital, Kingston.</p><p>Jamaican officials had earlier urged those in low-lying and flood-prone areas to seek refuge as Melissa rapidly climbs up the <a href=\"https://www.weather.gov/mfl/saffirsimpson\">Saffir-Simpson hurricane wind scale</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/26/hurricane-melissa-strengthens-into-category-4-approaches-jamaica\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Night-flying insects over UK in decline, weather radar study reveals",
      "link": "https://www.theguardian.com/environment/2025/oct/27/night-flying-insects-over-uk-in-decline-weather-radar-study-reveals",
      "pub_time_taipei": "2025-10-27T18:00:38+08:00",
      "summary": "<p>Study of Met Office data one of first to show how nocturnal insects affected by factors such as light pollution</p><p>Scientists have used Met Office radar data to track the trillions of insects flying above the UK for the first time, revealing a concerning decline in nocturnal species.</p><p>The team repurposed data from the UK’s network of 15 weather surveillance radars, which scan the sky hundreds of times a day.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/27/night-flying-insects-over-uk-in-decline-weather-radar-study-reveals\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Grave fears for civilians after Sudanese paramilitary claims capture of El Fasher",
      "link": "https://www.theguardian.com/world/2025/oct/27/fears-civilians-sudan-paramilitary-rsf-capture-el-fasher",
      "pub_time_taipei": "2025-10-27T17:47:44+08:00",
      "summary": "<p>RSF says it has seized control of army’s main base in Darfur, home to famine-stricken displacement camp</p><p>Fears are growing for hundreds of thousands of civilians trapped in El Fasher, Sudan, after the paramilitary Rapid Support Forces said it had captured the city, which it has been besieging for more than a year in the country’s civil war.</p><p>The group said on Sunday that it had seized control of the army’s main base in the city in Darfur, where <a href=\"https://www.theguardian.com/global-development/article/2024/aug/01/sudan-el-fasher-darfur-famine-starvation-declared-fews-net\">famine was declared</a> in a displacement camp last year. It then released a statement saying it had “extended control over the city of El Fasher from the grip of mercenaries and militias”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/fears-civilians-sudan-paramilitary-rsf-capture-el-fasher\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Argentina’s Milei wins friendlier Congress in midterms after U.S. bailout",
      "link": "https://www.washingtonpost.com/world/2025/10/26/argentina-midterm-election-milei-trump-bailout/",
      "pub_time_taipei": "2025-10-27T17:05:31+08:00",
      "summary": "The vote in Sunday’s midterms came as the United States finalized an up to $40 billion bailout package for Argentina, an effort to boost President Javier Milei."
    },
    {
      "source": "華盛頓郵報",
      "title": "Iranian women flout law on mandatory veiling as police curtail arrests",
      "link": "https://www.washingtonpost.com/world/2025/10/26/iran-women-hijab-veil-arrests/",
      "pub_time_taipei": "2025-10-27T17:00:23+08:00",
      "summary": "Defiance of hijab requirements has grown widespread across Iran. The government seems wary of cracking down, fearing unrest. But conservatives haven’t given up."
    },
    {
      "source": "華盛頓郵報",
      "title": "Germany needs a bigger military, but young people are divided on serving",
      "link": "https://www.washingtonpost.com/world/2025/10/27/germany-military-debate-obligatory-service/",
      "pub_time_taipei": "2025-10-27T17:00:22+08:00",
      "summary": "Lawmakers are debating steps toward restoring compulsory military service, but many young people are not enthusiastic about donning uniforms and taking up arms."
    },
    {
      "source": "衛報",
      "title": "‘Open hostility has become normalised’: Dutch Muslims fear rise of far right as general election looms",
      "link": "https://www.theguardian.com/world/2025/oct/27/geert-wilders-netherlands-dutch-muslims-fear-rise-of-far-right",
      "pub_time_taipei": "2025-10-27T16:53:04+08:00",
      "summary": "<p>The poll is seen as a litmus test for the Netherlands and its democratic ideals, as activists decry a hardening of political discourse driven by Geert Wilders</p><p>The <a href=\"https://x.com/geertwilderspvv/status/1952327110674313471?s=46&amp;t=TgIN1rYSc6FWv2PjbytaHw\">drawing depicted two women</a>; a young blonde with a friendly expression and a scowling older woman wearing a headscarf. On top of the image was a nod to this month’s general election in the Netherlands, along with the phrase “The choice is yours.”</p><p>The social media post, made by the far-right, anti-Muslim politician Geert Wilders, prompted a record 14,000 complaints to the country’s anti-discrimination hotline. “Many of those who called to report the image compared it to Nazi propaganda from the second world war,” the hotline <a href=\"https://discriminatie.nl/blog/discriminatie-nl-neemt-actie-en-doet-aangifte-tegen-wilders/\">said in a statement, </a>adding that the 19 anti-discrimination agencies associated with the hotline had flagged the post to police, amid concerns that it could be an incitement to hatred.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/geert-wilders-netherlands-dutch-muslims-fear-rise-of-far-right\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Environment minister could approve projects at odds with nature laws under Labor overhaul",
      "link": "https://www.theguardian.com/environment/2025/oct/27/environment-minister-could-approve-projects-at-odds-with-nature-laws-under-labor-overhaul",
      "pub_time_taipei": "2025-10-27T16:29:06+08:00",
      "summary": "<p>New ‘national interest’ provision revealed as extracts of legislation circulated to stakeholders before bill introduced to parliament later this week</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p></p><p>The environment minister would be able to approve projects at odds with nature laws if it was deemed in the “national interest” under the Albanese government’s planned overhaul of the environmental protection regime.</p><p>The proposed new provision was revealed in extracts of the legislation that were circulated to stakeholders on Monday, before its introduction to federal parliament later this week.</p><p><strong><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=copyembed\">Sign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter</a></strong></p> <a href=\"https://www.theguardian.com/environment/2025/oct/27/environment-minister-could-approve-projects-at-odds-with-nature-laws-under-labor-overhaul\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Republican senator calls Trump’s military airstrikes ‘extrajudicial killings’",
      "link": "https://www.theguardian.com/us-news/2025/oct/27/rand-paul-trump-military-airstrikes-venezuela",
      "pub_time_taipei": "2025-10-27T16:00:27+08:00",
      "summary": "<p>Rand Paul’s comments come days after president claimed US lawmakers wouldn’t take issue with Venezuelan strikes</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/21/us-strikes-caribbean-cia-role\">Exclusive: CIA playing ‘most important part’ in US strikes in the Caribbean, sources say</a></p></li></ul><p>The <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a>’s military <a href=\"https://www.theguardian.com/us-news/2025/oct/25/trump-venezuela-strikes-regime-change\">airtrikes</a> against boats off Venezuela’s coast that the White House claims were being used for drug trafficking are “extrajudicial killings”, said <a href=\"https://www.theguardian.com/us-news/rand-paul\">Rand Paul</a>, the president’s fellow Republican and US senator from Kentucky.</p><p>Paul’s strong comments on the topic came on Sunday during an interview on Republican-friendly Fox News, three days after <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> publicly claimed he “can’t imagine” federal lawmakers would have “any problem” with the strikes when asked about seeking congressional approval for them.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/27/rand-paul-trump-military-airstrikes-venezuela\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: Jamaica braces for its most powerful hurricane as Melissa nears category 5",
      "link": "https://www.theguardian.com/environment/2025/oct/27/jamaica-powerful-hurricane-melissa-category-5-landfall-new-zealand-storm",
      "pub_time_taipei": "2025-10-27T15:30:59+08:00",
      "summary": "<p>Record-breaking hurricane expected to make landfall on Tuesday with 160mph winds, while New Zealand reels from storm damage</p><p>• <a href=\"https://www.theguardian.com/world/live/2025/oct/27/hurricane-melissa-jamaica-cuba-caribbean-haiti-dominican-republic-live-news-latest-updates\">Hurricane Melissa – follow latest updates live</a></p><p></p><p>The Caribbean is <a href=\"https://www.theguardian.com/world/2025/oct/26/hurricane-melissa-strengthens-into-category-4-approaches-jamaica\">bracing for Hurricane Melissa</a>, one of the most powerful to ever strike the region. Melissa began as a cluster of thunderstorms off the coast of west Africa, which travelled west and developed into a depression, reaching tropical storm status to the north of Venezuela on 21 October. Rapid intensification over the weekend strengthened Melissa to category 4 as it slowly meandered west through the Caribbean Sea.</p><p>Melissa is expected to reach category 5 intensity on Monday night, veering north-east towards Jamaica before making landfall on Tuesday by about midday, with peak winds of 160mph (257km/h), which would make it the strongest of only five hurricanes ever recorded to hit Jamaica directly. The most recent, and before now the most powerful, was Hurricane Gilbert in 1988, which brought gusts of 130mph.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/27/jamaica-powerful-hurricane-melissa-category-5-landfall-new-zealand-storm\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Barnaby Joyce’s walkout and endless net zero rehashing? The Nationals are ‘having a normal one’",
      "link": "https://www.theguardian.com/australia-news/2025/oct/27/barnaby-joyce-walkout-net-zero-rehashing-nationals-coalition",
      "pub_time_taipei": "2025-10-27T15:20:29+08:00",
      "summary": "<p>The former deputy prime minister staying out of the Nationals party room is the latest sign some in the Coalition are in no rush to finish their ugly airing of grievances</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Nationals are once again, in the words of Chris Bowen, “having a normal one”.</p><p>Another Monday, another parliamentary week, another chapter in the seemingly never-ending story of the Coalition putting its fingers in its ears and screaming as they debate whether to ignore global momentum, scientific consensus and pleas from the business community, and seek to relitigate a position on net zero reached four years ago by the Morrison government.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/27/barnaby-joyce-walkout-net-zero-rehashing-nationals-coalition\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Sudanese paramilitary enters army’s last stronghold in Darfur",
      "link": "https://www.washingtonpost.com/world/2025/10/26/sudan-rsf-el-fashir-darfur/",
      "pub_time_taipei": "2025-10-27T15:04:34+08:00",
      "summary": "El Fashir is the last major city in the western region of Darfur held by Sudan’s military forces. The Rapid Support Forces’ entry raises fears of a bloodbath."
    },
    {
      "source": "衛報",
      "title": "Opposition wants ‘balanced outcome’ on environment protection reforms – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/27/epbc-environment-laws-ai-copyright-lobbying-transparency-federal-parliament-anthony-albanese-asean-sussan-ley-murray-watt-ntwnfb",
      "pub_time_taipei": "2025-10-27T14:37:46+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/27/coalition-greens-scolded-opposing-new-nature-laws-environment\">Coalition and Greens scolded for opposing new nature laws by author of key environment report</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The environment minister, <strong>Murray Watt,</strong> claims <strong>Sussan Ley</strong>’s reluctance to support the EPBC laws is about her “desperately trying to shore up her leadership” as the Coalition once again ties itself in knots over net zero and climate policy.</p><p>Speaking to reporters in Parliament House this morning, he says he’s open to making a deal with either the Greens or the Coalition, flatly rejecting Ley’s request to split up the environment bill into various chunks to be voted on separately.</p><p>It’s because she’s desperately trying to shore up her leadership ahead of some very difficult net zero conversations with her party room. This week, Sussan Ley is in danger of putting her own leadership ahead of the environment and ahead of business.</p><p>We can’t split the bill. We need to do both, and we need to get on with it.</p><p>We have been consulting to death on these reforms, and both business and environment groups are crying out for reform to finally be delivered.</p><p>I can’t make that any clearer. I’ve met the same number of times with the Coalition and the Greens. I’ve spoken as recently as yesterday with representatives from those parties. What we’re about is passing a bill that is good for the environment and good for business, and it’s up to the Coalition and the Greens to decide, are they prepared to do that, or are they going to go into their corners and fight for a bill that only delivers to the environment or only delivers to business?</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/27/epbc-environment-laws-ai-copyright-lobbying-transparency-federal-parliament-anthony-albanese-asean-sussan-ley-murray-watt-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Boy, 14, in hospital after crocodile attack while fishing at far north Queensland beach",
      "link": "https://www.theguardian.com/australia-news/2025/oct/27/crocodile-attack-myall-beach-queensland-boy-fishing-hospitalised",
      "pub_time_taipei": "2025-10-27T14:27:55+08:00",
      "summary": "<p>Incident follows several crocodile sightings around Cape Tribulation as breeding season begins and risks of aggression increase</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/27/epbc-environment-laws-ai-copyright-lobbying-transparency-federal-parliament-anthony-albanese-asean-sussan-ley-murray-watt-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A 14-year-old boy has been hospitalised after he was attacked by a crocodile while fishing at a beach in far north Queensland, authorities said.</p><p>He sustained wounds to his leg and torso on Saturday afternoon at Myall beach, Cape Tribulation, a small coastal community 140km north of Cairns, a Queensland ambulance service spokesperson said.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/27/crocodile-attack-myall-beach-queensland-boy-fishing-hospitalised\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hannah McGuire’s mother tells murderer she hopes he suffers ‘most intense pain imaginable’ for life",
      "link": "https://www.theguardian.com/australia-news/2025/oct/27/hannah-mcguire-mother-tells-murderer-lachlan-young-court-hope-he-suffers-most-intense-pain-ntwnfb",
      "pub_time_taipei": "2025-10-27T14:08:29+08:00",
      "summary": "<p>Family members of young woman strangled to death by her former boyfriend in her own home have confronted killer Lachlan Young in court</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/27/epbc-environment-laws-ai-copyright-lobbying-transparency-federal-parliament-anthony-albanese-asean-sussan-ley-murray-watt-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A mother has confronted her daughter’s killer in court, saying she will never forgive him for taking away her vibrant and courageous girl.</p><p>Lachlan Young, 23, did not look at Hannah McGuire’s mother, Debbie McGuire, as she read her statement in the Victorian supreme court on Monday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/27/hannah-mcguire-mother-tells-murderer-lachlan-young-court-hope-he-suffers-most-intense-pain-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Björn Andrésen, Swedish actor who starred in Death in Venice, dies aged 70",
      "link": "https://www.theguardian.com/film/2025/oct/27/bjorn-andresen-swedish-actor-dies-aged-70",
      "pub_time_taipei": "2025-10-27T12:55:47+08:00",
      "summary": "<p>Actor who also starred in Midsommar and became a musician was nicknamed ‘the most beautiful boy in the world’ – a title he struggled with all his life</p><p>Björn Andrésen, the Swedish actor best known for his breakout role in the 1971 film Death in Venice, has died aged 70.</p><p>At 15, Andrésen was cast in Italian director Luchino Visconti’s Death in Venice, based on Thomas Mann’s novella, in which he played Tadzio, a beautiful boy with whom an older man, played by Dirk Bogarde, becomes obsessed.</p> <a href=\"https://www.theguardian.com/film/2025/oct/27/bjorn-andresen-swedish-actor-dies-aged-70\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bear attack survival tips released in Japan as encounters surge",
      "link": "https://www.theguardian.com/world/2025/oct/27/bear-attack-survival-tips-released-in-japan-as-encounters-surge",
      "pub_time_taipei": "2025-10-27T12:55:05+08:00",
      "summary": "<p>Governor of one prefecture says he is considering asking the military for help to tackle increasing attacks amid thousands-strong bear population</p><p>Knowing what to do in the event of a close encounter with a bear was once a concern only for hikers and foragers in <a href=\"https://www.theguardian.com/world/japan\">Japan</a>. Now, however, people in populated areas are being urged to learn how to protect themselves following a spate of attacks, as the animals leave their natural habitats in search of food.</p><p>Bear encounters are generating almost daily headlines. In the past week in Akita prefecture, the animals attacked a jogger and a walker in <a href=\"https://www.theguardian.com/world/2024/dec/02/akita-japan-bear-attack-supermarket-captured\">built-up areas</a>, while another terrorised four people before holing up inside a nearby house. None of the victims was seriously injured.</p> <a href=\"https://www.theguardian.com/world/2025/oct/27/bear-attack-survival-tips-released-in-japan-as-encounters-surge\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Radiohead’s Thom Yorke says he would ‘absolutely not’ play in Israel now",
      "link": "https://www.theguardian.com/music/2025/oct/27/radiohead-thom-yorke-would-not-play-israel",
      "pub_time_taipei": "2025-10-27T08:55:49+08:00",
      "summary": "<p>Singer says he will not perform in Israel while Benjamin Netanyahu remains in power, eight years after Radiohead defied criticism to perform in Tel Aviv</p><p>Radiohead frontman Thom Yorke has said he would not now perform in Israel, eight years after the band defied pro-Palestinian activists to play a show in Tel Aviv.</p><p>“Absolutely not. I wouldn’t want to be 5,000 miles anywhere near the Netanyahu regime,” he told <a href=\"https://www.thetimes.com/culture/music/article/radiohead-tour-2025-interview-israel-fn0bmdzl8\">the Sunday Times magazine,</a> referring to prime minister Benjamin Netanyahu’s government.</p> <a href=\"https://www.theguardian.com/music/2025/oct/27/radiohead-thom-yorke-would-not-play-israel\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US and China agree ‘framework’ for trade deal ahead of Xi-Trump meeting",
      "link": "https://www.theguardian.com/us-news/2025/oct/27/us-china-framework-trade-deal-xi-trump-meeting",
      "pub_time_taipei": "2025-10-27T08:18:52+08:00",
      "summary": "<p>US treasury secretary anticipates tariff truce with China will be extended, and that China will revive substantial purchases of US soybeans</p><p>The US and China have agreed a framework for a trade deal just days before Donald Trump and Chinese president Xi Jinping are due to meet.</p><p>Treasury secretary Scott Bessent said the agreement, forged on the sidelines of the Association of south-east Asian Nations (Asean) summit in Malaysia on Sunday, would remove the threat of the imposition of 100% tariffs on Chinese imports starting on 1 November and include “a final deal” on the <a href=\"https://www.theguardian.com/technology/2025/oct/26/us-china-tiktok-deal-scott-bessent\">sale of TikTok in the US.</a></p> <a href=\"https://www.theguardian.com/us-news/2025/oct/27/us-china-framework-trade-deal-xi-trump-meeting\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As U.S. forces close in on Venezuela, lawmakers warn of ‘expanding’ operation",
      "link": "https://www.washingtonpost.com/world/2025/10/26/us-military-ships-planes-venezuela/",
      "pub_time_taipei": "2025-10-27T02:07:57+08:00",
      "summary": "The Trump administration has sent warships, fighter jets and surveillance aircraft to the region as it wages what it says is armed conflict against narcoterrorists."
    },
    {
      "source": "衛報",
      "title": "Boy thrown from Tate Modern’s 10th floor can now run and swim, says family",
      "link": "https://www.theguardian.com/artanddesign/2025/oct/26/boy-thrown-from-tate-moderns-10th-floor-now-able-to-run-and-swim-says-family",
      "pub_time_taipei": "2025-10-27T01:14:08+08:00",
      "summary": "<p>French child, who was six years old at the time of the incident in 2019, suffered life-changing injuries</p><p>A boy who was thrown from the 10th floor of <a href=\"https://www.theguardian.com/artanddesign/tate-modern\">Tate Modern</a> in London six years ago can now run and swim limited distances, his family has revealed.</p><p>The unnamed French boy, who his parents call their “little knight”, suffered life-changing injuries in the attack in August 2019. <a href=\"https://www.theguardian.com/uk-news/2021/apr/27/jonty-bravery-tate-modern-not-considered-risk\">Jonty Bravery is serving a minimum 15-year jail term </a>for his attempt to murder the boy.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/oct/26/boy-thrown-from-tate-moderns-10th-floor-now-able-to-run-and-swim-says-family\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Before Trump gutted the White House, Erdogan built his ‘White Palace’",
      "link": "https://www.washingtonpost.com/world/2025/10/26/trump-erdogan-renovation-palace-turkey-white-house/",
      "pub_time_taipei": "2025-10-27T00:58:17+08:00",
      "summary": "As long as there’s been human civilization, there have been leaders with vanity projects."
    },
    {
      "source": "衛報",
      "title": "US and China reach ‘final deal’ on TikTok sale, treasury secretary says",
      "link": "https://www.theguardian.com/technology/2025/oct/26/us-china-tiktok-deal-scott-bessent",
      "pub_time_taipei": "2025-10-27T00:25:00+08:00",
      "summary": "<p>Scott Bessent said plan was part of framework for trade deal but did not share details on transferring app’s ownership</p><ul><li><p><a href=\"https://www.theguardian.com/technology/2025/sep/22/us-tiktok-deal-explained\">Murdoch, Ellison and China: what we know about the US’s TikTok deal</a></p></li></ul><p>US treasury secretary Scott Bessent claimed on Sunday that the US and <a href=\"https://www.theguardian.com/world/china\">China</a> have finalized the details of a deal transferring <a href=\"https://www.theguardian.com/technology/tiktok\">TikTok</a>’s US version to new owners.</p><p>“We reached a final deal on TikTok,” Bessent <a href=\"https://www.cbsnews.com/news/scott-bessent-treasury-secretary-face-the-nation-transcript-10-26-2025/\">said</a> on Sunday on CBS’s Face the Nation with Margaret Brennan.<em><strong> </strong></em>Alluding to <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> and his Chinese counterpart, <a href=\"https://www.theguardian.com/world/xi-jinping\">Xi Jinping</a>, Bessent continued: “We reached [a deal] in Madrid, and I believe that as of today, all the details are ironed out, and that will be for the two leaders to consummate that transaction” during a meeting scheduled for Thursday in Korea.</p> <a href=\"https://www.theguardian.com/technology/2025/oct/26/us-china-tiktok-deal-scott-bessent\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Chinese and U.S. officials tentatively agree to avert 100 percent tariffs",
      "link": "https://www.washingtonpost.com/politics/2025/10/26/trump-china-trade-deal/",
      "pub_time_taipei": "2025-10-26T21:59:51+08:00",
      "summary": "The announcement marked a significant de-escalation of a volatile trade war ahead of President Donald Trump’s Thursday meeting with Xi Jinping."
    },
    {
      "source": "華盛頓郵報",
      "title": "Police arrest Louvre heist suspects, Paris prosecutor says",
      "link": "https://www.washingtonpost.com/world/2025/10/26/louvre-robbery-arrests/",
      "pub_time_taipei": "2025-10-26T20:59:28+08:00",
      "summary": "One man was arrested trying to leave the country, the prosecutor said. The arrests come a week after thieves broke into the Louvre Museum and stole precious jewels."
    }
  ]
}