{
  "mode": "last_24h",
  "window_start_taipei": "2025-08-23T23:09:09.880921+08:00",
  "window_end_taipei": "2025-08-24T23:09:09.880921+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "‘No place is safe’: families flee Gaza City as Israel vows to press on with offensive",
      "link": "https://www.theguardian.com/world/2025/aug/24/families-flee-gaza-city-as-israel-vows-to-press-on-with-offensive",
      "pub_time_taipei": "2025-08-24T22:47:50+08:00",
      "summary": "<p>Others refuse to leave as aircraft and tanks bomb outskirts of city where about half of Gaza’s 2m people now live</p><p>Israeli aircraft and tanks have pounded the eastern and northern outskirts of <a href=\"https://www.theguardian.com/world/israel-hamas-war\">Gaza City</a> destroying buildings and homes, as Israeli leaders vowed to press on with an expanded large-scale offensive on the city.</p><p>Witnesses reported the sound of continuous explosions overnight from Saturday night into Sunday morning in the areas of Zeitoun and Shejaia. Meanwhile, tanks shelled houses and roads in the nearby Sabra neighbourhood and several buildings were blown up in the northern area of Jabaliya.</p> <a href=\"https://www.theguardian.com/world/2025/aug/24/families-flee-gaza-city-as-israel-vows-to-press-on-with-offensive\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Coca-Cola in talks about potential cut-price £2bn sale of Costa Coffee",
      "link": "https://www.theguardian.com/business/2025/aug/24/coca-cola-talks-sale-costa-coffee",
      "pub_time_taipei": "2025-08-24T20:58:18+08:00",
      "summary": "<p>American owner said to be working with bankers on review of chain, which has more than 2,000 UK outlets</p><p>Costa Coffee could change hands again after it emerged that Coca-Cola has met potential buyers to discuss a cut-price deal to off-load the chain.</p><p>The American soft drinks company is said to be working with bankers on a review of Costa, Britain’s biggest coffee chain, that could lead to it being sold.</p> <a href=\"https://www.theguardian.com/business/2025/aug/24/coca-cola-talks-sale-costa-coffee\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Hot, crispy and cheeky’: Scottish chippy deep-fries the M&S strawberry and cream sandwich",
      "link": "https://www.theguardian.com/uk-news/2025/aug/24/hot-crispy-and-cheeky-scottish-chippy-deep-fries-the-ms-strawberry-and-cream-sandwich",
      "pub_time_taipei": "2025-08-24T20:29:51+08:00",
      "summary": "<p>Staff say customers come into Hook and Catch in Bearsden near Glasgow just to try it and film their first bite</p><p>Marks &amp; Spencer has <a href=\"https://www.theguardian.com/news/2017/nov/24/how-the-sandwich-consumed-britain#:~:text=The%20first%20official%20M&amp;S%20sandwich,and%20people%20wanted%20those%2C%20too.\">always been</a> at the forefront of sandwich innovation, having launched the first pre-packed sandwich in the spring of 1980 and raising eyebrows this summer by selling one with strawberry and cream filling.</p><p>But now a Scottish chip shop has gone a step further, offering to batter and deep-fry the viral snack. In a video <a href=\"https://www.tiktok.com/@hookandcatch/video/7526971664840559895?is_from_webapp=1&amp;web_id=7542089883671643670\">posted</a> on TikTok, staff at Hook and Catch near Glasgow can be seen dipping M&amp;S’s controversial “Strawberry and Creme” sandwich into batter, before deep-frying it, slicing it in half and serving with strawberry sauce.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/24/hot-crispy-and-cheeky-scottish-chippy-deep-fries-the-ms-strawberry-and-cream-sandwich\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "A Jesuit leader did nothing to stop a priest from sexually abusing children. The church may canonize him",
      "link": "https://www.theguardian.com/us-news/2025/aug/24/jesuits-new-orleans-clergy-abuse",
      "pub_time_taipei": "2025-08-24T20:00:32+08:00",
      "summary": "<p>Superior general Pedro Arrupe postponed the ordination of Donald B Dickerson, but ultimately allowed his promotion</p><ul><li><p>A version of this story was first reported and published by <a href=\"https://www.ncronline.org/news/arrupes-role-murky-dispute-over-ordination-abusive-jesuit\">National Catholic Reporter</a></p></li></ul><p>Numerous officials within the <a href=\"https://www.theguardian.com/world/catholicism\">Roman Catholic</a> religious order known as the Jesuits struggled in the 1970s and 1980s over how to deal with a man whom they knew molested children – but nonetheless was ordained a priest, according to a review of internal correspondence concerning his career.</p><p>The correspondence about the late Donald B Dickerson stems from a pending Louisiana state court lawsuit filed in June 2024 that alleges he raped a 17-year-old student at the order-run Loyola University New Orleans in 1984. It provides a rare, complex, behind-the-scenes look at how local leaders during a much earlier phase of the worldwide Catholic church’s ongoing clergy molestation scandal struggled to contain a predator priest’s repeated abuse of children while encouraging him to seek psychological help.</p><p><em>National Catholic Reporter is a national US news outlet that has been reporting on issues within the Catholic church since 1964</em></p> <a href=\"https://www.theguardian.com/us-news/2025/aug/24/jesuits-new-orleans-clergy-abuse\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘No-holds-barred fight’: California’s governor takes off his gloves to punch back at Trump",
      "link": "https://www.theguardian.com/us-news/2025/aug/24/no-holds-barred-fight-californias-governor-takes-off-his-gloves-to-punch-back-at-trump",
      "pub_time_taipei": "2025-08-24T20:00:31+08:00",
      "summary": "<p>Gavin Newsom has trolled the president mercilessly online, but he’s counting on his redistricting scheme to reclaim the House for Democrats – and boost his presidential ambitions</p><p>In the opening weeks of <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s second term, <a href=\"https://www.theguardian.com/us-news/gavin-newsom\">Gavin Newsom</a> wagered that peacemaking was best: a tarmac greeting for Air Force One, an Oval Office visit and a podcast slot for Maga’s biggest names. But then Trump came for <a href=\"https://www.theguardian.com/us-news/california\">California</a>, and its governor dropped the niceties.</p><p>With a flood of all-caps social media posts, a counterpunching redistricting proposal and a string of lawsuits challenging the new administration, Newsom is not just taking on Trump, he’s stealing his tactics: <em>fight, fight, fight.</em></p> <a href=\"https://www.theguardian.com/us-news/2025/aug/24/no-holds-barred-fight-californias-governor-takes-off-his-gloves-to-punch-back-at-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Composer John Williams says he ‘never liked film music very much’",
      "link": "https://www.theguardian.com/music/2025/aug/24/composer-john-williams-never-liked-film-music-very-much",
      "pub_time_taipei": "2025-08-24T20:00:30+08:00",
      "summary": "<p>Exclusive: The creator of some of cinema’s most memorable music says it pales in comparison to the great works</p><p>As one of the greatest composers in film, John Williams has written some of the most memorable music in cinema for masterpieces such as Jaws, Jurassic Park and Star Wars.</p><p>But despite winning five Oscars, the 93-year-old believes that, as an art form, film music pales in comparison to history’s great works.</p> <a href=\"https://www.theguardian.com/music/2025/aug/24/composer-john-williams-never-liked-film-music-very-much\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kemi Badenoch reveals ‘hysterical’ level of personal attacks faced as a black woman",
      "link": "https://www.theguardian.com/politics/2025/aug/24/kemi-badenoch-hysterical-level-personal-attacks-as-black-woman",
      "pub_time_taipei": "2025-08-24T19:04:55+08:00",
      "summary": "<p>Tory leader tells Sunday Times she is surprised at amount of racism she has experienced since taking up post</p><p>Kemi Badenoch has spoken openly about the racism she has suffered as the first black woman to lead the Conservative party.</p><p>The Tory leader <a href=\"https://www.thetimes.com/uk/politics/article/kemi-badenoch-husband-children-robert-jenrick-mtjj76jmv\">told the Sunday Times</a> she had been surprised at the amount of racism she had faced since being elected, having previously insisted that Britain was “the best place in the world to be black”.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/24/kemi-badenoch-hysterical-level-personal-attacks-as-black-woman\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nicola Sturgeon’s memoir Frankly taps into SNP discontent over party’s future",
      "link": "https://www.theguardian.com/politics/2025/aug/24/nicola-sturgeon-memoir-frankly-taps-into-voters-discontent-over-future-of-snp",
      "pub_time_taipei": "2025-08-24T18:56:17+08:00",
      "summary": "<p>Her critics have reacted with fury but some in party feel nostalgia and ‘sense of loss for independence movement’</p><p>Nicola Sturgeon’s month-long promotional tour for her memoir Frankly comes to an end this Friday at the Southbank Centre in London, the city, according to one of many carefully placed publication interviews, where she is considering moving to escape the <a href=\"https://www.bbc.co.uk/programmes/p0lwdjmx\">“goldfish bowl scrutiny”</a> of Scotland.</p><p>The former first minister’s political memoir has generated a blizzard of headlines since its <a href=\"https://www.theguardian.com/books/2025/aug/12/frankly-by-nicola-sturgeon-review-the-ex-first-minister-opens-up\">launch on 12 August</a>. Some were diverting but ultimately inconsequential, like her choice of future base, others rubbed salt in raw wounds, reprising two of the most divisive episodes in the SNP’s recent history – the Scottish government’s investigation into allegations of sexual harassment made against her predecessor Alex Salmond, and her flagship gender recognition law changes.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/24/nicola-sturgeon-memoir-frankly-taps-into-voters-discontent-over-future-of-snp\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Heatwave that fuelled deadly wildfires was Spain’s ‘most intense on record’",
      "link": "https://www.theguardian.com/world/2025/aug/24/heatwave-wildfires-spain-most-intense-on-record",
      "pub_time_taipei": "2025-08-24T18:53:33+08:00",
      "summary": "<p>Country’s weather agency says 10-day period from 8-17 August was hottest since at least 1950, as fires still rage</p><p>A 16-day heatwave Spain suffered this month was “the most intense on record”, the country’s state meteorological agency (AEMET) has said.</p><p>Provisional readings for the 3-18 August heatwave exceeded the last record, set in July 2022, and showed an average temperature 4.6C higher than for previous such phenomena, the agency said on X.</p> <a href=\"https://www.theguardian.com/world/2025/aug/24/heatwave-wildfires-spain-most-intense-on-record\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pro-Palestine protesters fill the streets in cities and towns across Australia after Gaza famine declaration",
      "link": "https://www.theguardian.com/world/2025/aug/24/hundreds-of-thousands-expected-at-pro-palestine-protests-across-australia-after-gaza-famine-declaration",
      "pub_time_taipei": "2025-08-24T17:34:36+08:00",
      "summary": "<p>‘The difference between my kids and those kids in Palestine is geography,’ one attendee says, as thousands turn out for marches</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Brisbane has amassed the largest pro-Palestinian crowd in the city’s history, rally organisers say, as thousands marched across Australia in a show of support for the Palestinian cause, days after <a href=\"https://www.theguardian.com/world/2025/aug/22/ipc-declares-famine-gaza-city\">famine was declared</a> in Gaza for the first time.</p><p>In Brisbane, organisers estimated at least 50,000 people gathered for a rally they described as “historic”, with Queensland police putting the figure at 10,000.</p> <a href=\"https://www.theguardian.com/world/2025/aug/24/hundreds-of-thousands-expected-at-pro-palestine-protests-across-australia-after-gaza-famine-declaration\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Declaration of famine in Gaza lays bare Israel’s disregard for humanitarian duty",
      "link": "https://www.theguardian.com/world/2025/aug/24/gaza-famine-declaration-israel-humanitarian-duty-analysis",
      "pub_time_taipei": "2025-08-24T17:00:27+08:00",
      "summary": "<p>The IPC’s findings that a quarter of Palestinians in Gaza are starving should mark an urgent turning point in this war</p><p>The <a href=\"https://www.theguardian.com/world/2025/aug/22/ipc-declares-famine-gaza-city\">declaration on Friday of widespread famine in Gaza</a> by the Integrated Food Security Phase Classification (IPC) should mark a turning point in the war. The IPC, which represents a fastidious survey of available data, is regarded as the international gold standard in nutritional crises.</p><p>Long-criticised by humanitarians in other emergencies for its overabundance of caution, the IPC’s declaration of Level 5 – “catastrophic” hunger – in Gaza is a significant moment. Famine, under the IPC’s exacting criteria, requires three critical thresholds to be passed: extreme food deprivation, acute malnutrition and starvation-related deaths, all of which are now visible in Gaza.</p> <a href=\"https://www.theguardian.com/world/2025/aug/24/gaza-famine-declaration-israel-humanitarian-duty-analysis\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Government to ‘feel the pressure’ after Gaza protests, says Greens leader – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/aug/24/australia-news-live-pro-palestine-marches-expected-to-attract-huge-turnout-after-declaration-of-famine-in-gaza-ntwnfb",
      "pub_time_taipei": "2025-08-24T13:44:34+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>David</strong> <strong>Littleproud</strong> continues to insist the Coalition is not setting itself up for another election defeat by maintaining its support for nuclear power.</p><p>Speaking to 2GB on Sunday, Littleproud said the Coalition would take a different approach than it did at the last election by lifting the moratorium on nuclear power generation in Australia and “let the market do it”.</p><p>I just say to your city viewers, regional Australia is bearing the brunt of this. I’m seeing towns and I’m actually seeing families being torn up by these renewable projects that are tearing up their productivity, your food security and actually the native environment. And it’s all without premise.</p><p>Artificial intelligence was absolutely central to our discussions because it will be absolutely gamechanging in our economy and our society into the future.</p><p>Getting it to 8% will be a good effort but not good enough, as minister Mark Butler has pointed out, so we will continue to work with the states on providing the support that people need and deserve, particularly in this instance, when it comes to Thriving Kids.</p><p>Well, that’s the ongoing discussions that we’ve been having, whether it’s treasurers, health ministers, NDIS ministers, leaders, have been having this discussion since the deal was struck.</p><p>What’s the best way to implement. Two deals, not one. They are closely related. There are billions and billions of dollars tied up in them and so we’ve been trying to progress both of those deals at once for good reason because there are swings and roundabouts for both of us.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/aug/24/australia-news-live-pro-palestine-marches-expected-to-attract-huge-turnout-after-declaration-of-famine-in-gaza-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Taiwan referendum on reopening last nuclear plant fails",
      "link": "https://www.theguardian.com/world/2025/aug/24/taiwan-referendum-on-reopening-last-nuclear-plant-fails",
      "pub_time_taipei": "2025-08-24T13:17:03+08:00",
      "summary": "<p>Clear majority backs restarting Maanshan reactor but doesn’t reach legal threshold, as president says nuclear power may be reconsidered if it becomes safe</p><p>A referendum to push for the reopening of Taiwan’s last nuclear plant has failed to reach the legal threshold to be valid, though the president said the island could return to the technology in the future if safety standards improved.</p><p>The plebiscite on Saturday, backed by the opposition, asked whether the Maanshan power plant should be reopened if it was “confirmed” there were no safety issues. The plant was closed in May as the government shifts to renewables and liquefied natural gas.</p> <a href=\"https://www.theguardian.com/world/2025/aug/24/taiwan-referendum-on-reopening-last-nuclear-plant-fails\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Retirees ‘deserve’ super tax breaks, treasurer says, as government considers how to give younger Australians ‘fair go’",
      "link": "https://www.theguardian.com/australia-news/2025/aug/24/retirees-deserve-super-tax-breaks-treasurer-says-as-government-considers-how-to-give-younger-australians-fair-go",
      "pub_time_taipei": "2025-08-24T09:33:58+08:00",
      "summary": "<p>No plan to alter concessional measures on retirees’ superannuation as part of tax reforms, Jim Chalmers says</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/24/australia-news-live-pro-palestine-marches-expected-to-attract-huge-turnout-after-declaration-of-famine-in-gaza-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p></p><p>Retirees still deserve concessional treatment on their superannuation, the treasurer says, despite mounting calls for an overhaul of the tax system.</p><p>Jim Chalmers said fairness for younger generations needed to be considered as part of any change to taxes, after talks at the three-day <a href=\"https://www.theguardian.com/business/2025/aug/20/five-takeaways-day-two-economic-reform-roundtable\">productivity roundtable</a> in Canberra.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/24/retirees-deserve-super-tax-breaks-treasurer-says-as-government-considers-how-to-give-younger-australians-fair-go\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We want builders on site, not filling in forms’: Albanese government cuts red tape in bid to boost home building",
      "link": "https://www.theguardian.com/australia-news/2025/aug/23/we-want-builders-on-site-not-filling-in-forms-albanese-government-cuts-red-tape-in-bid-to-boost-home-building",
      "pub_time_taipei": "2025-08-24T08:43:55+08:00",
      "summary": "<p>Pausing changes to Construction Code, establishment of ‘strike team’ within environment department and use of AI in planning among reforms</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/24/australia-news-live-pro-palestine-marches-expected-to-attract-huge-turnout-after-declaration-of-famine-in-gaza-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p></p><p>The Albanese government has promised to cut red tape and fast track environmental approvals for new homes in an effort to address Australia’s housing crisis.</p><p>On Saturday, the government announced plans to pause further residential changes to the National Construction Code and to streamline the assessment of more than 26,000 homes under the Environment Protection and Biodiversity Conservation Act.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/23/we-want-builders-on-site-not-filling-in-forms-albanese-government-cuts-red-tape-in-bid-to-boost-home-building\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Passengers to get to Sydney CBD in minutes from new train station set to boost construction of 10,000 homes",
      "link": "https://www.theguardian.com/australia-news/2025/aug/24/passengers-to-get-to-sydney-cbd-in-minutes-from-new-train-station-set-to-boost-construction-of-10000-homes",
      "pub_time_taipei": "2025-08-24T08:38:32+08:00",
      "summary": "<p>Commuters could get from Woollahra to city in eight minutes on eastern suburbs line with rezoning of area to include ‘a dedicated portion of affordable housing’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/24/australia-news-live-pro-palestine-marches-expected-to-attract-huge-turnout-after-declaration-of-famine-in-gaza-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australia’s oldest suburban rail network is on track for its first new station in more than a decade to boost construction of 10,000 homes in the country’s most expensive property market.</p><p>A station wasn’t built at Woollahra on Sydney’s eastern suburbs line when the route was built in the 1970s because of community opposition.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/24/passengers-to-get-to-sydney-cbd-in-minutes-from-new-train-station-set-to-boost-construction-of-10000-homes\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New England states vow to fight Trump administration order to halt work on offshore wind farm that’s nearly complete",
      "link": "https://www.theguardian.com/us-news/2025/aug/23/wind-farm-rhode-island-connecticut",
      "pub_time_taipei": "2025-08-24T06:46:06+08:00",
      "summary": "<p>Rhode Island and Connecticut officials say project, slated to power 350,000 homes, is essential to their climate goals</p><p>The Democratic governors of Rhode Island and Connecticut promised on Saturday to fight a <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> order halting work on a nearly complete wind farm off their coasts that was expected to be operational next year.</p><p>The <a href=\"https://revolution-wind.com/\">Revolution Wind project</a> was about 80% complete, with 45 of its 65 turbines already installed, according to the Danish wind farm developer Ørsted, when the US Bureau of Ocean Energy Management sent the firm <a href=\"https://www.boem.gov/sites/default/files/documents/renewable-energy/Director%26%23039%3BsOrder-20250822.pdf?VersionId=VO3AWAHsV_kDvT048xf8dG7A.Rsj6HZJ\">a letter</a> on Friday ordering it to “halt all ongoing activities”.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/23/wind-farm-rhode-island-connecticut\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Zohran Mamdani leads in fundraising for New York City mayoral contest",
      "link": "https://www.theguardian.com/us-news/2025/aug/23/zohran-mamdani-fundraising-new-york-city",
      "pub_time_taipei": "2025-08-24T04:21:32+08:00",
      "summary": "<p>The Democratic nominee far outpaces former governor Andrew Cuomo and embattled incumbent Eric Adams</p><p><a href=\"https://www.theguardian.com/us-news/zohran-mamdani\">Zohran Mamdani</a> pulled in almost double the funds of his nearest rivals for <a href=\"https://www.theguardian.com/us-news/new-york\">New York City</a> mayor between early July and mid-August, as the candidates prepare for the crucial post Labor Day push to the November poll.</p><p>New York’s City’s <a href=\"https://nyccfb.info/VSApps/CandidateSummary.aspx?as_cand_id=2899&amp;as_election_cycle=2025&amp;cand_name=Mamdani%2c+Zohran+K&amp;office=Mayor&amp;report=summ\">campaign finance board</a> said on Saturday that the democratic socialist, who won the Democratic party nomination in June against former state governor <a href=\"https://www.theguardian.com/us-news/andrew-cuomo\">Andrew Cuomo</a>, raised $1,051,200, with an average donation of $121 recorded equally from donors in and outside the state.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/23/zohran-mamdani-fundraising-new-york-city\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bus carrying junior high football team crashes in Pennsylvania, sending 21 people to hospital",
      "link": "https://www.theguardian.com/us-news/2025/aug/23/pennsylvania-bus-crash-junior-high-football-team",
      "pub_time_taipei": "2025-08-24T03:58:54+08:00",
      "summary": "<p>Bus overturned about 20 miles north of Pittsburgh while carrying players from Aliquippa junior high school</p><p>A bus carrying a junior high football team to a game crashed on Saturday north of Pittsburgh, sending 21 of the 28 people onboard to the hospital, officials said.</p><p>Twenty-five Aliquippa junior high students and three adults were headed to a game in nearby Gibsonia. The crash occurred in Economy Borough, about 20 miles north of Pittsburgh.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/23/pennsylvania-bus-crash-junior-high-football-team\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Former Sri Lankan president admitted to hospital after arrest",
      "link": "https://www.theguardian.com/world/2025/aug/23/sri-lanka-former-president-ranil-wickremesinghe-admitted-to-hospital-arrest-charges",
      "pub_time_taipei": "2025-08-23T23:56:59+08:00",
      "summary": "<p>Ranil Wickremesinghe, who faces charges of using public funds for private travel, treated for acute dehydration</p><p>Sri Lanka’s former president was admitted to hospital on Saturday, a day after he was charged with using public funds to finance private international travel, as the government intensified its crackdown on corruption.</p><p>Ranil Wickremesinghe, 76, was remanded in custody on Friday after being accused of using taxpayers’ money to pay for a two-day visit to the UK in September 2023 to attend a ceremony at the University of Wolverhampton granting an honorary professorship to his wife.</p> <a href=\"https://www.theguardian.com/world/2025/aug/23/sri-lanka-former-president-ranil-wickremesinghe-admitted-to-hospital-arrest-charges\">Continue reading...</a>"
    }
  ]
}