{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-04T21:49:13.707788+08:00",
  "window_end_taipei": "2025-09-05T21:49:13.707788+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Nigel Farage says ‘there’s every chance of general election in 2027’",
      "link": "https://www.theguardian.com/politics/2025/sep/05/nigel-farage-every-chance-general-election-2027",
      "pub_time_taipei": "2025-09-05T21:39:40+08:00",
      "summary": "<p>Reform UK leader tells party conference that Angela Rayner’s actions ‘scream of entitlement’</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates\">UK politics live – latest updates</a></p></li></ul><p>Nigel Farage has said there is every chance of a general election in 2027 as the government is falling apart after Angela Rayner’s resignation.</p><p>Speaking at the Reform UK party conference in Birmingham, he said the former Rayner’s actions “scream of entitlement” and said the Labour government was even worse than the Tories that went before it.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/05/nigel-farage-every-chance-general-election-2027\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tycoon who led campaign to decriminalise cannabis to be Thai PM",
      "link": "https://www.theguardian.com/world/2025/sep/05/tycoon-anutin-charnvirakul-thai-pm-cannabis-campaign",
      "pub_time_taipei": "2025-09-05T21:37:44+08:00",
      "summary": "<p>Anutin Charnvirakul voted in by parliament after promising election in four months, as Thaksin Shinawatra jets out</p><p>Anutin Charnvirakul, a staunch royalist, has been selected as Thailand’s next prime minister, after securing the backing of the majority of lawmakers in parliament.</p><p>The 58-year-old tycoon turned politician is considered a conservative, though he made a name for himself for leading a campaign to decriminalise cannabis. He was voted in after a chaotic scramble by parties to gain enough support to replace the ousted PM Paetongtarn Shinawatra, who was removed from office by a court ruling.</p> <a href=\"https://www.theguardian.com/world/2025/sep/05/tycoon-anutin-charnvirakul-thai-pm-cannabis-campaign\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Powell and Murray go in reshuffle after Rayner steps down – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-09-05T21:35:24+08:00",
      "summary": "<p>Leader of the Commons and Scottish secretary to leave government as Starmer remakes his senior team</p><ul><li><p><a href=\"https://www.theguardian.com/politics/2025/sep/05/angela-rayner-stands-down-over-stamp-duty-row\">Angela Rayner stands down over stamp duty row</a></p></li></ul><p>The <strong>Windrush commissioner</strong> has demanded “urgent reform” of the compensation scheme after being told by survivors that “the Home Office is waiting for us to die off”.</p><p>In a letter seen by the Guardian addressed to migration and equalities minister, <strong>Seema Malhotra</strong>, and shared with home secretary <strong>Yvette Cooper</strong>, <strong>Rev Clive Foster</strong> says it is “deeply concerning” that 66 people have died while waiting for compensation for the <strong><a href=\"https://www.theguardian.com/uk-news/windrush-scandal\">Windrush scandal</a></strong>.</p><p>Given the age and health of many people affected by the scandal, reform is a matter of urgency. Justice must be delivered in their lifetimes.</p><p>A phrase I’ve heard repeatedly from community members is that ‘the Home Office is waiting for us to die off’. While I don’t share this view, I believe it’s important that you hear it directly as it reflects the challenge you face in building trust.</p><p>We thank Rev Foster for his initial recommendations, many of which we are already implementing, and ministers will meet with him shortly to discuss further improvements to our schemes.</p><p>The UK has recognised the ‘real risk’ of genocide perpetuated by Israel, so unless this meeting is about peace, what message are we sending?</p><p>I am appalled at the decision to allow this representative of a government that is <a href=\"https://www.theguardian.com/commentisfree/2025/jul/15/the-guardian-view-on-the-children-of-gaza-when-17000-die-its-more-than-a-mistake\">systematically killing Palestinian children</a> on a daily basis to visit our country.</p><p>The prime minister is proving to be absolutely tone deaf to the desperate plight of the Palestinian people and the overwhelming feelings of revulsion of the British people at the brutality of the government Herzog represents.</p><p>Dialogue is one thing, but there are times when the act of meeting itself becomes a political statement.</p><p>Clearly Herzog is not Netanyahu, their politics on many issues are at variance. But that said, the president’s own words have helped legitimise the collective punishment of Palestinians, language that international jurists have warned could fall foul of the genocide convention.</p><p>The question must be asked: how do you see Israel in 10 years? What is the future for Palestinians in East Jerusalem, the West Bank and Gaza? If you have no reasonable alternative plan, Mr President, then there must be a Palestinian state.</p><p>But the only solution to this is through politics, through discussion. Herzog is easier to talk to than many in the extreme rightwing government in Israel. But we mustn’t pull our punches.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Graham Linehan told police trans teenager taunted him about divorce, trial hears",
      "link": "https://www.theguardian.com/uk-news/2025/sep/05/graham-linehan-told-police-trans-teenager-taunted-him-about-divorce-trial-hears",
      "pub_time_taipei": "2025-09-05T21:30:32+08:00",
      "summary": "<p>Father Ted co-creator told officer he knocked phone from Sophia Brooks’ hand in ‘reflex response’, court hears</p><p>Graham Linehan, the co-creator of Father Ted, told police he knocked a phone out of a teenage transgender activist’s hand after being taunted about his divorce, a court has heard.</p><p>The move was said by Linehan to have been a “reflex response” to a “provocative statement” from Sophia Brooks, then 17, who was filming him at the time.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/05/graham-linehan-told-police-trans-teenager-taunted-him-about-divorce-trial-hears\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Reform UK could strip FCA of power to regulate banking if elected",
      "link": "https://www.theguardian.com/politics/2025/sep/05/reform-uk-could-strip-city-watchdog-of-power-to-regulate-banking-if-elected",
      "pub_time_taipei": "2025-09-05T21:26:45+08:00",
      "summary": "<p>Nigel Farage reportedly plans to overhaul rules governing City of London that were introduced after 2008 financial crash</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/05/ons-crisis-retail-sales-error-uk-house-prices-record-high-us-jobs-report-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Nigel Farage could strip the City watchdog of its power to regulate the banking industry under a sweeping overhaul to undo changes made after the 2008 financial crisis if Reform UK was elected to government.</p><p>The leader of the party at the top of opinion polls has said he wants to prepare for the potential for an early general election in 2027.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/05/reform-uk-could-strip-city-watchdog-of-power-to-regulate-banking-if-elected\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump faces criticism over order to rebrand Pentagon as ‘Department of War’ – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
      "pub_time_taipei": "2025-09-05T21:26:27+08:00",
      "summary": "<p>Move could cost tens of millions of dollars, with letterheads and signs needing to be changed, and one Democrat says money should instead go towards preventing conflicts</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/04/trump-defense-war-department\">Trump expected to order rebrand of Pentagon as ‘Department of War’</a></p></li></ul><p><strong>Tensions between Michelle Wu, the mayor of Boston, and the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> have been escalating in recent months over the administration’s aggressive immigration policies, with reports now signaling the possibility of a federal immigration enforcement surge in the city.</strong></p><p>The friction came to a head last week when the Trump administration reportedly began preparing an “immigration enforcement blitz” for Boston in the coming weeks, according to <a href=\"https://www.politico.com/news/2025/08/29/trump-admin-plans-immigration-enforcement-surge-in-boston-00536276\">Politico</a>.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hundreds of workers detained in major Ice raid at US Hyundai factory",
      "link": "https://www.theguardian.com/us-news/2025/sep/05/immigration-ice-raid-hyundai-georgia",
      "pub_time_taipei": "2025-09-05T21:22:57+08:00",
      "summary": "<p>South Korea concerned after at least 450 were arrested at Georgia work site making batteries for Hyundai and Kia cars</p><p>Hundreds of workers at a factory being built in <a href=\"https://www.theguardian.com/us-news/state-of-georgia\">Georgia</a> to make car batteries for Hyundai and Kia electric vehicles were detained in a massive raid by Immigration and Customs Enforcement (<a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\">Ice</a>) on Thursday that stopped construction.</p><p>The facility is part of what would be the biggest industrial investment in the state’s history and had been hailed as a huge boost for the economy by Georgia’s Republican governor, Brian Kemp.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/05/immigration-ice-raid-hyundai-georgia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Putin says western troops in Ukraine would be ‘legitimate targets’ as European countries pledge security support – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/05/volodymyr-zelenskyy-ukraine-robert-fico-slovakia-vladimir-putin-russia-energy-europe-live-news-updates",
      "pub_time_taipei": "2025-09-05T21:22:42+08:00",
      "summary": "<p>Macron says 26 nations have offered security guarantees for Ukraine as Zelenskyy meets Slovakia’s Fico amid tension over Russian energy supplies</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/04/european-leaders-pressure-trump-to-reveal-how-much-support-us-will-give-ukraine\">Macron says 26 countries ready to supply postwar military backing for Ukraine</a></p></li></ul><p></p><p>US president <strong>Donald Trump</strong> has just posted on his Truth Social account, saying:</p><p><em>“<strong>Looks like we’ve lost India and Russia to deepest, darkest, China.</strong> May they have a long and prosperous future together! President Donald J. Trump”</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/05/volodymyr-zelenskyy-ukraine-robert-fico-slovakia-vladimir-putin-russia-energy-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Duchess of Kent has died aged 92, says Buckingham Palace",
      "link": "https://www.theguardian.com/uk-news/2025/sep/05/duchess-of-kent-dies",
      "pub_time_taipei": "2025-09-05T21:18:11+08:00",
      "summary": "<p>Palace says duchess, who was married to late queen’s cousin, ‘passed away peacefully surrounded by family’</p><p>The Duchess of Kent, the first Catholic convert in the royal family for centuries, who was known for presenting numerous Wimbledon trophies and consoling runners-up, has died aged 92.</p><p>The duchess was married to the late queen’s cousin the Duke of Kent but for decades led a separate life from him.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/05/duchess-of-kent-dies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US added just 22,000 jobs in August, continuing slowdown amid Trump tariffs",
      "link": "https://www.theguardian.com/business/2025/sep/05/us-jobs-report-august-tariffs",
      "pub_time_taipei": "2025-09-05T21:01:56+08:00",
      "summary": "<p>Latest report also contained more bad news – the US lost 13,000 jobs in June, according to the latest survey</p><p>The US jobs market stalled over the summer, adding just 22,000 jobs in August and continuing a slowdown in the labor market as businesses adjusted to disruptions caused by tariffs.</p><p>The latest jobs report also contained more bad news. The US lost 13,000 jobs in June, according to the latest survey, the first time it went into the negative since December 2020.</p><p>Federal employment dropped 15,000 jobs in August, totaling 97,000 jobs lost since January.</p><p>Manufacturing jobs went down by 12,000 in August and have tumbled 78,000 for the year.</p><p>The racial unemployment gap widened in August. Black Americans are seeing an unemployment rate of 7.5%, compared to 6.1% last August. The unemployment rate for White Americans is 3.7%</p> <a href=\"https://www.theguardian.com/business/2025/sep/05/us-jobs-report-august-tariffs\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tesla offers Elon Musk a trillion-dollar pay package",
      "link": "https://www.theguardian.com/technology/2025/sep/05/tesla-elon-musk-trillion-dollar-pay-package",
      "pub_time_taipei": "2025-09-05T20:14:44+08:00",
      "summary": "<p>CEO will have to increase the value of his electric car company from just over $1tn to $8.5tn over 10 years</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/05/ons-crisis-retail-sales-error-uk-house-prices-record-high-us-jobs-report-business-live-news-updates\">Business live – latest updates</a></p></li></ul><p>Elon Musk could become the world’s first trillionaire if he hits targets set by Tesla, under a scheme disclosed by the electric car company he runs and in which he is the largest shareholder.</p><p>Tesla outlined the terms of the incentive package, unprecedented in corporate history, in a section of its latest stock market update that began: “Yes, you read that correctly.”</p> <a href=\"https://www.theguardian.com/technology/2025/sep/05/tesla-elon-musk-trillion-dollar-pay-package\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Three Britons among 16 people killed in Lisbon funicular crash, police confirm",
      "link": "https://www.theguardian.com/world/2025/sep/05/initial-report-into-lisbon-funicular-crash-due-after-16-killed",
      "pub_time_taipei": "2025-09-05T20:06:51+08:00",
      "summary": "<p>Portuguese investigators find no evidence of sabotage, with mechanical or maintenance issues among possible causes</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/04/someone-needs-to-answer-for-what-happened-lisbon-reacts-to-streetcar-crash-that-killed-16\">‘Someone needs to answer for what happened’: Lisbon reacts to streetcar crash that killed 16</a></p></li></ul><p>Portuguese police have confirmed that three Britons were among the 16 people killed in Lisbon on Wednesday evening when one of the city’s funicular streetcars derailed and hurtled down a hill and into a building.</p><p>The accident, described by Portugal’s prime minister, Luís Montenegro, as “one of the biggest tragedies in our recent history”, also left 21 people injured, five of whom are in a serious condition.</p> <a href=\"https://www.theguardian.com/world/2025/sep/05/initial-report-into-lisbon-funicular-crash-due-after-16-killed\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Japanese man becomes oldest person to reach Mount Fuji summit at 102",
      "link": "https://www.theguardian.com/world/2025/sep/05/japanese-man-becomes-oldest-person-to-reach-summit-of-mount-fuji-at-102",
      "pub_time_taipei": "2025-09-05T19:49:24+08:00",
      "summary": "<p>Kokichi Akuzawa climbed with 70-year-old daughter to break record for oldest person to make ascent – a second time</p><p>Kokichi Akuzawa has become the oldest person to climb to the top of Mount Fuji at the age of 102 – despite almost giving up during his trek.</p><p>“I was really tempted to give up halfway through,” Akuzawa said. “Reaching the summit was tough, but my friends encouraged me, and it turned out well. I managed to get through it because so many people supported me.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/05/japanese-man-becomes-oldest-person-to-reach-summit-of-mount-fuji-at-102\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US imposes sanctions on Palestinians for requesting war crimes inquiry",
      "link": "https://www.theguardian.com/world/2025/sep/04/us-sanctions-palestinian-human-rights",
      "pub_time_taipei": "2025-09-05T19:17:29+08:00",
      "summary": "<p>Rights groups in Gaza and Ramallah had asked international criminal court to investigate Israel over genocide claims</p><p>The US has imposed sanctions against three Palestinian human rights groups that asked the international criminal court (ICC) to investigate Israel over allegations of genocide in Gaza, according to a notice posted to the US treasury department’s website.</p><p>The three groups – the Gaza-based Palestinian Centre for Human Rights and Al Mezan Center for Human Rights, and the Ramallah-based Al-Haq – were listed under what the treasury department said wereICC-related designations.</p> <a href=\"https://www.theguardian.com/world/2025/sep/04/us-sanctions-palestinian-human-rights\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: RFK Jr accused of ‘reckless disregard for science and the truth’ in Senate hearing",
      "link": "https://www.theguardian.com/us-news/2025/sep/05/first-thing-rfk-jr-accused-of-reckless-disregard-for-science-and-the-truth-in-senate-hearing",
      "pub_time_taipei": "2025-09-05T19:07:36+08:00",
      "summary": "<p>Health secretary defends his leadership as Democrats attack his vaccine policy and demand his resignation. Plus, how Giorgio Armani became the mastermind of contemporary style</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\">Don’t already get First Thing in your inbox? Sign up here</a></p></li></ul><p>Good morning.</p><p>The US health secretary, Robert F Kennedy Jr, faced the Senate finance committee in <a href=\"https://www.theguardian.com/us-news/2025/sep/04/rfk-jr-hearing-calls-resign-democrats\">a tense and combative hearing</a> on Thursday, during which lawmakers questioned his remarks expressing vaccine skepticism, claims that the scientific community is deeply politicized, and the ongoing turmoil plaguing the Centers for Disease Control and Prevention (CDC).</p><p><strong>What did the Democrats say during the hearing?</strong> Senators began by calling for Kennedy’s resignation. “Robert Kennedy’s primary interest is taking vaccines away from Americans,” the ranking member Ron Wyden said, while Raphael Warnock called Kennedy a “hazard to the health of the American people” and repeated his calls for him to step down or for Donald Trump to fire him.</p><p><strong>What did Trump say about the need for congressional approval?</strong> That the administration considered it a mere formality. “We’re just going to do it. I’m sure Congress will go along, if we need that. I don’t think we even need that,” he said.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/05/first-thing-rfk-jr-accused-of-reckless-disregard-for-science-and-the-truth-in-senate-hearing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Afghan earthquake death toll jumps to more than 2,200, say Taliban",
      "link": "https://www.theguardian.com/world/2025/sep/04/afghan-earthquake-death-toll-jumps-says-taliban",
      "pub_time_taipei": "2025-09-05T18:43:39+08:00",
      "summary": "<p>Aid agencies plead for funds as rough terrain hinders relief effort and 98% of buildings in one province are damaged</p><p>The death toll from a major earthquake in Afghanistan this week has jumped to more than 2,200, just as another magnitude 6.2 earthquake hit the southeastern region of the country on Thursday night.</p><p>On Thursday, Taliban spokesperson Hamdullah Fitrat <a href=\"https://www.theguardian.com/world/2025/sep/04/afghan-earthquake-death-toll-jumps-says-taliban\">confirmed that the death toll from Sunday’s earthquake had risen to 2,205</a> – up from previous estimates of 1,400 – making it one of the deadliest natural disasters to hit the country in decades.</p> <a href=\"https://www.theguardian.com/world/2025/sep/04/afghan-earthquake-death-toll-jumps-says-taliban\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: British Columbia breaks Canada’s September heat record",
      "link": "https://www.theguardian.com/environment/2025/sep/05/weather-tracker-record-heat-british-columbia-canada-september-record-temperature-kansas-oklahoma-hail",
      "pub_time_taipei": "2025-09-05T18:20:29+08:00",
      "summary": "<p>Temperatures climb above 40C, while a powerful hailstorm in the US lashes Kansas and Oklahoma</p><p>A spate of extremely hot weather in British Columbia has broken Canada’s national maximum temperature record for September.</p><p>On Tuesday, it reached 40C (104F) in Lytton, matching the previous all-time high. That was only the third time that temperature has been recorded in the country in September.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/05/weather-tracker-record-heat-british-columbia-canada-september-record-temperature-kansas-oklahoma-hail\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Starmer must not meet Israeli president during UK visit, say Labour MPs",
      "link": "https://www.theguardian.com/politics/2025/sep/04/israel-president-visit-london-talks-ministers-isaac-herzog",
      "pub_time_taipei": "2025-09-05T17:17:19+08:00",
      "summary": "<p>Exclusive: Isaac Herzog to visit London for expected talks with ministers, with UK on brink of recognising Palestinian statehood</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates\">UK politics live – latest updates</a></p></li></ul><p>The president of Israel will travel to London next week amid outcry from Labour MPs who have urged Keir Starmer not to meet the visiting delegation.</p><p>The arrival of Isaac Herzog is fraught with complication for ministers, with the UK government on the brink of recognising the state of Palestine at the UN general assembly.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/04/israel-president-visit-london-talks-ministers-isaac-herzog\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Wong responds to Andrews photo; proposed Harbour Bridge march headed to court – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
      "pub_time_taipei": "2025-09-05T17:09:31+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/05/neo-nazi-thomas-sewell-refused-bail-melbourne-ntwnfb\">Neo-Nazi Thomas Sewell refused bail as magistrate says he is a danger to community</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Coalition of the willing meeting a ‘positive sign’ for Ukraine, former ambassador says</strong></p><p>The former Australian ambassador to Russia, <strong>Peter Tesch</strong>, has appeared on ABC News Breakfast after <strong>Anthony Albanese</strong> joined a virtual meeting with world leaders signed up to the coalition of the willing for Ukraine on Thursday night.</p><p>The issue is that we are still no closer to a credible and durable peace settlement, because Moscow keeps walking both sides of the street, and that is provoking a degree of frustration. But in the absence of serious, additional pressure upon Moscow, it’s difficult to see a near-term solution here - notwithstanding Ukraine’s clear willingness to engage seriously in discussions.</p><p>And importantly, although the details are vague … President Trump at least remains engaged in that dialogue and that’s very important.</p><p>Our case for a 35% pay increase over three years will begin in the NSW Industrial Relations Commission later this month. As part of this case, which is one of the biggest industrial cases this state has seen, we will present evidence around the gendered undervaluation of nurses and midwives’ work and the work value changes our professions have seen over the past 16 years.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hollow Knight: Silksong launch crashes online gaming stores",
      "link": "https://www.theguardian.com/games/2025/sep/05/hollow-knight-silksong-launch-crashes-online-gaming-stores-popularity-demand-australian-game",
      "pub_time_taipei": "2025-09-05T15:19:01+08:00",
      "summary": "<p>Steam, the Nintendo eShop and Playstation Store among those that crashed on Friday, unable to cope with demand for the Australian-made game</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>An enigmatic three-member game developing team from Adelaide has created chaos on global online gaming platforms.</p><p>Steam and other major storefronts including Nintendo’s eShop, PlayStation Store and Microsoft Store crashed on Friday, unable to cope with the demand for Hollow Knight: Silksong, the long-awaited sequel to the critically acclaimed 2017 indie hit Hollow Knight.</p> <a href=\"https://www.theguardian.com/games/2025/sep/05/hollow-knight-silksong-launch-crashes-online-gaming-stores-popularity-demand-australian-game\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘A void that is impossible to fill’: tributes paid to fashion designer Giorgio Armani",
      "link": "https://www.theguardian.com/fashion/2025/sep/05/tributes-paid-to-fashion-designer-giorgio-armani",
      "pub_time_taipei": "2025-09-05T14:31:43+08:00",
      "summary": "<p>Donatella Versace says ‘the world lost a giant today’ while Victoria Beckham called him ‘a visionary designer whose legacy will live on forever’</p><ul><li><p><a href=\"https://www.theguardian.com/fashion/2025/sep/04/giorgio-armani-celebrated-italian-fashion-designer-dies-at-91\">Giorgio Armani, celebrated Italian fashion designer, dies at 91</a></p></li><li><p><a href=\"https://www.theguardian.com/fashion/2025/sep/04/giorgio-armani-obituary\">Giorgio Armani obituary</a></p></li><li><p><a href=\"https://www.theguardian.com/fashion/2025/sep/04/giorgio-armani-elegant-determined-a-little-unknowable\">Elegant, determined, a little unknowable: Giorgio Armani is gone but will never be forgotten</a></p></li><li><p><a href=\"https://www.theguardian.com/fashion/gallery/2025/sep/04/giorgio-armani-a-life-in-pictures\">A life in pictures</a></p></li></ul><p>Pioneering fashion designer Giorgio Armani has been remembered as a “true friend”, “an immense talent” and “a visionary” following his death at the age of 91.</p><p>Designers, celebrities, politicians and artists were among those paying tribute after the Armani Group <a href=\"https://www.theguardian.com/fashion/2025/sep/04/giorgio-armani-celebrated-italian-fashion-designer-dies-at-91\">announced his death</a> on Thursday.</p> <a href=\"https://www.theguardian.com/fashion/2025/sep/05/tributes-paid-to-fashion-designer-giorgio-armani\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK exit from ECHR ‘would remove foundations of Good Friday agreement’",
      "link": "https://www.theguardian.com/world/2025/sep/05/uk-exit-from-echr-would-remove-foundations-of-good-friday-agreement",
      "pub_time_taipei": "2025-09-05T13:00:17+08:00",
      "summary": "<p>Peace deal cannot be ‘negotiated away’ by British political figures who want to quit ECHR, says Irish deputy PM </p><p>Northern Ireland’s peace deal cannot be “negotiated away” by British political figures who want to see the UK quit the European Convention of Human Rights if elected, the Irish tánaiste has warned.</p><p>The ECHR is an integral part of the 1998 Belfast Good Friday agreement and withdrawal would remove those foundations of peace, according to Simon Harris, Ireland’s deputy prime minister.</p> <a href=\"https://www.theguardian.com/world/2025/sep/05/uk-exit-from-echr-would-remove-foundations-of-good-friday-agreement\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We’re scared of losing our jobs’: industries in India fear impact of Trump’s 50% tariffs",
      "link": "https://www.theguardian.com/world/2025/sep/05/scared-losing-jobs-industries-india-fear-impact-trump-tariffs",
      "pub_time_taipei": "2025-09-05T12:00:16+08:00",
      "summary": "<p>Textiles, footwear, jewellery, gems and seafood are sectors most affected in trade with US, India’s biggest market</p><p>India has long been one of the world’s great garment houses, turning out everything from cheap T-shirts to intricate embroidery. Last year, textile and garment exports to the US alone fetched £21bn, riding a wave of strong consumer demand.</p><p>Now the trade is in jeopardy. With the stroke of a pen, the US president, Donald Trump, last week slapped a 50% tariff on more than half of India’s £65bn worth of merchandise exports to the country’s largest market. A supply chain once prized for being cheap suddenly became among the priciest.</p> <a href=\"https://www.theguardian.com/world/2025/sep/05/scared-losing-jobs-industries-india-fear-impact-trump-tariffs\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Macron says 26 nations ready to provide postwar military backing to Ukraine",
      "link": "https://www.theguardian.com/world/2025/sep/04/european-leaders-pressure-trump-to-reveal-how-much-support-us-will-give-ukraine",
      "pub_time_taipei": "2025-09-05T11:36:31+08:00",
      "summary": "<p>French president says allies would either deploy ‘reassurance force’ troops to Ukraine, or be present in the area on land, sea or in the air</p><p>Twenty-six nations have pledged to provide postwar security guarantees to Ukraine, including an international force on land and sea and in the air, Emmanuel Macron said after a summit at which European leaders sought to pin down Donald Trump on the level of support he is willing to give Kyiv.</p><p>“The day the conflict stops, the security guarantees will be deployed,” the French president told a press conference at the Élysée Palace in Paris, standing alongside Volodymyr Zelenskyy.</p> <a href=\"https://www.theguardian.com/world/2025/sep/04/european-leaders-pressure-trump-to-reveal-how-much-support-us-will-give-ukraine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Don Dale detainee isolated for 84 hours and denied food as coercion technique, investigation finds",
      "link": "https://www.theguardian.com/australia-news/2025/sep/05/don-dale-detention-centre-84-hours-isolation-denied-food-coercion-technique-ntwnfb",
      "pub_time_taipei": "2025-09-05T11:19:08+08:00",
      "summary": "<p>Children’s commissioner says young Indigenous person kept in isolation for 12 hours longer than permitted under NT youth justice laws because they refused to move cell blocks</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A young Aboriginal person detained at the Don Dale detention centre was kept in isolation for 84 hours, unable to leave their cell or make contact with any support person, and was denied food for some of that time as a coercion tactic by officers, an investigation by the Northern Territory’s Office of the Children’s Commissioner has found.</p><p>The investigation examined an incident that took place in April 2024 at the notorious youth detention facility in Berrimah in the NT, which saw a young detainee held in a cell after refusing to move from one cell block to another.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/05/don-dale-detention-centre-84-hours-isolation-denied-food-coercion-technique-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Neo-Nazi Thomas Sewell refused bail as magistrate says he is a danger to community",
      "link": "https://www.theguardian.com/australia-news/2025/sep/05/neo-nazi-thomas-sewell-refused-bail-melbourne-ntwnfb",
      "pub_time_taipei": "2025-09-05T10:50:34+08:00",
      "summary": "<p>Sewell, who allegedly led an attack on the sacred Indigenous burial site in Melbourne known as Camp Sovereignty, was returned to custody following his court appearance</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Neo-Nazi Thomas Sewell, who allegedly led an attack on a sacred Indigenous burial site in Melbourne, has been refused bail.</p><p>Sewell, 32, appeared in the Melbourne magistrates court on Friday morning, with a magistrate saying she was satisfied he would endanger the safety of others if released into the community.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/05/neo-nazi-thomas-sewell-refused-bail-melbourne-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Andrew Forrest’s Fortescue rejects ‘credibility’ of business council modelling on 2035 emissions target",
      "link": "https://www.theguardian.com/australia-news/2025/sep/04/australia-needs-530bn-capital-to-meet-70-climate-goal-business-council-claims-ahead-of-new-2035-target",
      "pub_time_taipei": "2025-09-05T10:29:42+08:00",
      "summary": "<p>BCA member criticises climate modelling commissioned by lobby group that ‘underplays’ economic opportunities and does not factor in cost of inaction </p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A fight over climate policy has broken out within a major Australian business lobby, with mining billionaire Andrew Forrest’s Fortescue sharply criticising the Business Council of Australia over its modelling of the costs of making emissions cuts.</p><p>A report released by the business council on Friday claimed Australia would need up to $530bn in capital investment and to potentially curb coal and gas exports to achieve a 2035 emissions target of 70% or more.</p><p><strong><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=copyembed\">Sign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/04/australia-needs-530bn-capital-to-meet-70-climate-goal-business-council-claims-ahead-of-new-2035-target\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Third earthquake hits Afghanistan as death toll rises above 2,200",
      "link": "https://www.theguardian.com/world/2025/sep/04/third-earthquake-hits-afghanistan-as-death-toll-rises",
      "pub_time_taipei": "2025-09-05T03:24:38+08:00",
      "summary": "<p>South-east of country rocked as rescuers struggle to find survivors of first quake</p><p>A magnitude 6.2 earthquake has shaken <a href=\"https://www.theguardian.com/world/afghanistan\">Afghanistan</a> as the death toll from the devastating quake on Sunday rose to more than 2,200.</p><p>It struck south-eastern regions on Thursday night, according to the Helmholtz Centre for Geosciences in Germany. It was not immediately clear how much damage there was.</p> <a href=\"https://www.theguardian.com/world/2025/sep/04/third-earthquake-hits-afghanistan-as-death-toll-rises\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Canada’s Mark Carney signals austerity measures as government shifts focus from Trump to economy",
      "link": "https://www.theguardian.com/world/2025/sep/04/canada-carney-budget-trump",
      "pub_time_taipei": "2025-09-05T02:42:20+08:00",
      "summary": "<p>Prime minister cautions Canadians as Ottawa moves to curb spending to balance near-record military expenditures</p><p><a href=\"https://www.theguardian.com/world/mark-carney\">Mark Carney</a> has told Canadians to prepare for austerity measures and his finance minister warned of “tough choices” in the coming months, as the government attempts to balance near-record defence spending, cuts to government programs and a trade war with the United States.</p><p>Carney, the former central banker and economist turned politician, has been meeting senior ministers before the fall budget, and hinted cuts were coming to the federal bureaucracy.</p> <a href=\"https://www.theguardian.com/world/2025/sep/04/canada-carney-budget-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Canada: one person killed and six injured in stabbing in remote First Nation community",
      "link": "https://www.theguardian.com/world/2025/sep/04/canada-hollow-water-first-nation-stabbing-manitoba",
      "pub_time_taipei": "2025-09-05T02:35:39+08:00",
      "summary": "<p>Royal Canadian Mounted Police said the suspect who attacked Hollow Water First Nation has also died </p><p>One person has been killed and six others injured in a mass stabbing in an Indigenous community in central <a href=\"https://www.theguardian.com/world/canada\">Canada</a>, according to federal police who said that the the suspect also died in the incident.</p><p>The violence occurred in Hollow Water First Nation, a remote community with about 1,000 residents, 217km (135 miles) north of Manitoba’s provincial capital, Winnipeg, the Royal Canadian Mounted Police told AFP.</p> <a href=\"https://www.theguardian.com/world/2025/sep/04/canada-hollow-water-first-nation-stabbing-manitoba\">Continue reading...</a>"
    }
  ]
}