{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-25T20:40:08.852962+08:00",
  "window_end_taipei": "2025-09-26T20:40:08.852962+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Electoral Commission rejects call to reopen Labour Together investigation",
      "link": "https://www.theguardian.com/politics/2025/sep/26/morgan-mcsweeney-labour-together-electoral-commission-no-evidence-other-offences",
      "pub_time_taipei": "2025-09-26T20:32:18+08:00",
      "summary": "<p>Watchdog says it has found ‘no evidence of any other potential offences’ at thinktank when led by Morgan McSweeney</p><p>Morgan McSweeney, the prime minister’s chief of staff, will not face another investigation into undeclared donations to the Labour Together thinktank, the elections watchdog has said.</p><p>The Electoral Commission said it had found “no evidence of any other potential offences” by the thinktank formerly led by McSweeney, which was previously fined in 2021.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/26/morgan-mcsweeney-labour-together-electoral-commission-no-evidence-other-offences\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.K. plans mandatory digital ID to clamp down on migrants working illegally",
      "link": "https://www.washingtonpost.com/world/2025/09/26/uk-id-card-starmer-migration/",
      "pub_time_taipei": "2025-09-26T20:28:17+08:00",
      "summary": "The Labour prime minister announced the new ID requirement amid struggling poll numbers for his party and a rising global backlash against immigrants and asylum seekers."
    },
    {
      "source": "衛報",
      "title": "EU countries and Ukraine to hold talks on ‘drone wall’ to counter growing threat from Russia and others – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/26/denmark-drone-sightings-airport-russia-ukraine-europe-live-news",
      "pub_time_taipei": "2025-09-26T20:23:08+08:00",
      "summary": "<p>Numerous European countries to discuss plans to counter growing threat of incursions later today</p><p><strong>Danish defence minister Troels Lund Poulsen briefed European ministers on the recent drone sightings over Denmark</strong> as part of broader discussions on the so-called “drone wall” (<a href=\"https://www.theguardian.com/world/live/2025/sep/26/denmark-drone-sightings-airport-russia-ukraine-europe-live-news?page=with%3Ablock-68d673278f08af03abbe890a#block-68d673278f08af03abbe890a\">13:07</a>), his ministry <a href=\"https://x.com/Forsvarsmin\">said</a>.</p><p>During the meeting, the ministers from 10 countries, joined by the EU’s top diplomat <strong>Kaja Kallas </strong>and EU defence commissioner <strong>Andrius Kubilius, </strong>discussed “a possible new EU initiative aimed at supporting joint European capacity building in the field of drones.”</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/26/denmark-drone-sightings-airport-russia-ukraine-europe-live-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ice detainees death toll reaches 16 amid concerns over ‘horrendous’ conditions",
      "link": "https://www.theguardian.com/us-news/2025/sep/26/ice-detention-death-toll-trump",
      "pub_time_taipei": "2025-09-26T20:16:32+08:00",
      "summary": "<p>Rising toll worries activists as mass detention in US increases after Trump returned to White House in January</p><p>Deaths occurring in the custody of US Immigration and Customs Enforcement (<a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\">Ice</a>) have reached at least 16 since January amid increasing mass detention across the country and growing concerns over conditions.</p><p>On Sunday, Ismael Ayala-Uribe, a 39-year-old Mexican national and former “<a href=\"https://www.theguardian.com/us-news/2025/sep/17/congress-letter-dreamers-daca\">Dreamer</a>” – those given protections after being brought to the US as undocumented children in the past – <a href=\"https://www.theguardian.com/us-news/2025/sep/24/california-investigate-death-ice-custody\">died after</a> being held at an Ice facility in Adelanto, California, <a href=\"https://www.ice.gov/news/releases/mexican-national-dies-ice-custody-after-being-referred-local-hospital-day-prior\">according to</a> a statement from the federal agency.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/26/ice-detention-death-toll-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ex-FBI director James Comey indicted on two charges with reports that he will surrender on Friday - US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
      "pub_time_taipei": "2025-09-26T20:15:19+08:00",
      "summary": "<p>Comey is expected to surrender and have his initial appearance in federal district court today</p><p><strong>Well, the president is awake.</strong></p><p>Donald Trump has posted the following on his Truth Social social media network:</p><p>JAMES COMEY IS A DIRTY COP. MAKE AMERICA GREAT AGAIN!</p><p>Whether you like Corrupt James Comey or not, and I can’t imagine too many people liking him, HE LIED! It is not a complex lie, it’s a very simple, but IMPORTANT one. There is no way he can explain his way out of it. He is a Dirty Cop, and always has been, but he was just assigned a Crooked Joe Biden appointed Judge, so he’s off to a very good start. Nevertheless, words are words, and he wasn’t hedging or in dispute. He was very positive, there was no doubt in his mind about what he said, or meant by saying it. He left himself ZERO margin of error on a big and important answer to a question. He just got unexpectedly caught. James “Dirty Cop” Comey was a destroyer of lives. He knew exactly what he was saying, and that it was a very serious and far reaching lie for which a very big price must be paid! President DJT</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Benjamin Netanyahu set for defiant UN speech as Trump warns on annexation of West Bank - Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live",
      "pub_time_taipei": "2025-09-26T20:12:18+08:00",
      "summary": "<p>Israeli PM expected to share a defiant message at the UN general assembly on Friday against a Palestinian state</p><p><strong>Palestinians</strong> living in poverty were also affected, the Palestinian prime minister’s spokesperson <strong>Mohammad Abu al-Rob</strong> told Agence France-Presse (AFP), with their numbers rising by more than 150% since the start of the <strong>Gaza</strong> war, and with cash assistance not paid out in more than two months.</p><p>An increase in the number of <strong>Israeli</strong> checkpoints in the <strong>West Bank</strong>, and a reduction in work permits for West Bank Palestinians seeking work inside Israel have had a drastic impact.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Terrorism case against Kneecap rapper Liam Óg Ó hAnnaidh thrown out",
      "link": "https://www.theguardian.com/music/2025/sep/26/terrorism-case-against-kneecap-rapper-liam-og-o-hannaidh-thrown-out",
      "pub_time_taipei": "2025-09-26T20:11:09+08:00",
      "summary": "<p>Chief magistrate at Woolwich crown court rules that charge brought against musician is unlawful and ‘null’</p><p>A terrorism charge against the Kneecap rapper Liam Óg Ó hAnnaidh has been thrown out by the chief magistrate due to a technical error.</p><p>Ó hAnnaidh had been charged with a terrorism offence for allegedly displaying a Hezbollah flag at a gig at the O2 Forum in Kentish Town, north London, last November.</p> <a href=\"https://www.theguardian.com/music/2025/sep/26/terrorism-case-against-kneecap-rapper-liam-og-o-hannaidh-thrown-out\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Menzies Campbell, former Liberal Democrat leader, dies at 84",
      "link": "https://www.theguardian.com/politics/2025/sep/26/menzies-campbell-former-liberal-democrat-leader-dies-at-84",
      "pub_time_taipei": "2025-09-26T20:02:08+08:00",
      "summary": "<p>Campbell was North East Fife MP for nearly three decades and was made a peer, and once held UK 100m record</p><p>Menzies Campbell, the long-serving Liberal Democrat MP who led the party for 18 months, has died aged 84, his family have said.</p><p>Lord Campbell, usually known as Ming, died in London after a period of respite care, his grandson Gregor Grant-Suttie said in a statement. He had spent some of his final days watching last weekend’s Lib Dem conference.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/26/menzies-campbell-former-liberal-democrat-leader-dies-at-84\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Teen opioid addictions often untreated as youth overdose deaths rapidly rise in US – study",
      "link": "https://www.theguardian.com/us-news/2025/sep/26/us-teen-drug-overdoes-opioids",
      "pub_time_taipei": "2025-09-26T20:00:14+08:00",
      "summary": "<p>Drug overdoses are now a leading causes of death among US teens as fentanyl possibly drives surge, researchers warn</p><p>Fewer than<a href=\"https://www.healthaffairs.org/doi/full/10.1377/hlthaff.2025.00240\"> one in three teenagers </a>with opioid use disorder receive treatment, according to a study published in this month’s Health Affairs journal that looked at the disorder in minors from 2022 to 2023.</p><p>In 2023, <a href=\"https://www.kff.org/mental-health/teens-drugs-and-overdose-contrasting-pre-pandemic-and-current-trends/\">557 teens died of opioid overdose</a>, nearly threefold as many as in 2018, while adult opioid deaths only went up by 65% during this time, according to the study. Drug overdoses are now among the<a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC10979414/pdf/nihms-1977911.pdf\"> leading causes of death for US teenagers.</a></p> <a href=\"https://www.theguardian.com/us-news/2025/sep/26/us-teen-drug-overdoes-opioids\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Treasury ‘putting the squeeze’ on OBR over Labour growth plans amid tensions over downgrade",
      "link": "https://www.theguardian.com/business/2025/sep/26/treasury-putting-squeeze-on-obr-growth-plans-tensions-over-downgrade-rachel-reeves",
      "pub_time_taipei": "2025-09-26T20:00:13+08:00",
      "summary": "<p>Rachel Reeves may have to find up to £30bn in tax rises or spending cuts if forecaster revisits expectations</p><p>Treasury policymakers frustrated by the politically damaging timing of a downgrade to UK productivity forecasts by the Office for Budget Responsibility (OBR) are pressing the watchdog to score the benefits of Labour’s pro-growth plans.</p><p>Rachel Reeves faces the prospect of having to find up to £30bn in tax rises or spending cuts in her 26 November budget if, <a href=\"https://www.theguardian.com/business/2025/sep/16/new-headache-for-rachel-reeves-as-obr-downgrades-key-productivity-forecast\">as expected</a>, the OBR cuts its forecast for future productivity growth to match the consensus of other experts.</p> <a href=\"https://www.theguardian.com/business/2025/sep/26/treasury-putting-squeeze-on-obr-growth-plans-tensions-over-downgrade-rachel-reeves\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Immigrants with no criminal record now largest group in Ice detention",
      "link": "https://www.theguardian.com/us-news/2025/sep/26/immigrants-criminal-record-ice-detention",
      "pub_time_taipei": "2025-09-26T20:00:12+08:00",
      "summary": "<p>Government data shows 16,523 people with no record, versus 15,725 with a record and 13,767 with pending charges</p><p>Immigrants with no criminal record are now the <a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/aug/29/trump-immigration-ice-cbp-data\">largest group</a> in US immigration detention, according to data released by the government. The number of people with no criminal history arrested by Immigration and Customs Enforcement (<a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\">Ice</a>) and detained by the Trump administration has now surpassed the number of those charged with crimes.</p><p>Ice, the federal agency most heavily relied upon by Donald Trump to carry out the US president’s mass deportation campaign, released its latest numbers on Thursday.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/26/immigrants-criminal-record-ice-detention\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Reform UK’s ex-leader in Wales Nathan Gill pleads guilty to bribery charges",
      "link": "https://www.theguardian.com/uk-news/2025/sep/26/reform-uk-ex-leader-wales-nathan-gill-pleads-guilty-bribery-charges",
      "pub_time_taipei": "2025-09-26T19:59:51+08:00",
      "summary": "<p>Gill admits to eight charges while an elected member of the European parliament</p><p>The former leader of Reform UK in Wales has pleaded guilty to bribery charges relating to statements in favour of Russia in the European parliament.</p><p>Nathan Gill, of Anglesey, north Wales, admitted eight counts of bribery on dates between 6 December 2018 and 18 July 2019.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/26/reform-uk-ex-leader-wales-nathan-gill-pleads-guilty-bribery-charges\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "James Comey indicted on two charges as Trump pushes to prosecute political enemies | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/sep/26/first-thing-james-comey-indicted-as-trump-pushes-to-prosecute-political-enemies",
      "pub_time_taipei": "2025-09-26T19:38:15+08:00",
      "summary": "<p>Ex-FBI director indicted on counts of making false statements and obstruction of a congressional proceeding. Plus, human origins may reach back far deeper in time than previously thought</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>The former FBI director James Comey, one of Donald Trump’s most frequent targets, was <a href=\"https://www.theguardian.com/us-news/2025/sep/25/james-comey-fbi-director-indictment\">indicted yesterday</a> on one count of making a false statement to Congress and one count of obstruction of a congressional proceeding, the latest move in the president’s retribution campaign against his political adversaries.</p><p><strong>What did the </strong><strong>US attorney general say?</strong> “No one is above the law. Today’s indictment reflects this Department of Justice’s commitment to holding those who abuse positions of power accountable for misleading the American people,” Pam Bondi said in a statement.</p><p><strong>What else is happening?</strong> Donald Trump issued a presidential memorandum yesterday aimed at reining in what he has called a radical leftwing domestic “terror network” but which seemed <a href=\"https://www.theguardian.com/us-news/2025/sep/25/trump-presidential-memorandum-political-violence\">likely to meet fierce legal pushback from critics</a> depicting it as a licence for a broad crackdown on his political opponents.</p><p><strong>Why is there speculation that </strong><strong>Israel plans to annex the West Bank?</strong> There has been widespread speculation in Israel and elsewhere over how Netanyahu intends to retaliate for the <a href=\"https://www.theguardian.com/world/2025/sep/21/uk-canada-and-australia-announce-formal-recognition-of-palestine-with-wave-of-israel-allies-to-follow\">recognition of Palestine as a state</a> earlier this week by the UK, Australia, France, Canada and Portugal. Options include full annexation of the West Bank, or of smaller portions such as a strip of territory along the border with Jordan or shuttering British, French and other consulates in East Jerusalem, analysts said.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/26/first-thing-james-comey-indicted-as-trump-pushes-to-prosecute-political-enemies\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Netanyahu to address U.N. amid widening global backlash",
      "link": "https://www.washingtonpost.com/national-security/2025/09/26/israel-netanyahu-un-speech-gaza/",
      "pub_time_taipei": "2025-09-26T19:16:28+08:00",
      "summary": "Israeli Prime Minister Benjamin Netanyahu will address the United Nations amid opposition to the military campaign in Gaza and a proposal to annex the West Bank."
    },
    {
      "source": "華盛頓郵報",
      "title": "After U.S. strikes, Iran increases work at mysterious underground site",
      "link": "https://www.washingtonpost.com/national-security/2025/09/26/iran-underground-nuclear-us/",
      "pub_time_taipei": "2025-09-26T19:01:12+08:00",
      "summary": "Satellite imagery indicates Iran is increasing construction at a deeply buried site in “Pickaxe Mountain,” just south of the Natanz nuclear facility hit by Israeli and U.S. strikes in June."
    },
    {
      "source": "衛報",
      "title": "Drug traffickers livestream Argentinian women’s torture and killing",
      "link": "https://www.theguardian.com/world/2025/sep/26/argentina-drug-traffickers-livestream-killing-women",
      "pub_time_taipei": "2025-09-26T19:00:06+08:00",
      "summary": "<p>Brenda del Castillo, Morena Verdi and Lara Gutiérrez were lured with a promise of a $300 payment for a ‘sex party’</p><ul><li><p><a href=\"https://www.theguardian.com/global-development/article/2024/jun/13/argentina-rosario-drug-trade-cocaine\">‘The gangs never used to kill children, now they do’: how cocaine created Argentina’s first narcocity</a></p></li></ul><p>The murder of three young <a href=\"https://www.theguardian.com/world/argentina\">Argentinian</a> women whose torture by suspected drug traffickers was livestreamed on a private Instagram group has sent shock waves through a country unused to such extreme levels of narco violence.</p><p>Brenda del Castillo, 20, Morena Verdi, 20, and Lara Gutiérrez, 15, went missing on Friday, after they were lured to a house in the outskirts of Buenos Aires by a promise that they would be paid US $300 for taking part in a “sex party”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/26/argentina-drug-traffickers-livestream-killing-women\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russia is helping prepare China to attack Taiwan, documents suggest",
      "link": "https://www.washingtonpost.com/world/2025/09/26/russia-china-weapons-sales-air-assault/",
      "pub_time_taipei": "2025-09-26T18:23:40+08:00",
      "summary": "Russia is using its battlefield experience to give Chinese airborne units the training and technical knowhow to carry out lightning-fast operations."
    },
    {
      "source": "衛報",
      "title": "Man fined $340,000 for deepfake pornography of prominent Australian women in first-of-its-kind case",
      "link": "https://www.theguardian.com/technology/2025/sep/26/man-fined-34000-for-deepfake-pornography-of-prominent-australian-women-in-first-of-its-kind-case",
      "pub_time_taipei": "2025-09-26T18:02:50+08:00",
      "summary": "<p>Watchdog applauds ‘strong message’ after federal court orders Gold Coast man Anthony Rotondo to pay for posting deepfake images to a now-defunct website</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A man who posted deepfake pornographic images of prominent Australian women has been slapped with a hefty fine as a “strong message” in a first-of-its-kind case.</p><p>The federal court ordered Anthony Rotondo, also known as Antonio, to pay a $343,500 penalty plus costs on Friday after the online regulator eSafety Commissioner brought a case against him almost two years ago.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/26/man-fined-34000-for-deepfake-pornography-of-prominent-australian-women-in-first-of-its-kind-case\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "For fleeing Gazans, even renting a spot to pitch a tent can cost too much",
      "link": "https://www.washingtonpost.com/world/2025/09/26/gaza-city-displaced-tents-shelter/",
      "pub_time_taipei": "2025-09-26T17:00:31+08:00",
      "summary": "Tarpaulins and free slivers of earth are extremely rare as a quarter-million Palestinians flee Israel’s attack on Gaza City and crowd into pockets farther south."
    },
    {
      "source": "華盛頓郵報",
      "title": "Using the internet in South Korea? Prepare for the pornographic ads.",
      "link": "https://www.washingtonpost.com/world/2025/09/26/webtoon-online-ads-explicit-violence/",
      "pub_time_taipei": "2025-09-26T17:00:27+08:00",
      "summary": "South Korea has faced a surge of explicit cartoon ads in recent years. Some depict violence against women, raising concerns over child welfare and online sexism."
    },
    {
      "source": "華盛頓郵報",
      "title": "Has Pakistan extended its nuclear umbrella to Riyadh? No one will say.",
      "link": "https://www.washingtonpost.com/world/2025/09/26/pakistan-saudi-arabia-security-nuclear-weapons/",
      "pub_time_taipei": "2025-09-26T17:00:03+08:00",
      "summary": "As U.S. credibility erodes in the Persian Gulf, Saudi Arabia has signed a far-reaching mutual defense pact with Pakistan. But key details of the deal remain unclear."
    },
    {
      "source": "衛報",
      "title": "Abnormally hot days may hit Australia’s south-east after rare sudden warming over Antarctica",
      "link": "https://www.theguardian.com/environment/2025/sep/26/fears-of-abnormally-hot-days-in-southern-australia-after-sudden-stratospheric-warming-over-antarctica",
      "pub_time_taipei": "2025-09-26T15:53:03+08:00",
      "summary": "<p>Phenomenon extremely unusual in southern hemisphere and last occurred in 2019 when it contributed to worsening of black summer bushfires</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A rare rise in stratospheric temperatures over Antarctica could influence weather into summer, with previous events driving hotter and drier conditions for south-east Australia.</p><p>The phenomenon – called sudden stratospheric warming – is extremely unusual in the southern hemisphere.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/26/fears-of-abnormally-hot-days-in-southern-australia-after-sudden-stratospheric-warming-over-antarctica\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump tariff announcement wipes $1bn from CSL value – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb",
      "pub_time_taipei": "2025-09-26T15:41:27+08:00",
      "summary": "<p>This blog is closed.</p><p><strong>Parents need boost to lift flagging vaccination rate</strong></p><p>Parents need practical strategies such as easier access to appointments and bulk-billing to help reverse a concerning decline in childhood vaccination rates, research has found.</p><p>The top barriers were mostly around ability to get appointments easily, being able to prioritise their child’s vaccination over all of the other things that they have to get done, the cost of getting their child vaccinated.</p><p>We now know that that will be on the 20th of October. The point here is that they had spoken a number of times by phone. The relationship is conducted at many, many levels. It is going well.</p><p>We’ve got the lowest tariff rate. Aukus is happening at a pace. And so we’re really confident … about the progress of our relationship with the US.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Controversial Queensland mayor Troy Thompson resigns after corruption inquiry",
      "link": "https://www.theguardian.com/australia-news/2025/sep/26/controversial-queensland-mayor-troy-thompson-resigns-after-corruption-probe",
      "pub_time_taipei": "2025-09-26T15:34:55+08:00",
      "summary": "<p>Thompson, accused of misleading voters about his military record, says he will now nominate in the byelection caused by his departure</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A controversial north Queensland mayor <a href=\"https://www.theguardian.com/australia-news/2024/oct/01/steven-miles-north-queensland-mayor-troy-thompson-show-cause-ntwnfb\">accused of misleading voters</a> about his army service has resigned.</p><p>Troy Thompson was <a href=\"https://www.theguardian.com/australia-news/2024/nov/22/troy-thompson-townsville-mayor-suspended-military-record-posts-ntwnfb\">suspended on full pay in November</a> while the Queensland Crime and Corruption Commission (CCC) conducted an investigation.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/26/controversial-queensland-mayor-troy-thompson-resigns-after-corruption-probe\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Blood on these walls’: Mudrat tears into ABC’s Gaza coverage during Triple J live set",
      "link": "https://www.theguardian.com/media/2025/sep/26/mudrat-criticises-abc-coverage-israel-gaza-war-triple-j-live-set-palestinian-keffiyeh",
      "pub_time_taipei": "2025-09-26T13:32:50+08:00",
      "summary": "<p>Australian hip-hop artist donned a Palestinian keffiyeh and delivered a blistering critique of the broadcaster and its treatment of Antoinette Lattouf</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The hip-hop artist Mudrat used Triple J’s video series Bars of Steel to deliver a blistering critique of the ABC’s coverage of the Israel-Gaza war and its treatment of Antoinette Lattouf.</p><p>The federal court found in June the <a href=\"https://www.theguardian.com/media/2025/sep/24/abc-ordered-to-pay-antoinette-lattouf-another-150000-for-unlawful-termination-over-gaza-instagram-post\">ABC breached the Fair Work Act when it terminated the casual broadcaster</a> for reasons including that she held a political opinion opposing the Israeli military campaign in Gaza.</p> <a href=\"https://www.theguardian.com/media/2025/sep/26/mudrat-criticises-abc-coverage-israel-gaza-war-triple-j-live-set-palestinian-keffiyeh\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘History will remember who showed up’: Keir Starmer faces call to attend Cop30 summit",
      "link": "https://www.theguardian.com/environment/2025/sep/26/keir-starmer-faces-call-to-attend-cop30-summit",
      "pub_time_taipei": "2025-09-26T13:00:59+08:00",
      "summary": "<p>Response from leaders and key climate figures comes after PM’s aides advised non-attendance over concerns Reform may attack him</p><p>Leading climate figures and Labour MPs have urged Keir Starmer to attend the crucial <a href=\"https://www.theguardian.com/environment/2025/jun/29/climate-is-our-biggest-war-warns-ceo-of-cop30-ahead-of-un-summit-in-brazil\">Cop30 climate summit</a> this November, after aides advised him not to attend for fear of attracting the ire of the Reform party.</p><p>Simon Stiell, the UN’s climate chief, said: “Cop30 is where leaders are expected to come and roll up their sleeves, make deals to help their nation’s economy transition faster, creating more jobs, and guide the world on what next steps we take together.”</p> <a href=\"https://www.theguardian.com/environment/2025/sep/26/keir-starmer-faces-call-to-attend-cop30-summit\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New research may rewrite origins of the Book of Kells, says academic",
      "link": "https://www.theguardian.com/books/2025/sep/26/new-research-may-rewrite-origins-of-the-book-of-kells-says-academic",
      "pub_time_taipei": "2025-09-26T13:00:58+08:00",
      "summary": "<p>Exclusive: Author challenges assumption monks on Iona created manuscript, instead positing its origins are Pictish</p><p>The Book of Kells was likely to have been created 1,200 years ago in Pictish eastern Scotland, rather than on the island of Iona, according to research that challenges long-held assumptions about one of the world’s most famous medieval manuscripts.</p><p>The Book of Kells is an intricate, illuminated account of the four Gospels of Matthew, Mark, Luke and John that was long thought to have been started in the late eighth century at the monastery on Iona before being taken in the 9th century to the monastery of Kells in County Meath, Ireland, after a Viking raid.</p><p>The Book of Kells by Victoria Whitworth (Bloomsbury Publishing, £35). To support the Guardian, order your copy at <a href=\"https://www.guardianbookshop.com/the-book-of-kells-9781788541800/?utm_source=editoriallink&amp;utm_medium=merch&amp;utm_campaign=article\">guardianbookshop.com</a>. Delivery charges may apply.</p> <a href=\"https://www.theguardian.com/books/2025/sep/26/new-research-may-rewrite-origins-of-the-book-of-kells-says-academic\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Super Typhoon Ragasa rampages through Taiwan, Hong Kong and southern China",
      "link": "https://www.theguardian.com/environment/2025/sep/26/super-typhoon-ragasa-rampages-through-taiwan-hong-kong-and-southern-china",
      "pub_time_taipei": "2025-09-26T13:00:57+08:00",
      "summary": "<p>Peak winds of 165mph bring 17 deaths in Taiwan, while Storm Bualoi threatens to strengthen into typhoon on its way to the Philippines</p><p>Super Typhoon Ragasa pounded Taiwan, Hong Kong and China before moving into Vietnam on Thursday night, though as a much-weakened storm.</p><p>At its peak Ragasa had mean wind speeds of 165mph as it moved to the south of Taiwan, where it brought significant heavy rain resulting in 17 deaths as a barrier lake burst.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/26/super-typhoon-ragasa-rampages-through-taiwan-hong-kong-and-southern-china\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "A respected European statesman has praise for Trump",
      "link": "https://www.washingtonpost.com/world/2025/09/26/trump-ukraine-stubb-finland/",
      "pub_time_taipei": "2025-09-26T12:00:38+08:00",
      "summary": "“We’re going in the right direction,” said Finnish President Alexander Stubb of the war in Ukraine, “and I don’t think we’d be here without Trump.”"
    },
    {
      "source": "衛報",
      "title": "Trump says he ‘will not allow’ Israel to annex West Bank after lobbying from allies",
      "link": "https://www.theguardian.com/world/2025/sep/26/trump-says-he-will-not-allow-israel-to-annex-west-bank-after-lobbying-from-allies",
      "pub_time_taipei": "2025-09-26T11:10:28+08:00",
      "summary": "<p>British officials said they feared Trump would recognise Israeli control over the West Bank in retaliation for the UK, Australia, France and others recognising Palestine</p><p>Donald Trump has said he will not allow Israel to annex the occupied West Bank, rejecting calls from some far-right politicians in Israel who want to extend sovereignty over the area and in doing so make impossible the establishment of a Palestinian state.</p><p>“I will not allow Israel to annex the West Bank. Nope, I will not allow it. It’s not going to happen,” Trump told reporters in the Oval Office, adding “There’s been enough. It’s time to stop now.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/26/trump-says-he-will-not-allow-israel-to-annex-west-bank-after-lobbying-from-allies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Civilian injuries in Gaza similar to those of soldiers in war zones, study finds",
      "link": "https://www.theguardian.com/world/2025/sep/25/civilian-injuries-gaza-combat-soldiers-study",
      "pub_time_taipei": "2025-09-26T08:16:53+08:00",
      "summary": "<p>Wounds such as burns or leg injuries more common in Gaza than among US soldiers who fought in Iraq and Afghanistan</p><p>Civilians in Gaza have sustained injuries of a type and on a scale more usually seen among professional soldiers involved in intense combat operations, research has found.</p><p>A study published in the British Medical Journal (BMJ) found that some types of wounds – such as burns or injuries to legs – were more common among civilians in Gaza than among US soldiers fighting in recent conflicts in Iraq and Afghanistan.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/civilian-injuries-gaza-combat-soldiers-study\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Iran snapback sanctions loom as UN security council set to vote on nuclear programme",
      "link": "https://www.theguardian.com/world/2025/sep/26/iran-snapback-sanctions-un-security-council-vote-nuclear-programme",
      "pub_time_taipei": "2025-09-26T08:13:11+08:00",
      "summary": "<p>Russian efforts to delay the return of sanctions is expected to fail during vote on Friday</p><p>A final Russian attempt to defer the snapback of large-scale UN sanctions on Iran is expected to fail at the UN security council on Friday after European countries rejected last-minute Iranian offers to give UN weapons inspectors limited access to its bombed nuclear sites.</p><p>Russia will call for the reimposition of the sanctions to be deferred for six months to give more time for diplomacy, but European diplomats are confident that Russia will not get the nine votes it needs on the security council for the snapback to be deferred. The last time Russia put the same issue to a vote it received only four votes.</p> <a href=\"https://www.theguardian.com/world/2025/sep/26/iran-snapback-sanctions-un-security-council-vote-nuclear-programme\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As Gaza engulfs European politics, Italy sends navy ship on unlikely mission",
      "link": "https://www.washingtonpost.com/world/2025/09/25/gaza-flotilla-italy-spain-navy-israel/",
      "pub_time_taipei": "2025-09-26T06:18:22+08:00",
      "summary": "Italian Prime Minister Giorgia Meloni, inclined toward Israel, is navigating an uncomfortable position as the Italian navy helps a Gaza aid flotilla."
    },
    {
      "source": "衛報",
      "title": "Trump signs executive order to transfer TikTok to US owners",
      "link": "https://www.theguardian.com/technology/2025/sep/25/trump-china-tiktok-deal",
      "pub_time_taipei": "2025-09-26T05:56:01+08:00",
      "summary": "<p>Agreement separates app from Chinese owner ByteDance and allows US investors to take 80% stake</p><p>Donald Trump signed an executive order on Thursday <strong> </strong>outlining<strong> </strong>the terms of a deal to transfer TikTok to a US owner.</p><p>Trump said he and China’s president Xi Jinping had come to an agreement to allow TikTok to continue operating in the US, separating the social media platform from its Chinese owner ByteDance. Trump said the deal complies with a law that would have forced the shutdown of the app for American users had it not been divested and sold to a US owner.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/25/trump-china-tiktok-deal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "European broadcasters to vote on expelling Israel from Eurovision 2026",
      "link": "https://www.theguardian.com/tv-and-radio/2025/sep/25/european-broadcasters-to-vote-on-expelling-israel-from-eurovision-2026",
      "pub_time_taipei": "2025-09-26T05:25:47+08:00",
      "summary": "<p>European Broadcasting Union says vote required after several nations threaten potential boycott</p><p>The European Broadcasting Union has confirmed it will hold an online vote in November that could see the Israeli broadcaster Kan expelled from next year’s Eurovision song contest.</p><p>In a letter sent to participating broadcasters on Thursday, the EBU president, Delphine Ernotte Cunci, wrote there was an “unprecedented diversity of views” on Israel’s participation in Eurovision, and the issue required “a broader democratic basis”.</p> <a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/25/european-broadcasters-to-vote-on-expelling-israel-from-eurovision-2026\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Big trees in Amazon more climate-resistant than previously believed",
      "link": "https://www.theguardian.com/environment/2025/sep/25/study-shows-big-trees-in-amazon-more-climate-resistant-than-previously-believed",
      "pub_time_taipei": "2025-09-26T05:23:08+08:00",
      "summary": "<p>Forest is ‘remarkably resilient to climate change’, but remains under threat from fires and deforestation</p><p>The biggest trees in the Amazon are growing larger and more numerous, according to a new study that shows how an intact rainforest can help draw carbon dioxide out of the atmosphere and sequester it in bark, trunk, branch and root.</p><p>Scientists said the paper, <a href=\"https://www.nature.com/articles/s41477-025-02097-4\">published in Nature Plants on Thursday</a>, was welcome confirmation that big trees are proving more climate resilient than previously believed, and undisturbed tropical vegetation continues to act as an effective carbon sink despite rising temperatures and strong droughts.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/25/study-shows-big-trees-in-amazon-more-climate-resistant-than-previously-believed\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump administration calls for radical reform of world’s asylum system",
      "link": "https://www.washingtonpost.com/national-security/2025/09/25/trump-asylum-reforms-christopher-landau/",
      "pub_time_taipei": "2025-09-26T04:45:43+08:00",
      "summary": "Critics of the plan said they fear it would put vulnerable people at risk of being deported to countries where they could face torture and persecution."
    },
    {
      "source": "衛報",
      "title": "Washington backing plan for Tony Blair to head transitional Gaza authority",
      "link": "https://www.theguardian.com/world/2025/sep/25/washington-backing-plan-for-tony-blair-to-head-transitional-gaza-authority",
      "pub_time_taipei": "2025-09-26T04:03:53+08:00",
      "summary": "<p>Reported proposal for international body to oversee Gaza for up to five years counters UN-backed plan for faster transition to Palestinian rule</p><p>The White House is backing a plan that would see Tony Blair head a temporary administration of the Gaza Strip – initially without the direct involvement of the Palestinian Authority (PA), according to Israeli media reports.</p><p>Under the proposal, Blair would lead a body called the Gaza International Transitional Authority (Gita) that would have a mandate to be Gaza’s “supreme political and legal authority” for as long as five years.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/washington-backing-plan-for-tony-blair-to-head-transitional-gaza-authority\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Former French president handed 5-year prison term over Gaddafi money",
      "link": "https://www.washingtonpost.com/world/2025/09/25/french-nicolas-sarkozy-sentenced/",
      "pub_time_taipei": "2025-09-26T02:54:56+08:00",
      "summary": "Nicolas Sarkozy, convicted of conspiracy for seeking 2007 campaign funds from then-Libyan dictator Moammar Gaddafi, would be the first modern French president to serve time."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump says Kyiv can win back all its land. It’s not that simple.",
      "link": "https://www.washingtonpost.com/world/2025/09/25/ukraine-russia-territory-win/",
      "pub_time_taipei": "2025-09-26T01:59:22+08:00",
      "summary": "While Ukrainian officials say a massive influx of arms and technology is key to a major offensive to retake territory, analysts do not see that coming."
    },
    {
      "source": "衛報",
      "title": "Doug Ford to ban speed cameras in Ontario in populist appeal to suburban voters",
      "link": "https://www.theguardian.com/world/2025/sep/25/ontario-speed-camera-ban-doug-ford",
      "pub_time_taipei": "2025-09-26T01:45:37+08:00",
      "summary": "<p>Canada premier’s move prompts criticism from road safety activists and is likely to cue new showdown with Toronto</p><p>Doug Ford has announced plans to ban speed cameras in Ontario, describing the devices as an out-of-control “tax grab” in his latest populist appeal to suburban voters.</p><p>The move prompted criticism from road safety activists and is likely to cue another showdown with Toronto, after the mayor of Canada’s largest city urged councillors to keep the cameras in place, warning that “speed kills”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/ontario-speed-camera-ban-doug-ford\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel’s future in Uefa could come to a head before World Cup qualifiers",
      "link": "https://www.theguardian.com/football/2025/sep/25/israel-future-in-uefa-october-world-cup-qualifiers-suspension-maccabi-tel-aviv",
      "pub_time_taipei": "2025-09-26T01:38:28+08:00",
      "summary": "<ul><li><p>National team and club sides may face suspension</p></li><li><p>Next Uefa international break begins on 6 October</p></li></ul><p>Uefa could decide as early as next week whether to suspend Israel from its competitions, with the governing body facing growing pressure from inside and outside the game.</p><p>Reports on Thursday, initially in the Times, suggested a vote that would determine Israel’s participation in World Cup qualifying and that of Maccabi Tel Aviv in the Europa League could be held by Uefa’s executive committee before the international break begins on 6 October.</p> <a href=\"https://www.theguardian.com/football/2025/sep/25/israel-future-in-uefa-october-world-cup-qualifiers-suspension-maccabi-tel-aviv\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sarkozy’s spectacular downfall marks turning point in France’s struggle against graft",
      "link": "https://www.theguardian.com/world/2025/sep/25/sarkozys-spectacular-downfall-marks-turning-point-in-frances-struggle-against-graft",
      "pub_time_taipei": "2025-09-26T01:38:22+08:00",
      "summary": "<p>Experts say political legacy of former president convicted of criminal conspiracy now appears impossible to rebuild</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/25/nicolas-sarkozy-found-guilty-of-criminal-conspiracy-in-libya-trial\">Nicolas Sarkozy given five-year prison sentence after Libya trial</a></p></li></ul><p>When a Paris court handed Nicolas Sarkozy a five-year prison sentence on Thursday – for criminal conspiracy over a scheme to get election campaign funds from the regime of the late Libyan dictator Muammar Gaddafi – it was a historic moment for modern France.</p><p>The rightwing Sarkozy, who served as president between 2007 and 2012, was known in office not just for his hard line on immigration and national identity but for championing harsher sentencing for delinquents. He is now expected to enter jail within a matter of months.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/sarkozys-spectacular-downfall-marks-turning-point-in-frances-struggle-against-graft\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sarkozy says he will ‘sleep in jail but with head held high’ after conviction",
      "link": "https://www.theguardian.com/world/2025/sep/25/nicolas-sarkozy-found-guilty-of-criminal-conspiracy-in-libya-trial",
      "pub_time_taipei": "2025-09-26T01:13:20+08:00",
      "summary": "<p>Former French president receives five-year prison sentence for criminal conspiracy over pact with Gaddafi regime</p><p>The former French president Nicolas Sarkozy said he would “sleep in jail but with my head held high” after receiving a five-year prison sentence for criminal conspiracy – the first time a former head of state has been sent to prison in modern French history.</p><p>The verdict and sentencing followed a trial in which he and his aides were accused of making a <a href=\"https://www.theguardian.com/world/2025/sep/25/paris-court-to-rule-on-nicolas-sarkozy-corruption-charge\">corruption pact</a> with the regime of the late Libyan dictator Muammar Gaddafi to receive funding for the 2007 French presidential election campaign.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/nicolas-sarkozy-found-guilty-of-criminal-conspiracy-in-libya-trial\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Gaza City hospitals close, patients flee as Israeli forces advance",
      "link": "https://www.washingtonpost.com/world/2025/09/25/gaza-city-hospitals-close/",
      "pub_time_taipei": "2025-09-26T00:20:25+08:00",
      "summary": "Israel’s ground invasion of Gaza City has put several hospitals and more than two dozen primary health care providers out of service, medical staff and the U.N. say."
    },
    {
      "source": "衛報",
      "title": "Activists outraged after Rio lawmakers approve ‘wild west bonus’ for police who kill ‘criminals’",
      "link": "https://www.theguardian.com/world/2025/sep/25/rio-de-janeiro-brazil-police-bonus",
      "pub_time_taipei": "2025-09-26T00:03:19+08:00",
      "summary": "<p>Similar legislation introduced in Rio in mid-1990s caused an explosion of extrajudicial killings in the city’s favelas</p><p>Human rights activists have voiced outrage after <a href=\"https://www.theguardian.com/world/rio-de-janeiro\">Rio de Janeiro</a>’s parliament approved plans to pay police officers a “wild west bonus” for “neutralizing criminals” during operations.</p><p>The move is a throwback to the mid-1990s when Rio’s then governor, Marcello Alencar, introduced similar legislation that caused an explosion of extrajudicial killings in the city’s favelas.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/rio-de-janeiro-brazil-police-bonus\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Opponents of Australia cutting emissions pointed to China’s lack of a target. That argument just got harder to make",
      "link": "https://www.theguardian.com/australia-news/2025/sep/26/china-first-emissions-reduction-target-announced-global-impact",
      "pub_time_taipei": "2025-09-25T23:00:40+08:00",
      "summary": "<p>With China accounting for nearly a third of the world’s total emissions, any cuts it achieves will make a substantial difference for the world – and for fossil fuel exports</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=cvau_sfl\">Sign up for climate and environment editor Adam Morton’s free Clear Air newsletter here</a></p></li></ul><p>Anything China does on energy and climate change is very big news. Its plans ripple around the world, whether that’s in changing the demand for fossil fuels or affecting the impacts on the planet from global heating.</p><p>On Thursday, Australia woke to the news that China’s president, Xi Jinping, had told the United Nations that for the first time his country was setting a target to cut – in absolute terms – its greenhouse gas emissions.</p><p><strong><a href=\"https://www.theguardian.com/environment/2025/mar/10/sign-up-for-the-clear-air-australia-environment-newsletter-with-adam-morton?CMP=copyembed\">Sign up to get climate and environment editor Adam Morton’s Clear Air column as a free newsletter</a></strong></p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/26/china-first-emissions-reduction-target-announced-global-impact\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Denmark blames ‘systematic’ attack as mystery drones swarm more airports",
      "link": "https://www.washingtonpost.com/world/2025/09/25/airport-russia-denmark-drones/",
      "pub_time_taipei": "2025-09-25T20:50:06+08:00",
      "summary": "Drones forced Aalborg Airport to close, and others were spotted near three airports in the south. Days earlier, sightings closed Copenhagen and Oslo airports."
    }
  ]
}