{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-17T20:40:06.971127+08:00",
  "window_end_taipei": "2025-10-18T20:40:06.971127+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "‘No Kings’ protest live updates: millions expected to gather across the US for anti-Trump protests",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/18/anti-trump-no-kings-protests-updates",
      "pub_time_taipei": "2025-10-18T20:26:40+08:00",
      "summary": "<p>Organizers expect more than 2,500 demonstrations across country after high turnout at June protests as Robert De Niro urges Americans to ‘stand up and be counted’</p><p>Recovery from a recent surgery for colon cancer will not stop <strong>James Phipps</strong>, 75, from attending Saturday’s No Kings demonstration in Chicago, Illinois. “I have a burning desire to be a part of the protest.” he said, “because that’s all I’ve done all my life.”</p><p>Phipps, born in Marks, Mississippi, was <a href=\"https://seiu73.org/2022/02/new-documentary-shows-life-of-local-73-member-and-civil-rights-activist/\">involved</a> in the <a href=\"https://www.theguardian.com/world/civil-rights-movement\">civil rights movement</a> in the 1960s from the age of 13, when he was part of racially integrating his local high school and organising with the Student Nonviolent Coordinating Committee. At 15, he became involved in the Mississippi Freedom Labor Union (MFLU), which <a href=\"https://snccdigital.org/events/mississippi-freedom-labor-union-founded/\">organised</a> sharecroppers for better wages.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/18/anti-trump-no-kings-protests-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US Senate poised to approve industry lobbyist to lead chemical safety at EPA",
      "link": "https://www.theguardian.com/us-news/2025/oct/18/senate-epa-confirmation-douglas-troutman-lobbyist",
      "pub_time_taipei": "2025-10-18T20:00:45+08:00",
      "summary": "<p>If Douglas Troutman is confirmed, the top four toxics office at the environmental agency will be held by ex-lobbyists</p><p>The US Senate is poised to approve Donald Trump’s nomination of an industry lobbyist to lead the <a href=\"https://www.theguardian.com/environment/epa\">US Environmental Protection Agency’s</a> chemical safety office.</p><p>If the nominee, Douglas Troutman, is confirmed, the top four toxics office positions at the EPA will be held by former chemical industry lobbyists, raising new fears about the health and safety of the American public, consumers and workers, campaigners say.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/18/senate-epa-confirmation-douglas-troutman-lobbyist\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘There were stoats in kitchen cupboards’: AI deployed to help save Orkney’s birds",
      "link": "https://www.theguardian.com/environment/2025/oct/18/there-were-stoats-in-kitchen-cupboards-ai-deployed-to-help-save-orkneys-birds",
      "pub_time_taipei": "2025-10-18T20:00:44+08:00",
      "summary": "<p>Stoats have been an existential threat to Orkney’s rare birds but technology is helping to eradicate them</p><p>At first, the stoat looks like a faint smudge in the distance. But, as it jumps closer, its sleek body is identified by a heat-detecting camera and, with it, an alert goes out to Orkney’s stoat hunters.</p><p>Aided by an artificial intelligence programme trained to detect a stoat’s sinuous shape and movement, trapping teams are dispatched with the explicit aim of finding and killing it. It is the most sophisticated technology deployed in one of the world’s largest mammal eradication projects, which has the aim of detecting the few stoats left on Orkney.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/18/there-were-stoats-in-kitchen-cupboards-ai-deployed-to-help-save-orkneys-birds\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas took 251 hostages from Israel into Gaza. Where are they?",
      "link": "https://www.washingtonpost.com/world/interactive/hamas-hostages-israel-war-gaza/",
      "pub_time_taipei": "2025-10-18T19:57:33+08:00",
      "summary": "We’re tracking what happened to the hostages taken by Hamas on Oct. 7, 2023, from Israel."
    },
    {
      "source": "衛報",
      "title": "World’s landscapes may soon be ‘devoid of wild animals’, says nature photographer",
      "link": "https://www.theguardian.com/environment/2025/oct/18/worlds-landscapes-may-soon-be-devoid-of-wild-animals-says-nature-photographer",
      "pub_time_taipei": "2025-10-18T19:54:18+08:00",
      "summary": "<p>Margot Raggett, whose latest compilation shows animals scrubbed from natural habitats, calls for rethink on UK accelerated housebuilding</p><p>Margot Raggett has spent the past decade raising money for conservation efforts around the world but, right now, she feels nervous about the future. “It does feel like we’ve taken a backward step,” she said.</p><p>The wildlife photographer has raised £1.2m for the cause in the past 10 years through her Remembering Wildlife series, an annual, not-for-profit picture book featuring images of animals from the world’s top nature photographers. The first edition was published in 2015, when the Paris climate agreement was being drafted but, in the years since, efforts to tackle the climate crisis have been rolled back.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/18/worlds-landscapes-may-soon-be-devoid-of-wild-animals-says-nature-photographer\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Egypt expected to lead global stabilisation force in Gaza, say diplomats",
      "link": "https://www.theguardian.com/world/2025/oct/18/egypt-expected-to-lead-global-stabilisation-force-in-gaza-say-diplomats",
      "pub_time_taipei": "2025-10-18T19:00:44+08:00",
      "summary": "<p>Decommissioning Hamas weapons seen as major stumbling block, with British diplomats advising on process</p><p>A European and US-backed UN security council motion to give a planned international stabilisation force robust powers to control security inside Gaza is being prepared, with the strong expectation that Egypt will lead it, diplomats have said.</p><p>The US is pressing for the force to have a UN mandate without being a fully fledged UN peacekeeping force and will operate with the kind of powers given to international troops operating in Haiti to combat armed gangs.</p> <a href=\"https://www.theguardian.com/world/2025/oct/18/egypt-expected-to-lead-global-stabilisation-force-in-gaza-say-diplomats\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Man seeking asylum in Canada trapped at US Ice facility after he says he crossed border by mistake",
      "link": "https://www.theguardian.com/world/2025/oct/18/refugee-asylum-canada-ice-facility-border",
      "pub_time_taipei": "2025-10-18T19:00:43+08:00",
      "summary": "<p>Canada isn’t helping to repatriate refugee applicant Mahin Shahriar, a 28-year-old Bangladeshi man, his lawyer says</p><p>A refugee applicant living in <a href=\"https://www.theguardian.com/world/canada\">Canada</a> is trapped at a US immigration detention facility after he says he mistakenly crossed the border, but his lawyer says Canada isn’t helping to bring him back.</p><p>Mahin Shahriar, 28, who came to Canada from Bangladesh in 2019, told the Canadian Press he accepted an invitation from a “friend” to visit a property near Montreal, which he now suspects was part of a broader human trafficking operation.</p> <a href=\"https://www.theguardian.com/world/2025/oct/18/refugee-asylum-canada-ice-facility-border\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Iran announces official end to 10-year-old nuclear agreement",
      "link": "https://www.theguardian.com/world/2025/oct/18/iran-announces-official-end-to-10-year-old-nuclear-agreement",
      "pub_time_taipei": "2025-10-18T18:23:17+08:00",
      "summary": "<p>Tehran terminates 2015 deal under which sanctions were lifted in return for curbs on country’s nuclear programme</p><p>An international deal with Iran designed to keep the world safe from the spread of atomic weapons has officially ended, with Tehran announcing the termination of the decade-old agreement.</p><p>Iran said on Saturday that it was no longer bound by the 2015 agreement, <a href=\"https://www.theguardian.com/world/2015/jul/14/iran-nuclear-programme-world-powers-historic-deal-lift-sanctions\">officially known as the Joint Comprehensive Plan of Action (JCPOA)</a>, under which international sanctions were lifted in exchange for limitations on Tehran’s nuclear programme.</p> <a href=\"https://www.theguardian.com/world/2025/oct/18/iran-announces-official-end-to-10-year-old-nuclear-agreement\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "French customs reject British shellfish shipments after UK ‘reset’ deal with EU",
      "link": "https://www.theguardian.com/business/2025/oct/18/french-customs-reject-british-shellfish-shipments-after-uk-reset-deal-with-eu",
      "pub_time_taipei": "2025-10-18T18:00:42+08:00",
      "summary": "<p>One of the largest mussel exporters in Britain lose £150,000 after three lorries were prevented from entering the EU </p><p>One of Britain’s largest mussel exporters has suffered a £150,000 loss, after three of its shipments to the EU were rejected in recent weeks by French customs.</p><p>Family-run business Offshore Shellfish, based in Devon, has continued exporting blue mussels to its European customers since Brexit, despite the <a href=\"https://www.theguardian.com/business/2021/feb/02/eu-rules-on-some-types-of-shellfish-leave-uk-fishermen-devastated\">administrative burden</a> and onerous paperwork requirements.</p> <a href=\"https://www.theguardian.com/business/2025/oct/18/french-customs-reject-british-shellfish-shipments-after-uk-reset-deal-with-eu\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "With a phone call, Putin appears to change Trump’s mind on Ukraine. Again.",
      "link": "https://www.washingtonpost.com/world/2025/10/18/russia-putin-trump-ukraine-phone/",
      "pub_time_taipei": "2025-10-18T17:34:20+08:00",
      "summary": "It was the latest swing in Trump’s position on the war that often shifts following contact with Putin, who has shown skill in persuading the U.S. president."
    },
    {
      "source": "華盛頓郵報",
      "title": "Want to quit the U.S.A? A guide for renouncing citizenship",
      "link": "https://www.washingtonpost.com/world/2025/10/18/want-quit-usa-how-to-guide-renouncing-citizenship/",
      "pub_time_taipei": "2025-10-18T17:03:12+08:00",
      "summary": "Here are some key things to know about splitting up with the United States."
    },
    {
      "source": "華盛頓郵報",
      "title": "Not so proud to be American — ‘fed up’ expats renounce citizenship",
      "link": "https://www.washingtonpost.com/world/2025/10/18/renounce-us-citizenship-politics-expats/",
      "pub_time_taipei": "2025-10-18T17:01:21+08:00",
      "summary": "Each year, 5,000 to 6,000 Americans renounce U.S. citizenship mostly for tax-related and logistical reasons but politics is now playing a more central role, lawyers say."
    },
    {
      "source": "華盛頓郵報",
      "title": "Palestinians freed from Israeli detention met with joy and tragedy",
      "link": "https://www.washingtonpost.com/world/2025/10/18/palestinian-gaza-detainees-released/",
      "pub_time_taipei": "2025-10-18T17:00:50+08:00",
      "summary": "Gaza detainees, who often tell of harsh conditions while held by Israel, are returning home to discover tremendous losses suffered by their families."
    },
    {
      "source": "衛報",
      "title": "Labour’s housing hypocrisy: councils serve almost 200 families with no-fault eviction notices",
      "link": "https://www.theguardian.com/society/2025/oct/18/labours-housing-hypocrisy-councils-serve-almost-200-families-with-no-fault-eviction-notices",
      "pub_time_taipei": "2025-10-18T17:00:42+08:00",
      "summary": "<p>Exclusive: firms run by five of the party’s councils have used legal loophole to serve section 21 notices</p><p>Labour-run councils have used a legal loophole to issue almost 200 families with no-fault eviction notices since the party was elected on a promise to ban the practice, a Guardian investigation has found.</p><p><a href=\"https://www.theguardian.com/money/article/2024/sep/06/labour-moves-to-end-no-fault-evictions-within-months\">Scrapping these </a>orders, known as section 21 evictions, was one of Keir Starmer’s main pledges before last July’s general election but, more than a year later, they remain lawful.</p> <a href=\"https://www.theguardian.com/society/2025/oct/18/labours-housing-hypocrisy-councils-serve-almost-200-families-with-no-fault-eviction-notices\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Millions expected across all 50 US states to march in No Kings protests against Trump",
      "link": "https://www.theguardian.com/us-news/2025/oct/18/no-kings-protests-events-states",
      "pub_time_taipei": "2025-10-18T17:00:41+08:00",
      "summary": "<p>Events scheduled in more than 2,700 locations, from small towns to large cities, aligning behind message that the US is sliding into authoritarianism</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/18/anti-trump-no-kings-protests-updates\">‘No Kings’ protest live: updates from around the US</a></p></li></ul><p>Americans across all 50 states will march in protests against the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> on Saturday, aligning behind a message that the country is sliding into authoritarianism and there should be no kings in the US.</p><p>Millions are expected to turn out for the No Kings protests, the second iteration of a coalition that marched in June in one of the <a href=\"https://www.theguardian.com/us-news/2025/jun/19/no-kings-how-many-protesters-attended\">largest days of protest</a> in US history. Events are scheduled for more than 2,700 locations, from small towns to large cities.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/18/no-kings-protests-events-states\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US podcaster who helped convict ‘Queen of the Con’ disappointed at short sentence",
      "link": "https://www.theguardian.com/us-news/2025/oct/18/us-podcaster-queen-of-the-con-sentence",
      "pub_time_taipei": "2025-10-18T16:00:40+08:00",
      "summary": "<p>Johnathan Walton, who was a victim of Marianne ‘Mair’ Smyth, had helped UK authorities track her down</p><p>A US podcaster and author who helped UK authorities <a href=\"https://www.theguardian.com/uk-news/2025/sep/05/queen-of-the-con-marianne-mair-smyth-guilty-fraud-northern-ireland\">convict</a> a woman derisively known as the “Queen of the Con” of defrauding a group of Northern Irish mortgage advice customers has expressed disappointment in her being sentenced on Friday to only four years in prison.</p><p>“She scams or tries to scam everyone she meets, and she will never change,” Johnathan Walton said in a statement after Marianne “Mair” Smyth’s sentencing closed the books on a transatlantic case against her.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/18/us-podcaster-queen-of-the-con-sentence\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Pakistan confronts a new reality: It may have lost the Taliban",
      "link": "https://www.washingtonpost.com/world/2025/10/18/afghanistan-pakistan-border-clashes-taliban/",
      "pub_time_taipei": "2025-10-18T16:00:25+08:00",
      "summary": "The now-uneasy neighbors exchanged fire again on Friday, Taliban-controlled media reported, days after agreeing to a ceasefire and talks this weekend in Qatar."
    },
    {
      "source": "衛報",
      "title": "Israel identifies body of 10th hostage recovered from Gaza",
      "link": "https://www.theguardian.com/world/2025/oct/18/israel-hostage-body-gaza-red-cross-handover",
      "pub_time_taipei": "2025-10-18T15:05:00+08:00",
      "summary": "<p>Remains of Eliyahu ‘Churchill’ Margalit, who was killed on 7 October 2023, identified after being passed to Red Cross by Hamas</p><p>The body of a 75-year-old hostage handed over by Hamas to the Red Cross in Gaza late on Friday has been identified by Israel’s military as Eliyahu “Churchill” Margalit.</p><p>The Israel Defense Forces (IDF) said Margalit was killed at Nir Oz kibbutz on 7 October 2023 during Hamas’s assault on southern Israel and his body taken into the Gaza Strip. His death was confirmed in December 2023. His daughter, Nili Margalit, was also kidnapped and <a href=\"https://www.theguardian.com/world/2023/nov/27/who-are-the-israeli-hostages-freed-by-hamas-during-gaza-truce\">returned as part of a deal in November 2023.</a></p> <a href=\"https://www.theguardian.com/world/2025/oct/18/israel-hostage-body-gaza-red-cross-handover\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chen Ning Yang, Chinese-American physicist and Nobel laureate, dies at 103",
      "link": "https://www.theguardian.com/world/2025/oct/18/chen-ning-yang-chinese-american-physicist-and-nobel-laureate-dies-at-103",
      "pub_time_taipei": "2025-10-18T14:57:11+08:00",
      "summary": "<p>Renowned 1957 Nobel prize winner worked on statistical mechanics and symmetry principles in elementary particle physics</p><p>Chen Ning Yang, one of the world’s most renowned physicists and a Nobel prize winner, died on Saturday in Beijing at the age of 103 after an illness, state media outlet Xinhua has reported.</p><p>Born in eastern China’s Hefei in Anhui province in 1922, Yang was a Chinese-American physicist who worked on statistical mechanics and symmetry principles in elementary particle physics.</p> <a href=\"https://www.theguardian.com/world/2025/oct/18/chen-ning-yang-chinese-american-physicist-and-nobel-laureate-dies-at-103\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chemical linked to low sperm count, obesity and cancer found in dummies, tests find",
      "link": "https://www.theguardian.com/society/2025/oct/18/chemical-linked-impaired-sexual-development-found-dummies-tests",
      "pub_time_taipei": "2025-10-18T14:00:38+08:00",
      "summary": "<p>BPA, a synthetic chemical used in production of plastics, found in baby products made by three big European brands</p><p>A chemical linked to impaired sexual development, obesity and cancer has been found in baby dummies manufactured by three big European brands.</p><p>Dummies made by the Dutch multinational Philips, the Swiss oral health specialists Curaprox and the French toy brand Sophie la Girafe were found to contain bisphenol A (BPA), according to laboratory testing by dTest, a Czech consumer organisation. Philips said they had carried out subsequent testing and found no BPA, while Sophie la Girafe said the amount found was insignificant.</p> <a href=\"https://www.theguardian.com/society/2025/oct/18/chemical-linked-impaired-sexual-development-found-dummies-tests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "German far right setting agenda as opponents amplify its ideas, study finds",
      "link": "https://www.theguardian.com/world/2025/oct/18/german-far-right-setting-agenda-as-opponents-amplify-its-ideas-study-finds",
      "pub_time_taipei": "2025-10-18T13:00:40+08:00",
      "summary": "<p>Normalisation of far-right stances likely to affect success of such parties at ballot boxes across Europe, say researchers</p><p>Mainstream parties are increasingly allowing the far right to set the agenda, researchers in Germany have found, describing it as a shortcoming that had unwittingly helped the far right by legitimising their ideas and disseminating them more widely.</p><p>The findings, <a href=\"https://www.cambridge.org/core/journals/european-journal-of-political-research/article/farright-agenda-setting-how-the-far-right-influences-the-political-mainstream/D247EC90E46089A9EDA3223B435BC149\">published</a> in the European Journal of Political Research, were based on an automated text analysis of 520,408 articles from six German newspapers over the span of more than two decades.</p> <a href=\"https://www.theguardian.com/world/2025/oct/18/german-far-right-setting-agenda-as-opponents-amplify-its-ideas-study-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump says he has commuted sentence of George Santos in federal fraud case",
      "link": "https://www.theguardian.com/us-news/2025/oct/17/trump-commuted-sentence-george-santos",
      "pub_time_taipei": "2025-10-18T12:42:24+08:00",
      "summary": "<p>Former Republican US representative walks free after being sentenced in April to more than seven years in prison for deceiving donors and stealing identities of 11 people</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> announced on Friday he had commuted the sentence of George Santos, the disgraced former New York representative and serial fabulist who had been sentenced to more than seven years in prison after a short-lived political career marked by outlandish fabrications and fraudulent scheming.</p><p>Santos left the Federal Correctional Institution Fairton in New Jersey just hours later and was “on his way home”, his attorney Joseph Murray told Agence France-Presse by phone late on Friday.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/17/trump-commuted-sentence-george-santos\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "AI chatbots are hurting children, Australian education minister warns as anti-bullying plan announced",
      "link": "https://www.theguardian.com/technology/2025/oct/18/ai-chatbots-are-hurting-children-australian-education-minister-warns-as-anti-bullying-plan-announced",
      "pub_time_taipei": "2025-10-18T11:54:42+08:00",
      "summary": "<p>Jason Clare says artificial intelligence is ‘supercharging bullying’ to a ‘terrifying’ extent</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A disturbing new trend of AI chatbots bullying children and even encouraging them to take their own lives has the Australian government very concerned.</p><p>Speaking to media on Saturday, the federal education minister, Jason Clare, said artificial intelligence was “supercharging” bullying.</p> <a href=\"https://www.theguardian.com/technology/2025/oct/18/ai-chatbots-are-hurting-children-australian-education-minister-warns-as-anti-bullying-plan-announced\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Barnaby Joyce announcement to quit Nationals heightens speculation about One Nation move",
      "link": "https://www.theguardian.com/australia-news/2025/oct/18/barnaby-joyce-decision-to-leave-nationals-heightens-speculation-about-one-nation-move",
      "pub_time_taipei": "2025-10-18T10:29:07+08:00",
      "summary": "<p>MP tells supporters he won’t run for his seat of New England at next election and is ‘free to now consider all options’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Barnaby Joyce has told supporters he intends to quit the Nationals, won’t run for his seat of New England at the next election, and is “free to now consider all options” – heightening speculation he may switch parties in parliament.</p><p>It comes one day after Coalition figures said the former Nationals leader was <a href=\"https://www.theguardian.com/australia-news/2025/oct/17/barnaby-joyce-actively-considering-defection-to-one-nation-say-coalition-sources\">actively considering defecting to One Nation</a>.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/18/barnaby-joyce-decision-to-leave-nationals-heightens-speculation-about-one-nation-move\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least 15 detained after protesters and police clash outside Chicago Ice center",
      "link": "https://www.theguardian.com/us-news/2025/oct/17/ice-chicago-protesters-arrests-broadview-facility",
      "pub_time_taipei": "2025-10-18T10:07:31+08:00",
      "summary": "<p>Officers reportedly tackled and dragged several people after authorities told demonstrators to stay in ‘protest zones’</p><p>At least 15 people were <a href=\"https://wgntv.com/news/operation-midway-blitz/at-least-15-detained-as-protesters-demonstrate-outside-broadview-ice-facility-again/\">taken</a> into custody outside the Broadview Ice detention center in the Chicago area after heated confrontations between Illinois state police and protesters on Friday.</p><p>Authorities had instructed demonstrators to remain in designated “protest zones”, but tensions escalated when officers moved to clear the roadway.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/17/ice-chicago-protesters-arrests-broadview-facility\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "October heat records could tumble in multiple states as hot weather sweeps east through central Australia",
      "link": "https://www.theguardian.com/australia-news/2025/oct/18/october-heat-weather-records-could-tumble-multiple-states-bureau-meteorology-forecast",
      "pub_time_taipei": "2025-10-18T09:19:40+08:00",
      "summary": "<p>Unusually high temperatures in the low to mid 40s to hit parts of NSW, Queensland and SA, the Bureau of Meteorology predicts</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Multiple October weather records could tumble over the weekend as temperatures are expected to rise up to 15C above average across parts of Australia.</p><p>Parts of South Australia, Queensland, New South Wales and the ACT are forecast to experience soaring heat, while parts of the east coast will be hit by severe thunderstorms on Saturday, according to the Bureau of Meteorology.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/18/october-heat-weather-records-could-tumble-multiple-states-bureau-meteorology-forecast\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. military detains survivors of latest boat strike near Venezuela",
      "link": "https://www.washingtonpost.com/national-security/2025/10/17/boat-strike-survivors-detained-venezuela-caribbean/",
      "pub_time_taipei": "2025-10-18T07:37:23+08:00",
      "summary": "The operation is the sixth known attack on alleged drug smugglers in the Caribbean, and the first known to have left some people alive."
    },
    {
      "source": "衛報",
      "title": "Trump claims Maduro willing to give ‘everything’ to ease US tensions",
      "link": "https://www.theguardian.com/world/2025/oct/17/trump-maduro-venezuela",
      "pub_time_taipei": "2025-10-18T04:12:43+08:00",
      "summary": "<p>President says Venezuelan counterpart ‘doesn’t want to fuck around with the United States’</p><p>Donald Trump used an expletive to threaten the Venezuelan leader, <a href=\"https://www.theguardian.com/world/nicolas-maduro\">Nicolás Maduro</a>, on Friday, claiming that the leftist autocrat had offered major concessions to appease the US.</p><p>The US president was speaking to reporters at the White House on Friday <a href=\"https://www.theguardian.com/world/2025/oct/17/trump-putin-phone-call-sinks-kyiv-ukraine-hopes-for-us-tomahawk-missiles\">during a meeting</a> with the Ukrainian president, Volodymyr Zelenskyy.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/trump-maduro-venezuela\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump hesitant about giving Tomahawks to Ukraine, saying ‘hopefully they won’t need it’ – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/17/viktor-orban-vladimir-putin-volodymyr-zelenskyy-donald-trump-europe-latest-news-updates-russia-ukraine-war",
      "pub_time_taipei": "2025-10-18T03:58:33+08:00",
      "summary": "<p>Ukrainian president repeats call for weapons but US president insists they’re ‘not easy for us to give you’ and says ‘Putin wants to end the war’</p><p><strong>‘The key to success is in the sky’: the Ukrainian defenders struggling to stem Russia’s air assault</strong></p><p>First came the sound of drones. Then a boom that rattled windows. Shortly after that, two columns of black smoke rose over the Shebelinka gas processing plant in Ukraine’s Kharkiv region. Towering flames threatened storage tanks.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/17/viktor-orban-vladimir-putin-volodymyr-zelenskyy-donald-trump-europe-latest-news-updates-russia-ukraine-war\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Burqa ban bill approved by Portugal’s parliament seen as targeting Muslim women",
      "link": "https://www.theguardian.com/world/2025/oct/17/burqa-ban-bill-approved-by-portugals-parliament-seen-as-targeting-muslim-women",
      "pub_time_taipei": "2025-10-18T03:18:18+08:00",
      "summary": "<p>If signed into law, the bill proposed by far-right party would follow other European countries in banning face veils</p><p><a href=\"https://www.theguardian.com/world/portugal\">Portugal</a>’s parliament has approved a bill banning face veils worn for “gender or religious” reasons in public, in a move seen as targeting Muslim women who wear face coverings.</p><p>The measure was proposed by <a href=\"https://www.theguardian.com/world/2025/oct/13/portugal-far-right-chega-falls-well-short-local-elections\">the far-right Chega party</a> and would prohibit coverings such as burqas (a full-body garment that covers a woman from head to foot) and niqabs (the full-face Islamic veil with space around the eyes) from being worn in most public places. Face veils would still be allowed in airplanes, diplomatic premises and places of worship.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/burqa-ban-bill-approved-by-portugals-parliament-seen-as-targeting-muslim-women\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump downplays hopes he will supply Ukraine with US missiles after meeting with Zelenskyy",
      "link": "https://www.theguardian.com/world/2025/oct/17/trump-putin-phone-call-sinks-kyiv-ukraine-hopes-for-us-tomahawk-missiles",
      "pub_time_taipei": "2025-10-18T03:08:55+08:00",
      "summary": "<p>US president seemed more intent on brokering a peace deal after surprise phone call with Putin earlier in day</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> seemed more intent on brokering a peace deal than he was to supply Ukraine with Tomahawk cruise missiles during a White House meeting with <a href=\"https://www.theguardian.com/world/volodymyr-zelenskiy\">Volodymyr Zelenskyy</a>, saying that the US may need them for a future conflict.</p><p>While Trump did not rule out providing the long-range missiles Zelenskyy seeks, Trump appeared cool to the prospect as he looked ahead to a meeting with <a href=\"https://www.theguardian.com/world/vladimir-putin\">Vladimir Putin</a> in Hungary in the coming weeks.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/trump-putin-phone-call-sinks-kyiv-ukraine-hopes-for-us-tomahawk-missiles\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US has seized survivors of attack on alleged narco-sub in Caribbean",
      "link": "https://www.theguardian.com/us-news/2025/oct/17/survivors-caribbean-boat-strike-us-military-custody",
      "pub_time_taipei": "2025-10-18T02:47:34+08:00",
      "summary": "<p>In the six attacks on similar vessels launched by Trump, this is the first where any survivors have been reported</p><p>The US has seized <a href=\"https://www.theguardian.com/us-news/2025/oct/16/survivors-attack-drug-boat-caribbean\">survivors of a military strike on a suspected drug-carrying vessel in the Caribbean</a>, the first since <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> began launching deadly attacks in the region last month, according to officials in Washington.</p><p>Trump later confirmed the attack, telling reporters that the targeted vessel was a narco-submarine.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/17/survivors-caribbean-boat-strike-us-military-custody\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Would Tomahawk cruise missiles be a game changer for Ukraine?",
      "link": "https://www.washingtonpost.com/national-security/2025/10/17/ukraine-tomahawk-russia-typhon-launcher/",
      "pub_time_taipei": "2025-10-18T02:43:27+08:00",
      "summary": "President Donald Trump says he is considering sending the long-range weapon to Ukraine for strikes deep inside Russian territory."
    },
    {
      "source": "華盛頓郵報",
      "title": "Prince Andrew stripped of titles over sex allegations tied to Epstein",
      "link": "https://www.washingtonpost.com/world/2025/10/17/prince-andrew-relinquish-royal-titles/",
      "pub_time_taipei": "2025-10-18T02:25:19+08:00",
      "summary": "In a new book, one of Epstein’s victims wrote a lurid account of what she said was sexual abuse by Prince Andrew, a younger brother of King Charles III."
    },
    {
      "source": "衛報",
      "title": "Bank shares lead global market fall amid jitters over US private credit",
      "link": "https://www.theguardian.com/business/2025/oct/17/global-stock-markets-fall-and-gold-hits-record-high-amid-jitters-over-us-banks",
      "pub_time_taipei": "2025-10-18T00:24:22+08:00",
      "summary": "<p>Signs of credit stress send markets in Europe and Asia down, while investors turn to safe haven assets</p><p>European stock markets fell on Friday and gold hit a record high after two US regional banks said they had been exposed to <a href=\"https://www.theguardian.com/business/2025/oct/16/us-regional-bank-stocks-fall\">millions of dollars of bad loans and alleged fraud</a>.</p><p>Signs of credit stress rattled markets across Europe and Asia. In London the FTSE 100 fell 0.9%, Germany’s Dax fell 1.8%, Italy’s FTSE Mib fell 1.5%, the Ibex in Spain was off 0.3% and France’s Cac 40 dropped 0.2%.</p> <a href=\"https://www.theguardian.com/business/2025/oct/17/global-stock-markets-fall-and-gold-hits-record-high-amid-jitters-over-us-banks\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Trump is killing poor people’: Caribbean village mourns victim of US strike",
      "link": "https://www.theguardian.com/world/2025/oct/17/trump-caribbean-venezuela-trinidad-boat-strikes",
      "pub_time_taipei": "2025-10-17T23:46:35+08:00",
      "summary": "<p>Relatives of Trinidadian man believed killed in US military strike on alleged drug boat say he was denied due process</p><p>Relatives of two men from Trinidad believed to have been killed in a <a href=\"https://www.theguardian.com/us-news/us-military\">US military</a> strike on a boat in the <a href=\"https://www.theguardian.com/world/caribbean\">Caribbean</a> have accused <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> of “killing poor people” without due process and are demanding justice.</p><p>Chad “Charpo” Joseph and Rishi Samaroo, from the fishing village of Las Cuevas in northern Trinidad, are thought to be among <a href=\"https://www.theguardian.com/world/2025/oct/16/airstrike-venezuela-trinidad-us-death-investigation\">six people killed in a US airstrike </a>on a boat allegedly transporting drugs from <a href=\"https://www.theguardian.com/world/venezuela\">Venezuela</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/trump-caribbean-venezuela-trinidad-boat-strikes\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Oxford debate club to vote on ousting leader for LOL over Charlie Kirk killing",
      "link": "https://www.washingtonpost.com/world/2025/10/17/oxford-debate-union-charlie-kirk/",
      "pub_time_taipei": "2025-10-17T22:47:58+08:00",
      "summary": "At the Oxford Union in May, Charlie Kirk said “you should be allowed to say outrageous things,” but a student who met him then may be ousted over posts about Kirk’s death."
    },
    {
      "source": "衛報",
      "title": "Rowe and Payne: finish line in sight for aptly named British duo rowing nonstop from Peru to Australia",
      "link": "https://www.theguardian.com/sport/2025/oct/18/rowe-and-payne-finish-line-in-sight-for-aptly-named-british-duo-rowing-nonstop-from-peru-to-australia",
      "pub_time_taipei": "2025-10-17T22:00:23+08:00",
      "summary": "<p>After about 8,300 nautical miles Jess Rowe and Miriam Payne can’t wait to share their ‘tales of the high seas’ when they land in Cairns, Queensland</p><p>Six months in a rowboat in the South Pacific Ocean might sound like a nightmare.</p><p>But for British women Jess Rowe, 28, and Miriam Payne, 25, the blisters and salt sores are all just part of the adventure of a lifetime, as they <a href=\"https://www.theguardian.com/uk-news/2025/aug/24/we-keep-plodding-along-uk-pair-two-thirds-of-the-way-through-8000-mile-charity-row\">row from South America to Australia</a> in their 9 metre vessel, Velocity.</p> <a href=\"https://www.theguardian.com/sport/2025/oct/18/rowe-and-payne-finish-line-in-sight-for-aptly-named-british-duo-rowing-nonstop-from-peru-to-australia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Queensland anti-renewables group cited nonexistent papers in inquiry submissions using AI, publisher says",
      "link": "https://www.theguardian.com/australia-news/2025/oct/18/queensland-anti-renewables-group-cited-nonexistent-papers-in-inquiry-submissions-using-ai-publisher-says",
      "pub_time_taipei": "2025-10-17T22:00:22+08:00",
      "summary": "<p><strong>Exclusive</strong>: Rainforest Reserves Australia has published submissions naming nonexistent government authorities and a nonexistent windfarm</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A conservation charity known for its anti-renewables stance has made submissions to federal and state inquiries that name non-existent government authorities and a nonexistent windfarm, and cite scientific articles that the supposed publisher says don’t exist, a Guardian Australia investigation has found.</p><p>Two US-based academics and experts said Rainforest Reserves Australia’s (RRA) claims in submissions about their work were “100% misleading” and “absurd”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/18/queensland-anti-renewables-group-cited-nonexistent-papers-in-inquiry-submissions-using-ai-publisher-says\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump plans Putin summit on Ukraine, raising stakes for Zelensky meeting",
      "link": "https://www.washingtonpost.com/politics/2025/10/16/trump-buoyed-by-gaza-deal-plans-putin-summit-ukraine-peace/",
      "pub_time_taipei": "2025-10-17T21:05:55+08:00",
      "summary": "The call with Putin came right before his meeting with Zelensky where the Ukrainian leader was hoping to obtain new long-range weaponry to use against Russia."
    },
    {
      "source": "華盛頓郵報",
      "title": "Baek Sehee, whose therapy memoir resonated around the world, dies at 35",
      "link": "https://www.washingtonpost.com/obituaries/2025/10/17/baek-sehee-dead-korean-author/",
      "pub_time_taipei": "2025-10-17T20:49:35+08:00",
      "summary": "Her book “I Want to Die but I Want to Eat Tteokbokki” chronicled her experience with therapy and depression, along with her love of a Korean comfort food."
    },
    {
      "source": "衛報",
      "title": "Infectious diseases in Gaza ‘spiralling out of control’, says WHO – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/17/israel-gaza-ceasefire-hostages-hamas-benjamin-netanyahu-middle-east-latest-news-updates",
      "pub_time_taipei": "2025-10-17T20:44:01+08:00",
      "summary": "<p>UN official says: ‘Whether meningitis … diarrhoea, respiratory illnesses, we’re talking about a mammoth amount of work’. This live blog is closed</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/17/gaza-aid-still-critically-scarce-say-agencies-as-israel-delays-convoys\">Gaza aid still critically scarce, say agencies</a></p></li></ul><p>We’ve got a bit more from the UN’s World Food Programme on the situation in Gaza.</p><p>WFP spokeswoman Abeer Etefa told a media briefing in Geneva that, from Saturday until Wednesday, around 230 trucks with 2,800 tonnes of food supplies crossed into Gaza.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/17/israel-gaza-ceasefire-hostages-hamas-benjamin-netanyahu-middle-east-latest-news-updates\">Continue reading...</a>"
    }
  ]
}