{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-22T20:40:09.639857+08:00",
  "window_end_taipei": "2025-09-23T20:40:09.639857+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Secret Service says it dismantled ‘imminent telecommunications threat’ near UN general assembly ahead of Trump speech – live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
      "pub_time_taipei": "2025-09-23T20:28:48+08:00",
      "summary": "<p>US authorities say hidden system included over 100,000 SIM cards and 300 servers in the New York area with the power to interfere with emergency communication services</p><p>Following the news that the Secret Service intercepted a threat to distrupt cellular networks in New York, in just over an hour <strong>Donald Trump</strong> will addresses the United Nations general assembly in the city.</p><p>We’ll bring you the latest lines, and be keeping an ear out for a number of topics: the chorus of allies across the world formally recognizing Palestinian statehood, the call for more severe sanctions on Russia as the war in Ukraine rages on, and the worsening humanitarian crisis in Gaza.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Don’t pay any attention to what Trump says about medicine’, Wes Streeting tells Britons – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates",
      "pub_time_taipei": "2025-09-23T20:21:24+08:00",
      "summary": "<p>Medical experts concerned after US president warned pregnant women to avoid taking Tylenol in move contradicted by research</p><p><strong>Ed Davey</strong>, the Lib Dem leader, criticised Donald Trump for “the cruelty and stupidity” of his approach to medical research in comments distributed yesterday before Trump made bogus claims about autism in the Oval Office. (See <a href=\"https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates?page=with%3Ablock-68d2416c8f0810a966324c93#block-68d2416c8f0810a966324c93\">8.41am</a>.) Now Davey has <a href=\"https://x.com/EdwardJDavey/status/1970416196353958282\">described </a>the president’s latest comments as “dangerous nonsense”.</p><p>First Trump slashed funding for vaccines research now he’s peddling dangerous nonsense about paracetamol.</p><p>The UK should take on Trump’s anti-science agenda and open our doors to US researchers.</p><p>The US government is ignoring science and deliberately spreading misinformation. It will get people killed. And we have a Reform party that seems quite keen to import their health advice from these people.</p><p>Boldest of the lot are the proposals on migration, which, if taken up even in part, would represent the biggest paradigm shift of all. Reform UK has set the agenda with proposals to deny benefits to even legal migrants. By the standards of the centre-left, Labour Together’s suggestion is just as radical.</p><p>Rather than leave Isak, an Eritrean with post-traumatic stress disorder, languishing in an <a href=\"https://www.thetimes.com/article/police-officer-punched-asylum-protests-london-3c3v7hnzk\">asylum hotel</a>, their paper proposes he be granted time-limited refugee status for six months. He signs a contract that obliges him to learn English, find work and private accommodation; his access to any income support via universal credit is strictly conditional on him fulfilling its terms. Of all the changes suggested, this one – given that asylum seekers cannot currently work legally – would have the most profound consequences for British politics and the economy.</p><p>Why an asylum-seeker is drawn to Britain over, say, France is not obvious. A 2016 report from Warwick University, based on findings from 29 separate studies into asylum-seeker motives, concluded that social networks and shared languages were crucial. The report could not find a single study showing a significant correlation between work rights and destination choice. If asylum-seekers in Calais were motivated by working rights those who had yet to apply would stay in France, where they could work sooner.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Wild bird numbers continue to fall in UK with some species in ‘dramatic freefall’",
      "link": "https://www.theguardian.com/environment/2025/sep/23/wild-bird-numbers-continue-to-fall-in-uk-with-some-species-in-dramatic-freefall",
      "pub_time_taipei": "2025-09-23T20:20:12+08:00",
      "summary": "<p>Species index fell by 4% between 2019 and 2024 – although government data shows woodland populations beginning to stabilise</p><p>Wild bird species face an accelerating decline in the UK, new figures show, with some species heading for local extinction.</p><p>Bird numbers have plummeted since the 1970s, and new government data shows that trend continuing; between 2019 and 2024 the species index declined in the UK by 4% and England by 7%.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/23/wild-bird-numbers-continue-to-fall-in-uk-with-some-species-in-dramatic-freefall\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nato ready to ‘defend every inch of allied territory’, says Rutte after Russian incursions – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates",
      "pub_time_taipei": "2025-09-23T20:14:47+08:00",
      "summary": "<p>Nato chief’s address on last week’s violation of Estonian airspace comes amid drone incidents at Copenhagen and Oslo airport</p><p>Meanwhile, <strong>Russia denied that it was connected to the drone flights that forced Copenhagen airport to close its airspace for hours overnight</strong>, after Denmark’s prime minister said she could not rule out Russian involvement, AFP reported.</p><p>“We hear <strong>unfounded accusations from there every time.</strong> Perhaps a party that takes a serious, responsible position shouldn’t make such unfounded accusations time and again,” Kremlin spokesman <strong>Dmitry Peskov</strong> told reporters in a daily briefing call.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump to address UN general assembly as Israeli attacks on Gaza City continue – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/sep/23/gaza-israel-palestinian-state-recognition-donald-trump-un-unga-latest-news-live-updates",
      "pub_time_taipei": "2025-09-23T20:14:28+08:00",
      "summary": "<p>US president to address UN general assembly in New York after UK, France, Belgium, Canada, Australia and Portugal recognised a Palestinian state</p><p>The UN investigators cited examples of the scale of the Israeli killings, aid blockages, forced displacement and the destruction of a fertility clinic to back up its genocide finding.</p><p>The 1948 UN Genocide Convention defines genocide as crimes committed “with intent to destroy, in whole or in part, a national, ethnic, racial or religious group, as such”. To count as genocide, at least one of five acts must have occurred.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/23/gaza-israel-palestinian-state-recognition-donald-trump-un-unga-latest-news-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "All Amazon Fresh stores in UK to close",
      "link": "https://www.theguardian.com/technology/2025/sep/23/all-amazon-fresh-stores-in-uk-to-close-whole-foods",
      "pub_time_taipei": "2025-09-23T20:11:50+08:00",
      "summary": "<p>Company confirms plan to shut 19 shops with stronger focus on Whole Foods outlets after concept of stores without tills fails to catch on</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news\">Business live – latest updates</a></p><p></p></li></ul><p>Amazon is preparing to shut down all of its Amazon Fresh stores in the UK, just four years after the US tech company launched its first grocery shop in London.</p><p>The company plans to close all 19 Fresh stores, with plans to convert five of these into Whole Foods Market shops,<a href=\"https://www.theguardian.com/business/2017/jun/18/first-whole-foods-then-whole-industry-amazon-supermarkets\"> the US organic grocery chain that it bought in 2017</a>.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/23/all-amazon-fresh-stores-in-uk-to-close-whole-foods\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Asylum seeker at centre of Essex hotel protests jailed for 12 months",
      "link": "https://www.theguardian.com/uk-news/2025/sep/23/asylum-seeker-at-centre-of-essex-hotel-protests-jailed-for-12-months",
      "pub_time_taipei": "2025-09-23T20:11:16+08:00",
      "summary": "<p>Hadush Gerberslasie Kebatu, 38, was convicted last month of assaulting a 14-year-old girl and a woman</p><p>An asylum seeker staying at a hotel in Essex that became the focus of protests has been jailed for 12 months for the assault of a 14-year-old girl and a woman.</p><p>Hadush Gerberslasie Kebatu, 38, from Ethiopia, who had been living in the Bell hotel in Epping, <a href=\"https://www.theguardian.com/uk-news/2025/sep/04/epping-asylum-hotel-resident-found-guilty-of-sexual-assault\">was found guilty last month</a> of two counts of sexual assault and one of attempted sexual assault, committed days after arriving in the UK on a small boat.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/23/asylum-seeker-at-centre-of-essex-hotel-protests-jailed-for-12-months\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Pay no attention’: global health agencies dismiss false Trump claim on everyday painkillers",
      "link": "https://www.theguardian.com/society/2025/sep/23/global-health-agencies-dismiss-false-trump-claim-everyday-painkillers",
      "pub_time_taipei": "2025-09-23T20:04:58+08:00",
      "summary": "<p>Medical experts and regulators say US president should not be questioning established science</p><p>Global health agencies and regulators have dismissed unscientific advice from Donald Trump that made an unproven link between autism and the use of everyday painkillers and vaccines.</p><p>In a sign of how worried foreign governments are about the US president’s comments, the health secretary of the UK, which is one the US’s closest allies, <a href=\"https://www.theguardian.com/politics/2025/sep/23/wes-streeting-rejects-trump-claim-linking-paracetamol-and-autism\">told the British public</a> they should not “pay any attention whatsoever to what Donald Trump says about medicine”.</p> <a href=\"https://www.theguardian.com/society/2025/sep/23/global-health-agencies-dismiss-false-trump-claim-everyday-painkillers\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Danish PM: airport drone incursion a ‘serious attack’ on critical infrastructure",
      "link": "https://www.theguardian.com/world/2025/sep/23/drone-sightings-cause-disruption-delays-norway-denmark-airports",
      "pub_time_taipei": "2025-09-23T20:00:20+08:00",
      "summary": "<p>Russia denies involvement after Copenhagen and Oslo airports forced to close after drone sightings</p><p>The Danish prime minister has said the country was subjected to the “most serious attack on Danish critical infrastructure to date” after a drone incursion shut Copenhagen airport for several hours.</p><p>Mette Frederiksen said authorities were still investigating who was behind the suspected hybrid attack, but she said she could not rule out Russia.</p> <a href=\"https://www.theguardian.com/world/2025/sep/23/drone-sightings-cause-disruption-delays-norway-denmark-airports\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Drone flights shut airports in Denmark, Norway as anxiety over Russia soars",
      "link": "https://www.washingtonpost.com/world/2025/09/23/drones-denmark-norway-russia-airports/",
      "pub_time_taipei": "2025-09-23T19:29:42+08:00",
      "summary": "Russian breaches of NATO air space have put European military officials and aviation agencies on alert but it was unclear who flew the drones in Denmark and Norway."
    },
    {
      "source": "衛報",
      "title": "‘Fear and hopelessness’: one in four professors in the US south are leaving",
      "link": "https://www.theguardian.com/us-news/2025/sep/23/professors-us-south-leaving",
      "pub_time_taipei": "2025-09-23T19:00:54+08:00",
      "summary": "<p>Survey by American Association of Professors shows nearly quarter of respondents are switching due to states’s politics</p><p>Many professors in the US south, particularly in Florida, South Carolina and Texas, are considering leaving their state because of the impact the political climate is having on education, according to a new survey by the American Association of Professors.</p><p>Of those interviewed in the survey, <a href=\"https://drive.google.com/file/d/1TL9hu1Y-UMfqcqt3Jt95LGRj-rEPj2LP/view\">roughly a quarter</a> of respondents said they applied for a job in higher education in another state since the start of 2023.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/23/professors-us-south-leaving\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ice targeted me for organizing, says farm worker who left US for Mexico",
      "link": "https://www.theguardian.com/us-news/2025/sep/23/ice-deportation-us-mexico-farm-worker",
      "pub_time_taipei": "2025-09-23T18:00:54+08:00",
      "summary": "<p>Alfredo Juarez Zeferino spent a harrowing few months in Ice jail – and, under threat of deportation, chose to leave</p><p>Alfredo “Lelo” Juarez Zeferino spends much of his days outdoors, harvesting bananas and hiking vast, bramble-laden trails. But for more than a quarter of 2025, he barely saw the sun. After being arrested by Immigration and Customs Enforcement (Ice) in March, the farm-worker activist was placed in a detention center in Washington state, where he remained until he <a href=\"https://www.democracynow.org/2025/7/16/headlines/farm_labor_organizer_alfredo_juarez_zeferino_ends_deportation_fight_after_4_months_in_ice_jail\">agreed to voluntarily leave the US</a>.</p><p>“I probably would say five times, in the three months and a half I was in there, they offered me to go outside,” he explained on a Zoom call from his family farm in Guerrero, Mexico, where he has been for over a month.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/23/ice-deportation-us-mexico-farm-worker\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Colombian president: Trump’s boat strikes won’t stop narco traffickers",
      "link": "https://www.washingtonpost.com/world/2025/09/23/colombia-petro-interview-trump/",
      "pub_time_taipei": "2025-09-23T18:00:13+08:00",
      "summary": "In an interview with The Washington Post, Colombia’s Gustavo Petro argued the Trump administration’s boat strikes are “only for television” and amount to “murder.”"
    },
    {
      "source": "衛報",
      "title": "Trump officials announce highly contentious conclusions on autism | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/sep/23/first-thing-trump-officials-highly-contentious-conclusions-autism",
      "pub_time_taipei": "2025-09-23T17:44:18+08:00",
      "summary": "<p>President claims Tylenol increases<strong> </strong>risk when taken by pregnant women, an assertion contradicted by research. Plus, Jimmy Kimmel will return to TV tonight after much-criticized suspension</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>The <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> announced <a href=\"https://www.theguardian.com/us-news/2025/sep/22/trump-administration-autism-causes\">highly contentious conclusions</a> about the causes of autism on Monday, with a push for research purporting to find a possible “cure” for the condition.</p><p>Read more: <strong><a href=\"https://www.theguardian.com/us-news/2025/sep/22/trump-tylenol-autism-women\">Trump rails against Tylenol but autism claims not supported by science</a></strong></p><p>Read more: <strong><a href=\"https://www.theguardian.com/us-news/2025/sep/22/trump-tylenol-experts-autism\">Experts alarmed as Trump pushes unproven link between Tylenol and autism</a></strong></p><p><strong>What has Disney, ABC’s owner, said about the decision?</strong> “Last Wednesday, we made the decision to suspend production on the show to avoid further inflaming a tense situation at an emotional moment for our country,” the company said. “It is a decision we made because we felt some of the comments were ill-timed and thus insensitive. We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday.”</p><p><strong>Why has the decision been reversed?</strong> The Kimmel suspension became a flashpoint in a national debate on free speech. And crucially, unions, rights organizations, first amendment defenders, protesters who took to the streets and a long list of Hollywood celebrities stood by Kimmel.</p><p><strong>What is the latest on Israel’s attack on Gaza?</strong> The diplomatic scramble played out in New York as Israel intensified its assault on Gaza City on Monday, with reports of 37 Palestinians killed across the territory, including 30 in Gaza City. Israel launched an offensive in the city last week, ignoring international humanitarian concerns. More than 65,000 people have been killed in the Israeli military actions, according to Gaza health officials.</p><p><strong>What happens next?</strong> Trump is expected to deliver an aggressive speech decrying “globalist institutions” today, which he will claim “have significantly decayed the world order”, a White House spokesperson said in a briefing.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/23/first-thing-trump-officials-highly-contentious-conclusions-autism\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "How DNA on a glass of beer at airport led to capture of serial Australian rapist, the Night Stalker",
      "link": "https://www.theguardian.com/australia-news/2025/sep/23/sydney-night-stalker-rapist-pleads-guilty-13-charges-over-1990s-attacks-against-women-ntwnfb",
      "pub_time_taipei": "2025-09-23T17:10:23+08:00",
      "summary": "<p>Breakthroughs in forensic technology resulted in Glenn Gary Cameron’s arrest more than three decades after he terrorised women in Sydney</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>More than three decades ago the New South Wales police announced it had formed a special team to catch a man, later dubbed the “Night Stalker” or the “Moore Park rapist”, who terrorised women across Sydney in the early 90s.</p><p>At that time, a poster with a sketched image of the man, based on one of his victim’s recollections, was released. Below the image it said: “Do you know this person? Serial rapist sought over possible seven attacks.”</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/23/sydney-night-stalker-rapist-pleads-guilty-13-charges-over-1990s-attacks-against-women-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "India’s richest man buys $33 billion in Russian oil — risking Trump’s ire",
      "link": "https://www.washingtonpost.com/world/2025/09/23/india-trump-ambani-reliance-russia-oil/",
      "pub_time_taipei": "2025-09-23T17:00:47+08:00",
      "summary": "As Trump punishes India for purchasing Russian oil, billionaire Mukesh Ambani’s Reliance Industries finds itself at the center of a diplomatic firestorm."
    },
    {
      "source": "華盛頓郵報",
      "title": "Syria pursuing security deal with Israel to defuse heightened tensions",
      "link": "https://www.washingtonpost.com/world/2025/09/23/syria-israel-sharaa-security-agreement/",
      "pub_time_taipei": "2025-09-23T17:00:47+08:00",
      "summary": "Amid U.S. mediation, President Sharaa is pushing for Israel to withdraw from Syrian territory occupied in the past year, but some worry he will concede too much."
    },
    {
      "source": "衛報",
      "title": "Pennsylvania official faces threats over post she says was misconstrued as Charlie Kirk killing celebration",
      "link": "https://www.theguardian.com/us-news/2025/sep/23/pennsylvania-school-board-official-post-charlie-kirk-killing",
      "pub_time_taipei": "2025-09-23T17:00:20+08:00",
      "summary": "<p>Misty Hunt, a local school board member, said her ‘one down, hundreds to go’ post was about gardening, not Kirk</p><p>A member of a <a href=\"https://www.theguardian.com/us-news/pennsylvania\">Pennsylvania</a> school board says she is stepping back from her duties – and has been grappling with threats to her safety – after a “one down, hundreds to go” social media post about windblown milkweed seeds was misconstrued as celebrating the killing of far-right pundit <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">Charlie Kirk</a>.</p><p>Homer-Center school district board member Misty Hunt uploaded the post in question on 10 September, the same day Kirk was shot to death by a sniper while speaking at Utah Valley University (UVU).</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/23/pennsylvania-school-board-official-post-charlie-kirk-killing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Intelligence agencies should report on foreign interests in ‘activist groups’, Australian coal lobby group argues",
      "link": "https://www.theguardian.com/australia-news/2025/sep/23/intelligence-agencies-should-report-on-foreign-interests-in-activist-groups-australian-coal-lobby-group-argues",
      "pub_time_taipei": "2025-09-23T16:57:40+08:00",
      "summary": "<p>Coal Australia also wants government to broaden restrictions on foreign donations to stop money flowing to environmental groups</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>An Australian coal industry lobby group wants national intelligence agencies to report on any involvement of foreign interests in unnamed “activist groups” it claims are attempting to undermine the nation’s prosperity.</p><p>Coal Australia also wants the government to broaden restrictions on foreign donations to stop money being channelled to Australia-based environmental groups and create powers to terminate grants and rescind charity status to organisations who aren’t transparent about funding sources.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/23/intelligence-agencies-should-report-on-foreign-interests-in-activist-groups-australian-coal-lobby-group-argues\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sky News Australia staffer helped arrange bacon on guest’s shirt before offensive anti-Islam interview",
      "link": "https://www.theguardian.com/media/2025/sep/23/sky-news-australia-staffer-helped-arrange-bacon-on-guests-shirt-before-offensive-anti-islam-interview",
      "pub_time_taipei": "2025-09-23T16:11:08+08:00",
      "summary": "<p>UK-based influencer Ryan Williams posts friendly interaction with staffer revealing how much News Corp knew about the content before the segment</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The highly offensive guest that Sky News Australia put to air on Sunday was invited into the channel’s Perth studio where he declared he had “enough balls to fight Islam” while a studio staffer rearranged the bacon on his shirt before the interview.</p><p>The UK-based social media influencer Ryan Williams has posted a video of his friendly interaction with a Sky News staffer that throws more light on how much the News Corp-owned platform knew about their guest’s intentions before the live interview.</p> <a href=\"https://www.theguardian.com/media/2025/sep/23/sky-news-australia-staffer-helped-arrange-bacon-on-guests-shirt-before-offensive-anti-islam-interview\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two MPs cleared in Jacinta Allan manure investigation; search for Tasmanian plane called off – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
      "pub_time_taipei": "2025-09-23T15:44:32+08:00",
      "summary": "<p>Victoria’s new integrity watchdog made no finding of misconduct by Liberal MPs who assisted delivery of cow manure. This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/23/australian-health-experts-warns-trumps-unfounded-claims-about-paracetamol-may-harm-pregnant-women\">Australian health experts warn Trump’s unfounded autism claims about paracetamol may harm pregnant women</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Australians urged to take health advice from doctors, researchers and the medical community</strong></p><p><strong>Danielle McMullen, </strong>the president of the <strong>Australian Medical Association</strong>, stressed that <strong>paracetamol has been deemed by the TGA to be safe to use in pregnancy,</strong> although “of course like all medications we try to use it as little as possible when pregnant”.</p><p>The advice here in Australia sill is that paracetamol is a reasonable option and [a] safe option for pregnant women to use.</p><p>Like we did as Australia during the pandemic, we really took strong health advice from doctors, from researchers, and from that medical community and our regulator. So I’d encourage Australians to still do the same.</p><p>Our chief health officers and medical officers are medical practitioners, and trained in analysing these studies and weighing up the pros and cons and translating that into information that’s understandable by the general public. So, really encourage people to talk to their doctors in terms of listening to health advice for our health officers and health ministers here to be listening to that health advice.</p><p>The pilots received a pressurisation warning light shortly after take off on Monday morning and followed standard operating procedures.</p><p>We understand this might have been an unsettling experience for our customers and want to thank them for their patience and understanding.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. imposes sanctions on wife of judge who led Bolsonaro prosecution",
      "link": "https://www.washingtonpost.com/world/2025/09/23/bolsonaro-trump-brazil-de-moraes/",
      "pub_time_taipei": "2025-09-23T15:09:29+08:00",
      "summary": "The sanctions on Viviane Barci de Moraes, wife of Brazilian Supreme Court Justice Alexandre de Moraes, escalate the feud between Donald Trump and Brazil’s leadership."
    },
    {
      "source": "衛報",
      "title": "Queensland coalmines marked for closure ‘uneconomic’, analysis shows, despite sector blaming royalties scheme",
      "link": "https://www.theguardian.com/business/2025/sep/23/queensland-coalmines-closing-uneconomic-royalties-scheme-zombie-mines-bhp-anglo-american-qcoal",
      "pub_time_taipei": "2025-09-23T13:45:45+08:00",
      "summary": "<p>Findings show ‘zombie mines’ often restarted during coal price spikes and mothballed as prices return to normal levels</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Coalmines recently marked for closure in Queensland were previously shuttered due to being uneconomic, new analysis shows, undermining claims from the resources companies that they are being forced to close by the state’s royalty regime.</p><p>The “zombie mines” were often restarted in anticipation of windfall profits during coal price spikes, which occurred when Russia invaded Ukraine in early 2022.</p> <a href=\"https://www.theguardian.com/business/2025/sep/23/queensland-coalmines-closing-uneconomic-royalties-scheme-zombie-mines-bhp-anglo-american-qcoal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "British-Egyptian activist Alaa Abd el-Fattah freed from prison",
      "link": "https://www.theguardian.com/world/2025/sep/22/british-egyptian-activist-alaa-abd-el-fattah-to-be-freed-from-prison",
      "pub_time_taipei": "2025-09-23T12:47:56+08:00",
      "summary": "<p>Writer, who has served six years for sharing a Facebook post, was given a presidential pardon</p><p>The British-Egyptian human rights activist Alaa Abd el-Fattah has been released from jail after serving six years for sharing a Facebook post.</p><p>Egypt’s president, Abdel Fatah al-Sisi, granted him his freedom after intensive lobbying by the UK government and pressure from Egypt’s national human rights council.</p> <a href=\"https://www.theguardian.com/world/2025/sep/22/british-egyptian-activist-alaa-abd-el-fattah-to-be-freed-from-prison\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hungary refuses to stop buying Russian oil despite Trump’s Nato demand",
      "link": "https://www.theguardian.com/world/2025/sep/23/hungary-refuses-to-stop-buying-russian-oil-despite-trumps-nato-demand",
      "pub_time_taipei": "2025-09-23T12:00:39+08:00",
      "summary": "<p>Foreign minister says getting energy supplies elsewhere is a ‘nice dream’ while describing western European officials as ‘fanatics’</p><p>Hungary will not wean itself off Russian energy supplies, the country’s foreign minister has told the Guardian, despite the White House’s demand for Nato allies to stop buying Russian oil.</p><p>Donald Trump has demanded that Europe halt Russian oil imports, but in an interview on the sidelines of the 80th annual session of the UN general assembly, Péter Szijjártó said: “We can’t ensure the safe supply [of energy products] for our country without Russian oil or gas sources,” while adding that he “understood” Trump’s approach.</p> <a href=\"https://www.theguardian.com/world/2025/sep/23/hungary-refuses-to-stop-buying-russian-oil-despite-trumps-nato-demand\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "EU chemical firms plan to export rising quantities of ‘toxic’ pesticides, documents show",
      "link": "https://www.theguardian.com/environment/2025/sep/23/eu-chemical-firms-export-toxic-pesticides",
      "pub_time_taipei": "2025-09-23T12:00:39+08:00",
      "summary": "<p>Bloc urged to end ‘unethical double standard’ of allowing sale of products deemed too dangerous for EU farms</p><p>European chemical corporations have issued plans to export increasing quantities of “toxic” pesticides deemed too dangerous to spray on EU farms, an investigation has found, despite a pledge to end the practice.</p><p>Planned exports of domestically banned pesticides rose from 81,600 tons in 2018 to 122,000 tons in 2024, according to export notifications obtained via freedom of information requests by Unearthed, the investigative newsroom of Greenpeace, and the Swiss nonprofit Public Eye.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/23/eu-chemical-firms-export-toxic-pesticides\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump is waging culture war on Europe by promoting rightwing allies, report finds",
      "link": "https://www.theguardian.com/world/2025/sep/23/trump-culture-war-europe-promoting-rightwing-allies-report-finds",
      "pub_time_taipei": "2025-09-23T12:00:38+08:00",
      "summary": "<p>Study says US president seeks to interfere in elections and ‘move the ideological centre of gravity’ in European politics</p><p>The Trump administration is waging a culture war on Europe by aggressively promoting the Maga movement’s political and ideological allies on the continent and publicly humiliating the EU on the world stage, a joint report by the European Council on Foreign Relations (ECFR) and European Cultural Foundation has concluded.</p><p><a href=\"https://ecfr.eu/publication/reality-show-why-europe-must-not-cave-in-trumps-culture-war/\">The study argues</a> that the US president is actively seeking to interfere in European elections, transform the transatlantic relationship toward conservative values and rally Europe’s rightwing populists around the theme of free speech.</p> <a href=\"https://www.theguardian.com/world/2025/sep/23/trump-culture-war-europe-promoting-rightwing-allies-report-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Unification Church leader arrested in South Korea over bribery allegations linked to former first lady",
      "link": "https://www.theguardian.com/world/2025/sep/23/unification-church-leader-han-hak-ja-arrested-south-korea-ntwnfb",
      "pub_time_taipei": "2025-09-23T11:57:43+08:00",
      "summary": "<p>Han Hak-ja, aged 82, is detained after Seoul court hearing over claims she told church officials to bribe wife of then president Yoon Suk Yeol</p><p>The 82-year-old leader of the Unification Church was arrested in South Korea early Tuesday as investigators probe allegations that the church bribed the wife of jailed former president Yoon Suk Yeol and a conservative lawmaker.</p><p>Han Hak-ja, the widow of the church’s South Korean founder, Sun Myung Moon, has denied allegations that she directed church officials to bribe Yoon’s wife, Kim Keon Hee, and the lawmaker.</p> <a href=\"https://www.theguardian.com/world/2025/sep/23/unification-church-leader-han-hak-ja-arrested-south-korea-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mother in New Zealand’s ‘suitcase murders’ found guilty of killing her two children",
      "link": "https://www.theguardian.com/world/2025/sep/23/new-zealand-suitcase-murders-mother-found-guilty-of-killing-her-two-children",
      "pub_time_taipei": "2025-09-23T11:40:10+08:00",
      "summary": "<p>The bodies of Hakyung Lee’s children were discovered inside suitcases bought at a storage unit auction in Auckland in August 2022</p><p>A mother accused of murdering her children and hiding their bodies in suitcases, in a case that has become known as New Zealand’s “suitcase murders”, has been found guilty by an Auckland court.</p><p>The bodies of Yuna Jo and Minu Jo, aged eight and six at the time of their deaths, were <a href=\"https://www.theguardian.com/world/2022/nov/30/new-zealand-suitcase-murders-suspect-is-mother-of-child-victims-court-hears\">discovered inside suitcases bought at a storage unit</a> auction in Auckland in August 2022. Authorities believed they had been dead for three to four years by the time their bodies were found.</p> <a href=\"https://www.theguardian.com/world/2025/sep/23/new-zealand-suitcase-murders-mother-found-guilty-of-killing-her-two-children\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Arab Spring activist Alaa Abdel Fattah released after pardon from Egypt’s Sisi",
      "link": "https://www.washingtonpost.com/world/2025/09/22/alaa-abdel-fattah-egypt-pardon/",
      "pub_time_taipei": "2025-09-23T10:32:51+08:00",
      "summary": "Abdel Fattah was a symbol of the 2011 uprising but was arrested two years later. He has since spent almost all of the past 12 years behind bars."
    },
    {
      "source": "衛報",
      "title": "Rodrigo Duterte, former Philippines president, charged with crimes against humanity at ICC",
      "link": "https://www.theguardian.com/world/2025/sep/23/rodrigo-duterte-charged-crimes-against-humanity-icc-philippines-ntwnfb",
      "pub_time_taipei": "2025-09-23T09:56:04+08:00",
      "summary": "<p>Three charges against Duterte stem from his years-long campaign against drug users and dealers that rights groups say killed thousands</p><p>Prosecutors at the international criminal court (ICC) have charged former Philippines president Rodrigo Duterte with three counts of crimes against humanity, alleging his involvement in at least 76 murders as part of his “<a href=\"https://www.theguardian.com/world/2024/nov/04/rodrigo-dutertes-war-on-drugs-in-the-philippines-explained-in-30-seconds-ntwnfb\">war on drugs</a>”.</p><p>A heavily redacted charge sheet dated 4 July but made public on Monday laid out the accusations against the 80-year-old former leader, who is in ICC detention in The Hague.</p> <a href=\"https://www.theguardian.com/world/2025/sep/23/rodrigo-duterte-charged-crimes-against-humanity-icc-philippines-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Donald Trump signs order designating antifa as a domestic terror organization – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
      "pub_time_taipei": "2025-09-23T09:52:18+08:00",
      "summary": "<p>This blog has closed. Read our latest story <a href=\"https://www.theguardian.com/us-news/2025/sep/22/trump-executive-order-antifa-terrorist-organization\">here</a></p><p>Per my last post, it’s important to underscore that <strong>autism has been a focus for Kennedy</strong>. Earlier this month, the Wall Street Journal <a href=\"https://www.wsj.com/health/healthcare/rfk-jr-hhs-to-link-autism-to-tylenol-use-in-pregnancy-and-folate-deficiencies-e3acbb4c?gaa_at=eafs&amp;gaa_n=ASWzDAhwJUrTkQQKbf3fCPdx7a164OXbN3bA3HHVYMK1BmPXirXKdNsVALYTST5ieD8%3D&amp;gaa_ts=68d146ed&amp;gaa_sig=1YrB1_HneQxFDdL6Iz82R1yFPTDUITrQ991UFvw7hlf3GcuaXlh6Tq2SIVnB6tq-dwU4LO2n-laPq65v0IBmQA%3D%3D\">reported</a> that Kennedy planned to announce that use of Tylenol by pregnant women was potentially linked to <a href=\"https://www.theguardian.com/society/autism\">autism</a> spectrum disorder. Kennedy has claimed that the US is in the grip of an “autism epidemic” fuelled by “environmental toxins”.</p><p>A reminder that the <strong>American </strong><strong>College of Obstetrics and Gynecology </strong>(ACOG) says there’s “no clear evidence” linking “prudent” use of acetaminophen to issues with fetal development.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New Zealand loosens residency restrictions as record number of citizens leave",
      "link": "https://www.theguardian.com/world/2025/sep/23/new-zealand-visa-country-loosens-residency-restrictions-record-numbers-of-citizens-leave",
      "pub_time_taipei": "2025-09-23T09:33:49+08:00",
      "summary": "<p>Minister for economic growth says visas for skilled and experienced migrants could help plug gaps in the workforce</p><p>New Zealand is making it easier for migrant workers to come and live in the country, in its latest attempt to bolster the workforce and economy.</p><p>Announcing two new residency pathways, the minister for economic growth, Nicola Willis, on Tuesday said skilled and experienced migrants could help plug gaps in the workforce.</p> <a href=\"https://www.theguardian.com/world/2025/sep/23/new-zealand-visa-country-loosens-residency-restrictions-record-numbers-of-citizens-leave\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "France defies Trump, recognizes Palestinian statehood despite U.S. pressure",
      "link": "https://www.washingtonpost.com/national-security/2025/09/22/rubio-france-palestine-statehood-un/",
      "pub_time_taipei": "2025-09-23T09:25:52+08:00",
      "summary": "Secretary of State Marco Rubio tried to kill France’s recognition of Palestinian statehood, publicly lambasting it as a “gift to Hamas” ahead of the U.N. summit in New York."
    },
    {
      "source": "衛報",
      "title": "Abbas says Hamas must ‘surrender their weapons’ – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
      "pub_time_taipei": "2025-09-23T08:59:51+08:00",
      "summary": "<p>This blog is now closed. See our <a href=\"https://www.theguardian.com/world/2025/sep/22/arab-and-muslim-leaders-to-meet-trump-to-discuss-peace-plan-for-gaza\">full report here</a></p><p>The Israeli military, which justifies its assault on Gaza City by saying it wants to “destroy Hamas military infrastructure” hasn’t given a timeline for the ground offensive, but there are indications it could take months.</p><p>Amid this flurry of diplomatic activity, Israel is continuing to launch deadly attacks on Gaza, including on <strong>Gaza City</strong>, the biggest urban centre in the territory.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Albanese warns Netanyahu expansion of settlements in West Bank risks putting two-state solution ‘out of reach’",
      "link": "https://www.theguardian.com/australia-news/2025/sep/22/albanese-warns-netanyahu-expansion-of-settlements-in-west-bank-risks-putting-two-state-solution-out-of-reach",
      "pub_time_taipei": "2025-09-23T07:34:46+08:00",
      "summary": "<p>Australian PM tells major conference in US the trajectory of Gaza conflict is deeply worrying to the international community</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Anthony Albanese is warning Benjamin Netanyahu any move to expand Israeli settlements in the West Bank or annex parts of Palestine risks putting <a href=\"https://www.theguardian.com/australia-news/2025/sep/21/australia-joins-uk-and-canada-in-formally-recognising-palestinian-state\">a two-state solution</a> permanently “beyond reach”.</p><p>As far-right members of Netanyahu’s governing coalition demand Israel annexe some of the territory that would be part of a future Palestinian state, Albanese told major conference in New York the current trajectory of the conflict is deeply worrying to the international community.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/22/albanese-warns-netanyahu-expansion-of-settlements-in-west-bank-risks-putting-two-state-solution-out-of-reach\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "France recognises Palestine and calls for UN force in Gaza",
      "link": "https://www.theguardian.com/world/2025/sep/22/arab-and-muslim-leaders-to-meet-trump-to-discuss-peace-plan-for-gaza",
      "pub_time_taipei": "2025-09-23T05:55:02+08:00",
      "summary": "<p>Macron sets out plan for international stabilisation mission as Arab and Muslim leaders prepare to meet Trump in New York</p><p>Emmanuel Macron has announced France’s official recognition of the State of Palestine, setting out a plan for a UN-mandated international stabilisation force in postwar Gaza that is expected to find support in many countries but not in Israel or the US.</p><p>“The time has come to end the war in Gaza, the massacres and the death,” Macron said during a speech opening a special summit in the United Nations general assembly hall on Monday evening. “The time has come to do justice for the Palestinian people and thus to recognise the State of Palestine in Gaza, the West Bank and Jerusalem.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/22/arab-and-muslim-leaders-to-meet-trump-to-discuss-peace-plan-for-gaza\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Netanyahu vows retaliation ahead of more Palestine recognitions at U.N.",
      "link": "https://www.washingtonpost.com/world/2025/09/22/palestine-state-recognize-un-israel/",
      "pub_time_taipei": "2025-09-23T00:20:43+08:00",
      "summary": "As France and Saudi Arabia convene a summit to renew the push for a two-state solution, the Israeli leader said that “a Palestinian state will not be established.”"
    },
    {
      "source": "衛報",
      "title": "‘A heavy burden’: Belém residents evicted in rush for profits from Cop30 rentals",
      "link": "https://www.theguardian.com/environment/2025/sep/22/belem-residents-evicted-to-make-way-for-cop30-rentals",
      "pub_time_taipei": "2025-09-22T23:50:57+08:00",
      "summary": "<p>As the Brazilian city prepares to host 50,000 delegates, local people are being pushed from their homes</p><p>The two-bedroom apartment in Belém became Suelen Freitas’s home in 2020, when she moved her family to the same building as her elderly mother. On the edge of the Amazon rainforest, it was where her story played out for five years, from enduring the Covid pandemic, to watching her two children get into the university.</p><p>But in March everything changed. An eviction notice gave them and their neighbours 30 days to vacate their apartments. One by one, all 12 families were forced out. “It was very painful,” Freitas said.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/22/belem-residents-evicted-to-make-way-for-cop30-rentals\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Outdoor brand Arc’teryx’s Himalayan fireworks stunt sparks environmental probe",
      "link": "https://www.washingtonpost.com/world/2025/09/22/arcteryx-apology-fireworks-mountain-tibet/",
      "pub_time_taipei": "2025-09-22T22:43:20+08:00",
      "summary": "Arc’teryx said it regretted the high-altitude fireworks display, which it organized with the visual artist Cai Guo-Qiang in Tibet to promote mountain culture."
    },
    {
      "source": "華盛頓郵報",
      "title": "Putin ready to extend nuclear arms control pact for a year",
      "link": "https://www.washingtonpost.com/world/2025/09/22/russia-putin-start-nuclear-arms-treaty/",
      "pub_time_taipei": "2025-09-22T22:40:49+08:00",
      "summary": "The START agreement limiting active nuclear missiles and bombers expires in February, and Putin’s decision to extend it probably will be viewed favorably by Trump."
    },
    {
      "source": "衛報",
      "title": "Disabled Nigerian man living in UK for 38 years wins appeal against deportation",
      "link": "https://www.theguardian.com/uk-news/2025/sep/22/disabled-nigerian-anthony-olubunmi-george-wins-appeal-deportation",
      "pub_time_taipei": "2025-09-22T22:00:14+08:00",
      "summary": "<p>Anthony Olubunmi George, who arrived in 1986 and has no criminal convictions, given right to remain</p><p>A disabled Nigerian man who has lived in the UK for almost 40 years has won an appeal to stay in the country despite <a href=\"https://www.theguardian.com/uk-news/article/2024/may/19/home-office-in-threat-to-deport-disabled-man-to-nigeria-after-38-years-in-uk\">the Home Office wanting to deport him</a>.</p><p>Anthony Olubunmi George, 63, came to the UK at the age of 24 in 1986. He has not left the UK since and has no criminal convictions. He had two strokes in 2019 that left him with speech and mobility issues.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/22/disabled-nigerian-anthony-olubunmi-george-wins-appeal-deportation\">Continue reading...</a>"
    }
  ]
}