{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-18T20:40:08.485713+08:00",
  "window_end_taipei": "2025-10-19T20:40:08.485713+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Israeli army confirms it has carried out airstrikes in Rafah – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates",
      "pub_time_taipei": "2025-10-19T20:27:04+08:00",
      "summary": "<p>Ceasefire in crisis as army says it was responding after troops were attacked with anti-tank missile and gunfire</p><p><a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\">Israeli airstrikes on Gaza as ceasefire comes under threat</a></p><p><strong>Freed Israeli hostage David Cunio</strong> received a hero’s welcome in the city of <strong>Yavne</strong>, where residents lined the streets waving <strong>Israeli and American flags</strong> as he was driven from hospital to rejoin his family, The Times of Israel reports.</p><p>Cunio, who was <strong>abducted from kibbutz </strong><strong>Nir Oz</strong> with his family during the <strong>7 October 2023 Hamas attack</strong>, leaned out of the car window to <strong>shake hands and thank supporters</strong> as music played and people applauded.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel launches airstrikes on Rafah as Gaza ceasefire deal comes under threat",
      "link": "https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions",
      "pub_time_taipei": "2025-10-19T20:13:02+08:00",
      "summary": "<p>IDF says attack was in response to Hamas forces firing at its troops, as militant group says it is still committed to truce </p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates\">Middle East crisis – live updates</a></p></li></ul><p>The Israeli air force carried out airstrikes in Rafah on Sunday, Israel’s military has confirmed, in what marks the most serious threat so far to the week-long ceasefire in Gaza.</p><p>The airstrikes reportedly occurred after Hamas militants emerged from tunnels in the Rafah area and shot at Israeli soldiers in the morning, prompting a firefight. Israel’s army radio reported that deadly clashes in Rafah were continuing.</p> <a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Empty shelves, higher prices’: Americans tell of cost of Trump’s tariffs",
      "link": "https://www.theguardian.com/us-news/2025/oct/19/trump-tariffs-us-consumers",
      "pub_time_taipei": "2025-10-19T20:00:14+08:00",
      "summary": "<p>US consumers say price rises caused by president’s tariffs contradicts his promise to make life more affordable</p><p>As a mother of two, Paige Harris has noticed a change in the way she shops for her family.</p><p>“Items that I have bought regularly have gone up in price steadily,” she said. “From hair dye to baby formula, our grocery list has gotten smaller while our budget has had to increase. Meats like steak are a no-go for our household.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/19/trump-tariffs-us-consumers\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fears over higher rates as Georgia moves to provide more electricity for AI datacenters",
      "link": "https://www.theguardian.com/us-news/2025/oct/19/georgia-electricity-datacenters",
      "pub_time_taipei": "2025-10-19T20:00:13+08:00",
      "summary": "<p>State’s Republican-led public service commission to decide on power expansion and prices, as Democrats vie for voice</p><p><a href=\"https://www.theguardian.com/us-news/state-of-georgia\">Georgia</a> is facing the largest demand for electricity in its history, driven by nation-leading datacenter construction.</p><p>The Georgia Power company has made an unprecedented bid to the agency that oversees the utility for about 10 additional gigawatts of energy in the coming years – enough to power 8.3m homes, at an estimated cost of nearly $16bn, according to the <a href=\"https://www.selc.org/\">Southern Environmental Law Center</a>.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/19/georgia-electricity-datacenters\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Thieves steal treasured jewelry from Louvre in broad daylight",
      "link": "https://www.washingtonpost.com/world/2025/10/19/louvre-museum-robbery-jewels/",
      "pub_time_taipei": "2025-10-19T19:46:00+08:00",
      "summary": "Thieves broke into the Apollo Gallery, which houses the French crown jewels, through an outside window and escaped on motorbikes, the interior minister said."
    },
    {
      "source": "衛報",
      "title": "‘Priceless’ jewellery stolen from Louvre in raid by ‘experienced’ thieves",
      "link": "https://www.theguardian.com/world/2025/oct/19/louvre-closed-after-robbery-french-culture-minister-says",
      "pub_time_taipei": "2025-10-19T19:25:12+08:00",
      "summary": "<p>French minister says highly professional criminals used angle grinder to access one of museum’s most ornate rooms</p><p>“Priceless” historic jewellery has been stolen from the Louvre in Paris after a highly professional robbery by men who used an angle grinder to break through glass and enter one of the museum’s most ornate rooms.</p><p>The world’s most-visited museum was suddenly closed for the day after the break-in targeted pieces in two glass cases in its Apollon gallery, where the French crown jewels are held.</p> <a href=\"https://www.theguardian.com/world/2025/oct/19/louvre-closed-after-robbery-french-culture-minister-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Betfred says gambling tax rise in budget will force it to shut all its UK shops",
      "link": "https://www.theguardian.com/society/2025/oct/19/betfred-gambling-tax-rise-shut-uk-shops",
      "pub_time_taipei": "2025-10-19T19:21:08+08:00",
      "summary": "<p>Levies thought to be under consideration will kill profits, say bosses, as gambling firms ramp up lobbying efforts </p><p>Betfred has said it will close all 1,287 of its high street betting shops if Rachel Reeves raises taxes on the gambling industry in next month’s budget.</p><p>The company’s threat comes amid speculation that the chancellor is considering a tax increase worth up to £3.2bn <a href=\"https://www.theguardian.com/business/2025/oct/12/william-hill-owner-could-shut-shops-if-reeves-raises-gambling-taxes\">on sports betting</a> to help to close a potential £30bn shortfall in the public finances.</p> <a href=\"https://www.theguardian.com/society/2025/oct/19/betfred-gambling-tax-rise-shut-uk-shops\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Woman investigated over husband’s use of assisted dying clinic wanted to argue case in court",
      "link": "https://www.theguardian.com/society/2025/oct/19/woman-investigated-husband-use-assisted-dying-clinic-wanted-to-argue-case-in-court",
      "pub_time_taipei": "2025-10-19T19:00:16+08:00",
      "summary": "<p>Louise Shackleton says current law is traumatising families and she wanted jury to assess her innocence</p><p>A woman who was under police investigation for accompanying her husband to an assisted dying clinic in Switzerland said she wished her case had gone to trial so she could have proved her innocence in front of a jury.</p><p>Louise Shackleton, 59, spent 10 months under investigation for assisting a suicide before North Yorkshire police announced this week that the Crown Prosecution Service had decided <a href=\"https://www.theguardian.com/society/2025/oct/16/woman-who-travelled-with-husband-to-assisted-dying-clinic-will-not-face-charges\">it was not in the public interest</a> to prosecute her.</p> <a href=\"https://www.theguardian.com/society/2025/oct/19/woman-investigated-husband-use-assisted-dying-clinic-wanted-to-argue-case-in-court\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Scottish hospitality coalition urges chancellor to protect whisky industry",
      "link": "https://www.theguardian.com/food/2025/oct/19/scottish-hospitality-coalition-urges-chancellor-to-protect-whisky-industry",
      "pub_time_taipei": "2025-10-19T19:00:16+08:00",
      "summary": "<p>Exclusive: letter to Rachel Reeves from drinks, tourism and farming bodies calls for freeze on spirits duty in budget</p><p>A coalition of drinks, tourism and farming bodies has urged the chancellor to protect the Scottish whisky industry from a steeper sales slump and further job losses by freezing spirits duty in her budget next month.</p><p>The grouping, which includes the Scottish arms of the National Farmers’ Union, the Institute of Directors and UKHospitality, has written to Rachel Reeves to argue that a freeze in duty would be a “strategic investment” that could increase tax revenues.</p> <a href=\"https://www.theguardian.com/food/2025/oct/19/scottish-hospitality-coalition-urges-chancellor-to-protect-whisky-industry\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel IDs hostages’ bodies as Hamas says return of others will be hard",
      "link": "https://www.washingtonpost.com/world/2025/10/14/hamas-gaza-israel-hostages-killed/",
      "pub_time_taipei": "2025-10-19T18:09:09+08:00",
      "summary": "Here’s what to know about the hostages whose bodies have been returned to Israel — or that remain in Gaza as pressure mounts on Hamas to turn them over."
    },
    {
      "source": "華盛頓郵報",
      "title": "Traditionalists push Pope Leo to resurrect the Latin Mass",
      "link": "https://www.washingtonpost.com/world/2025/10/19/latin-mass-pope-leo-catholic/",
      "pub_time_taipei": "2025-10-19T18:00:32+08:00",
      "summary": "The Latin Mass has become toxically politicized and is posing a test for Pope Leo XIV as traditionalists call on him to reverse restrictions imposed by Pope Francis."
    },
    {
      "source": "華盛頓郵報",
      "title": "Desperately needed aid now reaching more of Gaza’s population amid truce",
      "link": "https://www.washingtonpost.com/world/2025/10/19/gaza-ceasefire-food-humanitarian-aid/",
      "pub_time_taipei": "2025-10-19T17:00:57+08:00",
      "summary": "But humanitarian groups continue to face challenges in supplying assistance, including blocked roads, damaged warehouses and Israeli government restrictions."
    },
    {
      "source": "衛報",
      "title": "Ohio man charged after brandishing gun at New York City Wikipedia conference",
      "link": "https://www.theguardian.com/us-news/2025/oct/19/ohio-man-wikipedia-conference",
      "pub_time_taipei": "2025-10-19T17:00:11+08:00",
      "summary": "<p>Connor Weston, 27, reportedly declared himself a ‘non-offending pedophile’ and threatened to kill himself</p><p>An Ohio man is facing criminal charges after he allegedly stormed a stage at a <a href=\"https://www.theguardian.com/technology/wikipedia\">Wikipedia</a> conference in <a href=\"https://www.theguardian.com/us-news/new-york\">New York City</a> with a gun – as well as a sign declaring himself a “non-offending pedophile” – and threatened to kill himself.</p><p>Connor Weston, 27, was reportedly tackled by organizers of WikiConference North America 2025, thwarting tragedy, before police said officers booked him on counts of criminal possession of a weapon and reckless endangerment.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/19/ohio-man-wikipedia-conference\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Political chaos in France could derail E.U. security initiatives",
      "link": "https://www.washingtonpost.com/world/2025/10/19/france-political-chaos-eu-defense/",
      "pub_time_taipei": "2025-10-19T17:00:00+08:00",
      "summary": "As Paris wrestles with ballooning debt and a budget impasse, two major Franco-German military projects and other E.U. integration initiatives could stall."
    },
    {
      "source": "衛報",
      "title": "Developers encroach on 2,000-year-old Devon wetland citing ‘blockages’ to Labour’s housing plans",
      "link": "https://www.theguardian.com/environment/2025/oct/19/developers-encroach-on-2000-year-old-devon-wetland-citing-blockages-to-labours-housing-plans",
      "pub_time_taipei": "2025-10-19T16:00:09+08:00",
      "summary": "<p>According to planning conditions, Wolborough Fen in Newton Abbot must be protected as groundworks are prepared for 1,200 homes</p><p>A 2,000-year-old wetland which is one of England’s most protected habitats has “bulldozers at its gates” after developers said conditions to protect it were blocking the growth the government is demanding.</p><p>Wolborough Fen in Newton Abbot, Devon, a site of special scientific interest (SSSI), must be protected from any damage by developers Vistry Group as they flatten hills and prepare the groundworks for 1,200 houses, according to planning conditions.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/19/developers-encroach-on-2000-year-old-devon-wetland-citing-blockages-to-labours-housing-plans\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "French theme park firm won UK government support despite far-right ties",
      "link": "https://www.theguardian.com/business/2025/oct/19/french-theme-park-company-puy-du-fou-won-uk-government-support-despite-ties-to-the-far-right",
      "pub_time_taipei": "2025-10-19T16:00:08+08:00",
      "summary": "<p>Tory trade minister promised to ‘assist’ plans to open £600m Puy du Fou site in Oxfordshire, emails shows</p><p>A French business that is planning to build a vast £600m historical theme park in rural Oxfordshire won help for its plans from the previous government despite its <a href=\"https://www.theguardian.com/business/2025/feb/22/far-right-links-and-putin-praise-fears-over-600m-uk-history-theme-park-plan\">founding family’s ties to the far right</a> and past praise of Vladimir Putin.</p><p>Correspondence obtained under freedom of information (FoI) laws showed the Conservative peer Dominic Johnson, a business and trade minister in Rishi Sunak’s government, promised to “assist” Puy du Fou – one of France’s most popular theme parks – in finding a UK site.</p> <a href=\"https://www.theguardian.com/business/2025/oct/19/french-theme-park-company-puy-du-fou-won-uk-government-support-despite-ties-to-the-far-right\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bolivia to vote in presidential runoff that will turn it to the right",
      "link": "https://www.theguardian.com/world/2025/oct/19/bolivia-election-vote-presidential-runoff-turn-right-coca",
      "pub_time_taipei": "2025-10-19T14:00:06+08:00",
      "summary": "<p>End of almost two decades of leftist rule could revive ‘war on drugs’ in change of approach to coca cultivation</p><p>Bolivians go to the polls on Sunday in an election that, whatever the result, will mark a complete shift to the right after nearly 20 years under the rule of the leftist Movimiento al Socialismo (Mas).</p><p>The country’s first-ever presidential runoff pits the centre-right senator Rodrigo Paz Pereira, 58, who <a href=\"https://www.theguardian.com/world/2025/aug/18/bolivia-presidential-election-preliminary-results\">won the first round</a> in August, against the rightwing former president Jorge “Tuto” Quiroga, 65, who in recent weeks has <a href=\"https://efe.com/mundo/2025-10-13/bolivia-elecciones-segunda-vuelta-jorge-quiroga/\">overtaken Paz Pereira in the polls</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/19/bolivia-election-vote-presidential-runoff-turn-right-coca\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "October heat records broken in WA; police use pepper spray on Melbourne protesters – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/19/anthony-albanese-donald-trump-washington-meeting-aukus-tariffs-counter-protests-anti-immigration-march-for-australia-rallies-ntwnfb",
      "pub_time_taipei": "2025-10-19T13:23:20+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/19/david-littleproud-calls-for-barnaby-joyce-to-stay-in-the-nationals-amid-speculation-of-a-jump-to-one-nation\">David Littleproud urges Barnaby Joyce to stay in the Nationals amid speculation of a jump to One Nation</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/19/crocodile-discovered-luxury-queensland-resort-pool-port-douglas-new-warnings\">Crocodile discovered in luxury Queensland resort pool sparks new warnings</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Asked about the hundreds of Palestinians from Gaza approved for visas in Australia and whether the ceasefire changes anything, <strong>Tony Burke</strong> said he’s not sure all of those approved for visas are still alive.</p><p>He says some will choose to stay in Australia, and others may end up with other options they might take up.</p><p>And there will be some people who we don’t hear from again. And there’s some on that case list that we haven’t heard from for a very long time. A significant number of them are part of split family groups, where some of the family is, in fact, here in Australia and they’re wanting to join.</p><p>You need to remember, our humanitarian program that we run around the world isn’t limited to places where there’s an active war. There is decency that Australia shows to people from around the world … there are Israelis who have been approved for humanitarian visas as well. I’ve got no intention of cancelling those either. We’re a decent country. We are talking about people where all the checks have been made. And some of them won’t choose to come here, some of them won’t be alive any more …</p><p>Probably the most significant change in response these days is the majority of people now get sent straight back to their country of origin. So, you used to really only see people going back to Indonesia or off to Nauru for processing. But the majority of cases now are going straight back to country of origin.</p><p>We had one very recently where, within 72 hours, we had everybody back to their country of origin. There was one in May, for example, where it was a mixed boatload of people from different countries and we had to, you know, from three different sorts of citizenships that people had come from. It was more complex but we still made sure we returned people directly straight back to the countries of origin.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/19/anthony-albanese-donald-trump-washington-meeting-aukus-tariffs-counter-protests-anti-immigration-march-for-australia-rallies-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Crocodile discovered in luxury Queensland resort pool sparks new warnings",
      "link": "https://www.theguardian.com/australia-news/2025/oct/19/crocodile-discovered-luxury-queensland-resort-pool-port-douglas-new-warnings",
      "pub_time_taipei": "2025-10-19T12:35:47+08:00",
      "summary": "<p>Reptile was removed after guests filmed it lying at the Sheraton Mirage in Port Douglas on Saturday</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/19/anthony-albanese-donald-trump-washington-meeting-aukus-tariffs-counter-protests-anti-immigration-march-for-australia-rallies-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A crocodile discovered lying in a luxury Queensland resort’s pool has been removed by wildlife rangers, with the state’s environment regulator issuing new warnings about the reptiles.</p><p>Two TikTok users posted footage of what appears to be a juvenile crocodile in the lagoon-style pool at the Sheraton Mirage in Port Douglas, in far north Queensland, on Saturday afternoon.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/19/crocodile-discovered-luxury-queensland-resort-pool-port-douglas-new-warnings\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "California governor says Trump ‘putting ego over responsibility’ as military show shuts highway",
      "link": "https://www.theguardian.com/us-news/2025/oct/18/california-highway-closure-military-celebration",
      "pub_time_taipei": "2025-10-19T10:34:58+08:00",
      "summary": "<p>Gavin Newsom says safety concerns forced state officials to close a portion of the busy Interstate 55 on Saturday</p><p>The California governor, Gavin Newsom, has accused Donald Trump of “putting his ego over responsibility” over a military showcase that involved firing live artillery shells over a major highway in the state’s south.</p><p>Newsom said safety concerns over the event forced state officials to close a portion of the busy Interstate 5 near the US Marine Camp Pendleton base on Saturday.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/18/california-highway-closure-military-celebration\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "David Littleproud urges Barnaby Joyce to stay in the Nationals amid speculation of a jump to One Nation",
      "link": "https://www.theguardian.com/australia-news/2025/oct/19/david-littleproud-calls-for-barnaby-joyce-to-stay-in-the-nationals-amid-speculation-of-a-jump-to-one-nation",
      "pub_time_taipei": "2025-10-19T08:40:28+08:00",
      "summary": "<p>Nationals leader says maverick MP still ‘has a contribution to make between now and when he retires’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/19/anthony-albanese-donald-trump-washington-meeting-aukus-tariffs-counter-protests-anti-immigration-march-for-australia-rallies-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Nationals leader, David Littleproud, has urged Barnaby Joyce stay in the party after the maverick MP announced his intention to quit and consider “all options” – prompting speculation of a possible defection to Pauline Hanson’s One Nation.</p><p>The former deputy prime minister <a href=\"https://www.theguardian.com/australia-news/2025/oct/18/barnaby-joyce-decision-to-leave-nationals-heightens-speculation-about-one-nation-move\">announced on Saturday</a> he would not stand for his New South Wales seat of New England at the next election. He cited an irreparably broken relationship with the Nationals’ leadership, but would see out the rest of the parliamentary term.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/19/david-littleproud-calls-for-barnaby-joyce-to-stay-in-the-nationals-amid-speculation-of-a-jump-to-one-nation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Guardian Australia’s Ben Smee joint winner of Queensland journalist of the year award",
      "link": "https://www.theguardian.com/australia-news/2025/oct/19/guardian-australias-ben-smee-joint-winner-of-queensland-journalist-of-the-year-award",
      "pub_time_taipei": "2025-10-19T08:21:06+08:00",
      "summary": "<p>The Guardian’s Queensland correspondent and three SBS journalists win top award for investigation into children locked up in police watch houses </p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/19/anthony-albanese-donald-trump-washington-meeting-aukus-tariffs-counter-protests-anti-immigration-march-for-australia-rallies-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Guardian Australia’s Ben Smee and a team from SBS have been named joint winners of the coveted journalist of the year award at Queensland’s annual media awards – the Clarions.</p><p>Smee, the <a href=\"https://www.theguardian.com/profile/ben-smee\">Guardian Australia’s Queensland state correspondent</a>, and SBS journalists Jennifer Luu, Jodie Noyce and Chloe Angelo, won the top award for their exclusive investigation, <a href=\"https://www.youtube.com/watch?v=pfT-Ts0g4VA\">In the Box: Inside the Isolation Cells where Australian Kids are Imprisoned.</a> Smee also picked up two other awards at a ceremony on Saturday night.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/19/guardian-australias-ben-smee-joint-winner-of-queensland-journalist-of-the-year-award\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Millions across all 50 US states march in No Kings protests against Trump",
      "link": "https://www.theguardian.com/us-news/2025/oct/18/no-kings-protests-events-states",
      "pub_time_taipei": "2025-10-19T08:16:52+08:00",
      "summary": "<p>Crowds of Americans, many in costumes, aligned behind message that US is sliding into authoritarianism</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/17/no-kings-protests-millions-trump\">What to know about the anti-Trump protests attracting millions</a></p></li><li><p><a href=\"https://www.theguardian.com/us-news/gallery/2025/oct/18/no-kings-protests-in-pictures\">No Kings protests: in pictures</a></p></li></ul><p>Americans across all 50 states <a href=\"https://www.theguardian.com/us-news/2025/oct/17/no-kings-protests-millions-trump\">marched in protests</a> against the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> on Saturday, aligning behind a message that the country is sliding into authoritarianism and there should be no kings in the US.</p><p>Millions of people turned out for the No Kings protests, the second iteration of a coalition that marched in June in one of the <a href=\"https://www.theguardian.com/us-news/2025/jun/19/no-kings-how-many-protesters-attended\">largest days of protest</a> in US history.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/18/no-kings-protests-events-states\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. repatriating survivors of alleged drug boat strike to Colombia, Ecuador",
      "link": "https://www.washingtonpost.com/national-security/2025/10/18/detainees-drug-boat-us-venezuela-colombia-ecuador/",
      "pub_time_taipei": "2025-10-19T06:45:35+08:00",
      "summary": "It is unclear if the two surviving alleged drug smugglers have any links to Venezuelan criminal organizations."
    },
    {
      "source": "衛報",
      "title": "Israel has violated ceasefire 47 times and killed 38 Palestinians, says Gaza media office",
      "link": "https://www.theguardian.com/world/2025/oct/18/israel-has-violated-ceasefire-47-times-and-killed-38-palestinians-says-gaza-media-office",
      "pub_time_taipei": "2025-10-19T05:06:47+08:00",
      "summary": "<p>Authorities urge UN to intervene ‘to protect unarmed civilian populations’ after attack on bus that killed 11</p><p>Gaza’s media office has accused Israel of violating the ceasefire with Hamas 47 times since the truce came into effect in early October, killing 38 Palestinians and wounding another 143.</p><p>“These violations have included crimes of direct gunfire against civilians, deliberate shelling and targeting, and the arrest of a number of civilians, reflecting the occupation’s continued policy of aggression despite the declared end of the war,” reads the statement.</p> <a href=\"https://www.theguardian.com/world/2025/oct/18/israel-has-violated-ceasefire-47-times-and-killed-38-palestinians-says-gaza-media-office\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rafah border crossing to stay closed ‘until further notice’, says Israel",
      "link": "https://www.theguardian.com/world/2025/oct/18/rafah-border-crossing-to-stay-closed-until-further-notice-says-israel",
      "pub_time_taipei": "2025-10-19T05:06:04+08:00",
      "summary": "<p>Officials say reopening of gateway between Gaza and Egypt would depend on Hamas returning remains of dead hostages</p><p>The Rafah border crossing between Gaza and Egypt will stay closed “until further notice”, Israel has said, after the Palestinian embassy in Cairo said the territory’s sole gateway to the outside world would reopen on Monday.</p><p>The statement by Benjamin Netanyahu’s office said reopening Rafah would depend on how Hamas fulfils its ceasefire role of returning the remains of all 28 dead hostages. Israel’s foreign ministry earlier said the crossing would probably reopen on Sunday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/18/rafah-border-crossing-to-stay-closed-until-further-notice-says-israel\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Putin demanded Ukraine surrender key territory in call with Trump",
      "link": "https://www.washingtonpost.com/politics/2025/10/18/putin-trump-donetsk-war-ukraine/",
      "pub_time_taipei": "2025-10-19T04:12:54+08:00",
      "summary": "The demand from Putin would significantly disadvantage Ukraine and could be an obstacle to peace, officials said."
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas took 251 hostages from Israel into Gaza. Where are they?",
      "link": "https://www.washingtonpost.com/world/interactive/hamas-hostages-israel-war-gaza/",
      "pub_time_taipei": "2025-10-19T03:33:40+08:00",
      "summary": "We’re tracking what happened to the hostages taken by Hamas on Oct. 7, 2023, from Israel."
    },
    {
      "source": "衛報",
      "title": "US military to move survivors of strike on alleged drug boat in Caribbean to nearby countries",
      "link": "https://www.theguardian.com/us-news/2025/oct/18/us-military-strike-survivors",
      "pub_time_taipei": "2025-10-19T03:24:45+08:00",
      "summary": "<p>Releasing them from US custody evades thorny legal issues regarding military detention of suspected drug smugglers</p><p>The Trump administration is moving to send the two survivors of Thursday’s strike in the Caribbean overseas rather than seek long-term military detention for them, four US officials and a source familiar with the matter told Reuters on Saturday.</p><p>The source, who like the US officials spoke on condition of anonymity, said the survivors were being sent to Colombia and Ecuador.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/18/us-military-strike-survivors\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australian banks ignore thousands of customers’ hardship requests",
      "link": "https://www.theguardian.com/australia-news/2025/oct/19/australian-banks-ignore-customer-hardship-requests",
      "pub_time_taipei": "2025-10-19T03:00:55+08:00",
      "summary": "<p><strong>Exclusive</strong>: Automated systems have generated ‘cookie cutter’ responses that fail to account for individual circumstances, financial watchdog says</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/19/anthony-albanese-donald-trump-washington-meeting-aukus-tariffs-counter-protests-anti-immigration-march-for-australia-rallies-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Banks are outright ignoring or offering “cookie cutter” responses to a rising number of hardship requests from struggling customers, despite repeated regulatory crackdowns.</p><p>Nearly 2,900 customers complained their bank had failed to respond to pleas for assistance in 2024-25, new data from the Australian Financial Complaints Authority (Afca) showed.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/19/australian-banks-ignore-customer-hardship-requests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bus crashes in north-eastern Brazil, killing 17 people, say police",
      "link": "https://www.theguardian.com/world/2025/oct/18/bus-crashes-in-north-eastern-brazil-killing-15-people-say-police",
      "pub_time_taipei": "2025-10-19T00:43:10+08:00",
      "summary": "<p>Driver lost control of bus in Saloá in Pernambuco state and cause of accident is under investigation</p><p>A passenger bus in north-eastern Brazil has crashed into a sand embankment and flipped on its side, killing 17 people, local authorities have said.</p><p>The bus was carrying about 30 passengers, police said on Saturday, but the number of injured, who were taken to nearby hospitals, was not immediately clear. The vehicle departed from the state of Bahia and crashed in Saloá, a city in the neighbouring state of Pernambuco.</p> <a href=\"https://www.theguardian.com/world/2025/oct/18/bus-crashes-in-north-eastern-brazil-killing-15-people-say-police\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "With a phone call, Putin appears to change Trump’s mind on Ukraine. Again.",
      "link": "https://www.washingtonpost.com/world/2025/10/18/russia-putin-trump-ukraine-phone/",
      "pub_time_taipei": "2025-10-18T22:54:50+08:00",
      "summary": "It was the latest swing in President Donald Trump’s position on the war that often shifts following contact with Russian President Vladimir Putin."
    },
    {
      "source": "華盛頓郵報",
      "title": "Oxford debate club to vote on ousting leader for LOL over Charlie Kirk killing",
      "link": "https://www.washingtonpost.com/world/2025/10/17/oxford-debate-union-charlie-kirk/",
      "pub_time_taipei": "2025-10-18T22:09:00+08:00",
      "summary": "At the Oxford Union in May, Charlie Kirk said “you should be allowed to say outrageous things,” but a student who met him then may be ousted over posts about Kirk’s death."
    }
  ]
}