{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-14T20:40:06.273539+08:00",
  "window_end_taipei": "2025-10-15T20:40:06.273539+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Gaza ceasefire live: Israel says body handed over by Hamas is not one of the hostages",
      "link": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
      "pub_time_taipei": "2025-10-15T20:29:13+08:00",
      "summary": "<p>Four bodies were handed over by Hamas on Tuesday to ease pressure on the fragile ceasefire, after the first four on Monday </p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/15/israel-pulls-back-threat-humanitarian-aid-gaza-hostages-remains-hamas\">Israel reportedly pulls back from threat to slash humanitarian aid entering Gaza</a></p></li></ul><p>The <strong>Israeli</strong> military said on Wednesday that one of the bodies handed over by <strong>Hamas</strong> the previous day as part of the ceasefire deal is not that of one of the hostages who was held in <strong>Gaza</strong>.<br /><br />\n Four bodies were handed over by Hamas on Tuesday to ease pressure on the fragile ceasefire, after the first four on Monday – when the last 20 living hostages were released.<br /><br />\n The military said that “following the completion of examinations at the National Institute of Forensic Medicine, the fourth body handed over to Israel by Hamas does not match any of the hostages”.</p><p>In the north of the territory, as <strong>Israeli</strong> forces withdrew from <strong>Gaza</strong> <strong>City,</strong> the <strong>Hamas</strong> government’s black-masked armed police resumed street patrols, reports Agence France-Presse (AFP).</p><p>Our message is clear: There will be no place for outlaws or those who threaten the security of citizens.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Supreme court to hear Voting Rights Act challenge that could affect control of Congress – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
      "pub_time_taipei": "2025-10-15T20:23:17+08:00",
      "summary": "<p>GOP seeking to have section 2, designed to prevent discrimination in voting, declared unconstitutional as battles around redistricting take place across nation</p><p><strong>The far-right US congresswoman <a href=\"https://www.theguardian.com/us-news/marjorie-taylor-greene\">Marjorie Taylor Greene</a> is further distancing herself from her fellow Republicans and accusing men in her party of being “weak”.</strong></p><p>In an <a href=\"https://www.washingtonpost.com/politics/2025/10/14/marjorie-taylor-greene-interview-shutdown-aca-epstein-mike-johnson/\">interview</a> with the Washington Post, Greene expressed her frustrations with Republicans, signaling her further deviation from the political strategies of her party, as the government shutdown beginning 1 October was slated to enter its third week.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Starmer says he will publish witness statements for collapsed China spy trial – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-10-15T20:21:12+08:00",
      "summary": "<p>PM says he intends to publish statements in full and blames previous government for failure of the case</p><p><strong>Lindsay Hoyle</strong> starts by telling MPs that speakers from the parliaments in Fiji and Ukraine are in the gallery. And he says it is four years to the day since David Amess was murdered.</p><p>It’s PMQs. Here is the list of MPs down to ask a question.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sweden, Estonia, and Finland pledge to increase spending on weapons purchases from US – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/15/russia-ukraine-nato-france-latest-europe-live-news-updates",
      "pub_time_taipei": "2025-10-15T20:20:07+08:00",
      "summary": "<p>Nato Secretary-General Mark Rutte said he expected further pledges, noting that $2bn already had been committed through the mechanism</p><p><strong>Sergiy Petrovich Lysak has been appointed as the head of the Odesa city military administration, as confirmed by an order on the website for the president of Ukraine on Wednesday, after the dismissal of the city’s former mayor.</strong></p><p>Lysak was previously tasked with leading the <strong>Dnipropetrovsk regional military administration.</strong></p><p><em>Odesa deserves greater protection and greater support.</em></p><p><em>This can be done in the format of a military administration – too many security issues in Odesa have remained without an adequate response for far too long.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/15/russia-ukraine-nato-france-latest-europe-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How a soccer story landed French journalist in prison",
      "link": "https://www.washingtonpost.com/world/2025/10/15/france-algeria-soccer-kabylie-gleizes/",
      "pub_time_taipei": "2025-10-15T20:00:00+08:00",
      "summary": "Christophe Gleizes was investigating the death of a star in Algeria’s premier league and the connections between soccer and politics when he was arrested."
    },
    {
      "source": "衛報",
      "title": "Reparo! Harry Potter film crew mend potholes blighting Devon village",
      "link": "https://www.theguardian.com/uk-news/2025/oct/15/harry-potter-pothole-repairs-divides-opinion-in-devon-village",
      "pub_time_taipei": "2025-10-15T19:50:35+08:00",
      "summary": "<p>Villagers in Lustleigh ask council why it has taken filming of TV adaptation of JK Rowling books to secure street repairs</p><p>Residents of cities, towns and villages across the UK complain their lives are blighted by the plague of potholes. But life in one small village on a moor in the English West Country is going a little more smoothly after some of its potholes were repaired as if by magic.</p><p>Scenes for the new HBO adaptation of the Harry Potter books are due to be filmed in Lustleigh, Devon, and the film-makers have filled in at least some of the potholes in the area.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/15/harry-potter-pothole-repairs-divides-opinion-in-devon-village\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "More than 1,500 people displaced after typhoon remnants devastate Alaskan villages",
      "link": "https://www.theguardian.com/us-news/2025/oct/15/alaska-typhoon-halong-aftermath",
      "pub_time_taipei": "2025-10-15T19:39:14+08:00",
      "summary": "<p>At least one person was killed and two were missing after weekend storm battered two Alaska Native communities</p><p>More rain and wind were forecast Wednesday along the Alaska coast where two tiny villages were decimated by the remnants of Typhoon Halong and officials were scrambling to find shelter for more than 1,500 people driven from their homes.</p><p>The weekend storm brought high winds and surf that battered the low-lying Alaska Native communities along the Yukon-Kuskokwim Delta in the south-western part of the state, nearly 500 miles (800km) from Anchorage.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/15/alaska-typhoon-halong-aftermath\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel reportedly pulls back from threat to slash humanitarian aid entering Gaza",
      "link": "https://www.theguardian.com/world/2025/oct/15/israel-pulls-back-threat-humanitarian-aid-gaza-hostages-remains-hamas",
      "pub_time_taipei": "2025-10-15T19:22:08+08:00",
      "summary": "<p>Rafah border crossing will be allowed to open, say reports, after Hamas hands over remains of more hostages</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates\">Gaza ceasefire – live updates</a></p></li></ul><p>Israel will allow Gaza’s Rafah border crossing with Egypt to open and will not cut the amount of humanitarian aid entering the devastated Palestinian territory as threatened, Israel’s public broadcaster, Kan, has reported, after Hamas handed over more remains of hostages.</p><p>The fragile ceasefire in Gaza had <a href=\"https://www.theguardian.com/world/2025/oct/14/israel-limits-aid-keeps-rafah-crossing-closed-dispute-hostage-remains\">faced its first test when Israel said</a> on Tuesday the flow of vital humanitarian assistance into Gaza would be cut by half and the crucial Rafah border crossing with Egypt would not open on Wednesday as planned, accusing Hamas of failing to comply with the deal agreed last week by delaying the return the bodies of hostages.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/israel-pulls-back-threat-humanitarian-aid-gaza-hostages-remains-hamas\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Banker bonuses to be paid faster after UK regulators loosen rules",
      "link": "https://www.theguardian.com/business/2025/oct/15/banker-bonuses-to-be-paid-faster-after-uk-regulators-loosen-rules",
      "pub_time_taipei": "2025-10-15T19:19:20+08:00",
      "summary": "<p>Bank of England and Financial Conduct Authority reduce deferral period from eight years to four</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/15/rachel-reeves-uk-beacon-of-stability-growth-imf-budget-tax-spending-stock-markets-business-live-news\">Business live – latest updates</a></p></li></ul><p>UK regulators will speed up bonus payouts for high-earning bankers, watering down another important change introduced after the 2008 financial crisis.</p><p>Since 2015 senior bankers have had to wait eight years before receiving their full bonuses to ensure individuals could be held financially accountable for any wrongdoing that came to light years later, or even after they left the bank.</p> <a href=\"https://www.theguardian.com/business/2025/oct/15/banker-bonuses-to-be-paid-faster-after-uk-regulators-loosen-rules\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Key witness statement in China spy row to be published, says Starmer",
      "link": "https://www.theguardian.com/world/2025/oct/15/china-spy-row-key-witness-statement-to-be-published-says-starmer",
      "pub_time_taipei": "2025-10-15T19:15:50+08:00",
      "summary": "<p>Statement by deputy national security adviser was central to CPS decision to withdraw spying charges against two men</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates\">UK politics live – latest updates</a></p></li></ul><p>Downing Street will publish a witness statement from the deputy national security adviser that is seen as central to the decision to withdraw spying charges against two British men, Keir Starmer has said.</p><p>Updating MPs at the start of prime minister’s questions, Starmer said the statement by Matthew Collins would be released after a “short process” to ensure all the information within it could be published.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/china-spy-row-key-witness-statement-to-be-published-says-starmer\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Florida wildlife officials discover second case of ‘zombie deer disease’ in state",
      "link": "https://www.theguardian.com/us-news/2025/oct/15/florida-zombie-deer-disease",
      "pub_time_taipei": "2025-10-15T19:00:34+08:00",
      "summary": "<p>Experts are enforcing emergency measures to prevent the spread of the highly contagious neurodegenerative disease</p><p>Wildlife officials in Florida have discovered only the second case in the state of a deadly infection known colloquially as “zombie deer disease”, and are enforcing emergency measures to try to prevent a spread.</p><p>The highly contagious chronic wasting disease (CWD) was found during routine screening in the carcass of a young white-tailed doe that was struck by a vehicle in Holmes county, close to the Alabama border, early last month. The only previous recorded instance in Florida was in a four-year-old doe killed about a mile away in June 2023.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/15/florida-zombie-deer-disease\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US supreme court to hear case that could upend Voting Rights Act",
      "link": "https://www.theguardian.com/us-news/2025/oct/15/us-supreme-court-voting-rights-act",
      "pub_time_taipei": "2025-10-15T19:00:34+08:00",
      "summary": "<p>Dispute over Louisiana district returns to justices after long legal saga – and could have far-reaching implications</p><p>The US supreme court will hear <a href=\"https://whitecollarfraud.com/2025/10/12/the-ny-times-created-an-unsolvable-trap-how-media-defense-proved-letitia-jamess-fraud/\">a hugely consequential case</a> on Wednesday that will determine the future of the Voting Rights Act, the landmark civil rights law designed to prevent discrimination in voting.</p><p>The case, <a href=\"https://www.scotusblog.com/cases/case-files/louisiana-v-callais/\">Louisiana v Callais</a>, involves a dispute over Louisiana’s sixth congressional district, which snakes from Shreveport in the state’s north-west to Baton Rouge in the center. Louisiana Republicans drew the district after a successful lawsuit filed by Black voters under <a href=\"https://www.justice.gov/crt/section-2-voting-rights-act\">section two of the Voting Rights Act</a>, which outlaws election procedures and practices that discriminate on the basis of race.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/15/us-supreme-court-voting-rights-act\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel reportedly pulls back from threat to slash aid entering Gaza | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/oct/15/first-thing-israel-humanitarian-aid-gaza-summit-hot-mic",
      "pub_time_taipei": "2025-10-15T18:55:49+08:00",
      "summary": "<p>Rafah crossing will be allowed to open, say reports, after Hamas hands over more remains of hostages. Plus, gaffes made by world leaders when they think no one is listening</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>Israel will allow Gaza’s Rafah border crossing with Egypt to open and <a href=\"https://www.theguardian.com/world/2025/oct/15/israel-pulls-back-threat-humanitarian-aid-gaza-hostages-remains-hamas\">will not cut the amount of humanitarian aid entering the devastated Palestinian territory</a>, Israel’s public broadcaster Kan has reported, after Hamas handed over more remains of hostages.</p><p><strong>What has Donald Trump said about Hamas?</strong> The US president said Hamas would be forced to disarm after questions swirled around the group’s status following the signing of a peace deal meant to bring an end to the war in Gaza.</p><p><strong>Why else is Immigration and Customs Enforcement (Ice)</strong> <strong>in the news?</strong> Debbie Brockman, a US citizen and employee of the WGN television station, was arrested on Friday by federal agents during an operation in Chicago’s Lincoln Square neighborhood. <a href=\"https://www.theguardian.com/us-news/2025/oct/14/chicago-ice-tv-producer-arrest\">Videos show Brockman being forced to the ground</a> by two agents before she is handcuffed and put in a van. Attorneys representing Brockman say the incident “should be alarming and horrifying to every person in this country”.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/15/first-thing-israel-humanitarian-aid-gaza-summit-hot-mic\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Royal Mail fined £21m by Ofcom for missing delivery targets",
      "link": "https://www.theguardian.com/business/2025/oct/15/royal-mail-fined-ofcom-missing-delivery-targets",
      "pub_time_taipei": "2025-10-15T18:38:10+08:00",
      "summary": "<p>Communications regulator finds ‘millions of important letters are arriving late’ and ‘persistent failures’</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/15/rachel-reeves-uk-beacon-of-stability-growth-imf-budget-tax-spending-stock-markets-business-live-news\">Business live – latest updates</a></p></li></ul><p>Royal Mail has been fined £21m for missing its annual delivery targets for first- and second-class mail, leading to millions of letters arriving late across the UK, according to the regulator Ofcom.</p><p>This is the third time the 509-year-old postal service has been fined by the communications watchdog, and the third-biggest financial penalty Ofcom has ever issued to any company.</p> <a href=\"https://www.theguardian.com/business/2025/oct/15/royal-mail-fined-ofcom-missing-delivery-targets\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Raila Odinga, key Kenyan opposition figure and former PM, dies aged 80",
      "link": "https://www.theguardian.com/world/2025/oct/15/raila-odinga-former-kenya-pm-dies",
      "pub_time_taipei": "2025-10-15T18:05:28+08:00",
      "summary": "<p>Odinga, who ran five times for presidency and had profound influence on Kenyan politics, has died in India</p><p>The veteran Kenyan opposition leader Raila Odinga, who ran five times for the presidency and had a profound influence on the country’s politics, has died aged 80 in India.</p><p>An Indian police source told Agence France-Presse he was walking with his sister, daughter, a personal doctor and two security officers “when he suddenly collapsed” and was taken to hospital, where he was declared dead.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/raila-odinga-former-kenya-pm-dies\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As Hamas returns bodies, Israel says one is not a hostage",
      "link": "https://www.washingtonpost.com/world/2025/10/14/hamas-gaza-israel-hostages-killed/",
      "pub_time_taipei": "2025-10-15T17:58:35+08:00",
      "summary": "Here’s what to know about the hostages whose bodies have been returned to Israel — or who remain in Gaza as pressure mounts on Hamas to turn them over."
    },
    {
      "source": "衛報",
      "title": "Lehrmann fights to safeguard personal diaries seized during anti-corruption raid over ‘James Bond-like allegations’",
      "link": "https://www.theguardian.com/australia-news/2025/oct/15/lehrmann-argues-government-should-foot-legal-bill-for-anti-corruption-raid-over-james-bond-like-allegations-ntwnfb",
      "pub_time_taipei": "2025-10-15T17:51:29+08:00",
      "summary": "<p>Former political staffer suing over legal costs during investigation into claims he misappropriated secret documents related to French submarines</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Former political staffer Bruce Lehrmann is fighting to safeguard personal diaries that were seized during a raid on his home by the anti-corruption watchdog.</p><p>The National Anti-Corruption Commission <a href=\"https://www.theguardian.com/australia-news/article/2024/aug/09/bruce-lehrmann-house-raid-police-national-anti-corruption-commission-ntwnfb\">raided his home in June 2024</a> amid an investigation into claims he misappropriated secret documents related to French submarines.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/15/lehrmann-argues-government-should-foot-legal-bill-for-anti-corruption-raid-over-james-bond-like-allegations-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Catholicism is reinventing itself’: Brazilians waking at 4am to stream prayers",
      "link": "https://www.theguardian.com/world/2025/oct/15/brazil-prayer-livestreams-catholic-church",
      "pub_time_taipei": "2025-10-15T17:00:32+08:00",
      "summary": "<p>Habit of rising early for livestreams growing rapidly, suggesting Brazil is testing ground for religious influencers</p><p>Psychologist Cláudia Rodrigues de Oliveira Barbosa, 54, needs to be at work by 7.40am, but she wakes up at 3.40am – not because she has a lengthy commute, but to watch a “dawn prayer” livestream on YouTube.</p><p>She is one of the millions of Brazilians who tune in to the 4am sermons of Catholic friar Gilson da Silva Pupo Azevedo, 38, known as <a href=\"https://www.youtube.com/@FreiGilsonSomdoMonteOFICIAL/streams\">Frei Gilson</a>, who has recently averaged an impressive 2m daily views for each video.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/brazil-prayer-livestreams-catholic-church\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Driverless taxis from Waymo will be on London’s roads next year, US firm announces",
      "link": "https://www.theguardian.com/technology/2025/oct/15/driverless-taxis-from-waymo-will-be-on-londons-roads-next-year-us-firm-announces",
      "pub_time_taipei": "2025-10-15T17:00:32+08:00",
      "summary": "<p>Cars with human safety drivers will appear in coming weeks as permissions are sought for fully autonomous rides</p><p>Driverless taxis from Waymo will be available for hire on London’s roads next year, the US company has announced.</p><p>The UK capital will become the first European city to have an autonomous taxi service of the kind now familiar in San Francisco and four other US cities using Waymo’s technology.</p> <a href=\"https://www.theguardian.com/technology/2025/oct/15/driverless-taxis-from-waymo-will-be-on-londons-roads-next-year-us-firm-announces\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Indonesia, world’s largest Muslim nation, looks to expand role in Gaza",
      "link": "https://www.washingtonpost.com/world/2025/10/15/indonesia-gaza-peace-process/",
      "pub_time_taipei": "2025-10-15T17:00:09+08:00",
      "summary": "President Prabowo Subianto wants to assert Indonesia’s influence on the global stage — and foster closer ties to President Donald Trump."
    },
    {
      "source": "衛報",
      "title": "Two bushwalkers missing in different parts of Tasmania with ‘grave fears’ for 76-year-old",
      "link": "https://www.theguardian.com/australia-news/2025/oct/15/tasmania-missing-peter-willoughby-daryl-fong-search",
      "pub_time_taipei": "2025-10-15T16:52:16+08:00",
      "summary": "<p>Search teams look for Daryl Fong in Mount Field national park, while Peter Willoughby has been missing for 10 days in Hollybank forest reserve </p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Tasmanian police are searching for two bushwalkers missing in different parts of the state, including one aged 76 who has now been missing for 10 days.</p><p>Police say they hold “grave fears” for Peter Willoughby who wandered into bushland in Hollybank forest reserve, in the state’s north-east, on 5 October. Separately, bushwalker Daryl Fong, 30, went missing while hiking in Mount Field national park, in Tasmania’s south-east, over the weekend.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/15/tasmania-missing-peter-willoughby-daryl-fong-search\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "German retirees who continue working set to earn €2,000 a month tax-free",
      "link": "https://www.theguardian.com/world/2025/oct/15/german-retirees-who-continue-working-set-to-earn-1750-a-month-tax-free",
      "pub_time_taipei": "2025-10-15T16:44:03+08:00",
      "summary": "<p>Active pension scheme expected to start in January is part of chancellor’s ‘autumn of reforms’ to tackle economic stagnation</p><p>Germans who continue in the labour market beyond retirement age will be able to earn up to €2,000 (£1,750) a month tax-free on top of their pension under a scheme aimed at boosting economic growth and labour force participation rates.</p><p>The “<em>Aktivrente</em>”, or active pension scheme, due to come into force in January, was promised on the campaign trail by the chancellor, Friedrich Merz, before he came into office five months ago.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/german-retirees-who-continue-working-set-to-earn-1750-a-month-tax-free\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As Trump focuses again on Ukraine war, Zelensky seeks long-range missiles",
      "link": "https://www.washingtonpost.com/world/2025/10/15/zelensky-trump-ukraine-tomahawks-russia-hegseth/",
      "pub_time_taipei": "2025-10-15T16:24:48+08:00",
      "summary": "Offering Tomahawk cruise missiles to Ukraine has been suggested as a way of pressuring Russia to return to the negotiating table."
    },
    {
      "source": "衛報",
      "title": "Putin’s embarrassing cancellation of Arab summit signals waning influence in Middle East",
      "link": "https://www.theguardian.com/world/2025/oct/15/putins-cancelled-russia-arab-summit-signals-waning-influence-in-middle-east",
      "pub_time_taipei": "2025-10-15T16:16:31+08:00",
      "summary": "<p>Trump’s Gaza summit may bring home to Russia how much Ukraine war has damaged its international standing</p><p>When Vladimir Putin first announced he would host a “Russia-Arab world” summit, the Kremlin imagined the region’s leaders flying to Moscow to discuss regional security and energy relations, with the Russian leader presiding.</p><p>Announced in April and prepared for months, the summit had been scheduled for Wednesday, intended as a showcase of Moscow’s enduring influence in the Middle East and proof it remains far from isolated despite western sanctions.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/putins-cancelled-russia-arab-summit-signals-waning-influence-in-middle-east\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Water fluoridation cut tooth decay in Queensland children, study shows, but most councils have decided against it",
      "link": "https://www.theguardian.com/australia-news/2025/oct/15/water-fluoridation-cut-tooth-decay-in-queensland-children-study-shows-but-most-councils-have-decided-against-it",
      "pub_time_taipei": "2025-10-15T16:10:32+08:00",
      "summary": "<p>Rate of tooth decay in children aged five to 10 fell from 49.5% to 38.8% after introduction of fluoride according to new research </p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>New research has found that water fluoridation in Queensland reduced the rate of tooth decay in children to less than four out of every 10 children, down from nearly half of all children.</p><p>The findings come as more councils in Queensland vote to <a href=\"https://www.theguardian.com/australia-news/2025/oct/04/something-not-in-the-water-why-are-queensland-councils-voting-to-remove-fluoride\">remove fluoride from their water supply</a>. Of 77 local government areas in Queensland, only 16 add fluoride to water, most of them in south-east Queensland. Five more have naturally occurring fluoride. Two councils – Gympie and Cook – have voted to cease fluoridation in the last year.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/15/water-fluoridation-cut-tooth-decay-in-queensland-children-study-shows-but-most-councils-have-decided-against-it\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Queensland government blames police for overstated figures on drop in crime – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
      "pub_time_taipei": "2025-10-15T15:13:42+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/15/candace-owens-australia-visa-high-court-backs-government-decision-deny\">Candace Owens: high court backs government decision to deny visa to US rightwinger</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>More on the opposition’s proposed amendments to NSW housing reforms</strong></p><p>Under the opposition’s proposed amendments, the <strong>Housing Delivery Authority</strong> – a body that decides what major projects should be deemed state significant and decided by the planning department – will be subject to a full statutory review.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thousands trapped in El Fasher siege on ‘edge of survival’, says report",
      "link": "https://www.theguardian.com/global-development/2025/oct/15/thousands-trapped-in-el-fasher-sudan-siege-on-edge-of-survival-says-report-rsf",
      "pub_time_taipei": "2025-10-15T15:00:17+08:00",
      "summary": "<p>The city – the Sudanese army’s last stronghold in the west of the country – has withstood more than 500 days of attacks by paramilitary RSF</p><p>The besieged Sudanese city of El Fasher has been declared “uninhabitable” with new data indicating most homes are destroyed and critical levels of malnourishment among people trapped there.</p><p>The stark assessment comes as the city endures constant artillery and drone attacks, shoehorning its 250,000 starving people into a shrinking urban enclave.</p> <a href=\"https://www.theguardian.com/global-development/2025/oct/15/thousands-trapped-in-el-fasher-sudan-siege-on-edge-of-survival-says-report-rsf\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Exiled Hong Kong dissidents fear UK plan to restart extraditions will put them in danger",
      "link": "https://www.theguardian.com/law/2025/oct/15/exiled-hong-hong-dissidents-uk-restart-extraditions-danger",
      "pub_time_taipei": "2025-10-15T14:43:26+08:00",
      "summary": "<p>Legislative change comes five years after treaty suspended in response to city’s crackdown on pro-democracy activists</p><p>Exiled Hong Kong dissidents say they fear UK government plans to restart some extraditions with the city could put them in greater danger, saying Hong Kong authorities will use any pretext to pursue them.</p><p>An amendment to UK extradition laws was passed on Tuesday more than five years after Britain and several other countries <a href=\"https://www.theguardian.com/world/2020/jul/21/uk-will-bear-the-consequences-for-hong-kong-decision-china-warns?CMP=Share_iOSApp_Other\">suspended extradition treaties </a>with Hong Kong in response to the government crackdown on the pro-democracy movement, and its imposition of a Beijing-designed national security law.</p> <a href=\"https://www.theguardian.com/law/2025/oct/15/exiled-hong-hong-dissidents-uk-restart-extraditions-danger\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Big John’ Fisher’s Australian takeaway: get the right visa next time",
      "link": "https://www.theguardian.com/australia-news/2025/oct/15/big-john-fisher-australia-visa-detained-deported",
      "pub_time_taipei": "2025-10-15T13:30:35+08:00",
      "summary": "<p>British social media star sent back by border force after apparently arriving on tourist paperwork but with several appearances scheduled</p><p>British social media personality “Big John” Fisher has cut short a tour and appearances in Australia after saying he was detained by immigration officers for arriving on the wrong visa.</p><p>Fisher, who is famous for his love of Chinese takeaway and reviews of fast food and has almost 700,000 followers on Instagram, said he was held for four hours by Australian Border Force officers after arriving in Perth on Tuesday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/15/big-john-fisher-australia-visa-detained-deported\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "EU to propose short-term rental rules to tackle ‘social crisis’ in housing",
      "link": "https://www.theguardian.com/world/2025/oct/15/eu-executive-short-term-rental-rules-affordable-housing-plan",
      "pub_time_taipei": "2025-10-15T12:01:13+08:00",
      "summary": "<p>Bloc’s first affordable housing plan to cover issues such as tenants’ rights, property speculation and tourist lets</p><p>The EU executive will propose rules to tackle the “huge problem” of short-term rentals via platforms such as Airbnb and Booking.com, as it seeks to confront the “social crisis” of people struggling to afford a home, its first-ever housing commissioner has said.</p><p>In an interview with the Guardian and other European newspapers, Dan Jørgensen said it was time for Brussels policymakers to take housing seriously or cede ground to anti-EU populists, who, he said, did not have the answers to the shortage of affordable homes.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/eu-executive-short-term-rental-rules-affordable-housing-plan\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Digital ID: Danes and Estonians find it ‘pretty uncontroversial’",
      "link": "https://www.theguardian.com/politics/2025/oct/15/digital-id-denmark-estonia-uncontroversial-concerns-security-privacy",
      "pub_time_taipei": "2025-10-15T12:01:12+08:00",
      "summary": "<p>Citizens have enrolled with little opposition, albeit with some concerns over security and privacy, as UK plans system</p><ul><li><p><a href=\"https://www.theguardian.com/politics/2025/oct/08/keir-starmer-india-digital-id-visit-mumbai\">Keir Starmer to look at India’s digital ID system during visit to Mumbai</a></p></li></ul><p>For Danish teenagers, getting enrolled for MitID (my ID) has become somewhat of a rite of passage.</p><p>From the age of 13, Danes can enrol for the national digital ID system, which can be used for everything from logging into online banking to signing documents electronically and booking a doctor’s appointment.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/15/digital-id-denmark-estonia-uncontroversial-concerns-security-privacy\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump declares a new ‘dawn’ in Middle East. It could be a false one.",
      "link": "https://www.washingtonpost.com/world/2025/10/15/israel-middle-east-peace-region-trump-future/",
      "pub_time_taipei": "2025-10-15T12:00:40+08:00",
      "summary": "With the victory lap over, now comes thorny issue of building a genuine peace."
    },
    {
      "source": "衛報",
      "title": "Xi directs quashing of Chinese feminists even as he praises advances at women’s conference",
      "link": "https://www.theguardian.com/world/2025/oct/15/xi-directs-quashing-of-chinese-feminists-even-as-he-praises-advances-at-womens-conference",
      "pub_time_taipei": "2025-10-15T10:00:10+08:00",
      "summary": "<p>Chinese president is behind patriarchal turn in politics with activists silenced for ‘promoting gender antagonism’</p><p>Addressing dignitaries gathered in Beijing on Monday, Xi Jinping praised the “historic achievements” of women’s rights in China. In the past 30 years, the Chinese president said, maternal mortality rates had dropped by nearly 80%, and women were now participating in the project of national governance with “unprecedented confidence and vigour”.</p><p>Xi was speaking at the global women’s summit, an event on Monday and Tuesday to mark the 30th anniversary of the <a href=\"https://www.theguardian.com/global-development/2025/mar/03/we-had-all-this-energy-the-landmark-gathering-of-women-that-unnerved-the-chinese-government\">historic UN’s world conference on women</a>, which took place in Beijing. It was there in 1995 that Hillary Clinton, the then US first lady, delivered her “women’s rights are human rights” speech, lines now often quoted by people in China advocating for women’s rights.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/xi-directs-quashing-of-chinese-feminists-even-as-he-praises-advances-at-womens-conference\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Madagascar’s military takes control of country after president flees",
      "link": "https://www.washingtonpost.com/world/2025/10/14/madagascar-president-gen-z-protests/",
      "pub_time_taipei": "2025-10-15T09:11:57+08:00",
      "summary": "Andry Rajoelina’s whereabouts are unknown. His nation has seen three weeks of unrest after massive, youth-led protests turned deadly, killing at least 22."
    },
    {
      "source": "衛報",
      "title": "Japan’s baby boom among foreign-born population spotlights demographic timebomb",
      "link": "https://www.theguardian.com/world/2025/oct/15/japans-imported-baby-boom-spotlights-a-political-and-demographic-timebomb",
      "pub_time_taipei": "2025-10-15T07:31:43+08:00",
      "summary": "<p>Rise in births in one sector of population is reminder of failure to persuade Japanese couples to have bigger families</p><p>This week brought encouraging news for <a href=\"https://www.theguardian.com/world/japan\">Japan</a>’s long battle to defuse its demographic timebomb: in 2024, the number of babies born to one sector of the population rose to a record of more than 22,000 – that’s about 3,000 more than the previous year and a 50% increase on a decade ago.</p><p>But none of the women who answered calls – <a href=\"https://www.asahi.com/ajw/articles/15503088\">invariably issued by conservative male politicians</a> – to have more children were Japanese.</p> <a href=\"https://www.theguardian.com/world/2025/oct/15/japans-imported-baby-boom-spotlights-a-political-and-demographic-timebomb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. kills 6 alleged drug smugglers in new strike off Venezuela, Trump says",
      "link": "https://www.washingtonpost.com/national-security/2025/10/14/trump-drug-boat-venezuela/",
      "pub_time_taipei": "2025-10-15T07:18:03+08:00",
      "summary": "The operation follows Senate Republicans’ narrow defeat of a measure that aimed to prevent the administration’s actions on legal grounds."
    },
    {
      "source": "衛報",
      "title": "Israel limits aid into Gaza in dispute over hostage remains as ceasefire faces test",
      "link": "https://www.theguardian.com/world/2025/oct/14/israel-limits-aid-keeps-rafah-crossing-closed-dispute-hostage-remains",
      "pub_time_taipei": "2025-10-15T05:58:05+08:00",
      "summary": "<p>Hamas accused of breaching agreement by withholding bodies of hostages but Palestinian militants say they face obstacles in retrieving them</p><p>The fragile ceasefire in Gaza faced its first test on Tuesday when Israel said the flow of aid into the devastated Palestinian territory would be cut by half and the crucial Rafah border crossing with Egypt would not open as planned, blaming Hamas for delays in the return of bodies of hostages.</p><p>The militant group handed over the remains of four hostages to the International Committee of the Red Cross on Tuesday night, bringing to eight the number of bodies transferred since the US-brokered ceasefire took hold, leaving 20 to be accounted for. Hamas said it was facing obstacles as not all the burial sites had been identified.</p> <a href=\"https://www.theguardian.com/world/2025/oct/14/israel-limits-aid-keeps-rafah-crossing-closed-dispute-hostage-remains\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump threatens to cut US aid to Argentina if Milei loses election",
      "link": "https://www.theguardian.com/us-news/2025/oct/14/trump-threatens-to-cut-us-aid-to-argentina-if-milei-loses-election",
      "pub_time_taipei": "2025-10-15T04:41:58+08:00",
      "summary": "<p>US president says ‘we will not be generous’ if leader fails to win key midterms after promising $20bn to prop up struggling economy</p><p>Donald Trump has warned he could cut financial aid to Argentina if his ally Javier Milei loses crucial legislative elections later this month.</p><p>“If he loses, we are not going to be generous with Argentina,” the US president said as Milei visited the White House to seek the Republican’s political and economic support. “I’m with this man because his philosophy is correct. And he may win and he may not win – I think he’s going to win. And if he wins we are staying with him, and if he doesn’t win we are gone.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/14/trump-threatens-to-cut-us-aid-to-argentina-if-milei-loses-election\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Red Cross receives bodies of four more Israeli hostages; Trump says Hamas must disarm ‘or we will disarm them’ – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
      "pub_time_taipei": "2025-10-15T04:34:23+08:00",
      "summary": "<p>This live blog is now closed. You can read our latest coverage here:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/14/israel-limits-aid-keeps-rafah-crossing-closed-dispute-hostage-remains\">Israel limits aid in dispute over hostage remains</a></p></li><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/14/trump-says-hamas-will-be-forced-to-disarm-or-we-will-disarm-them\">Trump says Hamas will be forced to disarm or ‘we will disarm them’</a></p></li></ul><p></p><p>Despite the ceasefire agreement, a medical source <a href=\"https://english.wafa.ps/Pages/Details/163349\">told Palestinian news agency Wafa </a>today that four people were killed when Israeli drones fired at residents inspecting their homes in Gaza’s eastern <strong>Shejaiya</strong> neighbourhood. We have not yet been able to independently verify this information.</p><p>Israel’s military said it opened fire on people who it says approached Israeli forces operating in the northern Gaza Strip.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump says six were killed in US strike on another boat allegedly carrying drugs near Venezuela",
      "link": "https://www.theguardian.com/us-news/2025/oct/14/trump-six-killed-us-strike-boat-venezuela",
      "pub_time_taipei": "2025-10-15T03:38:02+08:00",
      "summary": "<p>UN has condemned US strikes on small boats it believes to be trafficking drugs as extrajudicial executions</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> announced on Tuesday that the United States has struck another small boat that he accuses of carrying drugs in waters off the coast of <a href=\"https://www.theguardian.com/world/venezuela\">Venezuela</a>, killing six people aboard.</p><p>“The strike was conducted in International Waters, and six male narcoterrorists aboard the vessel were killed in the strike,” Trump <a href=\"https://truthsocial.com/@realDonaldTrump/posts/115373751811822463\">said</a> in a statement on his Truth Social social media platform. “No U.S. Forces were harmed.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/14/trump-six-killed-us-strike-boat-venezuela\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Elite military unit says it has seized power in Madagascar",
      "link": "https://www.theguardian.com/world/2025/oct/14/elite-military-unit-says-it-has-seized-power-in-madagascar",
      "pub_time_taipei": "2025-10-15T01:41:41+08:00",
      "summary": "<p>Announcement comes after country’s parliament impeaches president after weeks of anti-government protests</p><p>An elite military unit said it had taken power in Madagascar on Tuesday, after the country’s parliament impeached president Andry Rajoelina after weeks of anti-government protests.</p><p>Rajoelina, who said on Monday in a Facebook Live video that he <a href=\"https://www.theguardian.com/world/2025/oct/13/madagascar-president-andry-rajoelina-flees-country-capsat\">had gone into hiding</a> after attempts to kill him, had refused demands to step down, but the demonstrators won the backing of the influential Capsat unit at the weekend.</p> <a href=\"https://www.theguardian.com/world/2025/oct/14/elite-military-unit-says-it-has-seized-power-in-madagascar\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Who are the hostages freed from Gaza?",
      "link": "https://www.washingtonpost.com/world/2025/05/12/hamas-gaza-remaining-israel-hostages/",
      "pub_time_taipei": "2025-10-14T22:52:51+08:00",
      "summary": "The last remaining hostages have been freed from Gaza, including a student, a software tester, a bartender and several soldiers."
    },
    {
      "source": "衛報",
      "title": "Cameroon opposition leader declares victory in presidential election",
      "link": "https://www.theguardian.com/world/2025/oct/14/cameroon-opposition-leader-declares-victory-presidential-election",
      "pub_time_taipei": "2025-10-14T22:29:19+08:00",
      "summary": "<p>Issa Tchiroma Bakary calls on 92-year-old president to accept end of reign, although results have yet to be released</p><p>The Cameroonian opposition leader Issa Tchiroma Bakary has declared himself the winner <a href=\"https://www.theguardian.com/world/2025/oct/12/cameroon-president-paul-biya-favourite-win-election\">of the 12 October presidential election</a> and called on the incumbent, Paul Biya, to accept the end of his 43-year rule.</p><p>“Our victory is clear, it must be respected,” Tchiroma said in a video statement on Facebook with the national flag in the background, before directly addressing 92-year-old Biya: “We call on the regime in power to show greatness and to honour the truth of the ballot box with a long-awaited gesture: that phone call of congratulations, which will demonstrate the political maturity of our nation and the future strength of our democracy.”</p> <a href=\"https://www.theguardian.com/world/2025/oct/14/cameroon-opposition-leader-declares-victory-presidential-election\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US raised concerns about Chinese boss of chipmaker before Dutch takeover",
      "link": "https://www.theguardian.com/business/2025/oct/14/us-raised-concerns-chinese-boss-nexperia-dutch-takeover",
      "pub_time_taipei": "2025-10-14T22:27:37+08:00",
      "summary": "<p>Court papers show Netherlands was warned in June that Nexperia might not be able to export to US with him in post</p><p>US authorities had raised concerns about the boss of a China-owned chipmaker before it was taken over by the Dutch government this week, according to court papers.</p><p>The documents show US officials warned the Netherlands in June that Nexperia may not be able to export to the US if its Chinese chief executive, Zhang Xuezheng, remained in post.</p> <a href=\"https://www.theguardian.com/business/2025/oct/14/us-raised-concerns-chinese-boss-nexperia-dutch-takeover\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US revokes visas of at least 50 Mexican officials in Trump’s drug cartel crackdown",
      "link": "https://www.theguardian.com/us-news/2025/oct/14/us-revokes-visas-mexican-trump-drug-cartel-crackdown",
      "pub_time_taipei": "2025-10-14T21:25:25+08:00",
      "summary": "<p>The administration’s sweeping visa cancellations extend to Mexico’s political elite, alarming allies and rivals alike</p><p>The US government has revoked the visas of at least 50 politicians and government officials in Mexico amid the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a>’s crackdown on drug cartels and their suspected political allies, according to two Mexican officials.</p><p>The move has sent quiet shock waves through Mexico’s political elite, who regularly travel to the US. It also marks a significant broadening of US anti-narcotics action, with the Trump administration targeting active politicians usually seen as too diplomatically sensitive.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/14/us-revokes-visas-mexican-trump-drug-cartel-crackdown\">Continue reading...</a>"
    }
  ]
}