{
  "mode": "last_24h",
  "window_start_taipei": "2025-11-01T20:40:08.212675+08:00",
  "window_end_taipei": "2025-11-02T20:40:08.212675+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Cambridgeshire train stabbing: suspects both British and ‘nothing to suggest’ attack was terrorism, say police – latest updates",
      "link": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
      "pub_time_taipei": "2025-11-02T20:18:37+08:00",
      "summary": "<p>Two men have been arrested on suspicion of attempted murder as two people remain in a life-threatening condition</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/nov/02/two-men-in-police-custody-after-mass-stabbing-on-cambridgeshire-train\">Two men in custody after mass stabbing on Cambridgeshire train</a></p></li><li><p><a href=\"https://www.theguardian.com/uk-news/2025/nov/02/cambridgeshire-train-attack-what-we-know-so-far\">Cambridgeshire train attack: what we know so far</a></p></li></ul><p>Some more reaction is coming in.</p><p><strong>Kemi Badenoch, the Conservative leader</strong>, said she was “deeply disturbed” by the reports from Huntingdon.</p> <a href=\"https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK ‘to lose 600,000 workers to illness without better health support at work’",
      "link": "https://www.theguardian.com/money/2025/nov/02/uk-to-lose-600000-workers-to-illness-without-better-health-support-at-work",
      "pub_time_taipei": "2025-11-02T20:00:04+08:00",
      "summary": "<p>Exclusive: Royal Society of Public Health says ‘fundamental shift’ needed in how firms help those with health conditions</p><p>An extra 600,000 people will leave the British workforce in the next decade due to long-term health conditions unless ministers usher in “a fundamental shift” in how employers help maintain staff wellbeing, a report has warned.</p><p>More than 3.3 million adults are expected to become economically inactive by 2035, according to analysis by the Royal Society of Public Health (RSPH), costing the UK £36bn a year.</p> <a href=\"https://www.theguardian.com/money/2025/nov/02/uk-to-lose-600000-workers-to-illness-without-better-health-support-at-work\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The president who cried tariffs: will the US supreme court challenge Trump’s trade war?",
      "link": "https://www.theguardian.com/us-news/2025/nov/02/trump-tariffs-supreme-court",
      "pub_time_taipei": "2025-11-02T20:00:04+08:00",
      "summary": "<p>The US high court will hear arguments on whether Trump’s erratic imposition of global tariffs is legally valid</p><p>Donald Trump thrives on emergencies. He cried havoc on the very first day of his second term, declaring a national emergency caused by an “invasion” of “<a href=\"https://www.whitehouse.gov/presidential-actions/2025/01/declaring-a-national-emergency-at-the-southern-border-of-the-united-states/\">illegal aliens</a>” from Mexico. He has since invoked emergencies more than any president since the passage of the National Emergencies Act in 1976.</p><p>Next Wednesday, he faces another of his own making, as the US supreme court hears oral arguments on whether his globe-shaking signature economic policy – tariffs – is legally valid.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/02/trump-tariffs-supreme-court\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "He told the world what was happening in El Fasher. Then they sought him out. How Sudan lost ‘a true hero of the war’",
      "link": "https://www.theguardian.com/global-development/2025/nov/02/he-told-the-world-what-was-happening-in-el-fasher-then-they-sought-him-out-how-sudan-lost-a-true-hero-of-the-war",
      "pub_time_taipei": "2025-11-02T20:00:03+08:00",
      "summary": "<p>For months, Mohamed Khamis Douda shared accounts of what life was like under siege. He was killed when RSF fighters finally took the Darfur city, raising fears activists and civil society figures are being hunted down</p><p>For months, militiamen on the perimeters of El Fasher have asked those few who managed to escape the besieged Sudanese city whether Mohamed Khamis Douda was still inside. They shared videos threatening to kill him, which, as they hoped, made their way to the activist.</p><p>Even as the hunger and fear of living under siege and bombardment made him desperate to leave, Douda remained inside El Fasher, constantly working to let the outside world know what was happening to the people there. Then, on Sunday 26 October, Sudan’s paramilitary Rapid Support Forces <a href=\"https://www.theguardian.com/world/2023/oct/26/sudan-opposition-forces-rsf-say-they-have-seized-second-largest-city-nyala\">overran the city</a> and it was too late. His friends and family have confirmed to the Guardian that Douda has been killed.</p><p><strong>Monday</strong><strong> 4 August</strong></p><p>I awake each morning tired from the efforts of the previous day. Our first struggle is the merciless hunger and the second is the constant artillery shelling.</p> <a href=\"https://www.theguardian.com/global-development/2025/nov/02/he-told-the-world-what-was-happening-in-el-fasher-then-they-sought-him-out-how-sudan-lost-a-true-hero-of-the-war\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK charging industry could face £100m bill under business rate changes",
      "link": "https://www.theguardian.com/environment/2025/nov/02/uk-charging-industry-could-face-100m-bill-under-business-rate-changes",
      "pub_time_taipei": "2025-11-02T20:00:03+08:00",
      "summary": "<p>Industry bodies say proposals to make public charger operators pay the rates could harm the growing electric vehicles market</p><p>The UK charging industry has said it could face a £100m bill as the government considers making public charger operators pay business rates for the first time, at a time when <a href=\"https://www.theguardian.com/business/2025/may/19/weakening-of-uk-ev-sales-rules-likely-to-result-in-significantly-more-carbon-emissions\">slower-than-expected electric car sales</a> have put pressure on the sector.</p><p>ChargeUK, an industry body, said that its estimates suggest that operators will have to pay business rates on as many as 64,000 parking bays beside chargers which have not, up to now, been liable for the taxes. The lobby group said the change could add as much as £300 to the annual charging bill for some people if the cost is passed on to the customer.</p> <a href=\"https://www.theguardian.com/environment/2025/nov/02/uk-charging-industry-could-face-100m-bill-under-business-rate-changes\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Has OpenAI really made ChatGPT better for users with mental health problems?",
      "link": "https://www.theguardian.com/technology/2025/nov/02/openai-chatgpt-mental-health-problems-updates",
      "pub_time_taipei": "2025-11-02T20:00:02+08:00",
      "summary": "<p>Prompts indicating suicidal ideation got alarming replies, which experts say shows ‘how easy it is to break the model’</p><p>An OpenAI statement <a href=\"https://openai.com/index/strengthening-chatgpt-responses-in-sensitive-conversations/\">released this week </a>claimed the company had made its popular service ChatGPT better at supporting users experiencing mental health problems like suicidal ideation or delusions, but experts tell the Guardian they need to do more to truly ensure users are protected.</p><p>The Guardian tested several prompts indicating suicidal ideation with the ChatGPT GPT-5 updated model, which is now the default, and got alarming responses from the large language model (LLM) chatbot.</p> <a href=\"https://www.theguardian.com/technology/2025/nov/02/openai-chatgpt-mental-health-problems-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Two arrested after stabbing on U.K. train leaves ten injured",
      "link": "https://www.washingtonpost.com/world/2025/11/02/uk-train-stabbing-cambridgeshire/",
      "pub_time_taipei": "2025-11-02T19:51:39+08:00",
      "summary": "Police identified the suspects as two British men in their 30s and said the attack on the London-bound train did not appear to be terror-related."
    },
    {
      "source": "衛報",
      "title": "Ukraine deploys special forces to Pokrovsk in effort to hold key city",
      "link": "https://www.theguardian.com/world/2025/nov/02/ukraine-deploys-special-forces-to-pokrovsk-in-effort-to-hold-key-city",
      "pub_time_taipei": "2025-11-02T19:47:14+08:00",
      "summary": "<p>Escalating battle for city comes as overnight Russian drone and missile strikes kill six people, including two children</p><p>Ukraine has deployed special forces to the embattled eastern city of Pokrovsk in an attempt to push back an intense Russian assault involving thousands of troops, Kyiv’s top commander has said.</p><p>The escalating battle in the strategically important city comes as an overnight wave of Russian drone and missile attacks on Ukraine killed six people, including two children, and cut power to tens of thousands, officials said on Sunday.</p> <a href=\"https://www.theguardian.com/world/2025/nov/02/ukraine-deploys-special-forces-to-pokrovsk-in-effort-to-hold-key-city\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Five German climbers die in avalanche in northern Italy",
      "link": "https://www.theguardian.com/world/2025/nov/02/five-german-mountaineers-die-in-northern-italy-after-being-hit-by-avalanche",
      "pub_time_taipei": "2025-11-02T19:36:56+08:00",
      "summary": "<p>Mountaineers struck by avalanche on Saturday while climbing near the Cima Vertana, in the Ortles mountains</p><p>Five German mountaineers have died after being hit by an avalanche in northern Italy, rescuers said.</p><p>The bodies of three victims – two men and a woman – were recovered on Saturday, while the bodies of two other missing people, a man and his 17-year-old daughter, were found on Sunday morning.</p> <a href=\"https://www.theguardian.com/world/2025/nov/02/five-german-mountaineers-die-in-northern-italy-after-being-hit-by-avalanche\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two men in police custody after mass stabbing on Cambridgeshire train",
      "link": "https://www.theguardian.com/uk-news/2025/nov/02/two-men-in-police-custody-after-mass-stabbing-on-cambridgeshire-train",
      "pub_time_taipei": "2025-11-02T19:33:03+08:00",
      "summary": "<p>Two people left with life-threatening injuries after attack police say they are not treating as terrorist incident</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates\">Cambridgeshire train stabbing: latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/uk-news/2025/nov/02/cambridgeshire-train-attack-what-we-know-so-far\">Explainer: Cambridgeshire train attack – what we know so far</a></p></li></ul><p>Two men are in custody after multiple stabbings on a high-speed train in Cambridgeshire that left two people with life-threatening injuries, police have said.</p><p>A 32-year-old black British national and a 35-year-old Briton of Caribbean descent have been arrested, British Transport Police have said, after the incident on Saturday night after which 11 people were treated in hospital. It is not being treated as a terrorist incident.</p> <a href=\"https://www.theguardian.com/uk-news/2025/nov/02/two-men-in-police-custody-after-mass-stabbing-on-cambridgeshire-train\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Andrew to be stripped of naval title, says UK defence secretary",
      "link": "https://www.theguardian.com/uk-news/2025/nov/02/andrew-to-be-stripped-of-naval-title-says-uk-defence-secretary",
      "pub_time_taipei": "2025-11-02T18:49:22+08:00",
      "summary": "<p>Former Duke of York to lose honorary rank of vice-admiral a week after having royal title of prince removed</p><p>The former Duke of York will lose his naval title, the defence secretary has said, as King Charles looks to draw a line under the scandal over his brother’s relationship with the convicted sex offender Jeffrey Epstein.</p><p>Andrew Mountbatten Windsor will be stripped of his honorary rank of vice-admiral, which he was given in 2015 and has retained even after giving up other military positions in 2022, John Healey confirmed on Sunday.</p> <a href=\"https://www.theguardian.com/uk-news/2025/nov/02/andrew-to-be-stripped-of-naval-title-says-uk-defence-secretary\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "8 Palestinian factions meet to shape Gaza’s future – including Hamas",
      "link": "https://www.washingtonpost.com/world/2025/11/02/gaza-fatah-hamas-technocratic-committee/",
      "pub_time_taipei": "2025-11-02T18:00:47+08:00",
      "summary": "The militant movement is among eight Palestinian groups meeting in Cairo to hammer out proposed features of an interim administration for Gaza."
    },
    {
      "source": "華盛頓郵報",
      "title": "Charismatic leader emerges on the left to roil Britain’s political scene",
      "link": "https://www.washingtonpost.com/world/2025/11/02/zack-polanski-greens-uk-mamdani/",
      "pub_time_taipei": "2025-11-02T17:00:36+08:00",
      "summary": "Zack Polanski of the Greens has drawn comparisons to New York’s Zohran Mamdani as he connects with younger voters on social media over the political issues of the day."
    },
    {
      "source": "華盛頓郵報",
      "title": "India and China restored direct flights. Can relations take off again?",
      "link": "https://www.washingtonpost.com/world/2025/11/02/india-china-direct-flights-relations/",
      "pub_time_taipei": "2025-11-02T17:00:18+08:00",
      "summary": "India and China have resumed direct flights after a five-year lull, generating hope among Indian businesses. But doubts remain over how deep the thaw will go."
    },
    {
      "source": "衛報",
      "title": "Marjorie Taylor Greene tells Bill Maher she believes extraterrestrials are demons",
      "link": "https://www.theguardian.com/us-news/2025/nov/02/marjorie-taylor-greene-real-time-bill-maher",
      "pub_time_taipei": "2025-11-02T17:00:01+08:00",
      "summary": "<p>Georgia Republican lawmaker also claims she didn’t know Rothschild family, of her ‘space laser’ theory, was Jewish</p><p>Republican <a href=\"https://www.theguardian.com/us-news/house-of-representatives\">US House</a> member <a href=\"https://www.theguardian.com/us-news/marjorie-taylor-greene\">Marjorie Taylor Greene</a> has said she believes in demons, surmising that they might be aliens who fell from heaven, and claims to have been unaware that key figures in the antisemitic space lasers conspiracy she floated were Jewish.</p><p>She made those bizarre remarks as a guest on Friday on HBO’s Real Time With Bill Maher after winning some fans among <a href=\"https://www.theguardian.com/us-news/democrats\">Democrats</a> who once loathed her – yet had come to appreciate how the far-right Georgia representative had recently <a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/oct/19/marjorie-taylor-greene-breaks-republican-ranks\">broken with Republicans on various issues</a>. Those include healthcare, Gaza, the federal government shutdown that began on 1 October and the handling of documents pertaining to the late convicted sex offender Jeffrey Epstein, who was friends with <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> before the latter man won two presidencies.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/02/marjorie-taylor-greene-real-time-bill-maher\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rosalía’s Berghain is a thundrous goth-pop hit – but is it opera?",
      "link": "https://www.theguardian.com/music/2025/nov/02/rosalia-berghain-is-a-thundrous-goth-pop-hit-but-is-it-opera",
      "pub_time_taipei": "2025-11-02T16:00:01+08:00",
      "summary": "<p>The Catalan star’s epic new single is delighting and dividing classical music fans in equal measure</p><p>The Top 10 of today’s Spotify Global Top 50 looks like business as usual: two Taylor Swift songs; Lady Gaga and Bruno Mars’ Die With a Smile hanging around for an eighth month; the eminently normal male pop stars Sombr and Alex Warren doing brisk business.</p><p>But nestled among the crowd-pleasers is something of an outlier: a gothic, baroque assault powered by Vivaldi-style strings and operatic singing in German and Spanish.</p> <a href=\"https://www.theguardian.com/music/2025/nov/02/rosalia-berghain-is-a-thundrous-goth-pop-hit-but-is-it-opera\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sussan Ley under pressure as Nationals formally scrap net zero target",
      "link": "https://www.theguardian.com/australia-news/2025/nov/02/nationals-party-room-meeting-net-zero-emissions-target-david-littleproud",
      "pub_time_taipei": "2025-11-02T14:28:17+08:00",
      "summary": "<p>David Littleproud says he informed the Liberal leader days ago of the policy position his party was considering</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/02/nationals-net-zero-party-room-meeting-coalition-labor-murray-watt-anthony-albanese-apec-mark-butler-medicare-bulk-billing-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The National party has unanimously decided to scrap its net zero commitments after a party room meeting on Sunday, piling pressure on Sussan Ley and the Liberals as they continue to debate their own energy platform.</p><p>The party leader, David Littleproud, said the Nationals would focus on “aspirations” rather than targets and align Australia’s emissions reduction to other OECD countries. Littleproud said he was “proud” of the decision.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/02/nationals-party-room-meeting-net-zero-emissions-target-david-littleproud\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘What are they going to do, chase someone up?’ Victorian rock climbers scorn ban on Mount Arapiles Indigenous sites",
      "link": "https://www.theguardian.com/australia-news/2025/nov/02/victorian-rock-climbers-urge-people-defy-ban-indigenous-sites",
      "pub_time_taipei": "2025-11-02T14:23:20+08:00",
      "summary": "<p>State park contains rock art dating back at least 3,000 years and tens of thousands of artefacts</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Rock climbers are openly discussing flouting Victoria’s voluntary bans on routes near Mount Arapiles despite a plea from the state government to respect the area’s Indigenous heritage.</p><p>The area in the state’s west is regarded as among Australia’s premier rock climbing destinations. It also contains millennia-old rock art, among other significant Indigenous sites.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/02/victorian-rock-climbers-urge-people-defy-ban-indigenous-sites\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Three killed in US military strike on alleged drug vessel in the Caribbean",
      "link": "https://www.theguardian.com/us-news/2025/nov/02/three-killed-in-us-military-strike-on-alleged-drug-vessel-in-the-caribbean",
      "pub_time_taipei": "2025-11-02T14:19:08+08:00",
      "summary": "<p>Defense secretary announces a new strike on alleged drug smugglers in the Caribbean Sea, bringing total killed in US strikes to at least 64 people</p><p>The US military has carried out another lethal strike on alleged drug smugglers in the Caribbean Sea, US defense secretary Pete Hegseth said.</p><p>Hegseth said on Saturday the vessel was operated by a US-designated terrorist organization but did not name which group was targeted. He said three people were killed in the strike.</p> <a href=\"https://www.theguardian.com/us-news/2025/nov/02/three-killed-in-us-military-strike-on-alleged-drug-vessel-in-the-caribbean\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Decision to scrap net zero commitment shows Nationals ‘profoundly out of touch’, critics say – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/nov/02/nationals-net-zero-party-room-meeting-coalition-labor-murray-watt-anthony-albanese-apec-mark-butler-medicare-bulk-billing-ntwnfb",
      "pub_time_taipei": "2025-11-02T12:57:08+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/nov/02/nationals-party-room-meeting-net-zero-emissions-target-david-littleproud\">Nationals ‘proud’ to formally scrap net zero target after party room meeting</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Watt says Labor doesn’t have a policy to end native forest logging</strong></p><p>Asked if he wanted native forest logging to continue (it’s not banned in the legislation, despite the significant negative environmental impact that it has), Watt dodges the question by saying the party doesn’t have a specific policy of ending native forest logging.</p><p>What we have said, though, is that we will follow the recommendation from <strong>Graeme Samuel</strong> to apply national environmental standards to the regional forestry agreements that are used for native forestry, so what that means in practice is that native forestry would need to meet higher environmental standards than are currently required under the legislation. That’s a big step forward in terms of the environmental management of native forestry. But it doesn’t go as far as what the Greens party is seeking in being an all-out ban.</p><p>Not in its own right. We haven’t taken the approach of saying that particular projects are altogether banned. Every project will be assessed on its merits whether it be a coal and gas project, whether it be a housing and renewable project, they have all got to demonstrate they’re not having a significant impact on one of the nine matters of national environmental significance under the act.</p><p>If a coal or gas development was seeking approval, then it would need to meet the national environmental standards. It would need to avoid and minimise its environmental impacts and offset them to achieve a net gain. So they would be improvements compared to the criteria that apply to a project at the moment. If it was considered to have an unacceptable impact on the environment then it would get knocked back as would a housing development or a renewable project.</p><p>We’re not trying to sort of put in particular criteria for particular sectors. What we’re trying to do is put in a balanced package for all sorts of projects, for all industries, that deliver environmental and business gains.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/nov/02/nationals-net-zero-party-room-meeting-coalition-labor-murray-watt-anthony-albanese-apec-mark-butler-medicare-bulk-billing-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "LA Dodgers retain World Series after thrilling Game 7 win over Toronto Blue Jays",
      "link": "https://www.theguardian.com/sport/2025/nov/02/dodgers-win-world-series-game-7-blue-jays-baseball",
      "pub_time_taipei": "2025-11-02T12:34:39+08:00",
      "summary": "<ul><li><p>Game 7: LA Dodgers 5–4 Toronto Blue Jays</p></li><li><p>Will Smith’s 11th-inning home run proves decisive</p></li><li><p>Dodgers becomes first repeat champion since 2000</p></li><li><p><a href=\"https://www.theguardian.com/sport/live/2025/nov/01/world-series-game-7-los-angeles-dodgers-v-toronto-blue-jays-live-updates\">As it happened: Bryan Graham’s inning-by-inning report</a></p></li><li><p><a href=\"https://www.theguardian.com/sport/gallery/2025/nov/02/world-series-dodgers-global-reactions-japan-canada\">In pictures: Fans around world react to Dodgers’ epic win</a></p></li></ul><p>The Los Angeles Dodgers won their second consecutive title in stunning fashion in the early hours of Sunday morning, depriving the Toronto Blue Jays of a first World Series in 32 years in a stomach-churning, epic Game 7. Will Smith’s solo home run with two outs at the top of the 11th inning off Shane Bieber gave LA a 5-4 lead before Yoshinobu Yamamoto, pitching in relief just a day after throwing 96 pitches, got Alejandro Kirk to ground out into a World Series-ending double play, bringing a ninth title to the Dodgers organization.</p><p>“Man, they’re a special group of guys,” Smith said after the game. “We just never gave up, kept fighting, pitching our asses off, hitting, taking great at-bats. Finally punched through there. Man, that was a fight for seven games. That’s a really good <a href=\"https://www.theguardian.com/sport/toronto-blue-jays\">Toronto Blue Jays</a> team. I’m just excited. There’s nothing better than this.”</p> <a href=\"https://www.theguardian.com/sport/2025/nov/02/dodgers-win-world-series-game-7-blue-jays-baseball\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Maduro braces for a U.S. attack; Venezuelans worry more about dinner",
      "link": "https://www.washingtonpost.com/world/2025/11/01/maduro-venezuela-attack-economy/",
      "pub_time_taipei": "2025-11-02T11:57:22+08:00",
      "summary": "The government is urging civilians to prepare for the worst. Ordinary Venezuelans say they have more pressing concerns."
    },
    {
      "source": "衛報",
      "title": "Prestigious Ballarat Grammar banned from accepting new boarders amid child safety reports",
      "link": "https://www.theguardian.com/australia-news/2025/nov/02/ballarat-grammar-ban-new-boarders-child-safety-reports",
      "pub_time_taipei": "2025-11-02T11:52:24+08:00",
      "summary": "<p>School board apologises after regulator imposes six interim conditions while it conducts a review </p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/02/nationals-net-zero-party-room-meeting-coalition-labor-murray-watt-anthony-albanese-apec-mark-butler-medicare-bulk-billing-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Ballarat Grammar has apologised after the Victorian Registration and Qualifications Authority banned the prestigious school from accepting new boarding students until it proves it can comply with <a href=\"https://www.theguardian.com/society/childprotection\">child safety</a> standards.</p><p>On Friday evening the VRQA chief executive, Stefanie Veal, announced the regulator had imposed six interim conditions on the regional school’s boarding premises registration while it continued a review.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/02/ballarat-grammar-ban-new-boarders-child-safety-reports\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Passengers on ill-fated cruise ship flown home after Lizard Island death of 80-year-old",
      "link": "https://www.theguardian.com/australia-news/2025/nov/01/luxury-cruise-cancelled-after-80-year-old-left-behind-on-lizard-island-dies-alone",
      "pub_time_taipei": "2025-11-02T11:33:50+08:00",
      "summary": "<p>The Coral Adventurer will return to Cairns, as investigations into Suzanne Rees’ death continue</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/31/suzanne-rees-lizard-island-death-cruise-ship-coral-adventurer\">How luxury cruise ship passenger Suzanne Rees was left to die alone on Lizard island</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/nov/02/nationals-net-zero-party-room-meeting-coalition-labor-murray-watt-anthony-albanese-apec-mark-butler-medicare-bulk-billing-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p></p><p>All passengers on the ill-fated, luxury Coral Adventurer cruise have been disembarked and the ship is now sailing for Cairns where the investigation into the tragic death of passenger Suzanne Rees, 80, will continue.</p><p>The vessel stayed near Thursday Island in the Torres Strait while passengers packed their bags and left the ship, to board flights home.</p> <a href=\"https://www.theguardian.com/australia-news/2025/nov/01/luxury-cruise-cancelled-after-80-year-old-left-behind-on-lizard-island-dies-alone\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump threatens potential military action in Nigeria, says aid will cease",
      "link": "https://www.washingtonpost.com/world/2025/11/01/trump-nigeria-christians/",
      "pub_time_taipei": "2025-11-02T08:19:33+08:00",
      "summary": "The move is an escalation in the president’s campaign against the West African country’s government over allegedly failing to protect Christians."
    },
    {
      "source": "華盛頓郵報",
      "title": "Two additional suspects charged in Louvre jewel heist that shocked France",
      "link": "https://www.washingtonpost.com/world/2025/11/01/suspects-louvre-jewel-heist/",
      "pub_time_taipei": "2025-11-02T05:38:02+08:00",
      "summary": "Two more suspects have been charged for their alleged involvement in last month’s daytime heist at the Louvre,"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump administration tells Congress war law doesn’t apply to cartel strikes",
      "link": "https://www.washingtonpost.com/national-security/2025/11/01/trump-venezuela-war-drugs-law/",
      "pub_time_taipei": "2025-11-02T04:28:19+08:00",
      "summary": "The Office of Legal Counsel told select lawmakers that the executive branch is not bound by the War Powers Resolution, which requires congressional approval for any military action that exceeds 60 days."
    },
    {
      "source": "衛報",
      "title": "Veteran actor Tchéky Karyo, star of Nikita and The Missing, dies aged 72",
      "link": "https://www.theguardian.com/film/2025/nov/01/veteran-actor-tcheky-karyo-star-of-nikita-and-the-missing-dies-aged-72",
      "pub_time_taipei": "2025-11-02T03:47:41+08:00",
      "summary": "<p>French-Turkish actor appeared in a string of high-profile films, as well as hit BBC series The Missing</p><p>Tchéky Karyo, who appeared in some of director Luc Besson’s biggest hits and a string of international films, died on Friday at the age of 72, his family have announced.</p><p>A statement from his wife and children sent to AFP said he had “succumbed to cancer”.</p> <a href=\"https://www.theguardian.com/film/2025/nov/01/veteran-actor-tcheky-karyo-star-of-nikita-and-the-missing-dies-aged-72\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two more suspects charged over Louvre heist taking total to four",
      "link": "https://www.theguardian.com/world/2025/nov/01/two-more-suspects-charged-over-louvre-heist-taking-total-to-four",
      "pub_time_taipei": "2025-11-02T03:18:59+08:00",
      "summary": "<p>Woman, 38, and man, 37, had been arrested on Wednesday in relation to theft of £76m worth of jewellery in Paris </p><p>Two more suspects, a man and a woman arrested this week over the jewel heist at the Louvre, have been charged and remanded in custody, prosecutors have said.</p><p>The charges on Saturday brought to four the number of people now charged over the spectacular robbery.</p> <a href=\"https://www.theguardian.com/world/2025/nov/01/two-more-suspects-charged-over-louvre-heist-taking-total-to-four\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Canada’s prime minister apologized to Trump over Reagan anti-tariff ad",
      "link": "https://www.washingtonpost.com/world/2025/11/01/carney-trump-apologizes-canada-tariffs/",
      "pub_time_taipei": "2025-11-01T22:17:57+08:00",
      "summary": "President Donald Trump halted trade talks with Canada over the ad, which was paid for by the Ontario government and featured Ronald Reagan criticizing tariffs."
    },
    {
      "source": "衛報",
      "title": "How al-Qaida-linked jihadist group JNIM is bringing Mali to its knees",
      "link": "https://www.theguardian.com/world/2025/nov/01/how-al-qaida-linked-jihadist-group-jnim-is-bringing-mali-to-its-knees",
      "pub_time_taipei": "2025-11-01T22:00:35+08:00",
      "summary": "<p>Political instability and fuel shortages caused by rebel group is driving Mali to brink of becoming Islamist republic</p><p>Armed groups of JNIM fighters have blocked key routes used by fuel tankers, disrupting supply lines to the capital Bamako and other regions across Mali.</p><p>The al-Qaida-linked jihadist group <a href=\"https://www.theguardian.com/world/2025/jun/25/jihadist-ghost-enemy-jnim-sahel\">Jama’at Nusrat ul-Islam wa al-Muslimin </a>(JNIM) is gradually converging on Mali’s capital, Bamako, with increasing attacks in recent weeks, including on army-backed convoys.</p> <a href=\"https://www.theguardian.com/world/2025/nov/01/how-al-qaida-linked-jihadist-group-jnim-is-bringing-mali-to-its-knees\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "These are the U.S. ships and aircraft massing off Venezuela",
      "link": "https://www.washingtonpost.com/world/2025/11/01/venezuela-us-militarty-aircraft-carrier-ships-strikes-caribbean-trump-maduro/",
      "pub_time_taipei": "2025-11-01T21:22:19+08:00",
      "summary": "The large-scale buildup of U.S. military forces and assets in the Caribbean suggests that the Trump administration is preparing to expand operations."
    },
    {
      "source": "華盛頓郵報",
      "title": "Edward Cody, globe-trotting correspondent at The Post, dies at 82",
      "link": "https://www.washingtonpost.com/obituaries/2025/11/01/edward-cody-dead-foreign-correspondent/",
      "pub_time_taipei": "2025-11-01T21:00:36+08:00",
      "summary": "He reported on conflicts and disaster zones from Mexico to Lebanon. “Rarely in a career do you enjoy a task that is so solitary and intense,” he wrote."
    },
    {
      "source": "衛報",
      "title": "‘We don’t feel safe’: after week of bombings, people in Gaza are losing faith in ceasefire",
      "link": "https://www.theguardian.com/world/2025/nov/01/gaza-ceasefire-bombings-people-losing-faith",
      "pub_time_taipei": "2025-11-01T21:00:34+08:00",
      "summary": "<p>After initial enthusiasm, people fear ceasefire does not mean end to war but just less frequent, more unpredictable violence</p><p>Ameen al-Zein, like many in Gaza, was overjoyed by the news of the ceasefire. It was a rare moment of relief after years of fear and loss. On Tuesday night he gave an interview to a local NGO urging people to return to their homes in northern Gaza now that fighting had stopped. Just half an hour later, Zein was dead, killed in an Israeli bombing on the school where he had been sheltering in Beit Lahia, northern Gaza.</p><p>He died without being able to fulfil his vow to his wife that they would return to Beit Lahia and pitch a tent over the rubble, eager to be home even if their house was no longer there.</p> <a href=\"https://www.theguardian.com/world/2025/nov/01/gaza-ceasefire-bombings-people-losing-faith\">Continue reading...</a>"
    }
  ]
}