{
  "mode": "last_24h",
  "window_start_taipei": "2025-08-25T22:00:36.233498+08:00",
  "window_end_taipei": "2025-08-26T22:00:36.233498+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Work with partners on security guarantees ‘must be accelerated,’ Zelenskyy says - Europe live",
      "link": "https://www.theguardian.com/world/live/2025/aug/26/donald-trump-putin-zelenskyy-france-meeting-europe-live",
      "pub_time_taipei": "2025-08-26T21:49:12+08:00",
      "summary": "<p>Specifics on Ukraine’s defence should be detailed ‘in near future’ as Finnish president says Russia deploying a ‘typical’ delaying tactic</p><p><strong>A combat drone, presumed to be Ukrainian, went off course and exploded over Estonia without causing any casualties</strong>, the Baltic state and close Ukraine ally said on Tuesday, AFP reported.</p><p>Pieces of the drone, which left a crater on crashing, were <strong>discovered by an agricultural worker near the south-eastern town of Tartu</strong>, 75 kilometres (45 miles) from the border with Russia.</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/26/donald-trump-putin-zelenskyy-france-meeting-europe-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘No cause exists under the law’: Federal Reserve governor Lisa Cook responds to Trump’s move to fire her – live",
      "link": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
      "pub_time_taipei": "2025-08-26T21:46:18+08:00",
      "summary": "<p>Lisa Cook says she will not resign after Trump accused of ‘cobbling together’ mortgage fraud allegations against her</p><ul><li><p><a href=\"https://www.theguardian.com/business/2025/aug/25/trump-fires-federal-reserve-governor-lisa-cook\">Trump moves to fire Fed governor Lisa Cook</a></p></li></ul><p><strong>Lev Menand, a law professor at Columbia law school, said Donald Trump’s attempt to fire Federal Reserve chief Lisa Cook is a “procedurally invalid removal under the statute”.</strong></p><p>Menand, who authored a book about the Fed’s actions during the coronavirus pandemic, also said for-cause firings are typically related to misconduct while in office, rather than based on private misconduct from before an official’s appointment.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK retail shares fall amid fears of squeeze in consumer spending",
      "link": "https://www.theguardian.com/business/2025/aug/26/uk-retail-shares-fall-consumer-spending-primark-b-and-q",
      "pub_time_taipei": "2025-08-26T21:41:07+08:00",
      "summary": "<p>Parent groups of Primark and B&amp;Q hit as analysts say jobs and inflation concerns could affect sales</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/26/trump-fire-federal-reserve-governor-dollar-falls-markets-business-live-news\">Business live – latest updates</a></p></li></ul><p>Fears that UK consumers will rein in spending in the second half of this year has knocked the values of some of Britain’s biggest retailers including the parent groups of Primark and B&amp;Q, and DIY chain Wickes.</p><p>The retailers’ share prices dropped on Tuesday morning after analysts at Deutsche Bank warned that retail spending could be hit by <a href=\"https://www.theguardian.com/business/2025/jul/17/rise-in-uk-unemployment-and-slowing-wage-growth-add-new-pressure-for-interest-rate-cut\">the cooling UK jobs market</a> and easing growth in household income.</p> <a href=\"https://www.theguardian.com/business/2025/aug/26/uk-retail-shares-fall-consumer-spending-primark-b-and-q\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN demands investigations into Gaza hospital killings",
      "link": "https://www.theguardian.com/world/2025/aug/26/un-demands-investigations-into-gaza-hospital-killings",
      "pub_time_taipei": "2025-08-26T21:37:05+08:00",
      "summary": "<p>Second strike at Gaza hospital happened just as journalists and rescue crews arrived</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates\">Middle East crisis – live updates</a></p></li></ul><p>The UN has demanded that Israel’s investigations into unlawful killings in Gaza, including its “double tap” bombing of Nasser hospital which killed 20 people, including five journalists, yield results and ensure accountability.</p><p>“There needs to be justice,” Thameen Al-Kheetan, spokesperson for the UN’s human rights office, told reporters on Tuesday in Geneva. He added that the number of journalists killed in Gaza raised many questions about the targeting of media workers.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/un-demands-investigations-into-gaza-hospital-killings\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hundreds of senior diplomats call for EU to take urgent action over Gaza crisis – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
      "pub_time_taipei": "2025-08-26T21:36:18+08:00",
      "summary": "<p>Open letter has been signed by 209 former EU ambassadors, senior diplomatic staff and ambassadors from EU nation states</p><p>The UN says that Israel must not only investigate alleged unlawful killings in Gaza like the hospital strike that killed 20 people, including journalists, the previous day, but also ensure those probes yield results.</p><p>“There needs to be justice,” United Nations rights office spokesman Thameen Al-Kheetan told AFP in Geneva, adding that the large number of media workers killed in the Gaza war “raises many, many questions about the targeting of journalists”.</p><p>The Israeli authorities have, in the past, announced investigations in such killings.</p><p>It’s of course the responsibility of Israel, as the occupying power, to investigate - but these investigations need to yield results.</p> <a href=\"https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Farage’s plan to deport thousands of asylum seekers draws scorn from legal experts",
      "link": "https://www.theguardian.com/politics/2025/aug/26/nigel-farage-plan-deport-asylum-seekers-scorn-from-legal-experts",
      "pub_time_taipei": "2025-08-26T21:27:58+08:00",
      "summary": "<p>Reform UK leader told scheme is ‘simply not rooted in reality’ after he dodges questions on how it would work</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/aug/26/nigel-farage-mass-deportations-reform-migration-small-boats-uk-politics-live\">UK politics live – latest updates</a></p></li></ul><p>Nigel Farage’s plans to deport hundreds of thousands of asylum seekers, including women and children, and withdraw the UK from vital human rights protections have triggered fierce condemnation from campaigners, legal experts and political opponents, who said the proposals would dismantle Britain’s postwar commitments and shred fundamental rights.</p><p>Unveiling Reform UK’s “Operation Restoring Justice” at a combative Oxford press conference, Farage claimed his party would detain and deport “absolutely anyone” arriving by small boat and ensure they are “never, ever allowed to stay”, insisting this would stop crossings “within days” and “save tens and possibly hundreds of billions of pounds”.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/26/nigel-farage-plan-deport-asylum-seekers-scorn-from-legal-experts\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Illinois governor hits back at Trump in Chicago national guard feud: ‘not in good shape’",
      "link": "https://www.theguardian.com/us-news/2025/aug/26/trump-chicago-national-guard-pritzker",
      "pub_time_taipei": "2025-08-26T21:24:16+08:00",
      "summary": "<p>Governor Pritzker says Trump is ‘not in good shape’ as president weighs sending troops into Chicago against local wishes</p><p>The Democratic governor of Illinois, <a href=\"https://www.theguardian.com/us-news/2025/aug/25/trump-national-guard-chicago-democrats\">JB Pritzker</a>, has hit back at <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> for commenting on his weight, saying the Republican president is himself “not in good shape” amid escalating tension over the possible deployment of the national guard on the streets of Chicago.</p><p>Trump said on Monday that Pritzker “ought to spend more time in the gym”. While successfully campaigning in 2024 for a second presidency that began in January, Trump said that the Illinois governor is “too busy eating” to lead his state.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/26/trump-chicago-national-guard-pritzker\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US groups demand release of American-Palestinian teen imprisoned by Israel",
      "link": "https://www.theguardian.com/us-news/2025/aug/26/american-palestinian-teenager-israeli-prison",
      "pub_time_taipei": "2025-08-26T21:24:06+08:00",
      "summary": "<p>More than 100 organizations advocate for freedom of 16-year-old dual citizen detained for more than six months</p><p>More than one hundred US human rights, faith-based and civil rights groups have demanded that the secretary of state, Marco Rubio, immediately secure the release of a 16-year-old dual American-Palestinian citizen who has been in an Israeli prison for six months over allegations of rock throwing.</p><p>The coalition, which includes the American-Arab Anti-Discrimination Committee, the Center for Constitutional Rights and Pax Christi USA, warned that Mohammed Zaher Ibrahim’s deteriorating health puts “his life on the line” and demanded urgent US intervention in the most significant organized pressure campaign on the imprisoned teenager’s case yet.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/26/american-palestinian-teenager-israeli-prison\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Oklahoma man charged after 11-year-old girl gives birth at home",
      "link": "https://www.theguardian.com/us-news/2025/aug/26/oklahoma-child-abuse-birth",
      "pub_time_taipei": "2025-08-26T21:08:26+08:00",
      "summary": "<p>DNA test tied man to newborn in case prosecutor calls among most serious, as girl’s mother also accused</p><p>An <a href=\"https://www.theguardian.com/us-news/oklahoma\">Oklahoma</a> man is facing charges of child sexual molestation after an 11-year-old girl in his orbit gave birth in her home, and her mother is accused of enabling abuse in a case that a local assistant district attorney called possibly “the most serious … I have ever prosecuted”.</p><p>The charges that the Muskogee county district attorney’s office filed against Dustin Walker, 34, on Monday came after a DNA test confirmed he was the father of the newborn at the center of the case, the Oklahoma news outlet KWTV reported, citing officials.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/26/oklahoma-child-abuse-birth\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Couple who died in Isle of Wight helicopter crash named",
      "link": "https://www.theguardian.com/uk-news/2025/aug/26/couple-who-died-in-isle-of-wight-helicopter-crash-named",
      "pub_time_taipei": "2025-08-26T20:57:59+08:00",
      "summary": "<p>Justyna Czoska, a horse riding instructor, and her partner, Wojtek Kowalkowski, died along with a third person </p><p>A couple who <a href=\"https://www.theguardian.com/uk-news/2025/aug/25/people-killed-isle-of-wight-helicopter-crash\">died in a helicopter crash</a> during the bank holiday on the Isle of Wight have been named by relatives.</p><p>Justyna Czoska, 52, a horse riding instructor, and her partner, Wojtek Kowalkowski, 49, from Bloxham, Oxfordshire, died after the aircraft crash-landed at about 9.24am on Monday between Shanklin and Whiteley Bank. The helicopter had taken off from Sandown airport 20 minutes earlier.</p> <a href=\"https://www.theguardian.com/uk-news/2025/aug/26/couple-who-died-in-isle-of-wight-helicopter-crash-named\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russia could back delay to ‘snapback’ of nuclear sanctions against Iran",
      "link": "https://www.theguardian.com/world/2025/aug/26/iran-nuclear-sanctions-delay-russia",
      "pub_time_taipei": "2025-08-26T20:25:56+08:00",
      "summary": "<p>Moscow willing to support six-month extension of deadline before punishments are reimposed, reports suggest</p><p>Russia and Iran could back an extended six-month deadline before European powers reimpose sweeping United Nations sanctions on Iran over its refusal to allow UN inspectors back into nuclear sites after the Israeli-US assault in June.</p><p>France, Britain and Germany – known as the E3 – have long threatened to trigger a “snapback” of sanctions at the UN security council before 18 October, when a largely defunct nuclear deal struck 10 years ago between Tehran and major powers expires.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/iran-nuclear-sanctions-delay-russia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The French film star, the fake Irish aristocrat and the missing €7m",
      "link": "https://www.theguardian.com/world/2025/aug/26/dany-boon-french-film-star-the-fake-irish-aristocrat-thierry-fialek-birles-and-the-missing-euros",
      "pub_time_taipei": "2025-08-26T20:07:39+08:00",
      "summary": "<p>Trial to open in Nice of Thierry Fialek-Birles, accused of an ‘elaborate fraud’ against the actor and director Dany Boon</p><p>One of France’s most popular actors will have a starring role in court when a fake Irish aristocrat goes on trial accused of cheating him out of millions of euros.</p><p>Dany Boon, director and star of Bienvenue chez les Ch’tis (Welcome to the Sticks), France’s biggest box office hit, says an alleged conman, who claimed to be an Oxford-educated maritime lawyer, stole nearly €7m (£6m) from him as part of an elaborate scam.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/dany-boon-french-film-star-the-fake-irish-aristocrat-thierry-fialek-birles-and-the-missing-euros\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Turkish transport minister fined after posting video of himself driving at 140mph",
      "link": "https://www.theguardian.com/world/2025/aug/26/turkish-transport-minister-fined-posting-video-himself-driving-140mph",
      "pub_time_taipei": "2025-08-26T19:05:59+08:00",
      "summary": "<p>Footage shared by Abdulkadir Uraloğlu under hashtag #TurkeyAccelerates inadvertently shows him speeding</p><p>Turkey’s transport minister has been given a speeding fine after posting a video of himself racing down a highway with the hashtag #TurkeyAccelerates.</p><p>On Sunday evening, Abdulkadir Uraloğlu <a href=\"https://x.com/a_uraloglu/status/1959664330603114908\">shared a video of himself</a> on X driving along a highway near the capital, Ankara, listening to folk songs and clips of speeches by President Recep Tayyip Erdoğan.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/turkish-transport-minister-fined-posting-video-himself-driving-140mph\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump says he is firing Fed governor Lisa Cook in escalating attack on bank’s independence | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/aug/26/first-thing-trump-says-he-is-firing-fed-governor-lisa-cook-in-escalating-attack-on-banks-independence",
      "pub_time_taipei": "2025-08-26T19:01:56+08:00",
      "summary": "<p>Cook has said that Trump has no authority to remove her from the job over over allegations she committed mortgage fraud. Plus, a look at the AI-led agency advocating for ‘AI rights’</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>Donald Trump has <a href=\"https://www.theguardian.com/business/2025/aug/25/trump-fires-federal-reserve-governor-lisa-cook\">said he is firing the Federal Reserve governor</a>, Lisa Cook, over a claim that she committed mortgage fraud, as he intensified his attack on the central bank’s independence.</p><p><strong>Why does Trump want Cook out?</strong> It would allow him to replace her with someone who could offer him more control over Fed policy, as his demands for lower interest rates have been ignored so far.</p><p><strong>What else is the committee seeking?</strong> It has also issued deposition subpoenas to figures including Bill and Hillary Clinton, former FBI director James Comey and former attorneys general Loretta Lynch, Eric Holder, Merrick Garland, William Barr and Jeff Sessions.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/26/first-thing-trump-says-he-is-firing-fed-governor-lisa-cook-in-escalating-attack-on-banks-independence\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Peers who do not participate enough in House of Lords face sack",
      "link": "https://www.theguardian.com/politics/2025/aug/26/peers-who-do-not-participate-enough-in-house-of-lords-face-sack",
      "pub_time_taipei": "2025-08-26T18:28:48+08:00",
      "summary": "<p>Ministers will also press ahead with plan for retirement age of 80 after bill abolishing remaining hereditary peers goes through</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/aug/26/nigel-farage-mass-deportations-reform-migration-small-boats-uk-politics-live\">UK politics live – latest updates</a></p></li></ul><p>Labour plans to remove peers who do not contribute enough to the House of Lords and to press ahead with plans for a retirement age of 80 from the upper house.</p><p><a href=\"https://www.telegraph.co.uk/politics/2025/08/25/house-of-lords-labour-plans-overhaul-sack/\">Writing for the Telegraph</a>, the leader of the House of Lords, Angela Smith, said a select committee would consider the next stage of Lords reform after the abolition of hereditary peers.</p> <a href=\"https://www.theguardian.com/politics/2025/aug/26/peers-who-do-not-participate-enough-in-house-of-lords-face-sack\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Norway wealth fund sells Caterpillar stake over Israel allegations",
      "link": "https://www.theguardian.com/world/2025/aug/26/norway-wealth-fund-excludes-caterpillar-over-israel-allegations",
      "pub_time_taipei": "2025-08-26T18:26:53+08:00",
      "summary": "<p>World’s largest wealth fund says it has excluded bulldozer maker and five Israeli banking groups on ethics grounds</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/26/trump-fire-federal-reserve-governor-dollar-falls-markets-business-live-news\">Business live – latest updates</a></p></li></ul><p>The world’s largest wealth fund has excluded Caterpillar, the construction equipment manufacturer, over Israel’s use of its bulldozers to destroy Palestinian property in Gaza and the West Bank.</p><p>Norway’s $2tn (£1.5tn) fund said on Monday it had excluded Caterpillar and five Israeli banking groups on ethics grounds.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/norway-wealth-fund-excludes-caterpillar-over-israel-allegations\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "One in four UK late-night venues have closed since 2020, figures show",
      "link": "https://www.theguardian.com/business/2025/aug/26/late-night-venues-closed-uk-night-time-deserts",
      "pub_time_taipei": "2025-08-26T17:51:15+08:00",
      "summary": "<p>Industry body calls for urgent tax cuts to save ‘cornerstones of community life’ and halt rise of ‘night-time deserts’</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/26/trump-fire-federal-reserve-governor-dollar-falls-markets-business-live-news\">Business live – latest updates</a></p></li></ul><p>More than one in four late-night venues have shut their doors since 2020, figures show, prompting lobbyists to warn that the UK faces a worrying rise in “night-time deserts” without urgent tax cuts.</p><p>Nearly 800 late-night businesses have been forced to close over the past five years, according to the Night Time Industries Association (NTIA), representing a 26.4% <a href=\"https://www.theguardian.com/business/2024/dec/27/calls-to-save-the-uks-ailing-nightclub-industry-after-another-year-of-closures\">contraction in the late-night sector overall</a>. That compares with a 14.2% contraction across the wider hospitality sector.</p> <a href=\"https://www.theguardian.com/business/2025/aug/26/late-night-venues-closed-uk-night-time-deserts\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Porepunkah shooting: police hunt ‘dangerous’ suspect who fled into bush after allegedly killing two officers ‘in cold blood’",
      "link": "https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area",
      "pub_time_taipei": "2025-08-26T17:30:37+08:00",
      "summary": "<p>Victoria police believe alleged offender is heavily armed and urge local residents to stay indoors</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/26/porepunkah-shooting-live-updates-victoria-police-active-incident-latest-news-ntwnfb\">Victoria police shooting live updates</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/26/victoria-police-shooting-what-we-know-so-far-ntwnfb\">What we know so far about the shooting in rural Australia</a></p></li></ul><p>A manhunt is under way after two Victorian police officers were “murdered in cold blood” and another wounded in a shooting at a rural property in the high country town of Porepunkah.</p><p>The Victorian police commissioner, Mike Bush, said the suspect – believed to be “heavily armed” – was still at large. Bush urged the wider community to stay indoors and said a “full deployment” was under way on Tuesday evening to find the suspect, who he described as “obviously a very dangerous person”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australian Jewish groups applaud expulsion of Iranian diplomats but say community faces renewed fears",
      "link": "https://www.theguardian.com/australia-news/2025/aug/26/australian-jewish-groups-applaud-expulsion-of-iranian-diplomats-but-say-community-faces-renewed-fears-ntwnfb",
      "pub_time_taipei": "2025-08-26T17:14:59+08:00",
      "summary": "<p>Adass Israel synagogue board member says announcement of Iran’s involvement in December arson attack has caused ‘general fear’ among congregation</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australian Jewish groups have applauded the government’s “entirely appropriate” move to expel the Iranian ambassador in light of Iran’s alleged connections to antisemitic attacks in Australia – but say the “horrendous” news has renewed fears among the already traumatised community.</p><p>Responding to news the Iranian Revolutionary Guard Corps will be <a href=\"https://www.theguardian.com/australia-news/2025/aug/26/iran-ambassador-expelled-australia-antisemitic-attacks-ntwnfb\">listed as a terrorist organisation</a> in Australia, Jewish community members said the action was welcome but overdue.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/26/australian-jewish-groups-applaud-expulsion-of-iranian-diplomats-but-say-community-faces-renewed-fears-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Dangerous’ suspect who allegedly killed two officers escaped into bush alone and is believed to be ‘heavily armed’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/aug/26/porepunkah-shooting-live-updates-victoria-police-active-incident-latest-news-ntwnfb",
      "pub_time_taipei": "2025-08-26T17:00:43+08:00",
      "summary": "<p>This blog has now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/26/police-attending-active-incident-at-rural-property-in-victoria-and-ask-people-to-avoid-the-area\">Porepunkah shooting: two Victoria police officers dead, one injured in attack at rural property</a></p></li><li><p><a href=\"https://www.theguardian.com/australia-news/2025/aug/26/victoria-police-shooting-what-we-know-so-far-ntwnfb\">What we know so far about the shooting in rural Australia</a></p></li></ul><p>Wangaratta police have confirmed there is still an “active incident” ongoing and are continuing to urge people to avoid the area.</p><p>In a statement published to its social media page a moment ago, the local police service said Victoria police “continues to respond to an incident at a property in Porepunkah”.</p><p>This is still an active incident and we will provide more information when it’s operationally safe to do so.</p><p>We ask people avoid the area.</p><p>Tonight’s Ordinary Council Meeting has also been postponed, and will be rescheduled for two weeks’ time. Further details will be provided at a later date.</p><p>We thank you for your patience and understanding.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/aug/26/porepunkah-shooting-live-updates-victoria-police-active-incident-latest-news-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "PM declines to comment on reports of other attacks orchestrated by Iran; Israel praises Australia for ‘principled stand’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/aug/26/australia-politics-live-labor-coalition-trades-ndis-environment-epa-anthony-albanese-sussan-ley-question-time-ntwnfb",
      "pub_time_taipei": "2025-08-26T16:49:47+08:00",
      "summary": "<p>This blog has now closed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>In the last parliament, the government had just reached a deal with the Greens and members of the crossbench, to get its environmental laws over the line.</p><p>Now that they’ve had to go back to the drawing board, the Coalition and the Greens will be approached for negotiation (as <strong>Murray Watt</strong> outlined a bit earlier).</p><p>We need laws that actually act on the climate crisis, protect nature. And of course, we will always stand for making sure everyone’s got a home, a roof over their heads in this wealthy country. So the offer’s there. We’re looking forward to those discussions with government. Or they can choose to do a deal that will just pave the way for more big business profits, trash nature and leave ordinary people behind with the Libs.</p><p><strong>It’s very clear that targeting or hitting hospitals, health workers and civilians is a breach of international law.</strong> We join with the rest of the international community in condemning this action.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/aug/26/australia-politics-live-labor-coalition-trades-ndis-environment-epa-anthony-albanese-sussan-ley-question-time-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "India’s supreme court orders inquiry into giant zoo run by son of Asia’s richest person",
      "link": "https://www.theguardian.com/world/2025/aug/26/india-supreme-court-giant-zoo-son-asia-richest-person-vantara",
      "pub_time_taipei": "2025-08-26T16:37:50+08:00",
      "summary": "<p>Activists claim Anant Ambani’s Vantara facility has no plan to return its endangered species to the wild</p><p>India’s supreme court has ordered an investigation into allegations of illegal animal imports and financial misconduct at a vast private zoo set up by the son of Asia’s richest person.</p><p>Vantara, which describes itself as the “world’s biggest wild animal rescue centre”, is run by Anant Ambani, a son of Mukesh Ambani, the billionaire head of the conglomerate Reliance Industries.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/india-supreme-court-giant-zoo-son-asia-richest-person-vantara\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australia’s move against Iran over antisemitic attacks hailed by Israel – but PM should not expect praise to last",
      "link": "https://www.theguardian.com/australia-news/2025/aug/26/australias-move-against-iran-over-antisemitic-attacks-hailed-by-israel-but-anthony-albanese-should-not-expect-praise-to-last-ntwnfb",
      "pub_time_taipei": "2025-08-26T15:56:08+08:00",
      "summary": "<p>Labor’s decisive response may counter criticism it has not pushed back enough against rising instances of antisemitism since 7 October</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/26/australia-politics-live-labor-coalition-trades-ndis-environment-epa-anthony-albanese-sussan-ley-question-time-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Back in January, the boss of the Australian federal police said it was investigating if bad actors overseas could be <a href=\"https://www.theguardian.com/australia-news/2025/jan/22/paid-actors-antisemitic-attacks-australia-pm-anthony-albanese-police-afp-ntwnfb\">paying to whip up antisemitism</a> and undermine social cohesion in Australia.</p><p>As the government struggled to counter an alarming, rapid spate of vandalism and violent attacks on synagogues and Jewish community sites in Sydney and Melbourne, commissioner Reece Kershaw said overseas groups might be recruiting locals to carry out crimes.</p> <a href=\"https://www.theguardian.com/australia-news/2025/aug/26/australias-move-against-iran-over-antisemitic-attacks-hailed-by-israel-but-anthony-albanese-should-not-expect-praise-to-last-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump threatens tariffs on countries that ‘discriminate’ against US tech",
      "link": "https://www.theguardian.com/us-news/2025/aug/26/donald-trump-tariffs-us-tech-uk-digital-services-tax-eu",
      "pub_time_taipei": "2025-08-26T15:11:52+08:00",
      "summary": "<p>Levies and restrictions could hit UK’s digital services tax and EU states such as France, Italy and Spain</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/26/trump-fire-federal-reserve-governor-dollar-falls-markets-business-live-news\">Business live – latest updates</a></p></li></ul><p>Donald Trump has threatened to impose tariffs and export restrictions on countries whose taxes, legislation and regulations target US big tech companies such as Google, Meta, Amazon and Apple.</p><p>In a post on his social media platform, Truth Social, the US president said: “Digital taxes, legislation, rules or regulations are all designed to harm, or discriminate against, American technology.”</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/26/donald-trump-tariffs-us-tech-uk-digital-services-tax-eu\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Cambodia MPs pass ‘chilling’ bill enabling citizenship to be stripped",
      "link": "https://www.theguardian.com/world/2025/aug/26/cambodia-treason-citizenship-law",
      "pub_time_taipei": "2025-08-26T10:28:08+08:00",
      "summary": "<p>Coalition of rights groups says law covering ‘collusion’ could be abused to stifle government’s opponents</p><p>Cambodian parliamentarians have passed legislation allowing people who “collude” with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.</p><p>Rights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/cambodia-treason-citizenship-law\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Protests erupt in Indonesia over privileges for parliament members and ‘corrupt elites’",
      "link": "https://www.theguardian.com/world/2025/aug/26/indonesia-protests-austerity-parliament-member-privileges",
      "pub_time_taipei": "2025-08-26T10:26:10+08:00",
      "summary": "<p>Controversy over housing allowance, which is almost 10 times minimum wage, comes amid President Prabowo Subianto’s austerity drive</p><p>Riot police have fired water cannon and rounds of teargas at thousands of stone-throwing protesters in <a href=\"https://www.theguardian.com/world/indonesia\">Indonesia’s</a> capital as anger over the lavish allowances of parliament members has fuelled public anger.</p><p>Thousands of students, workers and activists demonstrated outside the nation’s parliament on Monday against a monthly housing allowance of 50 million rupiah ($US3,075) for MPs, which is almost 10 times the Jakarta minimum wage.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/indonesia-protests-austerity-parliament-member-privileges\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump says he hopes to meet Kim Jong-un and raises prospect of US taking over some South Korean land",
      "link": "https://www.theguardian.com/us-news/2025/aug/25/trump-north-korea-kim-jong-un-lee-jae-myung",
      "pub_time_taipei": "2025-08-26T09:20:11+08:00",
      "summary": "<p>South Korean president Lee Jae Myung uses Oval Office meeting to encourage Trump to engage with North Korean leader</p><p>Donald Trump has said he wants to meet North Korean leader <a href=\"https://www.theguardian.com/world/kim-jong-un\">Kim Jong-un</a>, possibly this year, in an attempt to revive the <a href=\"https://www.theguardian.com/world/2019/feb/28/how-donald-trump-kim-jong-un-misread-each-other-hanoi-summit\">failed nuclear diplomacy</a> of his first term as US president.</p><p>“I’d like to have a meeting. I look forward to meeting with Kim Jong-un in the appropriate future,” Trump said during an occasionally awkward meeting at the Oval Office with South Korea’s new president, Lee Jae Myung, in which he raised the prospect of taking ownership of South Korean land that hosts a US military base.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/25/trump-north-korea-kim-jong-un-lee-jae-myung\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Piracy and armed robbery surge in the straits of Malacca and Singapore – report",
      "link": "https://www.theguardian.com/world/2025/aug/26/piracy-straits-of-malacca-singapore",
      "pub_time_taipei": "2025-08-26T07:46:01+08:00",
      "summary": "<p>In the first six months of this year there were 80 incidents of piracy and armed robbery in the strategic waterways</p><p>Incidents of piracy and armed robbery in the straits of Malacca and Singapore have nearly quadrupled in the strategic waterways this year, according to a new report from an anti-piracy monitoring group.</p><p>In the first six months of this year there were 80 incidents of piracy and armed robbery in the straits, according to ReCAAP’s Information Sharing Centre (ISC). In the same period last year there were 21 incidents.</p> <a href=\"https://www.theguardian.com/world/2025/aug/26/piracy-straits-of-malacca-singapore\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mexican drug lord ‘El Mayo’ pleads guilty to racketeering in New York",
      "link": "https://www.theguardian.com/us-news/2025/aug/25/ismael-zambada-el-mayo-pleads-guilty",
      "pub_time_taipei": "2025-08-26T01:44:40+08:00",
      "summary": "<p>Ismael Zambada was co-founder of Sinaloa cartel led by Joaquín ‘El Chapo’ Guzmán, now imprisoned in US</p><p>The Mexican drug lord <a href=\"https://www.theguardian.com/world/article/2024/jul/28/mexican-drugs-lord-el-mayo-captured-ismael-zambada-garcia-sinaloa\">Ismael “El Mayo” Zambada</a>, co-founder of the Sinaloa cartel, pleaded guilty to federal racketeering charges as well as running a criminal enterprise on Monday, more than a year since he was arrested in Texas after what has been described as a kidnapping.</p><p>“I recognize the great harm illegal drugs have done to the people in the United States and Mexico,” the 77-year-old Zambada said in court through a Spanish-language interpreter. “I apologize for all of it, and I take responsibility for my actions.”</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/25/ismael-zambada-el-mayo-pleads-guilty\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel bombed Gaza hospital a second time, killing rescuers, say health officials",
      "link": "https://www.theguardian.com/world/2025/aug/25/journalists-among-people-killed-by-israeli-strike-on-gaza-hospital",
      "pub_time_taipei": "2025-08-26T01:41:36+08:00",
      "summary": "<p>At least 20 people, including five journalists, died as they rushed to help those wounded in the first strike</p><p>Israel bombed the main hospital in southern Gaza on Monday and then struck the same spot again as rescuers and journalists rushed to help the wounded, killing at least 20 people including five journalists, health officials said.</p><p>The first strike hit the top floor of a building at the Nasser hospital, killing the Reuters journalist Hussam al-Masri and others. Journalists and rescuers then rushed to the scene to help the wounded, when a second bomb struck the same spot, 15 minutes later.</p> <a href=\"https://www.theguardian.com/world/2025/aug/25/journalists-among-people-killed-by-israeli-strike-on-gaza-hospital\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel’s attack on hospital in Gaza may constitute a war crime on many fronts",
      "link": "https://www.theguardian.com/world/2025/aug/25/israel-attack-gaza-hospital-may-constitute-war-on-many-fronts",
      "pub_time_taipei": "2025-08-26T00:49:02+08:00",
      "summary": "<p>Double-tap strike suggests killing of civilians, rescue workers and journalists deliberate and not a mistake</p><p>Israel’s twin strike on the Nasser hospital in Gaza, which killed five journalists including staff working for the Associated Press, Reuters, and Al Jazeera, is a potential violation of international law writ large.</p><p>The attack targeted a civilian building, specifically a hospital, in a <a href=\"https://www.theguardian.com/world/2025/aug/25/journalists-among-people-killed-by-israeli-strike-on-gaza-hospital\">reckless double-tap strike</a> that killed civilians, with rescue workers and journalists among them. All categories that should be protected under international law.</p> <a href=\"https://www.theguardian.com/world/2025/aug/25/israel-attack-gaza-hospital-may-constitute-war-on-many-fronts\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First human case of flesh-eating screwworm parasite confirmed in US",
      "link": "https://www.theguardian.com/us-news/2025/aug/25/new-world-screwworm-flesh-eating-parasite-case-us",
      "pub_time_taipei": "2025-08-25T22:32:35+08:00",
      "summary": "<p>HHS told Reuters patient had returned from El Salvador but beef industry said person had traveled from Guatemala</p><p>The US Department of Health and Human Services (HHS) on Sunday reported the first human case in the US of travel-associated <a href=\"https://www.theguardian.com/us-news/2025/jul/02/new-world-screwworm-fly-flesh-eating-maggot\">New World screwworm</a>, a flesh-eating parasite, from an outbreak-affected country.</p><p>The case, investigated by the <a href=\"https://www.theguardian.com/us-news/maryland\">Maryland</a> department of health and the US Centers for Disease Control and Prevention (CDC), was confirmed by the CDC as New World screwworm on 4 August – and involved a patient who returned from travel to El Salvador, an HHS spokesperson, Andrew G Nixon, said in an email to Reuters.</p> <a href=\"https://www.theguardian.com/us-news/2025/aug/25/new-world-screwworm-flesh-eating-parasite-case-us\">Continue reading...</a>"
    }
  ]
}