{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-10T20:40:10.143615+08:00",
  "window_end_taipei": "2025-09-11T20:40:10.143615+08:00",
  "items": [
    {
      "source": "華盛頓郵報",
      "title": "U.K. dismisses ambassador to U.S. over Epstein links",
      "link": "https://www.washingtonpost.com/world/2025/09/11/uk-withdraws-ambassador-peter-mandelson-epstein/",
      "pub_time_taipei": "2025-09-11T20:34:34+08:00",
      "summary": "British Prime Minister Keir Starmer fired Peter Mandelson after diplomats said “additional information” emerged about his links with convicted sex offender Jeffrey Epstein."
    },
    {
      "source": "衛報",
      "title": "Keir Starmer sacks Peter Mandelson over Jeffrey Epstein ties",
      "link": "https://www.theguardian.com/politics/2025/sep/11/keir-starmer-sacks-peter-mandelson-over-jeffrey-epstein-revelations",
      "pub_time_taipei": "2025-09-11T20:19:31+08:00",
      "summary": "<p>Foreign Office says extent of US ambassador’s friendship with disgraced financier not disclosed when he was appointed</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news\">UK politics live – latest updates</a></p></li></ul><p>Keir Starmer has sacked Peter Mandelson as ambassador to the US over his association with Jeffrey Epstein.</p><p>The Foreign Office minister Stephen Doughty told MPs that Mandelson had not disclosed the extent and depth of his friendship with Epstein, a convicted child sex offender, when he was appointed as the ambassador.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/11/keir-starmer-sacks-peter-mandelson-over-jeffrey-epstein-revelations\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN security council to hold emergency meeting as Poland plans no-fly zone after Russian drone incursion – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/11/europe-live-news-updates-poland-russia-drones-ukraine-war-latest",
      "pub_time_taipei": "2025-09-11T20:13:30+08:00",
      "summary": "<p>Poland is seeking to step up its defences with plans to restrict air traffic in the eastern part of the country</p><p><strong>Grynkewich</strong> now gets a specific question on <strong>Poland</strong>.</p><p>He speaks about how allied command operations worked in this case, with every level “doing exactly what they were supposed to do, which was to defend Alliance territory.”</p><p><em>“But when you’re when you’re an operational commander, and you have a capability and there’s an attack or an incursion into your airspace, <strong>the cost of the weapon doesn’t matter at that moment in time; you’re going to use it to defend our population.</strong>”</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/11/europe-live-news-updates-poland-russia-drones-ukraine-war-latest\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Charlie Kirk shooting latest: search for killer under way as Trump vows crackdown on ‘political violence’",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
      "pub_time_taipei": "2025-09-11T20:12:16+08:00",
      "summary": "<p>In an address delivered before the person who killed Kirk had even been identified, Donald Trump blamed ‘the radical left’ for the shooting</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing\">Police search for suspect amid condemnation of ‘targeted’ killing</a></p></li><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-death-political-violence-aftermath\">‘What have we become?’: shock across US political parties</a></p></li></ul><p>A <strong>UK</strong> offshoot of a <strong>US</strong> conservative group set up by <strong>Charlie</strong> <strong>Kirk</strong> is to hold a vigil in <strong>London</strong> after he was shot dead, reports the PA news agency.</p><p><strong>Turning Point UK</strong> has said its activists will gather on Friday evening by the <strong>Montgomery statue</strong> in <strong>Whitehall</strong> and called on others to “join us in remembering Charlie”.</p><p>It’s absolutely shocking, we’re heartbroken over here in the UK.</p><p>My thoughts this evening are with the loved ones of Charlie Kirk.</p><p>It is heartbreaking that a young family has been robbed of a father and a husband.</p><p>Political violence has no place in our societies.</p><p>Our thoughts and condolences are with his family.</p><p>An atrocious murder, a deep wound for democracy and for those who believe in freedom.</p><p>My condolences to his family, to his loved ones, and to the American conservative community.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Teenage girl stabbed twice in Southport attack relives day ‘like horror film on repeat’",
      "link": "https://www.theguardian.com/uk-news/2025/sep/11/southport-attack-inquiry-testimony-teenage-girl-stabbed",
      "pub_time_taipei": "2025-09-11T19:56:08+08:00",
      "summary": "<p>Schoolgirl victim tells inquiry she looked into killer’s ‘possessed’ eyes before he launched attack at dance workshop</p><p>A teenage girl who was stabbed twice in the Southport attack has described staring into the killer’s “possessed” eyes and reliving that day “like a horror film on repeat”.</p><p>The schoolgirl, who cannot be identified, told the public inquiry into the atrocity that it must explain how knife-obsessed Axel Rudakubana was able to carry out the murders.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/11/southport-attack-inquiry-testimony-teenage-girl-stabbed\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Doctor’s ‘dangerous’ vaccine claims at Reform UK conference to be examined by GMC",
      "link": "https://www.theguardian.com/politics/2025/sep/11/reform-uk-doctor-aseem-malhotra-vaccine-claims-gmc",
      "pub_time_taipei": "2025-09-11T19:48:14+08:00",
      "summary": "<p>Aseem Malhotra was criticised by Starmer at PMQs after linking king’s cancer to Covid vaccine at party conference</p><p>Comments by a controversial doctor who used a speech at Reform UK’s conference to link Covid vaccines to cancer in the royal family are being examined by the General Medical Council (GMC) amid mounting condemnation of him by senior medics.</p><p>The regulator, which is charged with upholding professional standards in UK medicine, is also progressing with an investigation into Aseem Malhotra, currently an adviser to Donald Trump’s health secretary, Robert F Kennedy, over a previous claim. It may consider whether to stop or limit his ability to work as a doctor in the UK in the interest of protecting the public.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/11/reform-uk-doctor-aseem-malhotra-vaccine-claims-gmc\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Peter Mandelson sacked for saying Epstein’s first conviction was wrong, minister says – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news",
      "pub_time_taipei": "2025-09-11T19:45:02+08:00",
      "summary": "<p>Foreign Office minister says ex-ambassador’s comment that Epstein’s conviction was wrongful ‘is new information’</p><p><strong>Stephen Doughty</strong>, a Foreign Office minister, is responding to the UQ about Peter Mandelson.</p><p>He starts by making the point that it is the anniversary of the “despicable” 9/11 terrorism attacks.</p><p>Keir Starmer must sack Peter Mandelson without further delay - and come clean about what he knew when, and whether he sanctioned blocking the publication of damaging material.<br /><br />\n UK government documents shouldn’t be hidden from the public just because they are damaging to the Labour party - and by backing Peter Mandelson to the hilt, the prime minister’s own reputation is now on the line.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Green energy entrepreneur calls on UK to subsidise North Sea oil and gas firms",
      "link": "https://www.theguardian.com/business/2025/sep/11/green-energy-entrepreneurs-urge-uk-allow-new-north-sea-oil-gas-projects",
      "pub_time_taipei": "2025-09-11T19:29:53+08:00",
      "summary": "<p>Dale Vince urges ministers to ‘optimise’ resources in fossil fuel basin to help smooth transition to renewables</p><p>One of Britain’s leading green industrialists has called on the government to offer subsidies to North Sea oil companies to help support a “just transition” to renewables.</p><p>Dale Vince, a Labour donor, urged ministers to “optimise” the remaining resources of the declining oil basin as the UK reduces its reliance on fossil fuels. The party has promised to <a href=\"https://www.theguardian.com/business/2025/mar/05/ban-on-new-drilling-confirmed-as-ministers-consult-on-north-sea-clean-energy-future\">ban new North Sea oil and gas projects</a>.</p> <a href=\"https://www.theguardian.com/business/2025/sep/11/green-energy-entrepreneurs-urge-uk-allow-new-north-sea-oil-gas-projects\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: Police search for suspect in Charlie Kirk shooting amid condemnation of ‘targeted’ killing",
      "link": "https://www.theguardian.com/us-news/2025/sep/11/first-thing-police-search-for-suspect-in-charlie-kirk-shooting-amid-condemnation-of-targeted-killing",
      "pub_time_taipei": "2025-09-11T18:58:21+08:00",
      "summary": "<p>Killing of the conservative activist in Utah remains ‘an active investigation’, say authorities. Plus, how not to lose hope in the fight against ecological disaster</p><p>Good morning.</p><p>Law enforcement were still searching on <a href=\"https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing\">Thursday for a suspect in the shooting of the conservative activist Charlie Kirk</a>, hours after the close ally of Donald Trump was killed at a Utah university, triggering bipartisan condemnation.</p><p><strong>How did it unfold?</strong> Local officials said the shooting was “believed to be a targeted attack” by a shooter from the roof of a building.</p><p><strong>What’s happening in response?</strong> Warsaw said Nato allies had made concrete proposals to boost its air defenses, with the UK considering deploying Typhoon jets as part of an enhanced air policing mission to protect Nato’s eastern flank.</p><p><strong>Why might Russia send drones into Poland?</strong> The Guardian’s defense and security editor, <a href=\"https://www.theguardian.com/world/2025/sep/10/drones-poland-post-alaska-escalation-russia-analysis\">Dan Sabbagh, dissects this question in his analysis</a>, suggesting that a desire to create fear, assess Nato’s air defenses and test the US’s commitment to the alliance may all be factors.</p><p><a href=\"https://www.theguardian.com/world/live/2025/sep/11/europe-live-news-updates-poland-russia-drones-ukraine-war-latest\">Head to our live blog for the latest updates.</a></p> <a href=\"https://www.theguardian.com/us-news/2025/sep/11/first-thing-police-search-for-suspect-in-charlie-kirk-shooting-amid-condemnation-of-targeted-killing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘The chaos is the point’: tumult as Covid vaccine boosters deployed under RFK Jr",
      "link": "https://www.theguardian.com/world/2025/sep/11/covid-vaccine-boosters-rfk",
      "pub_time_taipei": "2025-09-11T18:00:52+08:00",
      "summary": "<p>People attempting to obtain vaccine report major hurdles amid new limitations brought in by Trump health secretary</p><p>The first deployment of updated Covid shots under the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> has been plagued by access issues and misinformation amid confusion and chaos at US health agencies.</p><p>People attempting to get the <a href=\"https://www.theguardian.com/society/vaccines\">vaccines</a> say they have struggled to understand eligibility requirements, book appointments, process insurance claims, battle misinformation from pharmacists and obtain prescriptions from their doctors in some states. Such hurdles will disproportionately affect people of color and low-income people, experts say.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/covid-vaccine-boosters-rfk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Interstellar overhype: Nasa debunks claim about alien-made comet",
      "link": "https://www.theguardian.com/science/2025/sep/11/interstellar-comet-nasa-alien-made",
      "pub_time_taipei": "2025-09-11T18:00:50+08:00",
      "summary": "<p>Nasa dismisses theory by Harvard astronomer who suggested an object from beyond the solar system could be a relic from a distant civilization </p><p>Skywatchers at <a href=\"https://www.theguardian.com/science/nasa\">Nasa</a> have discounted a Harvard astronomer’s hypothesis that a rare interstellar object hurtling through our solar system is a relic from a civilization in another celestial neighborhood, and “could potentially be dire for humanity”.</p><p>Avi Loeb, head of Harvard University’s <a href=\"https://projects.iq.harvard.edu/galileo/home\">Galileo Project</a>, which searches for evidence of extraterrestrial intelligence, raised eyebrows by suggesting <a href=\"https://arxiv.org/pdf/2507.12213\">in a scientific paper</a> in July that <a href=\"https://science.nasa.gov/solar-system/comets/3i-atlas/\">Comet 3I/Atlas</a>, set for a close pass with Mars next month, could be artificially made.</p> <a href=\"https://www.theguardian.com/science/2025/sep/11/interstellar-comet-nasa-alien-made\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Utah Republican senator faces backlash over post condemning Kirk’s killing",
      "link": "https://www.theguardian.com/us-news/2025/sep/11/republican-senator-mike-lee-kirk-shooting-melissa-hortman",
      "pub_time_taipei": "2025-09-11T18:00:50+08:00",
      "summary": "<p>Only months ago, Mike Lee had posted disparaging tweets after Democrat Melissa Hortman and her husband were fatally shot</p><p>The official X account of Mike Lee, a Republican US senator, drew backlash after quickly condemning Wednesday’s killing of <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">influential conservative activist Charlie Kirk</a> in Utah – less than three months from when the politician initially responded to the shootings of two Minnesota Democratic lawmakers by boosting misinformation about that case.</p><p>A <a href=\"https://x.com/SenMikeLee/status/1965880323067003011\">post</a> from Lee, who joined the Senate in 2011, denounced Kirk’s murder as “a cowardly act of violence” while hailing the Turning Point USA executive director as an “American patriot” and “inspiration to countless young people”. His post also solicited prayers for the 31-year-old Kirk’s widow, Erika, and their children.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/11/republican-senator-mike-lee-kirk-shooting-melissa-hortman\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "China and Russia sign more deals, but Beijing keeps the upper hand",
      "link": "https://www.washingtonpost.com/world/2025/09/11/russia-china-relations-deepen/",
      "pub_time_taipei": "2025-09-11T17:05:26+08:00",
      "summary": "Russia and China deepened their “friendship without limits” but Vladimir Putin didn’t get everything he wanted, underscoring his junior status in the partnership."
    },
    {
      "source": "衛報",
      "title": "After crafting quiet Florida life, Shah of Iran’s alleged ‘chief torturer’ must now face trial",
      "link": "https://www.theguardian.com/world/2025/sep/11/parviz-sabeti-shah-iran-lawsuit",
      "pub_time_taipei": "2025-09-11T17:00:32+08:00",
      "summary": "<p>Parviz Sabeti crafted an anonymous new life for his family – but now he faces a $225m lawsuit for atrocities committed in prisons in Tehran and elsewhere</p><p>Neighbors in the upscale Florida community of Windermere know them as Peter and Nancy, the seemingly friendly retired couple they wave to on morning walks, and who always appear to enjoy visits from their two high-flying grown daughters, one a respected professor of science at Harvard University.</p><p>Yet behind the high walls of their $3.6m lakefront mansion lies a darker, more closely guarded reality: “Peter” is actually Parviz Sabeti, the alleged head of secret police and chief torturer of the former Shah of Iran’s pre-revolutionary government, now facing a <a href=\"https://iranjusticecollective.org/wp-content/uploads/2025/02/Complaint.pdf\">$225m lawsuit</a> in Florida for atrocities committed in prisons in Tehran and elsewhere.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/parviz-sabeti-shah-iran-lawsuit\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Inside India’s hidden war against one of the world’s oldest insurgencies",
      "link": "https://www.washingtonpost.com/world/2025/09/11/india-maoists-naxals-rebels-bastar/",
      "pub_time_taipei": "2025-09-11T17:00:13+08:00",
      "summary": "As the Indian government escalates its campaign against Maoist rebels, villagers say the issues underlying the insurgency remain unresolved."
    },
    {
      "source": "衛報",
      "title": "Tasmanian museum kept and displayed 177 human remains without families’ knowledge, report finds",
      "link": "https://www.theguardian.com/australia-news/2025/sep/11/tasmanian-museum-kept-and-displayed-177-human-remains-without-the-families-knowing-report-finds-ntwnfb",
      "pub_time_taipei": "2025-09-11T16:14:26+08:00",
      "summary": "<p>University of Tasmania apologises, saying staff have met with families and will consider coroner’s findings</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Human specimens were collected, and in some cases publicly displayed, by a museum for decades without the knowledge or consent of families.</p><p>The University of Tasmania’s RA Rodda Museum collected remains from coronial autopsies from 1966 to 1991 for teaching and research purposes.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/11/tasmanian-museum-kept-and-displayed-177-human-remains-without-the-families-knowing-report-finds-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pocock says Bishop should be ‘reflecting on her position’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
      "pub_time_taipei": "2025-09-11T15:59:08+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/sep/11/anu-vice-chancellor-genevieve-bell-resigns-amid-crisis-of-confidence-in-leadership\">Julie Bishop vows to stay on as ANU chancellor after vice-chancellor resigns amid leadership crisis</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Some images from the wild weather across Sydney and NSW</strong></p><p><strong>Australia raises travel advice level for Nepal as Nepalese Australians express grief over unrest</strong></p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump offered to let S. Korean detainees stay, train U.S. workers, Seoul says",
      "link": "https://www.washingtonpost.com/world/2025/09/11/trump-south-korea-hyundai-raid-visas/",
      "pub_time_taipei": "2025-09-11T15:44:52+08:00",
      "summary": "The 316 South Koreans arrested at the Hyundai-LG plant in Georgia are expected to return home Friday. The raid may chill investment in the U.S., South Korea’s president said."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S-China calls stoke expectations that Trump may soon meet Xi",
      "link": "https://www.washingtonpost.com/world/2025/09/11/trump-xi-meeting-rubio-hegseth/",
      "pub_time_taipei": "2025-09-11T15:26:58+08:00",
      "summary": "Marco Rubio and Pete Hegseth, the secretaries of state and defense, spoke with their Chinese counterparts less than a week after Beijing held a muscular military parade."
    },
    {
      "source": "衛報",
      "title": "Two Victorian police officers charged with negligent manslaughter over man’s fatal 2024 arrest",
      "link": "https://www.theguardian.com/australia-news/2025/sep/11/two-victoria-police-officers-charged-with-negligent-manslaughter-luke-briggs-arrest-ntwnfb",
      "pub_time_taipei": "2025-09-11T15:24:26+08:00",
      "summary": "<p>Family of Luke Briggs, 35, left ‘utterly distraught’ by death in custody following arrest in Hoppers Crossing car park</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Negligent manslaughter charges have been laid against two Victorian police officers after a man died following his arrest in a car park, with the lawyer for his family saying they had been left distraught by his passing and delays in the case.</p><p>Luke Briggs, 35, was arrested in a convenience store car park at Hoppers Crossing, in Melbourne’s southwest, in July 2024. He became unresponsive at the scene and died eight days later at Royal Melbourne Hospital.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/11/two-victoria-police-officers-charged-with-negligent-manslaughter-luke-briggs-arrest-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sydney Water failed to properly test before declaring ‘no known Pfas hotspots’ in catchments, inquiry finds",
      "link": "https://www.theguardian.com/environment/2025/sep/11/sydney-water-erred-when-claiming-there-were-no-known-pfas-hotspots-in-drinking-water-catchments-committee-finds",
      "pub_time_taipei": "2025-09-11T14:45:53+08:00",
      "summary": "<p>More attention needs to be given to rapidly evolving issue of contamination of waterways with ‘forever chemicals’, committee’s chair says</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Sydney Water did not perform “an appropriate level of due diligence” before claiming there were no known <a href=\"https://www.theguardian.com/australia-news/2024/apr/09/australia-among-hotspots-for-toxic-forever-chemicals-study-of-pfas-levels-finds\">Pfas hotspots</a> within its drinking water catchments, a state parliamentary committee has found.</p><p>The New South Wales upper house committee tabled its <a href=\"https://www.parliament.nsw.gov.au/lcdocs/inquiries/3076/Report%20No%201%20-%20Select%20Committee%20on%20PFAS%20-%20Final%20version%20-%2011%20September%202025.pdf\">16 findings and 32 recommendations </a>on Thursday following an inquiry triggered by reporting in the Sydney Morning Herald that detected elevated levels of some “forever chemicals” in parts of Sydney’s drinking water catchment.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/11/sydney-water-erred-when-claiming-there-were-no-known-pfas-hotspots-in-drinking-water-catchments-committee-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Julie Bishop vows to stay on as ANU chancellor after vice-chancellor resigns amid leadership crisis",
      "link": "https://www.theguardian.com/australia-news/2025/sep/11/anu-vice-chancellor-genevieve-bell-resigns-amid-crisis-of-confidence-in-leadership",
      "pub_time_taipei": "2025-09-11T14:19:31+08:00",
      "summary": "<p>Genevieve Bell’s resignation follows tumultuous period marked by redundancies, proposed course closures and allegations of a toxic work culture</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Julie Bishop has vowed to stay on as chancellor of the Australian National University after the vice-chancellor tendered her resignation, ending a tumultuous two years at the institution marked by redundancies, proposed course closures and allegations of a toxic work culture.</p><p>Bishop confirmed on Thursday morning that Prof Genevieve Bell had resigned from ANU, with provost Rebekah Brown to be interim vice-chancellor until a replacement is found.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/11/anu-vice-chancellor-genevieve-bell-resigns-amid-crisis-of-confidence-in-leadership\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hong Kong criticised for rejecting bill giving ‘bare minimum’ rights to same-sex couples",
      "link": "https://www.theguardian.com/world/2025/sep/11/hong-kong-same-sex-couples-rights-bill-rejected",
      "pub_time_taipei": "2025-09-11T14:16:01+08:00",
      "summary": "<p>Legislative council voted down a bill that was introduced to comply with an order from the city’s top court</p><p>Human rights groups have accused the Hong Kong government of failing to provide the “bare minimum” of rights to same-sex couples after it rejected a bill that was introduced to comply with an order by the city’s top court.</p><p>The city’s unicameral legislative council (LegCo), on Wednesday rejected the bill by a vote of 71-14 after the second reading, following months of debate in the city between opponents who said it threatened family values and advocates who said the government was out of line with the majority of residents who supported same-sex relationships.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/hong-kong-same-sex-couples-rights-bill-rejected\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thursday briefing: Why Russia’s drone attack marks ‘a new level of hostility’ in the war",
      "link": "https://www.theguardian.com/world/2025/sep/11/thursday-briefing-why-russias-drone-attack-marks-a-new-level-of-hostility-in-the-war",
      "pub_time_taipei": "2025-09-11T13:41:55+08:00",
      "summary": "<p>In today’s newsletter: More than a dozen drones entered Polish airspace,  the first time in the war a Nato country has been pulled into direct military action – and an escalation Europe can’t ignore</p><p>Good morning. Less than a month ago, European leaders were sitting in the White House with Donald Trump, sketching out a path to peace for Ukraine. Fast forward to Wednesday and the Polish prime minister warned that the prospect of a large military conflict is “closer than at any time since the second world war”.</p><p>This is because Vladimir Putin has been drawing up his own plans, flying more than a dozen drones into Polish airspace. It is the closest the fighting has come to European homes and the first time a Nato country has been pulled into direct military action since the full-scale invasion of Ukraine began in 2022.</p><p><em><strong>US</strong></em> | Charlie Kirk, founder of rightwing youth activist group Turning Point USA and a close ally of Donald Trump, <a href=\"https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shot-utah\">was fatally shot</a> on Wednesday afternoon while speaking at Utah Valley University near Salt Lake City.</p><p><em><strong>UK news</strong></em><strong> </strong>| Keir Starmer was urged to <a href=\"https://www.theguardian.com/politics/2025/sep/10/starmer-urged-to-sack-mandelson-amid-epstein-business-deal-revelations\">sack Peter Mandelson as British ambassador to the US</a> after more details emerged of his close friendship and business dealings with the paedophile financier Jeffrey Epstein.</p><p><em><strong>Europe</strong></em> | A joint operation between several central European countries has identified an alleged <a href=\"https://www.theguardian.com/world/2025/sep/11/european-operation-identifies-alleged-belarusian-spy-ring\">Belarusian spy ring</a> that reportedly included a former deputy head of Moldovan intelligence.</p><p><em><strong>Iran</strong></em> | Tehran and the UN nuclear inspectorate have <a href=\"https://www.theguardian.com/world/2025/sep/10/un-inspectors-iran-nuclear-sites-breakthrough-deal\">reached an agreement</a> that will allow inspectors to return to inspect all of Iran’s nuclear sites, including those bombed by Israel and the US in June.</p><p><em><strong>Boris Johnson</strong></em> | The publisher of the Washington Post, Will Lewis, is facing <a href=\"https://www.theguardian.com/uk-news/2025/sep/10/washington-post-boss-will-lewis-secret-adviser-boris-johnson-leak\">fresh questions over his independence</a> after a cache of leaked files revealed he gave extensive support to Boris Johnson as a secret political adviser when Johnson was prime minister.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/thursday-briefing-why-russias-drone-attack-marks-a-new-level-of-hostility-in-the-war\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Flash floods in Indonesia leave at least 15 people dead and 10 missing",
      "link": "https://www.theguardian.com/world/2025/sep/11/flash-floods-indonesia-bali-deaths",
      "pub_time_taipei": "2025-09-11T12:58:57+08:00",
      "summary": "<p>Torrential rains cause flooding and landslides in East Nusa Tenggara province and on the tourist island of Bali</p><ul><li><p><a href=\"https://www.theguardian.com/world/gallery/2025/sep/11/flash-flooding-in-bali-indonesia-in-pictures\"><strong>Flooding in Bali, Indonesia – in pictures</strong></a></p></li></ul><p>Rescuers have recovered the bodies of 15 people who have died in flash flooding in two Indonesian provinces, while authorities said 10 others were missing.</p><p>Torrential rains beginning on Monday caused flooding and landslides in East Nusa Tenggara province and on the island of Bali.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/flash-floods-indonesia-bali-deaths\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
      "link": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
      "pub_time_taipei": "2025-09-11T12:01:22+08:00",
      "summary": "<p>Rights group also finds rise in openly gay, bisexual and transgender people running for office in 36 countries</p><p>Politicians in at least 51 countries used homophobic or transphobic rhetoric during elections last year, from depicting LGBTQ+ identity as a foreign threat to condemning “gender ideology”, according to a new study of 60 countries and the EU.</p><p>However, there were also gains for LGBTQ+ representation in some countries. Openly gay, bisexual and transgender people ran for office in at least 36 countries, including for the first time in Botswana, Namibia and Romania – albeit unsuccessfully – according to the report by Outright International. The number of LGBTQ+ elected officials doubled to at least 233 in Brazil.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Greenlandic women detail Danish forced contraception program in new report",
      "link": "https://www.washingtonpost.com/world/2025/09/10/denmark-forced-contraception-greenland/",
      "pub_time_taipei": "2025-09-11T09:17:57+08:00",
      "summary": "Denmark forced contraception on more than 350 Greenlandic Indigenous women and girls, who reported cases that date back to the 1960s."
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel threatens ‘enemies everywhere’ after strike against Hamas in Qatar",
      "link": "https://www.washingtonpost.com/world/2025/09/10/israel-qatar-strike-hamas/",
      "pub_time_taipei": "2025-09-11T07:09:24+08:00",
      "summary": "Qatar’s prime minister, Mohammed bin Abdulrahman al-Thani, said in an interview with CNN that the Israeli strike in Doha was “state terror.”"
    },
    {
      "source": "衛報",
      "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
      "link": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
      "pub_time_taipei": "2025-09-11T07:01:16+08:00",
      "summary": "<p>The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders</p><p>Press freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found.</p><p>According to the Stockholm-based <a href=\"http://www.idea.int/\" title=\"Original URL: http://www.idea.int/. Click or tap if you trust this link.\">International Institute for Democracy and Electoral Assistance (IDEA)</a>, democracy has declined in 94 countries over the last five years and only a third have made progress.</p> <a href=\"https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "France welcomes new prime minister with ‘block everything’ protests",
      "link": "https://www.washingtonpost.com/world/2025/09/10/france-protest-block-everything-macron-lecornu/",
      "pub_time_taipei": "2025-09-11T05:22:04+08:00",
      "summary": "Protesters staged disruptive protests across France in a display of anger and discontent over the country’s centrist government."
    },
    {
      "source": "華盛頓郵報",
      "title": "NATO says it scrambled fighter jets, shot down Russian drones over Poland",
      "link": "https://www.washingtonpost.com/world/2025/09/10/poland-russia-nato-drones-ukraine-war/",
      "pub_time_taipei": "2025-09-11T04:01:56+08:00",
      "summary": "The military called the breach of Poland’s airspace “unprecedented,” and it triggered a request by Warsaw to consult with fellow NATO members."
    },
    {
      "source": "華盛頓郵報",
      "title": "Tea with dad — Prince Harry meets King Charles for first time in 19 months",
      "link": "https://www.washingtonpost.com/world/2025/09/10/prince-harry-king-charles-reunion/",
      "pub_time_taipei": "2025-09-11T03:36:20+08:00",
      "summary": "The last time the pair met was in February 2024, the day after the palace announced that Charles was receiving treatment for an undisclosed form of cancer."
    },
    {
      "source": "衛報",
      "title": "Poland dismisses Russia’s claim drone incursion was unintentional as Ukraine calls for joint European air defence system – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
      "pub_time_taipei": "2025-09-11T03:31:13+08:00",
      "summary": "<p>This live blog is now closed. For the latest updates on this story, read our full report:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military\">Poland ‘closer to military conflict than at any time since WW2’ as Nato allies weigh response to drone incursion</a></p></li></ul><p>Lubelskie region governor Krzysztof Komorski is leading an emergency meeting with the police this morning. <br /><br />\n In a <a href=\"https://x.com/komorski4lbn/status/1965618423045689434\">post on X</a>, he urged residents to follow the guidance from the relevant authorities.</p><p>Prime minister Donald Tusk meanwhile said in <a href=\"https://x.com/donaldtusk/status/1965626207078437321\">his latest update</a> that he is in “constant contact” with Nato secretary general Mark Rutte.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli airstrikes ‘killed any hope’ for hostages in Gaza, says Qatari prime minister",
      "link": "https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas",
      "pub_time_taipei": "2025-09-11T03:27:05+08:00",
      "summary": "<p>Mohammed bin Abdulrahman bin Jassim al-Thani calls for Benjamin Netanyahu to be ‘brought to justice’</p><p>Qatar’s prime minister has said that Benjamin Netanyahu “killed any hope” for the remaining hostages in Gaza following Israel’s extraordinary strike on Hamas negotiators in Doha on Tuesday.</p><p>In an interview with CNN on Wednesday, Mohammed bin Abdulrahman bin Jassim al-Thani called the deadly strike in the Qatari capital an act of “state terror”. Israel’s attack the previous day killed six members of Hamas who were negotiating a ceasefire deal brokered by the US and other Gulf countries.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/israel-threats-outrage-qatar-strike-hamas\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Democrats pressure Trump to show proof deadly boat strike was legal",
      "link": "https://www.washingtonpost.com/national-security/2025/09/10/trump-drug-boat-strike-congress/",
      "pub_time_taipei": "2025-09-11T03:24:41+08:00",
      "summary": "The incident has frustrated lawmakers from both parties who have questioned why the administration has not publicly disclosed evidence to back up its claims."
    },
    {
      "source": "衛報",
      "title": "South Africa to reopen Steve Biko inquest 48 years after death in police custody",
      "link": "https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody",
      "pub_time_taipei": "2025-09-11T03:09:35+08:00",
      "summary": "<p>Death of anti-apartheid activist in 1977 after police beat him into a coma sparked outrage across the world</p><p>South African prosecutors will reopen an inquest into the death of the prominent anti-apartheid activist <a href=\"https://www.theguardian.com/world/2013/feb/18/steve-biko-south-africa-struggle\">Steve Biko</a>, nearly 50 years after he died in police custody.</p><p>Biko, the founder of South Africa’s Black Consciousness Movement, <a href=\"https://www.theguardian.com/world/2022/sep/14/steve-biko-dies-in-south-african-prison-cell-1977\">died in a prison cell in 1977 aged just 30</a>, after being beaten into a coma by police who had arrested him nearly a month earlier.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/south-africa-to-reopen-steve-biko-inquest-48-years-after-death-in-police-custody\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Poland ‘closer to military conflict than at any time since WW2’ as Nato allies weigh response to Russian drones",
      "link": "https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military",
      "pub_time_taipei": "2025-09-11T03:00:02+08:00",
      "summary": "<p>Donald Tusk says Poland dealing with a large-scale provocation after at least 19 violations of Polish airspace</p><p>Poland’s prime minister, Donald Tusk, said the country is closer to military conflict “than at any time since the second world war” as Warsaw and Nato allies weighed a response to an incursion of Russian drones into Polish airspace.</p><p>Poland scrambled its own and Nato air defences, shooting down at least three drones, as Russia’s attack on Ukraine spread to Nato territory early on Wednesday in the most significant way since the full-scale invasion more than three years ago.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Almost all German pilots admit to napping during flights in union survey",
      "link": "https://www.theguardian.com/world/2025/sep/10/about-93-of-pilots-admit-napping-during-flights-in-german-survey",
      "pub_time_taipei": "2025-09-11T02:08:51+08:00",
      "summary": "<p>Pilots’ union says the issue has become a ‘worrying reality’ as a result of staff shortages and operation pressure</p><p>A German pilots’ union has said that napping during flights has become a “worrying reality” for its members, as it sounded the alarm over “increasing fatigue” in the sector.</p><p>The Vereinigung Cockpit union said it had carried out a survey of more than 900 pilots in recent weeks, which found that 93% of them admitted to napping during a flight in the past few months.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/about-93-of-pilots-admit-napping-during-flights-in-german-survey\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Anti-Islamic biker gang members hired to run security at controversial Gaza aid sites",
      "link": "https://www.theguardian.com/world/2025/sep/10/anti-islamic-biker-gang-infidels-mc-gaza-aid-sites",
      "pub_time_taipei": "2025-09-11T02:00:45+08:00",
      "summary": "<p>More than 10 Infidels MC members deployed to sites run by US- and Israeli-backed Gaza Humanitarian Foundation</p><p>Senior members of an anti-Islamic biker gang have been hired by US contractors and deployed to <a href=\"https://www.theguardian.com/world/gaza\">Gaza</a> to oversee security at food distribution sites backed by the US and Israeli governments, <a href=\"https://www.bbc.com/news/articles/cm2zy4l8jgeo\">according to a BBC investigation</a>.</p><p>The investigation found that more than 10 members of Infidels MC, a US biker gang that uses the Crusader cross as its symbol and whose members have anti-Islamic tattoos, have been hired by UG Solutions and deployed to food aid sites run by the Gaza Humanitarian Foundation. According to the BBC, seven members of the gang are in “senior positions overseeing [GHF] sites”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/anti-islamic-biker-gang-infidels-mc-gaza-aid-sites\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "For first time, more children obese than underweight, UNICEF finds",
      "link": "https://www.washingtonpost.com/world/2025/09/10/child-obesity-unicef-global/",
      "pub_time_taipei": "2025-09-11T01:29:33+08:00",
      "summary": "Child obesity, once associated with wealthy countries, has become increasingly common in parts of the world where undernutrition was once more prevalent."
    },
    {
      "source": "衛報",
      "title": "Israeli military kills at least 41 people as it continues to order evacuation of Gaza City",
      "link": "https://www.theguardian.com/world/2025/sep/10/israeli-military-kills-at-least-people-as-it-continues-to-order-evacuation-of-gaza-city",
      "pub_time_taipei": "2025-09-11T00:45:26+08:00",
      "summary": "<p>Many of 1 million residents say they will not leave as they do not believe al-Mawasi humanitarian zone is safe</p><p>The Israeli military has killed at least 41 people in Gaza, including 12 aid seekers, over the last 24 hours as it continued to order the population of Gaza City to evacuate before its planned offensive.</p><p><a href=\"https://www.theguardian.com/world/2025/sep/09/israel-orders-gaza-city-residents-to-leave-as-military-prepares-to-occupy-city\">The evacuation orders</a> were accompanied by intensified Israeli bombing of the city, the Israeli military interspersing orders with announcements of high-rise towers they had bombed.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/israeli-military-kills-at-least-people-as-it-continues-to-order-evacuation-of-gaza-city\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Actors and directors pledge not to work with Israeli film groups ‘implicated in genocide’",
      "link": "https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians",
      "pub_time_taipei": "2025-09-11T00:34:14+08:00",
      "summary": "<p>Exclusive: Thousands of film workers join new boycott initiative criticized by Israeli producers’ group as ‘misguided’</p><p>Thousands of actors, directors and other film industry professionals have signed a new pledge vowing not to work with <a href=\"https://www.theguardian.com/world/israel\">Israeli</a> film institutions they say are “implicated in genocide and apartheid against the Palestinian people”.</p><p>“As film-makers, actors, film industry workers, and institutions, we recognise the power of cinema to shape perceptions” <a href=\"https://filmworkersforpalestine.org/#endingcomplicity\">the pledge</a> reads. “In this urgent moment of crisis, where many of our governments are enabling the carnage in Gaza, we must do everything we can to address complicity in that unrelenting horror.”</p> <a href=\"https://www.theguardian.com/film/2025/sep/08/film-pledge-israeli-institutions-palestinians\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Cuba hit with fifth blackout in less than a year with 10m people in the dark",
      "link": "https://www.theguardian.com/world/2025/sep/10/cuba-electricity-power-blackout",
      "pub_time_taipei": "2025-09-11T00:28:09+08:00",
      "summary": "<p>Grid failure follows string of nationwide blackouts that plunged antiquated power system into near-total disarray</p><p>Emergency crews were working to restore power to 10 million people on Wednesday as <a href=\"https://www.theguardian.com/world/cuba\">Cuba</a> suffered its fifth nationwide blackout in under a year, the energy ministry announced.</p><p>“There has been a total disconnection of the electric system,” the energy ministry and National Electric Union said early on Wednesday.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/cuba-electricity-power-blackout\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump asks EU to impose tariffs of up to 100% on India and China",
      "link": "https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia",
      "pub_time_taipei": "2025-09-10T23:59:45+08:00",
      "summary": "<p>In effort to end Russia’s war in Ukraine, US president proposes tariffs targeting Putin allies and trade partners</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news\">Business live – latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live\">Europe live – latest updates</a></p></li></ul><p>Donald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to end the war in Ukraine.</p><p>The US president made the demand during a meeting between US and EU officials discussing options to increase economic pressure on Russia on Tuesday, according to a White House official.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/trump-asks-eu-to-impose-high-tariffs-on-india-and-china-to-put-pressure-on-russia\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel escalates attacks on Gaza City as Qatar strike scuttles ceasefire talks",
      "link": "https://www.washingtonpost.com/world/2025/09/10/israel-gaza-city/",
      "pub_time_taipei": "2025-09-10T21:57:09+08:00",
      "summary": "Gaza City residents face an impossible choice as Israel steps up attacks: Escape and try to survive elsewhere in the enclave, or risk death."
    },
    {
      "source": "華盛頓郵報",
      "title": "What to know as Poland invokes NATO Article 4, citing Russian drone violation",
      "link": "https://www.washingtonpost.com/world/2025/09/10/poland-russia-ukraine-drone-article-4-nato/",
      "pub_time_taipei": "2025-09-10T20:59:16+08:00",
      "summary": "Poland accused Russia of violating its airspace 19 times overnight, during its bombardment of neighboring Ukraine. Moscow denies the drones are Russian."
    },
    {
      "source": "衛報",
      "title": "South Korean woman who bit off attacker’s tongue acquitted after 61 years",
      "link": "https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years",
      "pub_time_taipei": "2025-09-10T20:56:42+08:00",
      "summary": "<p> Choi Mal-ja’s appeal gained momentum after #MeToo movement inspired her to seek justice</p><p>A court in South Korea has acquitted a woman convicted six decades ago for biting off part of a man’s tongue during an alleged sexual assault, after she challenged the ruling, inspired by the country’s #MeToo movement.</p><p>Choi Mal-ja was 19 in 1964 when she was attacked by a 21-year-old man in the southern town of Gimhae. He pinned her to the ground and repeatedly forced his tongue into her mouth, at one point blocking her nose to stop her from breathing, according to court records.</p> <a href=\"https://www.theguardian.com/world/2025/sep/10/south-korean-woman-who-bit-off-attackers-tongue-acquitted-after-61-years\">Continue reading...</a>"
    }
  ]
}