{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-24T20:40:06.081062+08:00",
  "window_end_taipei": "2025-09-25T20:40:06.081062+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "BP predicts higher oil and gas demand, suggesting world will not hit 2050 net zero target",
      "link": "https://www.theguardian.com/business/2025/sep/25/bp-oil-and-gas-clean-energy-ukraine-middle-east-tariffs",
      "pub_time_taipei": "2025-09-25T20:25:20+08:00",
      "summary": "<p>Conflict in Ukraine and Middle East as well as trade tariffs are making states focus on energy security</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/25/co-op-cyber-attack-cost-it-80m-profits-loss-government-support-jlr-suppliers-business-live-news\">Business live – latest updates</a></p></li></ul><p>BP has raised its forecasts for oil and gas demand, suggesting global net zero target for 2050 will not be met, in the latest sign the transition to clean energy is decelerating.</p><p>The energy company’s closely watched outlook report has estimated that oil use is on track to hit 83m barrels a day in 2050, a rise of 8% compared with its previous estimate of 77m barrels a day.</p> <a href=\"https://www.theguardian.com/business/2025/sep/25/bp-oil-and-gas-clean-energy-ukraine-middle-east-tariffs\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Burnham claims he is ‘completely committed’ to his Greater Manchester mayoral job - UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live",
      "pub_time_taipei": "2025-09-25T20:24:14+08:00",
      "summary": "<p>Burnham says he loves ‘everything about this job’ and that he will support the Labour party ‘in whatever way I can’</p><p><strong>Sweeney</strong> asked about Northern Powerhouse Rail, and reports <a href=\"https://www.bbc.co.uk/news/articles/ckge94030g7o\">it is being shelved again</a>.</p><p><strong>Burnham</strong> said these reports were “disappointing”.</p><p>It feels always that projects in the southern half the country are green lighted but often red lighted up here.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sarkozy says he will ‘sleep in prison, but with head held high’ following guilty verdict in Libya trial – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live",
      "pub_time_taipei": "2025-09-25T20:21:55+08:00",
      "summary": "<p>Sarkozy found guilty of criminal conspiracy for receiving millions of euros from late Libyan dictator Muammar Gaddafi and will spend time in custody even if he appeals</p><p>Here is a bit more on that from Reuters:</p><p><em>Sarkozy, who has always denied the charges, <strong>was accused of making a deal with Gaddafi in 2005</strong>, when he was France’s interior minister, <strong>to obtain campaign financing in exchange for supporting the then-isolated Libyan government</strong> on the international stage.</em></p><p>…</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tory candidates must pledge support for leaving ECHR or stand down, says Jenrick",
      "link": "https://www.theguardian.com/politics/2025/sep/25/tory-candidates-must-pledge-support-for-leaving-echr-or-stand-down-says-jenrick",
      "pub_time_taipei": "2025-09-25T20:21:20+08:00",
      "summary": "<p>Shadow justice secretary demands that prospective MPs sign contract saying they stand for ‘Conservative values’</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live\">UK politics – latest updates</a></p></li></ul><p>Robert Jenrick has demanded that prospective Conservative candidates should either promise to support leaving the European convention on human rights or stand down.</p><p>As the party continues to debate whether to pledge to withdraw from the international agreement, the the shadow justice secretary said he would get candidates “to sign a contract to say they actually stand for Conservative values”.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/25/tory-candidates-must-pledge-support-for-leaving-echr-or-stand-down-says-jenrick\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Former FBI director James Comey expected to be indicted on criminal charges, reports say – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
      "pub_time_taipei": "2025-09-25T20:14:58+08:00",
      "summary": "<p>Comey has long been focus of Donald Trump, who sacked him from FBI role in early months of presidency</p><p>Donald Trump will welcome the president of Turkey, <strong>Recep Tayyip Erdoğan</strong>, to the White House today for a bilateral meeting.</p><p>He’ll welcome the Turkish leader at 11am EST, where we’ll get the opportunity to cover his arrival.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nicolas Sarkozy given five-year prison sentence after Libya trial",
      "link": "https://www.theguardian.com/world/2025/sep/25/nicolas-sarkozy-found-guilty-of-criminal-conspiracy-in-libya-trial",
      "pub_time_taipei": "2025-09-25T20:14:34+08:00",
      "summary": "<p>Former French president found guilty of criminal conspiracy after being accused of pact with Gaddafi regime</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live\">Europe – live updates</a></p></li></ul><p>The former French president Nicolas Sarkozy has been given a five-year prison sentence after being found guilty<strong> </strong>of criminal conspiracy in a trial in which he and aides were accused of making a <a href=\"https://www.theguardian.com/world/2025/sep/25/paris-court-to-rule-on-nicolas-sarkozy-corruption-charge\">corruption pact</a> with the regime of the late Libyan dictator Muammar Gaddafi to receive funding for the 2007 French presidential election campaign.</p><p>In a surprise ruling, the head judge, Nathalie Gavarino, handed down a special form of sentence that means Sarkozy, 70, will have to serve a prison term even if he appeals.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/nicolas-sarkozy-found-guilty-of-criminal-conspiracy-in-libya-trial\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "House Democrats to send letter to Trump on Friday urging US to recognize Palestinian statehood",
      "link": "https://www.theguardian.com/us-news/2025/sep/25/house-democrats-trump-palestinian-statehood",
      "pub_time_taipei": "2025-09-25T20:00:37+08:00",
      "summary": "<p>Exclusive: letter, led by Ro Khanna, has 46 signatories and calls for ‘long overdue need to recognize Palestinian self-determination’</p><p>Dozens of House <a href=\"https://www.theguardian.com/us-news/democrats\">Democrats</a> have signed a letter to <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> and secretary of state <a href=\"https://www.theguardian.com/us-news/marco-rubio\">Marco Rubio</a>, urging the administration to recognize Palestinian statehood.</p><p>The letter, led by California Democrat Ro Khanna, has 46 signatures, and lawmakers will send it to the US president on Friday, according to plans first provided to the Guardian.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/25/house-democrats-trump-palestinian-statehood\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Spotify removes 75m spam tracks in past year as AI increases ability to make fake music",
      "link": "https://www.theguardian.com/music/2025/sep/25/spotify-removes-75m-spam-tracks-past-year-ai-increases-ability-make-fake-music",
      "pub_time_taipei": "2025-09-25T20:00:35+08:00",
      "summary": "<p>Streamer to crack down on AI-generated spam by introducing filter to identify fraudulent uploads</p><p>Spotify has revealed it removed 75m spam tracks from its platform over the past year as artificial intelligence tools increase the ability of fraudsters to create fake music.</p><p>The world’s biggest music streaming service announced a crackdown on vexatious tracks after admitting the rise of powerful AI tools had coincided with a significant amount of spam content being tackled by the streamer.</p> <a href=\"https://www.theguardian.com/music/2025/sep/25/spotify-removes-75m-spam-tracks-past-year-ai-increases-ability-make-fake-music\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘A proper gent‘: people share memories of cricket umpire Dickie Bird",
      "link": "https://www.theguardian.com/sport/2025/sep/25/a-proper-gent-readers-pay-tribute-to-legendary-cricket-umpire-dickie-bird",
      "pub_time_taipei": "2025-09-25T19:47:56+08:00",
      "summary": "<p>The proud Yorkshireman is remembered as someone who knew how to hold a crowd – and a cricket match</p><ul><li><p><a href=\"https://www.theguardian.com/sport/2025/sep/23/dickie-bird-former-test-cricket-umpire-dies\"><strong>Legendary cricket umpire Dickie Bird dies aged 92</strong></a></p></li></ul><p>In 1983 I worked at the Oval, cooking lunch for 40 in the committee room. After cooking, I had to change out of my whites and into a frock to supervise the room. There were, of course, no changing facilities for women, only a small loo, so Dickie used to usher me into the umpires’ room where there was a shower, and stand outside the door to make sure no one else came in. A proper gent. I paid him in puddings! <br /><strong>Gina Birley, London </strong></p> <a href=\"https://www.theguardian.com/sport/2025/sep/25/a-proper-gent-readers-pay-tribute-to-legendary-cricket-umpire-dickie-bird\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Is Trump right that Russia’s economy is on the brink of collapse?",
      "link": "https://www.theguardian.com/world/2025/sep/25/is-trump-right-that-russian-economy-is-on-brink-of-collapse",
      "pub_time_taipei": "2025-09-25T19:36:46+08:00",
      "summary": "<p>While VAT is going up to finance the war and fuel is in short supply, few expect Putin to adjust his war plans </p><p>Russia’s economy is in deep peril, Donald Trump assured the world this week, in a dramatic <a href=\"https://www.theguardian.com/us-news/2025/sep/24/trumps-change-in-tone-is-valuable-to-ukraine-but-more-than-words-are-needed\">change of tune</a> on the war in Ukraine in which the US president claimed Kyiv now had a chance to win back all its territory.</p><p>The reality, economists say, is more complicated. While Moscow is enduring its toughest period since the chaotic first days of the invasion, few analysts believe its economy is on the brink of a total collapse, and fewer still expect Vladimir Putin to adjust his war plans in the short term.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/is-trump-right-that-russian-economy-is-on-brink-of-collapse\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Neglected’: preservation group moves to protect US Latino heritage sites as funding threats loom",
      "link": "https://www.theguardian.com/us-news/2025/sep/25/trump-cuts-latino-heritage-historic-landmarks",
      "pub_time_taipei": "2025-09-25T19:00:34+08:00",
      "summary": "<p>The Latinos in Heritage Conservation group warns various sites are in danger of being lost forever due to lack of funds</p><p>Numerous historic landmarks across the US recognizing Latino history and culture are in danger of being lost forever, according to a preservation group that has published a list of what it finds to be the most vulnerable to coincide with Hispanic Heritage Month.</p><p>Many of the 13 sites named in the first <a href=\"https://www.latinoheritage.us/ell-2025-nominations/plaza-del-cerro\">Latinos in Heritage Conservation study</a> have become rundown or fallen into disrepair through a lack of funds to maintain them, according to the group, which said they were largely “left outside of the mainstream narratives of preservation”.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/25/trump-cuts-latino-heritage-historic-landmarks\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "One dead and two injured in shooting at Texas Ice facility | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/sep/25/first-thing-one-dead-and-two-injured-in-shooting-at-texas-ice-facility",
      "pub_time_taipei": "2025-09-25T18:21:02+08:00",
      "summary": "<p>Authorities say all three people shot were detainees at Dallas facility. Plus, WHO rejects Trump’s claims of link between Tylenol and autism</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>One detainee has been killed and two others <a href=\"https://www.theguardian.com/us-news/2025/sep/24/dallas-ice-shooting-texas-immigration-center-latest\">injured in a shooting</a> at an Immigration and Customs Enforcement (Ice) field office in Dallas, according to officials.</p><p><strong>What are the details of the shooting?</strong> The Dallas police department said officers responded to a call at approximately 6.40am on Wednesday. Police said the suspect “opened fire at a government building from an adjacent building. Two people were transported to the hospital with gunshot wounds. One victim died at the scene. The suspect is deceased.”</p><p><strong>Do we know anything about a potential motive at this stage?</strong> Authorities said the FBI was investigating the incident as an act of targeted violence. The head of the FBI field office in Dallas said “rounds that were found near the suspected shooter contain messages that are anti-Ice in nature”. One of the unspent shell casings recovered had the phrase “ANTI-ICE” written on it, according to a post from the FBI director, Kash Patel.</p><p><strong>What have Republican opponents said?</strong> Bill Cassidy, a Republican senator for Louisiana and the chair of the Senate health committee, has led a rebellion on the administration’s health policies. “You’re going to change a medical guideline without science?” Cassidy <a href=\"https://thehill.com/policy/healthcare/5517446-gop-senator-on-trump-linking-autism-tylenol-not-the-case/\">told the Hill</a>. “I mean, you’re going to build a bridge without physics? You’re going to fly a plane without engineering?”</p><p><strong>What about medical experts?</strong> From the Society for Maternal-Fetal Medicine to the American College of Obstetricians and Gynecologists, doctors have endorsed the use of acetaminophen during pregnancy – <a href=\"https://www.theguardian.com/us-news/2025/sep/22/trump-tylenol-experts-autism\">after expressing alarm</a> as Trump baselessly linked the painkiller with a rise in autism among children.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/25/first-thing-one-dead-and-two-injured-in-shooting-at-texas-ice-facility\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Denmark blames ‘systematic’ attack as mystery drones swarm more airports",
      "link": "https://www.washingtonpost.com/world/2025/09/25/airport-russia-denmark-drones/",
      "pub_time_taipei": "2025-09-25T18:07:44+08:00",
      "summary": "Drones forced Aalborg Airport to close, and others were spotted near three airports in the south. Days earlier, sightings closed Copenhagen and Oslo airports."
    },
    {
      "source": "衛報",
      "title": "Deadly Ice shooting comes as violence spikes amid Trump immigration crackdown",
      "link": "https://www.theguardian.com/us-news/2025/sep/25/dallas-shooting-ice-facility",
      "pub_time_taipei": "2025-09-25T18:00:33+08:00",
      "summary": "<p>Trump officials seek to tie attacks to ‘radical left’ as agencies accused of violent tactics against migrants and protesters</p><p>Wednesday’s <a href=\"https://www.theguardian.com/us-news/2025/sep/24/dallas-ice-shooting-texas-immigration-center-latest\">deadly shooting</a> at an Immigration and Customs and Enforcement (Ice) facility in Dallas comes as the agency has heightened its crusade against undocumented people and bolstered its self-image of being under siege from violent enemies.</p><p>Little is known of the motives of the gunman who opened fire on the detention center near Love Field airport from a nearby roof, killing a detainee and wounding two others before killing himself.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/25/dallas-shooting-ice-facility\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Taiwan convicts four former ruling party officials of spying for China",
      "link": "https://www.theguardian.com/world/2025/sep/25/taiwan-convicts-four-former-ruling-party-officials-of-spying-for-china",
      "pub_time_taipei": "2025-09-25T17:55:55+08:00",
      "summary": "<p>Huang Chu-jung, previously an assistant to a New Taipei city councillor, receives longest sentence of 10 years</p><p>Four <a href=\"https://www.theguardian.com/world/2025/jun/11/four-former-officials-in-taiwans-ruling-party-charged-with-spying-for-china-ntwnfb\">former employees</a> of Taiwan’s ruling political party have been convicted of spying for China and handed prison sentences of up to 10 years.</p><p>The four include a former aide to Taiwan’s president, Lai Ching-te, when he was vice-president and for a time during his current presidency, and a senior staffer to Joseph Wu, then foreign minister and now the national security chief.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/taiwan-convicts-four-former-ruling-party-officials-of-spying-for-china\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First new Qantas Airbus jets come with one toilet for every 90 economy passengers – worse than Jetstar, Scoot and Ryanair",
      "link": "https://www.theguardian.com/business/2025/sep/25/qantas-airbus-come-with-one-toilet-for-every-90-economy-passengers-worse-than-jetstar-scoot-and-ryanair",
      "pub_time_taipei": "2025-09-25T17:55:19+08:00",
      "summary": "<p>Full service carrier says it will add additional toilets to its first three new Airbus 321XLR models – but they will be in service for three years beforehand</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The first three aircraft in Qantas’s new fleet will arrive with a worse economy passenger-to-toilet ratio than on planes used by budget carriers Scoot, Ryanair and Jetstar.</p><p>After ordering the Airbus 321XLR aircraft in 2022 to replace its ageing Boeing 737s, Qantas on Thursday used the new planes on commercial flights for the first time on the Sydney to Melbourne and Sydney to Perth routes.</p> <a href=\"https://www.theguardian.com/business/2025/sep/25/qantas-airbus-come-with-one-toilet-for-every-90-economy-passengers-worse-than-jetstar-scoot-and-ryanair\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Professional actor’ behind attacks that closed Danish airports, defence minister says",
      "link": "https://www.theguardian.com/world/2025/sep/25/drones-aalborg-airport-denmark-closed-days-after-copenhagen-oslo",
      "pub_time_taipei": "2025-09-25T17:30:47+08:00",
      "summary": "<p>Drones overfly four more airports forcing Aalborg to halt traffic two nights after shutdown at Copenhagen terminals</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live\">Europe – live updates</a></p></li></ul><p>Denmark’s defence minister says the country has been the victim of a professional hybrid attack after drones flew over four airports overnight in the second such incursion in a matter of days.</p><p>The drone sightings began shortly before 10pm on Wednesday and ended just before 1am on Thursday. Flights were halted for several hours at Aalborg airport, which also serves as a military base, Airports in Esbjerg, Sønderborg and Skrydstrup were also affected. Skrydstrup is home to some of the Danish military’s fighter jets.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/drones-aalborg-airport-denmark-closed-days-after-copenhagen-oslo\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "China wants a ‘super-embassy’ in London — sparking anger and spying fears",
      "link": "https://www.washingtonpost.com/world/2025/09/25/china-london-embassy-spying/",
      "pub_time_taipei": "2025-09-25T17:24:36+08:00",
      "summary": "China’s proposal for a large embassy by the Tower of London, near critical communications cables, has led to espionage concerns. China describes the claims as “slander.”"
    },
    {
      "source": "衛報",
      "title": "Sydney’s Burwood and North Melbourne among world’s coolest neighbourhoods, Time Out says",
      "link": "https://www.theguardian.com/australia-news/2025/sep/25/burwood-sydney-north-melbourne-among-world-coolest-neighbourhoods-time-out",
      "pub_time_taipei": "2025-09-25T16:49:22+08:00",
      "summary": "<p>A vibrant culture, a dynamic food scene and lively atmosphere pushed Burwood into the Top 20, according to ‘local experts’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>One of Sydney’s most culturally diverse suburbs has made it on to Time Out’s annual 39 coolest neighbourhoods list.</p><p>Burwood, it seems, has come a long way since Frank Lowy opened his first Westfield shopping complex on its main street in the mid 1960s.</p><p>Jimbōchō, Tokyo</p><p>Borgerhout, Antwerp</p><p>Barra Funda, São Paulo</p><p>Camberwell, London</p><p>Avondale, Chicago</p><p>Mullae-dong, Seoul</p><p>Ménilmontant, Paris</p><p>Nakatsu, Osaka</p><p>Vallila, Helsinki</p><p>Labone, Accra</p><p>Nguyen Thai Binh, Ho Chi Minh</p><p>Anjos, Lisbon</p><p>Digbeth, Birmingham</p><p>Red Hook, New York</p><p>Perpetuo Socorro, Medellín</p><p><strong>Burwood, Sydney</strong></p><p>Linden, Johannesburg</p><p>Former French Concession, Shanghai</p><p>Quartieri Spagnoli, Naples</p><p>Bencoolen, Singapore</p><p>Endoume, Marseille</p><p>Plateau-Mont-Royal, Montréal</p><p>The Liberties, Dublin</p><p><strong>North Melbourne, Melbourne</strong></p><p>Portales, Mexico City</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/25/burwood-sydney-north-melbourne-among-world-coolest-neighbourhoods-time-out\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fashion campaigner Livia Giuggioli shreds MBE over Trump’s ‘grotesque’ UK visit",
      "link": "https://www.theguardian.com/fashion/2025/sep/25/fashion-livia-giuggioli-colin-firth-shreds-mbe-trump-uk-visit",
      "pub_time_taipei": "2025-09-25T16:48:57+08:00",
      "summary": "<p>Colin Firth’s ex-wife to return honorary medal to authorities in protest over US president’s ‘poisonous rhetoric’</p><ul><li><p><a href=\"https://www.theguardian.com/commentisfree/2025/sep/18/the-guardian-view-on-trump-state-visit-to-britain-plenty-of-glitter-but-this-was-gilt-not-gold\">The Guardian view on Trump’s state visit to Britain: plenty of glitter, but this was gilt, not gold</a></p></li><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live\">UK politics – latest updates</a></p></li></ul><p>Livia Giuggioli, a sustainable fashion campaigner and the former wife of the actor Colin Firth, has torn up her honorary MBE in <a href=\"https://www.theguardian.com/us-news/video/2025/sep/17/thousands-of-demonstrators-protest-against-trump-state-visit-video\">protest over Donald Trump’s state visit</a> to the UK and his “poisonous rhetoric”.</p><p>Hailed as the “queen of the green carpet”, Giuggioli was among the recipients of honorary British awards to foreign nationals in 2019 for services to sustainable fashion.</p> <a href=\"https://www.theguardian.com/fashion/2025/sep/25/fashion-livia-giuggioli-colin-firth-shreds-mbe-trump-uk-visit\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weakened Super Typhoon Ragasa heads towards Vietnam after battering China and Hong Kong",
      "link": "https://www.theguardian.com/world/2025/sep/25/weakened-super-typhoon-ragasa-heads-towards-vietnam-after-battering-china-and-hong-kong",
      "pub_time_taipei": "2025-09-25T16:46:21+08:00",
      "summary": "<p>Huge clear-up efforts start after storm leaves trail of destruction, with 25 reported dead in Taiwan and the Philippines </p><p>Huge clear-up operations were under way in southern China and Hong Kong on Thursday, after <a href=\"https://www.theguardian.com/world/2025/sep/24/super-typhoon-ragasa-update-path-hong-kong-taiwan-china\">Super Typhoon Ragasa battered the region</a>, causing widespread flooding and damaged roads.</p><p>Ragasa, the most powerful tropical cyclone so far this year, left a trail of damage across Hong Kong, which resumed international flights on Thursday but kept kindergartens and some schools closed. In the economic hub of Guangdong province in mainland China, where more than 2 million people were evacuated ahead of the super typhoon, crews used excavators to clear thousands of toppled trees and unblock roads.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/weakened-super-typhoon-ragasa-heads-towards-vietnam-after-battering-china-and-hong-kong\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "DNA tests to determine if heart belongs to Australian man who died in Bali",
      "link": "https://www.theguardian.com/world/2025/sep/25/byron-haddow-australian-man-bali-hospital-denies-organ-theft-allegations",
      "pub_time_taipei": "2025-09-25T16:23:49+08:00",
      "summary": "<p>Australian officials demanded answers after the body of Byron Haddow was returned without his heart</p><p>DNA testing is being carried out on a heart that is claimed to be that of Queensland man Byron Haddow, who died in Bali in May.</p><p>Haddow, 23, was found dead in the plunge pool of his villa while on holiday. His body was returned to Australia four weeks later and a second autopsy found his heart was missing.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/byron-haddow-australian-man-bali-hospital-denies-organ-theft-allegations\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "DNA tests to determine if heart belongs to man who died in Bali – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb",
      "pub_time_taipei": "2025-09-25T16:16:41+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/25/byron-haddow-australian-man-bali-hospital-denies-organ-theft-allegations\">DNA tests to determine if heart belongs to Australian man who died in Bali</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Anthony Albanese</strong> says China should do more on cutting carbon emissions, including closing more coal fired power stations.</p><p>In a video statement to the UN in New York, president <strong>Xi Jinping</strong> said China would reduce its greenhouse gas emissions across the economy by 7-10% by 2035, while “striving to do better”.</p><p>It is good that there is progress being made. We, of course would like there to be more, but it is a step forward, and indeed, China has exceeded its previous targets.</p><p>We’d like to see new coal fired power plants not open. But it is a step forward. If you look at the transition that’s occurring as part of what President Xi announced, as well of electric vehicles, that’s been a revolution, frankly, in a relatively short period of time.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brisbane kindergarten forced to back down after proposing to charge parents $2,200 for their own children’s art",
      "link": "https://www.theguardian.com/australia-news/2025/sep/25/brisbane-kindergarten-craigslea-proposed-charging-parents-2200-for-their-own-childrens-art-forced-to-back-down",
      "pub_time_taipei": "2025-09-25T16:04:01+08:00",
      "summary": "<p>Craigslea kindergarten’s management committee told parents the centre owed over $40,000 and the fee could help pay off the debt</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A Brisbane kindergarten has been forced to back down after asking parents to pay $2,200 for their own children’s artwork amid a dispute over the management of the childcare centre.</p><p>Craigslea community kindergarten, a local childcare centre in Chermside West in Brisbane’s north, made national headlines this week after a series of emails to parents. The centre has been in turmoil for weeks and was closed after a mass exodus of staff before the school holidays.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/25/brisbane-kindergarten-craigslea-proposed-charging-parents-2200-for-their-own-childrens-art-forced-to-back-down\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Biometric checks to visit EU could take nine months to fully enforce",
      "link": "https://www.theguardian.com/travel/2025/sep/25/biometric-checks-to-visit-eu-to-get-phased-rollout-from-october",
      "pub_time_taipei": "2025-09-25T14:26:15+08:00",
      "summary": "<p>Though registration kiosks are due to open in UK in two weeks, system may not be fully enforced for nine months</p><p>Biometric registration to visit the EU may not be fully enforced for another nine months, with border officials allowed to relax the rules to alleviate queues or chaos at ports after the system finally goes live.</p><p>In just over two weeks, Eurotunnel, Eurostar and the Port of Dover will all open new biometric registration kiosks in the UK, installed at a cost of tens of millions of pounds.</p> <a href=\"https://www.theguardian.com/travel/2025/sep/25/biometric-checks-to-visit-eu-to-get-phased-rollout-from-october\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "After years of chaos, Lebanese leadership nets record approval, poll finds",
      "link": "https://www.washingtonpost.com/world/2025/09/25/after-years-chaos-lebanese-leadership-nets-record-approval-poll-finds/",
      "pub_time_taipei": "2025-09-25T14:00:00+08:00",
      "summary": "More than 6 in 10 Lebanese adults approved of the country’s leadership, up from 16 percent in 2024. The upswing is one of the largest for a government in 20 years."
    },
    {
      "source": "衛報",
      "title": "Generational change or gender breakthrough, whoever Japan’s next PM is will have a mountain to climb",
      "link": "https://www.theguardian.com/world/2025/sep/25/japan-leadership-next-pm-shinjiro-koizumi-sanae-takaichi-liberal-democratic-party-debate",
      "pub_time_taipei": "2025-09-25T12:48:17+08:00",
      "summary": "<p>Two candidates have emerged as favourites to lead Japan’s Liberal Democratic Party, ahead of the party vote next week</p><p>The next leader of <a href=\"https://www.theguardian.com/world/japan\">Japan</a>’s ruling party will either be the country’s first female prime minister or its youngest leader since the war. But the significance of those milestones will be quickly lost in the party’s attempts to rebuild after two bruising elections that have cast doubt over the future of one of the world’s most successful political machines.</p><p>Two of the five candidates vying to replace Shigeru ishiba – who <a href=\"https://www.theguardian.com/world/2025/sep/07/japan-pm-shigeru-ishiba-resign\">announced his resignation</a> earlier this month – as the next president of the Liberal Democratic party (LDP) have emerged as clear favourites in what analysts are describing as a last-ditch attempt to unify a party battered by a <a href=\"https://www.theguardian.com/world/2024/apr/28/anger-at-party-funding-scandal-in-japan-threatens-to-bring-down-pm-kishida\">major funding scandal</a> and the <a href=\"https://www.theguardian.com/world/2025/may/19/runaway-rice-prices-spell-danger-for-japans-prime-minister-as-elections-loom\">cost-of-living crisis</a>.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/japan-leadership-next-pm-shinjiro-koizumi-sanae-takaichi-liberal-democratic-party-debate\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Tunnel vision’: how Israel is using archaeology to win US support for goals",
      "link": "https://www.theguardian.com/world/2025/sep/25/israel-archaeology-jerusalem-history-us",
      "pub_time_taipei": "2025-09-25T12:00:28+08:00",
      "summary": "<p>Scientists say Netanyahu government and its US backers are trying to construct a history shorn of all complexity</p><p>When the US secretary of state, Marco Rubio, visited Jerusalem this month, the itinerary his Israeli hosts laid on involved more archaeology than anything else. On his first day, Benjamin Netanyahu <a href=\"https://www.theguardian.com/world/2025/sep/14/rubio-visit-middle-east-israel-qatar-hamas\">took Rubio underground</a> to excavations near the Western Wall. On the second day, Israel’s prime minister gave his American visitor the honour of inaugurating a tunnel burrowed under a Palestinian district, along a Roman-era street nicknamed the Pilgrimage Road, in a “City of David” archaeological park established by an Israeli settler organisation.</p><p>Both events were intended to emphasise Jerusalem’s Jewish roots and its status, Netanyahu stressed, as “our eternal and undivided capital”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/israel-archaeology-jerusalem-history-us\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Yemen needs two-state solution as no prospect of ousting Houthis, says southern leader",
      "link": "https://www.theguardian.com/world/2025/sep/25/yemen-needs-two-state-solution-houthis-southern-leader",
      "pub_time_taipei": "2025-09-25T12:00:27+08:00",
      "summary": "<p>Aidarous al-Zubaidi says Houthis will not be dislodged by bombing and path to political settlement is blocked</p><p>Yemen needs its own two-state solution, the president of its Southern Transitional Council (STC) has said, warning that there is currently no prospect of dislodging the Iran-backed Houthis from power in the north.</p><p>Speaking on the sidelines of the UN general assembly, Aidarous al-Zubaidi told the Guardian: “The best solution for Yemen and the best path to stability is the two-state solution, whether by referendum or agreement. The reality on the ground is that there are two states militarily and economically.”</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/yemen-needs-two-state-solution-houthis-southern-leader\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Wealthy investors from US, China and Hong Kong top applications for New Zealand’s ‘golden visa’ scheme",
      "link": "https://www.theguardian.com/world/2025/sep/25/new-zealand-golden-visa-scheme-active-investor-plus-applications-usa-china-hong-kong",
      "pub_time_taipei": "2025-09-25T10:01:40+08:00",
      "summary": "<p>Since new rules for the Active Investor Plus visa came into effect in April, applicant numbers have almost tripled</p><p>Wealthy investors from the US, China and Hong Kong are the leaders in applications for New Zealand’s “golden visas” after the government relaxed the scheme’s requirements in a bid to boost the flagging economy.</p><p>The new rules for the Active Investor Plus visa came into effect in April and lowered investment thresholds, removed English-language requirements and cut the amount of time applicants must spend in the country to establish residency from three years to three weeks.</p> <a href=\"https://www.theguardian.com/world/2025/sep/25/new-zealand-golden-visa-scheme-active-investor-plus-applications-usa-china-hong-kong\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Escaping Gaza City, while reporting on its destruction – podcast",
      "link": "https://www.theguardian.com/news/audio/2025/sep/25/escaping-gaza-city-while-reporting-on-its-destruction-podcast",
      "pub_time_taipei": "2025-09-25T10:00:23+08:00",
      "summary": "<p>Malak A Tantesh on fleeing the Israeli ground offensive in Gaza and becoming a reporter in the most dangerous place on Earth for journalists</p><p><strong>Malak A Tantesh</strong> is a journalist in Gaza. On 16 September, the day Israel began its full-scale ground offensive Gaza City, she was among those trying to flee the city. As she hurriedly packed up for her 11th displacement in the last 18 months, she recorded voice notes. “We all say that we don’t want to leave, but we deeply know that we have no other choice,” she says.</p><p>She tells <strong>Lucy Hough</strong> what it has been like to be displaced so many times while trying to report on the events around her, all at just 20 years old. When Israel’s blockade of the strip led to hunger and famine, it became hard to work: “I was covering stories about hunger and famine, and I was myself hungry. I was feeling that I am about to collapse. We were eating one meal a day.”</p> <a href=\"https://www.theguardian.com/news/audio/2025/sep/25/escaping-gaza-city-while-reporting-on-its-destruction-podcast\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Malawi’s 85-year-old ex-leader returns to power in presidential election",
      "link": "https://www.theguardian.com/world/2025/sep/24/former-president-peter-mutharika-defeats-incumbent-in-malawi-presidential-election",
      "pub_time_taipei": "2025-09-25T04:40:45+08:00",
      "summary": "<p>Lazarus Chakwera, who presided over a multi-year economic crisis, concedes election after Peter Mutharika wins 56.8% of vote</p><p>Malawians have voted in an 85-year-old former leader over an incumbent who presided over a multi-year economic crisis, high inflation, essential goods shortages, climate disasters and international aid cuts.</p><p>Peter Mutharika got 56.8% of the vote compared with 33% for Lazarus Chakwera, according to official results of the 16 September presidential election announced on Wednesday.</p> <a href=\"https://www.theguardian.com/world/2025/sep/24/former-president-peter-mutharika-defeats-incumbent-in-malawi-presidential-election\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Denmark, hoping to reconcile, apologizes for forced contraception in Greenland",
      "link": "https://www.washingtonpost.com/world/2025/09/24/denmark-forced-contraception-apology-greenland/",
      "pub_time_taipei": "2025-09-25T04:38:29+08:00",
      "summary": "In Greenland, Danish Prime Minister Mette Frederiksen will apologize formally for the mistreatment of thousands of Inuit girls and women who were given invasive contraception without consent."
    },
    {
      "source": "衛報",
      "title": "At least 20 people reported injured after drone strike on Israeli city of Eilat",
      "link": "https://www.theguardian.com/world/2025/sep/24/people-injured-drone-strike-israel-eilat",
      "pub_time_taipei": "2025-09-25T01:01:14+08:00",
      "summary": "<p>Two people seriously injured, says national ambulance service as military says drone was launched from Yemen</p><p>At least 20 people have been injured, two seriously, after a drone launched from Yemen hit Israel’s Red Sea resort city of Eilat on the border with Jordan and Egypt.</p><p>Police said the drone fell in Eilat’s city centre, causing damage in the area frequented by tourists.</p> <a href=\"https://www.theguardian.com/world/2025/sep/24/people-injured-drone-strike-israel-eilat\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As Israel’s isolation mounts at U.N., full toll remains limited",
      "link": "https://www.washingtonpost.com/world/2025/09/24/israel-isolation-netanyahu-un-unga/",
      "pub_time_taipei": "2025-09-24T22:41:13+08:00",
      "summary": "Deep isolation has yet to set in, but Israel’s leadership appears to be bracing for the long haul."
    },
    {
      "source": "衛報",
      "title": "As it happened – deadly cyclone makes landfall in China after devastating Hong Kong, Taiwan and Philippines",
      "link": "https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates",
      "pub_time_taipei": "2025-09-24T22:29:57+08:00",
      "summary": "<p>This blog is now closed, you can read more on this story here:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/24/super-typhoon-ragasa-update-path-hong-kong-taiwan-china\">Ragasa: 17 killed in Taiwan as storm batters Hong Kong</a></p></li><li><p><a href=\"https://www.theguardian.com/artanddesign/gallery/2025/sep/24/super-typhoon-ragasa-path-destruction-in-pictures\">In pictures: Ragasa’s path of destruction</a></p></li></ul><p><strong>Super Typhoon Ragasa</strong> is the strongest storm of 2025 and is now bearing down on <strong>China’s southern coast</strong>.</p><p>The Guardian’s picture desk have put together this gallery showing some of the damage and scenes being witnessed in <strong>Hong Kong</strong>, <strong>Taiwan</strong>, <strong>the Philippines</strong> and <strong>China</strong>.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "After Trump targets H-1B visas, can India lure back skilled workers?",
      "link": "https://www.washingtonpost.com/world/2025/09/24/india-h1b-visas-fee-skilled-workers/",
      "pub_time_taipei": "2025-09-24T22:00:48+08:00",
      "summary": "Indian leaders say the new $100,000 fee for H-1B visas could be a boon for domestic industry. Others say the country will struggle to absorb more skilled workers."
    },
    {
      "source": "衛報",
      "title": "Renowned ‘sponge city’ architect Kongjian Yu dies in Brazil plane crash",
      "link": "https://www.theguardian.com/world/2025/sep/24/architect-kongjian-yu-dies-brazil-plane-crash",
      "pub_time_taipei": "2025-09-24T21:56:08+08:00",
      "summary": "<p>The 62-year-old Chinese landscape architect was killed with three others while filming in the Pantanal wetlands</p><p><a href=\"https://www.theguardian.com/artanddesign/2018/mar/21/turning-cities-into-sponges-how-chinese-ancient-wisdom-is-taking-on-climate-change\">Kongjian Yu</a>, one of the world’s most famous landscape architects, has reportedly been killed in a plane crash in Brazil’sPantanal wetlands while making a film about his work.</p><p>Yu, 62, was flying to a ranch in Mato Grosso do Sul state, near Brazil’s western border with Paraguay and Bolivia, in a single-engine four-seater Cessna aircraft when the plane went down on Tuesday afternoon.</p> <a href=\"https://www.theguardian.com/world/2025/sep/24/architect-kongjian-yu-dies-brazil-plane-crash\">Continue reading...</a>"
    }
  ]
}