{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-03T20:40:06.981555+08:00",
  "window_end_taipei": "2025-10-04T20:40:06.981555+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Israel-Gaza live: airstrikes reported in Gaza despite Trump’s call for Israel to stop bombing ‘immediately’",
      "link": "https://www.theguardian.com/world/live/2025/oct/04/israel-gaza-hamas-trump-plan-hostages-netanyahu-latest-news-updates",
      "pub_time_taipei": "2025-10-04T20:27:14+08:00",
      "summary": "<p>Netanyahu’s office has said that Israel is preparing for an ‘immediate implementation’ of the first stage of Trump’s Gaza plan</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages\">Full report: Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages</a></p></li></ul><p><strong>Turkey</strong> said 36 of its citizens were expected to return home via a special flight on Saturday afternoon, after Israel intercepted a Gaza-bound aid flotilla.</p><p>“We expected 36 of our nationals on the Global Sumud Flotilla vessels seized by Israeli forces in international waters will return to our country this afternoon via a special flight,” Turkish foreign ministry spokesman <strong>Oncu Keceli</strong> said on X, adding that the final number has not been finalised.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/04/israel-gaza-hamas-trump-plan-hostages-netanyahu-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Storm Amy live updates: London’s royal parks closed due to strong winds; Scotland hit by power cuts and travel disruption",
      "link": "https://www.theguardian.com/uk-news/live/2025/oct/04/storm-amy-live-updates-latest-news-uk-ireland-weather-warnings-met-office",
      "pub_time_taipei": "2025-10-04T20:22:37+08:00",
      "summary": "<p>Weather and flood warnings are in place across the UK and Ireland, where a man has been killed</p><p>The <a href=\"https://check-for-flooding.service.gov.uk/alerts-and-warnings\">Environment Agency </a>has issued <strong>two flood alerts</strong> where “flooding is expected” for Keswick Campsite in the Lake District and locations near the River Ure, particularly around Boroughbridge Camping and Caravanning Site in North Yorkshire.</p><p>“Avoid using low-lying footpaths and any bridges near local watercourses. Take care and avoid walking, cycling or driving through flood water,” it advises.</p> <a href=\"https://www.theguardian.com/uk-news/live/2025/oct/04/storm-amy-live-updates-latest-news-uk-ireland-weather-warnings-met-office\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Palestine Action protest: police begin making arrests at London demo",
      "link": "https://www.theguardian.com/world/2025/oct/04/palestine-action-protest-police-arrests-london-demo",
      "pub_time_taipei": "2025-10-04T20:08:17+08:00",
      "summary": "<p>Officers start arresting activists at silent vigil in support of banned organisation</p><p>Arrests have begun in Trafalgar Square at what may be the biggest demonstration so far against a ban on the proscribed organisation Palestine Action.</p><p>Police began arresting demonstrators at the silent vigil in support of the group, which has been classed by the UK government as a terror organisation since July this year.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/palestine-action-protest-police-arrests-london-demo\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘The fear was immense’: al-Shabaab exploits fragmented politics to reclaim land in Somalia",
      "link": "https://www.theguardian.com/world/2025/oct/04/the-fear-was-immense-al-shabaab-exploits-fragmented-politics-to-reclaim-land-in-somalia",
      "pub_time_taipei": "2025-10-04T20:00:07+08:00",
      "summary": "<p>With Islamist militant group 40km from Mogadishu, a ‘strategic stalemate’ has been reached, but some fear worst is yet to come</p><p>One night in early July, Maryan Abdikadir Geedi decided it was finally time to abandon her small shop in the town of Moqokori in the Hiiraan region of Somalia.</p><p>Though she had heard of the rapid recent gains made by <a href=\"https://www.theguardian.com/world/al-shabaab\">al-Shabaab</a>, the Islamist militant movement, the 46-year-old had hoped to stay. Since getting married in 2013, Geedi had seen control over Moqokori change hands repeatedly.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/the-fear-was-immense-al-shabaab-exploits-fragmented-politics-to-reclaim-land-in-somalia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Next Tory leader? Rise of Katie Lam reflects rightward shift on migration",
      "link": "https://www.theguardian.com/politics/2025/oct/04/rise-of-katie-lam-next-tory-leader-migration",
      "pub_time_taipei": "2025-10-04T20:00:05+08:00",
      "summary": "<p>Shadow Home Office minister who tweets in language of hard-right populism  is talked of as future of conservatism</p><p>Pictured on her <a href=\"https://www.katieforkent.com/\">official website</a> smiling on a country walk with her golden retriever, Katie Lam looks every inch the traditional Conservative MP. But make no mistake: this is a very modern breed of Tory, and one whose rise gives a clue to the current direction of UK politics.</p><p>Still only 34 and in parliament for little over a year, Lam is named almost ubiquitously by fellow Conservatives as a likely future leader – even, some venture, a direct replacement for Kemi Badenoch.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/04/rise-of-katie-lam-next-tory-leader-migration\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Greens ‘on track’ to supplant Labour as favourite party in London, says Zack Polanski",
      "link": "https://www.theguardian.com/politics/2025/oct/04/greens-on-track-to-supplant-labour-as-favourite-party-in-london-says-zack-polanski",
      "pub_time_taipei": "2025-10-04T19:00:03+08:00",
      "summary": "<p>Exclusive: poll asked voters to rank parties on how favourably they felt about them, with strong support in capital and among younger voters</p><p>The Greens are viewed more favourably than any other party in London and among younger voters, polling produced for the party has shown, with its leader, Zack Polanski, saying this showed they were “on track” to supplant Labour.</p><p>The YouGov poll, carried out to coincide with the Greens’ <a href=\"https://www.theguardian.com/politics/2025/oct/03/starmer-will-hand-britain-over-to-farage-says-green-party-leader-zack-polanski\">ongoing annual conference</a> in Bournemouth, asked voters in England to rank the five main parties in order of how favourably they felt about them, rather than the usual metric of which they planned to vote for.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/04/greens-on-track-to-supplant-labour-as-favourite-party-in-london-says-zack-polanski\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "High stakes for Gaza peace talks as Hamas accepts Trump plan with conditions",
      "link": "https://www.washingtonpost.com/world/2025/10/04/israel-hamas-war-peace-plan-netanyahu/",
      "pub_time_taipei": "2025-10-04T18:44:52+08:00",
      "summary": "Both sides have backed President Trump’s peace plan to free all Israeli hostages — but key differences remain on how Israel’s military would withdraw from Gaza."
    },
    {
      "source": "衛報",
      "title": "British teenager dies in car crash months after being freed from Dubai jail for sex with girl, 17",
      "link": "https://www.theguardian.com/uk-news/2025/oct/04/british-teenager-marcus-fakana-dies-in-car-collision-months-after-being-freed-from-dubai-jail-for-sex-with-girl",
      "pub_time_taipei": "2025-10-04T18:37:33+08:00",
      "summary": "<p>Marcus Fakana, 19, died in hospital after police pursued a vehicle in Tottenham, London, which was then involved in a collision</p><p>A British teenager who was <a href=\"https://www.theguardian.com/world/2024/dec/11/uk-teenager-marcus-fakana-jailed-in-dubai-over-relationship-with-17-year-old-girl\">jailed in Dubai</a> for having a sexual relationship with a 17-year-old girl while they were on holiday<strong> </strong>has died in a car crash three months after he was released, a campaign group has said.</p><p>Marcus Fakana, 19, died in hospital in the early hours of Friday after police pursued a vehicle in Tottenham, north London.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/04/british-teenager-marcus-fakana-dies-in-car-collision-months-after-being-freed-from-dubai-jail-for-sex-with-girl\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fired national security prosecutor warns colleagues in note on way out",
      "link": "https://www.theguardian.com/us-news/2025/oct/04/fired-national-security-prosecutor-note-warning",
      "pub_time_taipei": "2025-10-04T18:00:05+08:00",
      "summary": "<p>Michael Ben’Ary says he was fired based on a social media post by a January 6 conspiracy theorist</p><p>A senior national security prosecutor in the eastern district of Virginia said in a farewell note <a href=\"https://x.com/dnlbrns/status/1974151421315723286\">taped to his door</a> to colleagues on Friday that he was apparently fired this week because a January 6 conspiracy theorist denounced him on social media for having worked for the deputy attorney general in the Biden administration.</p><p>The veteran federal prosecutor, Michael Ben’Ary, was fired on Wednesday, the same day that Julie Kelly, a pro-Trump commentator who <a href=\"https://www.yahoo.com/news/pro-trump-political-commentator-julie-050936220.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAALG2lahq3u5mPT1Qml1EwDdEBldnAF3qdbLBO49F9dDQRTEvJFEpgd2awZimk--SqmJm_BFMP5T4nStSjm1r_nKa42UU3zi3saA2vA1fUV7dymX0CxZqFHMdlMg9xg0Be4IWoCdLDh41dYvcPMgKw4yKogF2XnFvyztBsiUulebS\">once called</a> a Capitol police officer beaten by the pro-Trump mob on January 6 a “crisis actor”, suggested on social media that Ben’Ary was an ally of his former boss, Lisa Monaco, a senior justice department official who helped drive the investigation of Donald Trump’s role in the Capitol riot.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/04/fired-national-security-prosecutor-note-warning\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump officials cut nearly $8bn in clean energy projects in Democratic states",
      "link": "https://www.theguardian.com/us-news/2025/oct/04/trump-clean-energy-cuts-democrat-states",
      "pub_time_taipei": "2025-10-04T18:00:04+08:00",
      "summary": "<p>Democrats and environmental groups slam move as ‘sick political game’ and say it will drive up energy bills</p><p>The <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> is cancelling $7.6bn in grants that supported hundreds of <a href=\"https://www.theguardian.com/environment/renewableenergy\">clean energy</a> projects in 16 states, all of which voted for <a href=\"https://www.theguardian.com/us-news/democrats\">Democrat</a> Kamala Harris in last year’s presidential election.</p><p>The move comes as <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> threatens <a href=\"https://www.theguardian.com/us-news/2025/oct/02/government-shutdown-federal-workers-funding-freeze\">deep cuts</a> in his fight with congressional Democrats over the <a href=\"https://www.theguardian.com/us-news/2025/oct/03/trump-government-shutdown-republicans-democrats\">government shutdown</a>.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/04/trump-clean-energy-cuts-democrat-states\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK antisemitism ‘allowed to grow’, Jewish security group says before pro-Palestine protests",
      "link": "https://www.theguardian.com/news/2025/oct/04/antisemitism-has-been-allowed-to-grow-in-uk-says-jewish-security-group",
      "pub_time_taipei": "2025-10-04T17:38:55+08:00",
      "summary": "<p>Head of policy at Community Security Trust calls Saturday’s planned protest against ban on Palestine Action ‘self absorbed and insensitive’</p><p>Antisemitism has been “allowed to grow” by politicians and across wider society, the main Jewish security group has said in the aftermath of the attack on a Manchester synagogue, which left three people dead.</p><p>Speaking before planned pro-Palestine marches on Saturday, Dave Rich, head of policy at the Community Security Trust, said it was “remarkably self absorbed and insensitive” for people to attend a silent vigil for Gaza after Thursday’s attack.</p> <a href=\"https://www.theguardian.com/news/2025/oct/04/antisemitism-has-been-allowed-to-grow-in-uk-says-jewish-security-group\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Meloni’s Italy looks to restrict talk of LBGTQ+ sexuality in schools",
      "link": "https://www.washingtonpost.com/world/2025/10/04/italy-schools-lgbtq-legislation-gender/",
      "pub_time_taipei": "2025-10-04T16:45:12+08:00",
      "summary": "New laws could ban LGBTQ+ issues from classrooms and more strictly limit gender affirmation for transgender minors — part of a wider trend in Europe and the U.S."
    },
    {
      "source": "衛報",
      "title": "Japan poised to get first female PM after Sanae Takaichi wins ruling party leadership",
      "link": "https://www.theguardian.com/world/2025/oct/04/sanae-takaichi-expected-to-become-japans-first-female-pm-after-winning-ruling-party-leadership",
      "pub_time_taipei": "2025-10-04T16:24:21+08:00",
      "summary": "<p>Margaret Thatcher admirer beat her more moderate rival to become leader of Liberal Democratic party</p><p>Japan is poised to get its first female prime minister after Sanae Takaichi was elected as leader of the governing Liberal Democratic party (LDP) – a victory that should lead to her being installed as the country’s new leader in the middle of the month.</p><p>Takaichi, a rightwing politician who has voiced admiration for Margaret Thatcher in her quest to build a “strong and prosperous” Japan on the international stage, beat her moderate rival, Shinjiro Koizumi, in a runoff election at the LDP headquarters in Tokyo on Saturday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/sanae-takaichi-expected-to-become-japans-first-female-pm-after-winning-ruling-party-leadership\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bodies of two women who died in Victorian high country might have been there ‘two or three days’, police say",
      "link": "https://www.theguardian.com/australia-news/2025/oct/04/two-bodies-found-in-victorian-high-country-by-hikers",
      "pub_time_taipei": "2025-10-04T15:11:38+08:00",
      "summary": "<p>Police are working to identify the women and ask anyone who had seen two women appearing ‘disoriented’ in the area earlier to contact Crime Stoppers </p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Emergency services have recovered the bodies of two women who died in “blizzard conditions” in the Victorian high country.</p><p>The bodies of the women were found by hikers near a remote hut at Nelse, about 400km north-east of Melbourne, on Friday afternoon. Their deaths are not considered to be suspicious, police said.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/04/two-bodies-found-in-victorian-high-country-by-hikers\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Sanae Takaichi is set to become Japan’s first female prime minister",
      "link": "https://www.washingtonpost.com/world/2025/10/04/sanae-takaichi-japan-prime-minister/",
      "pub_time_taipei": "2025-10-04T14:15:54+08:00",
      "summary": "The new leader will take the helm of the world’s fourth-largest economy at a time of unusual political instability, rising prices and increasing regional tensions."
    },
    {
      "source": "衛報",
      "title": "Potential contempt charges in relation to Kyle and Jackie O comments on Erin Patterson still under consideration",
      "link": "https://www.theguardian.com/australia-news/2025/oct/04/potential-contempt-charges-in-relation-to-kyle-and-jackie-o-comments-on-erin-patterson-still-under-consideration-ntwnfb",
      "pub_time_taipei": "2025-10-04T13:57:08+08:00",
      "summary": "<p>Office of public prosecutions says decision has ‘not yet been finalised’, four months after judge referred comments including Kyle Sandilands saying ‘lock that bitch up’</p><ul><li><p><strong>Get our </strong><a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\"><strong>breaking news email</strong></a><strong>, </strong><a href=\"https://app.adjust.com/w4u7jx3\"><strong>free app</strong></a><strong> or </strong><a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\"><strong>daily news podcast</strong></a></p></li></ul><p>The Victorian office of public prosecutions has yet to rule out contempt charges in relation to comments made on the Kyle and Jackie O Show about the triple murder trial of Erin Patterson, four months after the co-hosts were criticised by a supreme court judge.</p><p>Justice Christopher Beale <a href=\"https://www.theguardian.com/media/2025/jul/07/kyle-and-jackie-o-face-prosecution-for-contempt-erin-patterson-trial-comments-ntwnfb\">referred the comments</a> to the office for contempt proceedings in June, after Kyle Sandilands made comments including, “just lock that bitch up” and called the case “not strong for her”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/04/potential-contempt-charges-in-relation-to-kyle-and-jackie-o-comments-on-erin-patterson-still-under-consideration-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Europe needs to ‘get serious’ about threat posed to it by Russia, Ukraine minister says",
      "link": "https://www.theguardian.com/world/2025/oct/04/europe-needs-to-get-serious-about-threat-posed-to-it-by-russia-ukraine-minister-says",
      "pub_time_taipei": "2025-10-04T13:00:09+08:00",
      "summary": "<p>Sergiy Kyslytsya says Kremlin already at war with Europe and predicts that Vladimir Putin will ‘escalate escalating’</p><p>Europe needs to “get serious” about the existential threat posed to it by Russia, Ukraine’s deputy foreign minister has said, warning that Vladimir Putin will “escalate escalating”.</p><p>In an interview with the Guardian, Sergiy Kyslytsya – Kyiv’s former ambassador to the UN – said the Kremlin was already at war with Europe. He said Russia’s recent drone incursions against several EU countries were well-calculated and an attempt to “move the red lines”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/europe-needs-to-get-serious-about-threat-posed-to-it-by-russia-ukraine-minister-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Warnings of imports of caged hen eggs as Ukraine and Poland become UK’s biggest suppliers",
      "link": "https://www.theguardian.com/food/2025/oct/04/warnings-imports-caged-hen-eggs-ukraine-poland-uk-biggest-suppliers",
      "pub_time_taipei": "2025-10-04T13:00:08+08:00",
      "summary": "<p>Shift raises food safety and welfare concerns as imports can bypass standards for domestic producers</p><p>Ukraine and Poland have overtaken other EU countries to become the UK’s biggest egg suppliers, sparking warnings that imports of eggs from caged hens are slipping “through the back door” despite welfare pledges.</p><p>Freedom of information data from the Animal and Plant Health Agency shows that, while the Netherlands supplied a large proportion of UK eggs in 2022, its share has steadily fallen. By 2025, Ukraine and Poland together accounted for more than 15m kilograms, with Spain, Italy and other southern and eastern European countries also having increased their exports.</p> <a href=\"https://www.theguardian.com/food/2025/oct/04/warnings-imports-caged-hen-eggs-ukraine-poland-uk-biggest-suppliers\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘One rule for the rich’: the Salzburg mansion, the Porsche heir and the writer Stefan Zweig",
      "link": "https://www.theguardian.com/world/2025/oct/04/salzburg-mansion-tunnel-porsche-heir-jewish-writer-stefan-zweig",
      "pub_time_taipei": "2025-10-04T13:00:07+08:00",
      "summary": "<p>The car magnate, who is restoring the Jewish author’s former villa, has been given permission to dig out a 500-metre road leading to a garage, causing consternation in the city</p><p>For three years the peace and quiet of Doris Rüggeberg’s cosy flat on the Kapuzinerberg, a picturesque wooded hill in Salzburg, has been interrupted by the noise from the nextdoor neighbour’s building site.</p><p>Wolfgang Porsche, a German-Austrian automotive magnate, bought the 17th-century villa at No 5 as a second home in 2019 for about €9m (£7.8m). Ever since, he has been busily renovating the property before he and his partner, Gabriele Prinzessin zu Leiningen, move in this winter.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/salzburg-mansion-tunnel-porsche-heir-jewish-writer-stefan-zweig\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Andrew Hastie says there is ‘no challenge’ to Sussan Ley after stepping down from Liberal frontbench",
      "link": "https://www.theguardian.com/australia-news/2025/oct/04/andrew-hastie-says-there-is-no-challenge-to-sussan-ley-after-stepping-down-from-liberal-frontbench",
      "pub_time_taipei": "2025-10-04T12:17:38+08:00",
      "summary": "<p>Former shadow home affairs minister claims he quit because he was not given a leadership role in developing policy on immigration</p><ul><li><p><strong>Get our </strong><a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\"><strong>breaking news email</strong></a><strong>, </strong><a href=\"https://app.adjust.com/w4u7jx3\"><strong>free app</strong></a><strong> or </strong><a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\"><strong>daily news podcast</strong></a></p></li></ul><p>Andrew Hastie has ruled out an imminent challenge to Sussan Ley’s leadership of the Liberal party after dramatically quitting the shadow cabinet.</p><p>But the former solider has vowed to keep publicly prosecuting his Australia-first agenda from the backbench, maintaining pressure on Ley as she attempts to unite her fractured party.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/04/andrew-hastie-says-there-is-no-challenge-to-sussan-ley-after-stepping-down-from-liberal-frontbench\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Munich airport forced to suspend flights for second day in a row over drone sightings",
      "link": "https://www.theguardian.com/world/2025/oct/04/munich-airport-forced-to-suspend-flights-for-second-day-in-a-row-over-drone-sightings",
      "pub_time_taipei": "2025-10-04T10:49:37+08:00",
      "summary": "<p>About 6,500 passengers stranded as interior minister says earlier drone incident a ‘wake-up call’</p><p>Munich airport was forced to halt operations for the second day in a row on Friday over drone sightings, with dozens of flights and more than 6,000 passengers affected.</p><p>Airports in Denmark, Norway and Poland <a href=\"https://www.theguardian.com/world/2025/sep/28/denmark-reports-more-drone-sightings-ahead-of-european-summits\">have recently suspended flights</a> due to unidentified drones, while Romania and Estonia have pointed the finger at Russia, which has brushed off the allegations.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/munich-airport-forced-to-suspend-flights-for-second-day-in-a-row-over-drone-sightings\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Indonesian school collapse: death toll rises to 14 as crews pull more bodies from rubble",
      "link": "https://www.theguardian.com/world/2025/oct/04/indonesian-school-collapse-death-toll-rises-to-14-as-crews-pull-more-bodies-from-rubble",
      "pub_time_taipei": "2025-10-04T10:46:00+08:00",
      "summary": "<p>Dozens of students remain unaccounted for at Sidoarjo boarding school as rescuers bring in heavy excavators to clear large slabs of concrete</p><p>The death toll from a school collapse in Indonesia rose to 14 on Friday after recovery crews pulled multiple bodies from beneath the rubble. Dozens of students remain unaccounted for and the death toll is expected to rise.</p><p>Rescuers initially searched by hand for survivors after the building caved in on Monday. But with no more signs of life detected by Thursday, they turned to heavy excavators equipped with jackhammers to help them progress more rapidly.</p> <a href=\"https://www.theguardian.com/world/2025/oct/04/indonesian-school-collapse-death-toll-rises-to-14-as-crews-pull-more-bodies-from-rubble\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump says Hamas response to peace plan means ‘peace in the Middle East’ is ‘very close’ – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
      "pub_time_taipei": "2025-10-04T10:05:28+08:00",
      "summary": "<p>US president welcomes Hamas response to his Gaza plan despite group saying further negotiations are required over details. This blog is now closed.</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/02/hamas-likely-to-accept-trump-peace-plan-with-key-revisions-experts-say\">Hamas could ask for revisions to Trump Gaza plan, sources and analysts say</a></p></li><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/03/trump-government-shutdown-republicans-democrats\">US government shutdown day three: Republicans and Democrats make little progress on deal</a></p></li><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/03/trump-administration-shutdown-chicago\">Trump administration freezes $2.1bn in funds for Chicago transit projects</a></p></li></ul><p>As the world waits for Hamas’s response to Donald Trump’s <a href=\"https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas\">peace plan for Gaza</a>, the US president has issued a new deadline for the militant group of <strong>6pm ET on Sunday</strong>.</p><p>Trump, who on Monday gave Hamas “three or four days” to respond to his ultimatum, said they were being given “one last chance”. He wrote on his Truth Social platform this morning:</p><p>Every Country has signed on! <strong>If this LAST CHANCE agreement is not reached, all HELL, like no one has ever seen before, will break out against Hamas</strong>.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages",
      "link": "https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages",
      "pub_time_taipei": "2025-10-04T10:02:49+08:00",
      "summary": "<p>Palestinian militant group accepts part of US president’s plan but seeks further negotiations on many terms</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/04/israel-gaza-hamas-trump-plan-hostages-netanyahu-latest-news-updates\">Israel-Gaza live: latest new updates</a></p></li></ul><p>Donald Trump ordered Israel to “immediately” stop bombing Gaza as he welcomed Hamas’s partial acceptance of <a href=\"https://www.theguardian.com/world/2025/oct/03/egypt-foreign-minister-urges-hamas-to-accept-trump-gaza-plan-and-disarm\">his ultimatum to end the nearly two-year war</a>.</p><p>Hamas has agreed to release all hostages in return for Palestinian prisoners held in Israeli jails, as well as surrender governing power in the Gaza Strip, in accordance with <a href=\"https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas\">Trump’s plan</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Dfat officials supporting five Australians in Israeli prison after they were detained on pro-Palestinian flotilla",
      "link": "https://www.theguardian.com/australia-news/2025/oct/03/australians-gaza-flotilla-detained-government-pushing-israel-for-information",
      "pub_time_taipei": "2025-10-04T09:30:23+08:00",
      "summary": "<p>The Global Movement to Gaza group have raised concerns about the conditions in which the Australians are being held in detention</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/03/png-agreement-aukus-submarines-pact-anthony-albanese-richard-marles-retired-admiral-slams-aukus-deal-gaza-flotilla-intercepted-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australian officials are on the ground in Ketziot to support five Australians who have been detained in an Israeli prison after being arrested as part of the pro-Palestinian flotilla carrying aid to Gaza.</p><p>The Israeli navy stopped the Global Sumud Flotilla on Thursday, intercepting all but one of the vessels attempting to breach the blockade. On Friday, all 42 vessels were confirmed to have been <a href=\"https://www.theguardian.com/world/2025/oct/03/final-boat-of-42-strong-pro-palestinian-flotilla-intercepted-by-israel\">stopped by Israeli forces</a>.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/03/australians-gaza-flotilla-detained-government-pushing-israel-for-information\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Kansas deputy pressed knee into cuffed Black man for 86 seconds, records show",
      "link": "https://www.theguardian.com/us-news/2025/oct/03/kansas-sheriff-deputy-black-inmate-death",
      "pub_time_taipei": "2025-10-04T08:29:48+08:00",
      "summary": "<p>Richard Fatherly was charged with second-degree murder in the death of Charles Adair, arrested a day before his death</p><p>A white Kansas sheriff’s deputy charged with murder in the death of an incarcerated Black person shoved his knee into the cuffed man’s back for 1 minute and 26 seconds after he was wheeled back to his cell from the infirmary, newly released court records show.</p><p>Richard Fatherly was charged last month with second-degree murder and an alternative count of involuntary manslaughter in Charles Adair’s 5 July death in the Wyandotte county detention center in Kansas City, Kansas. Adair had been arrested one day before his death on misdemeanor warrants for failure to appear on multiple traffic violations.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/03/kansas-sheriff-deputy-black-inmate-death\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sean ‘Diddy’ Combs sentenced to more than four years in prison and given $500,000 fine – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
      "pub_time_taipei": "2025-10-04T08:25:31+08:00",
      "summary": "<p>Combs, who was convicted of ‘transportation to engage in prostitution’, sentenced in New York. This blog is now closed.</p><p><strong>The prosecution <a href=\"https://viewer.gutools.co.uk/us-news/2025/sep/30/sean-diddy-combs-sentence-recommendation\">submitted several victim impact </a>statements to the court ahead of sentencing, including one from Ventura.</strong></p><p>“While the jury did not seem to understand or believe that I engaged in freak-offs because of the force and coercion the defendant used against me, I know that is the truth, and his sentence should reflect the reality of the evidence and my lived experience as a victim” Ventura <a href=\"https://viewer.gutools.co.uk/us-news/2025/sep/30/sean-diddy-combs-sentence-recommendation\">wrote</a>.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Yeah, nah’: why the Victorian Liberal party has taken an unusual step in the search for future MPs",
      "link": "https://www.theguardian.com/australia-news/2025/oct/04/victorian-liberal-party-reselections-unusual-step-extending-deadline-search-for-future-mps",
      "pub_time_taipei": "2025-10-04T08:00:04+08:00",
      "summary": "<p>The state opposition is changing tack in a bid to attract stronger candidates for high stakes seats and avoid an election catastrophe</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>When the Victorian Liberal party’s state executive met last Thursday, just days before preselections closed in seats held by four retiring MPs, they looked at the list of candidates before them, underwhelmed.</p><p>“The view was, ‘yeah, nah’,” said one Liberal source, who requested anonymity to discuss internal party matters.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/04/victorian-liberal-party-reselections-unusual-step-extending-deadline-search-for-future-mps\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Supreme Court will let Trump end protected status for Venezuelans for now",
      "link": "https://www.washingtonpost.com/politics/2025/10/03/supreme-court-temporary-protected-status/",
      "pub_time_taipei": "2025-10-04T07:47:32+08:00",
      "summary": "A federal judge had ruled on Sept. 5 that Homeland Security Secretary Kristi L. Noem broke the law by revoking the temporary protected status of Venezuelan and Haitian immigrants."
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas accepts Trump’s plan to end the war in Gaza, but with conditions",
      "link": "https://www.washingtonpost.com/world/2025/10/03/hamas-gaza-peace-ceasefire-deal/",
      "pub_time_taipei": "2025-10-04T05:25:59+08:00",
      "summary": "The plan aims to secure the release of Israeli hostages held in the Gaza Strip and end a two-year conflict that has reduced much of the enclave to rubble."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. kills 4 alleged drug smugglers near Venezuela, Hegseth says",
      "link": "https://www.washingtonpost.com/national-security/2025/10/03/hegseth-venezuela-drug-strike/",
      "pub_time_taipei": "2025-10-04T03:05:43+08:00",
      "summary": "The U.S. strike near Venezuela is the latest in the Trump administration’s legally nebulous campaign targeting Latin American drug cartels."
    },
    {
      "source": "衛報",
      "title": "Hegseth says four killed in US strike on alleged drug boat off Venezuelan coast",
      "link": "https://www.theguardian.com/us-news/2025/oct/03/hegseth-venezuela-deadly-boat-strike",
      "pub_time_taipei": "2025-10-04T02:24:34+08:00",
      "summary": "<p>Pentagon chief says strike – fourth by US military in recent weeks – targeted boat with ‘substantial amounts’ of drugs</p><p>The United States carried out a strike against an alleged drug-trafficking boat on Friday that killed four people, US defense secretary <a href=\"https://www.theguardian.com/us-news/pete-hegseth\">Pete Hegseth</a> said, a day after the Trump administration told Congress it was entering a new “non-international armed conflict” with cartels.</p><p>The strike, which Hegseth said he directed on Donald Trump’s orders, appears to be at least the fourth in recent weeks. Hegseth gave few details about the boat or the evidence that it was carrying narcotics, other than saying the US had confirmed it was carrying drugs.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/03/hegseth-venezuela-deadly-boat-strike\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "First woman is named archbishop of Canterbury, leader of Church of England",
      "link": "https://www.washingtonpost.com/world/2025/10/03/archbishop-canterbury-first-woman-england/",
      "pub_time_taipei": "2025-10-04T01:07:48+08:00",
      "summary": "Sarah Mullally, previously the bishop of London, is the first woman to serve as spiritual leader of the Church of England in its nearly 500-year history."
    },
    {
      "source": "華盛頓郵報",
      "title": "Patricia Crowther, dead at 97, brought witchcraft out of the shadows",
      "link": "https://www.washingtonpost.com/obituaries/2025/10/03/patricia-crowther-witch-dead/",
      "pub_time_taipei": "2025-10-04T00:53:10+08:00",
      "summary": "Ms. Crowther, who was called Britain’s oldest witch, wrote books, gave interviews and co-hosted a radio show promoting the Wiccan faith."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump wanted to extend a key U.S.-Africa trade agreement. It expired anyway.",
      "link": "https://www.washingtonpost.com/world/2025/10/03/africa-us-trade-program-expired/",
      "pub_time_taipei": "2025-10-04T00:15:03+08:00",
      "summary": "With Capitol Hill mired in the government shutdown or on recess, a 25-year-old trade legislation was allowed to lapse despite 11th-hour White House backing."
    },
    {
      "source": "衛報",
      "title": "Egypt foreign minister urges Hamas to accept Trump Gaza plan and disarm",
      "link": "https://www.theguardian.com/world/2025/oct/03/egypt-foreign-minister-urges-hamas-to-accept-trump-gaza-plan-and-disarm",
      "pub_time_taipei": "2025-10-03T23:14:25+08:00",
      "summary": "<p>Hamas reportedly split on response to deal as US president sets Sunday deadline for militant group to reply</p><p>Egypt and Qatar are working to convince Hamas to accept Donald Trump’s ultimatum to end the war in Gaza, Egypt’s foreign minister has said, as Trump gave a Sunday deadline to reply.</p><p>Badr Abdelatty said the time had come for Hamas to disarm, and that Israel should be given no excuse to continue its offensive in Gaza, where it killed another 28 Palestinians on Friday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/03/egypt-foreign-minister-urges-hamas-to-accept-trump-gaza-plan-and-disarm\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Journalist Mario Guevara deported to El Salvador after 100 days in Ice custody",
      "link": "https://www.theguardian.com/us-news/2025/oct/03/journalist-mario-guevara-ice-deportation",
      "pub_time_taipei": "2025-10-03T22:33:04+08:00",
      "summary": "<p>Removal comes after Emmy-winning Salvadorian reporter was arrested while covering ‘No Kings Day’ protest</p><p>Journalist Mario Guevara’s imprisonment by Immigrations and Customs Enforcement (<a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\">Ice</a>) ended with <a href=\"https://www.theguardian.com/us-news/2025/sep/19/mario-guevara-deportation-georgia-journalist\">deportation</a> to <a href=\"https://www.theguardian.com/world/el-salvador\">El Salvador</a> on Friday, his family announced on social media.</p><p>Guevara has been a media mainstay in the <a href=\"https://www.theguardian.com/us-news/atlanta\">Atlanta</a> area for about 20 years, after fleeing El Salvador to escape leftwing militias in 2004. Though he has a work permit and two of his children are American citizens, he has operated under the “administrative closure” of deportation orders for much of that time.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/03/journalist-mario-guevara-ice-deportation\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How Jane Goodall shaped generations of science and conservation in Africa",
      "link": "https://www.washingtonpost.com/world/2025/10/02/jane-goodall-africa-science-conservation-legacy/",
      "pub_time_taipei": "2025-10-03T22:08:23+08:00",
      "summary": "The late primatologist and advocate became a global face of field research and environmental protection across the continent, and opened doors for women."
    }
  ]
}