{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-25T20:40:08.477656+08:00",
  "window_end_taipei": "2025-10-26T20:40:08.477656+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Trump sanctions have swift impact but will world stop buying Russian oil and gas?",
      "link": "https://www.theguardian.com/business/2025/oct/26/trump-sanctions-impact-russian-oil-gas",
      "pub_time_taipei": "2025-10-26T20:00:02+08:00",
      "summary": "<p>Analysts say president’s war on Russia’s fossil fuel revenues is a chance to bring peace to Ukraine and profit to US</p><p>Donald Trump’s stated mission to broker peace in Ukraine could come down to this simple question: can the US president convince the world to stop buying Russia’s fossil fuels?</p><p>Last week, Trump <a href=\"https://www.theguardian.com/us-news/2025/oct/22/us-sanctions-russia-oil-vladimir-putin-refusal-ukraine-war\">imposed sanctions</a> on Russia’s two largest oil companies, Rosneft and Lukoil, in an effort to damage Moscow’s ability to fund its war machine.</p> <a href=\"https://www.theguardian.com/business/2025/oct/26/trump-sanctions-impact-russian-oil-gas\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fears Gaza ‘temporary’ ceasefire line could become permanent new border",
      "link": "https://www.theguardian.com/world/2025/oct/26/fears-gaza-temporary-ceasefire-line-could-become-permanent-new-border",
      "pub_time_taipei": "2025-10-26T19:55:26+08:00",
      "summary": "<p>Yellow markers installed by IDF entrench divide that cuts strip in two, as hopes of moving to next phase of truce fade</p><p>A supposedly temporary yellow line marking Gaza’s ceasefire is taking an increasingly physical form as the <a href=\"https://www.theguardian.com/world/2025/oct/19/israel-identifies-body-of-11th-hostage-from-gaza-amid-ceasefire-tensions\">precarious truce</a> shows signs of stalling, with potentially dramatic consequences for Palestine’s future.</p><p>Israel Defense Forces (IDF) troops have started installing yellow concrete markers every 200 metres to delineate the area remaining under Israeli control during the first phase of the ceasefire.</p> <a href=\"https://www.theguardian.com/world/2025/oct/26/fears-gaza-temporary-ceasefire-line-could-become-permanent-new-border\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Epping sex offender back in custody after being released from prison in error",
      "link": "https://www.theguardian.com/uk-news/2025/oct/26/epping-sex-offender-back-in-custody-after-being-released-from-prison-in-error",
      "pub_time_taipei": "2025-10-26T19:14:16+08:00",
      "summary": "<p>Hadush Gerberslasie Kebatu, whose case triggered summer protests in Essex, had been seen ‘confused’ after release from HMP Chelmsford</p><p>A former asylum seeker and convicted sex offender who was released from prison in error is back in custody and now faces deportation.</p><p>The Ethiopian national Hadush Gerberslasie Kebatu was <a href=\"https://www.theguardian.com/uk-news/2025/sep/23/asylum-seeker-at-centre-of-essex-hotel-protests-jailed-for-12-months\">jailed for 12 months</a> in September for sexually assaulting a woman and a 14-year-old girl and made the subject of a five-year sexual harm prevention order.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/26/epping-sex-offender-back-in-custody-after-being-released-from-prison-in-error\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Police arrest Louvre heist suspects, Paris prosecutor says",
      "link": "https://www.washingtonpost.com/world/2025/10/26/louvre-robbery-arrests/",
      "pub_time_taipei": "2025-10-26T19:11:33+08:00",
      "summary": "One man arrested was trying to leave the country, the prosecutor said. The arrests come a week after thieves broke into the Louvre museum and stole precious jewels."
    },
    {
      "source": "衛報",
      "title": "High court halts eviction of refugee under Home Office 28-day policy",
      "link": "https://www.theguardian.com/uk-news/2025/oct/26/high-court-halts-eviction-of-refugee-under-home-office-28-day-policy",
      "pub_time_taipei": "2025-10-26T19:00:02+08:00",
      "summary": "<p>Judge intervenes in case, disapplying government rule that charities say drives refugees into homelessness</p><p>A high court judge has overruled the government by halting the eviction of a refugee from his asylum accommodation in an emergency case in the early hours of the morning.</p><p>Mr Justice Johnson made an order in the out-of-hours case just before 2am on Wednesday, disapplying a Home Office policy that requires new refugees to move on from their asylum accommodation within 28 days.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/26/high-court-halts-eviction-of-refugee-under-home-office-28-day-policy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gun violence prevention groups disqualified from grants built around their work",
      "link": "https://www.theguardian.com/us-news/2025/oct/26/gun-violence-prevention-non-profit-grants-disqualified",
      "pub_time_taipei": "2025-10-26T19:00:01+08:00",
      "summary": "<p>Trump administration altering program that was a lifeline for pioneering non-profits helping reduce gun violence</p><p>The Trump administration has released solicitations for a grant program meant to stop gun violence in underserved communities. But this year, the non-profits the grant was built around are disqualified from applying, according to an application notice released by the Department of Justice (DoJ) in September.</p><p>The Community Based Violence Intervention and Prevention Initiative (CVIPI), was created in 2022, to support groups working in rural and urban communities struggling to address violence and fund research studying the programs’ efficacy.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/26/gun-violence-prevention-non-profit-grants-disqualified\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two men arrested after Louvre jewel heist",
      "link": "https://www.theguardian.com/world/2025/oct/26/two-men-reportedly-arrested-after-louvre-jewel-heist",
      "pub_time_taipei": "2025-10-26T18:47:20+08:00",
      "summary": "<p>Two suspects in their 30s detained on Saturday evening in relation to €88m robbery, according to French media</p><p>Two suspects have been arrested in relation to last Sunday’s heist at the Louvre museum in Paris, in which a gang of four men made off with crown jewels worth an estimated €88m (£76m), French media have reported.</p><p>The Paris public prosecutor confirmed on Sunday that one man had been detained by organised crime squad officers at about 10pm (8pm UK time) on Saturday at Charles de Gaulle airport in Paris, but did not say how many arrests had been made.</p> <a href=\"https://www.theguardian.com/world/2025/oct/26/two-men-reportedly-arrested-after-louvre-jewel-heist\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump oversees Thailand-Cambodia ceasefire signing as Asia tour gets under way",
      "link": "https://www.theguardian.com/us-news/2025/oct/26/trump-oversees-thailand-cambodia-ceasefire-signing-as-asia-tour-gets-under-way",
      "pub_time_taipei": "2025-10-26T18:28:05+08:00",
      "summary": "<p>Trump has begun a five-day trip to Malaysia, Japan and South Korea, his first visit to the region since taking office in January</p><p>Donald Trump has overseen the signing of a ceasefire agreement between Thailand and Cambodia on the first day of an Asia tour where he will seal new trade agreements and hold a crucial meeting with Xi Jinping.</p><p>The US president arrived in Malaysia on Sunday ahead of the Asean summit in the capital, Kuala Lumpur. At a ceasefire ceremony in front of a sign that read “Delivering Peace”, the Thai prime minister, Anutin Charnvirakul, and his Cambodian counterpart, Hun Manet, signed an expanded ceasefire deal related to <a href=\"https://www.theguardian.com/world/2025/jul/24/why-thailand-cambodia-border-clash-conflict\">a deadly five-day conflict in July</a>.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/26/trump-oversees-thailand-cambodia-ceasefire-signing-as-asia-tour-gets-under-way\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "What to know about the U.S. forces closing in on Venezuela",
      "link": "https://www.washingtonpost.com/world/2025/10/26/us-military-ships-planes-venezuela/",
      "pub_time_taipei": "2025-10-26T18:00:44+08:00",
      "summary": "The Trump administration has sent warships, fighter jets and surveillance aircraft to the region as it wages what it says is armed conflict against narco-terrorists."
    },
    {
      "source": "衛報",
      "title": "Trump’s move to pay troops amid shutdown sets dangerous precedent, experts warn",
      "link": "https://www.theguardian.com/us-news/2025/oct/26/trump-military-pay-government-shutdown",
      "pub_time_taipei": "2025-10-26T18:00:03+08:00",
      "summary": "<p>Experts see move as Trump’s latest attempt to shift power of the purse away from Congress and into executive branch</p><p>By ordering that US military personnel <a href=\"https://www.theguardian.com/us-news/2025/oct/11/trump-shutdown-military-pay\">receive paychecks</a> even though the government is shut down, Donald Trump is seeing to the needs of a politically untouchable constituency that has been caught up in the congressional logjam over federal spending.</p><p>But experts who spoke to the Guardian warn that he is doing so in a way that is almost certainly illegal and, if left unchecked, bodes ill for Congress’s constitutional authority to control government spending. Some fear it could set the stage for the president to unilaterally fund other contentious decisions in the future, such as the deployment of the military on US soil.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/26/trump-military-pay-government-shutdown\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russia arrests Ukrainian biologist for backing curbs on Antarctic krill fishing",
      "link": "https://www.theguardian.com/environment/2025/oct/26/russia-ukrainian-biologist-leonid-pshenichnov-arrest-treason-antarctic-krill-overfishing",
      "pub_time_taipei": "2025-10-26T18:00:01+08:00",
      "summary": "<p>‘Trumped-up’ charges spark diplomatic row as scientists express fears for health of 70-year-old Leonid Pshenichnov</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/oct/26/explainer-antarctic-krill-vital-ecosystem-food-chain-conservation-carbon-store\">Antarctic krill: how did a paperclip-sized crustacean cause a diplomatic row – and why are they so important?</a></p></li></ul><p></p><p>A diplomatic row has erupted over the “illegal” detention of one of Ukraine’s scientists, who has been accused by the Kremlin of undermining Russia’s industrial trawling for krill in Antarctica.</p><p>Leonid Pshenichnov, 70, a Ukrainian biologist who is an expert on Antarctica, has a decades-long record of scientific research and contributions to conservation, including support for marine protected areas in the region.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/26/russia-ukrainian-biologist-leonid-pshenichnov-arrest-treason-antarctic-krill-overfishing\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Sudanese paramilitary enters army’s last stronghold in Darfur",
      "link": "https://www.washingtonpost.com/world/2025/10/26/sudan-rsf-el-fashir-darfur/",
      "pub_time_taipei": "2025-10-26T17:56:57+08:00",
      "summary": "El Fashir is the last major city in the western region of Darfur held by Sudan’s military forces. The Rapid Support Forces’ entry raises fears of a bloodbath."
    },
    {
      "source": "華盛頓郵報",
      "title": "How Trump’s perception of Japan collides with today’s economic reality",
      "link": "https://www.washingtonpost.com/world/2025/10/26/trump-japan-tariffs-trade/",
      "pub_time_taipei": "2025-10-26T17:00:00+08:00",
      "summary": "Japan was the genesis of President Donald Trump’s tariff-led approach to reshaping the global economy. When he lands in Tokyo, trade will again be on his agenda."
    },
    {
      "source": "衛報",
      "title": "NI parents caught in UK crackdown lose child benefit after travelling via Dublin",
      "link": "https://www.theguardian.com/uk-news/2025/oct/26/ni-parents-caught-in-uk-crackdown-lose-child-benefit-after-travelling-via-dublin",
      "pub_time_taipei": "2025-10-26T16:00:58+08:00",
      "summary": "<p>Exclusive: new anti-fraud system fails to account for fact many return to country via airport in Irish capital</p><p>Parents in Northern Ireland have had their child support payments stopped as part of the UK government’s crackdown on alleged benefit fraud simply because they returned from a holiday via Dublin airport.</p><p>So far 346 families have had their benefits frozen, <a href=\"https://thedetail.tv/\">an investigation by NI online newspaper, the Detail</a>, shared with the Guardian, has discovered.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/26/ni-parents-caught-in-uk-crackdown-lose-child-benefit-after-travelling-via-dublin\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Peer trying to derail UK smoking ban discussed bill with relative at tobacco firm",
      "link": "https://www.theguardian.com/business/2025/oct/26/uk-smoking-ban-lord-strathcarron-relative-british-american-tobacco",
      "pub_time_taipei": "2025-10-26T16:00:58+08:00",
      "summary": "<p>Lord Strathcarron says he and an in-law ‘high up’ at British American Tobacco discussed bill, which he aims to weaken</p><p>A member of the House of Lords who is trying to derail the generational ban on tobacco sales discussed the legislation with a family member who is “very high up” at British American Tobacco (BAT).</p><p>Lord Strathcarron is proposing amendments that would scrap the central provision of the tobacco and vapes bill, originally proposed by Rishi Sunak’s government.</p> <a href=\"https://www.theguardian.com/business/2025/oct/26/uk-smoking-ban-lord-strathcarron-relative-british-american-tobacco\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How one cyber-scamming syndicate used Singapore for legitimacy",
      "link": "https://www.washingtonpost.com/world/2025/10/26/cyber-scamming-prince-group-syndicate-singapore/",
      "pub_time_taipei": "2025-10-26T16:00:00+08:00",
      "summary": "The chairman of Prince Group, indicted over online scams, and his associates took advantage of Singapore’s reputation as stable and predictable financial capital."
    },
    {
      "source": "衛報",
      "title": "Cruise control: could a £5 ‘entry’ fee help balance Orkney’s needs with tourist demand?",
      "link": "https://www.theguardian.com/uk-news/2025/oct/26/orkney-council-tourist-levy-call-visitor-boom",
      "pub_time_taipei": "2025-10-26T15:00:56+08:00",
      "summary": "<p>With tourists outnumbering locals by 20:1, islanders say levy is needed to help protect neolithic sites and maintain public services</p><p>Artisan jewellery, gift and whisky shops crowd the main street of Kirkwall on Orkney. The town even has a new sushi shop, offering bento boxes and matcha cheesecake.</p><p>Once home to the Viking earls who ruled the islands, Kirkwall has hit it rich: it tops the UK’s charts for cruise ship visits, as American, German and Italian tourists descend on remarkable neolithic sites such as Skara Brae and its medieval cathedral.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/26/orkney-council-tourist-levy-call-visitor-boom\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Russian drone attack on Kyiv leaves three people dead and dozens wounded, mayor says",
      "link": "https://www.theguardian.com/world/2025/oct/26/russian-drone-attack-on-kyiv-leaves-three-people-dead-and-dozens-wounded-mayor-says",
      "pub_time_taipei": "2025-10-26T14:53:34+08:00",
      "summary": "<p>Vitali Klitschko says six children hurt in overnight attack that sparked fires in apartment buildings</p><p>An overnight Russian drone attack on Kyiv killed three people and wounded dozens, the mayor of the Ukrainian capital has said.</p><p>The head of Kyiv’s military administration said early on Sunday that “several” Russian drones were operating over the city, and warned people to “remain in shelters”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/26/russian-drone-attack-on-kyiv-leaves-three-people-dead-and-dozens-wounded-mayor-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Do populists always crash the economy?",
      "link": "https://www.theguardian.com/news/ng-interactive/2025/oct/26/do-populists-always-crash-the-economy",
      "pub_time_taipei": "2025-10-26T14:00:56+08:00",
      "summary": "<p>Argentina is counting the cost of its turn to Javier Milei. Politicians from Donald Trump to Giorgia Meloni and Nigel Farage will be closely watching what happens next</p><p>“<em>Cambio</em>, <em>cambio</em>.” Under the blazing sun, dozens of money changers are hawking US dollars along Florida Street, a bustling pedestrian strip in Buenos Aires. Known as <em>arbolitos</em> (“little trees”), they are thriving ahead of the 26 October midterm elections in a country long used to saving in the greenback.</p><p>“The best time to buy is now,” says one <em>arbolito</em>, declining to give her name. “[The dollar] went down a little but it is a fake-out – it’ll rise again.”</p> <a href=\"https://www.theguardian.com/news/ng-interactive/2025/oct/26/do-populists-always-crash-the-economy\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Line drawn by 19th-century Britain stokes Pakistan-Taliban tension",
      "link": "https://www.washingtonpost.com/world/2025/10/26/afghanistan-pakistan-border-durand-line/",
      "pub_time_taipei": "2025-10-26T14:00:00+08:00",
      "summary": "The Durand Line, a legacy of the British Empire from 1893, is dividing the neighbors today."
    },
    {
      "source": "衛報",
      "title": "Australia news live: thunderstorm asthma warning for Victoria’s north as wild weather threatens east coast",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/26/australia-news-live-anthony-albanese-asean-apac-coalition-matt-canavan-renewable-energy-solar-power",
      "pub_time_taipei": "2025-10-26T13:25:08+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/26/australia-must-step-up-avoid-loss-life-amid-trump-cuts-tom-frieden-former-cdc\">Australia must ‘step up to prevent catastrophic and preventable loss of life’ amid Trump cuts, former CDC boss says</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Trump shadow looms large as PM scales regional summits</strong></p><p>World leaders, including&nbsp;<strong>Anthony</strong>&nbsp;<strong>Albanese,</strong>&nbsp;will jostle for position at major regional summits as talks between&nbsp;<strong>Donald</strong>&nbsp;<strong>Trump</strong>&nbsp;and&nbsp;<strong>Xi</strong>&nbsp;<strong>Jinping</strong>&nbsp;take centre stage.</p><p>I’d love to keep him part of the team.</p><p>I think he is, David. Because support for net zero is dropping off a cliff. There was a poll just a couple of weeks ago to show that net zero has net zero support, which is a big turnaround in just a few months, and I think that Barnaby played a role in that, and the net zero promise we were made is not delivering and working for the Australian people. Because they’ve seen their power bills go up, and the jobs go offshore, and it’s time to think again about this.</p><p>It’s got nothing to do with One Nation. I don’t care about One Nation. I care about the thousands of hard-working men and women, many of whom are members of the Liberal-National party who have given me this enormous privilege to serve my country and state, and I’m not going to turn my back on them.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/26/australia-news-live-anthony-albanese-asean-apac-coalition-matt-canavan-renewable-energy-solar-power\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Allan says Victoria machete ban is working despite brawl at community sport event",
      "link": "https://www.theguardian.com/australia-news/2025/oct/26/allan-says-victoria-machete-ban-is-working-despite-brawl-that-left-teenager-with-serious-injuries",
      "pub_time_taipei": "2025-10-26T13:11:02+08:00",
      "summary": "<p>Police were called to a fight among a large group of men armed with machetes on Saturday evening</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/26/australia-news-live-anthony-albanese-asean-apac-coalition-matt-canavan-renewable-energy-solar-power\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Victorian premier, Jacinta Allan, has said the state’s machete ban is working, despite reports of a brawl on Saturday night in Melbourne’s north and the discovery of a teenager with serious injuries nearby.</p><p>Police were called to respond to a large group of males, aged in their late teens, fighting with machetes on Saturday evening, Det Sgt Matthew Feben told reporters on Sunday morning.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/26/allan-says-victoria-machete-ban-is-working-despite-brawl-that-left-teenager-with-serious-injuries\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Minister to retain final say on controversial projects under Labor’s long-awaited nature laws",
      "link": "https://www.theguardian.com/australia-news/2025/oct/26/minister-to-retain-final-say-on-controversial-projects-under-labors-long-awaited-nature-laws",
      "pub_time_taipei": "2025-10-26T12:06:32+08:00",
      "summary": "<p>Retention of ministerial powers satisfies key demand of Coalition and industry but disappoints groups who wanted ‘arms-length’ review</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/26/australia-news-live-anthony-albanese-asean-apac-coalition-matt-canavan-renewable-energy-solar-power\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The environment minister will still be responsible for approving projects under new federal nature laws, after Labor rebuffed calls for a completely independent watchdog with full decision-making powers.</p><p>The retention of ministerial decision-making powers satisfies a key demand from the Coalition and industry and is not opposed by the Greens.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/26/minister-to-retain-final-say-on-controversial-projects-under-labors-long-awaited-nature-laws\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Ignorant’: former Labor MP condemns Minns government for threatening Blue Mountains protesters over historic site",
      "link": "https://www.theguardian.com/australia-news/2025/oct/26/ignorant-former-labor-mp-condemns-minns-government-for-threatening-blue-mountains-protesters-over-historic-site",
      "pub_time_taipei": "2025-10-26T09:56:14+08:00",
      "summary": "<p>Former home affairs minister Bob Debus, who served in the Rudd government, throws his support behind Clairvaux in Katoomba</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/26/australia-news-live-anthony-albanese-asean-apac-coalition-matt-canavan-renewable-energy-solar-power\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The state government has threatened to treat First Nations and environmental groups as trespassers if they continue to use a historic home in the Blue Mountains that was once an infamous “house of horrors” but was reclaimed as a community hub.</p><p>But a former state and federal MP and stalwart of the Labor party has criticised the Minns government as “unethical” and “ignorant”, for enforcing the eviction of the groups from Clairvaux in Katoomba.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/26/ignorant-former-labor-mp-condemns-minns-government-for-threatening-blue-mountains-protesters-over-historic-site\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Texas officers heroically rescue baby pinned under car after overturn crash",
      "link": "https://www.theguardian.com/us-news/2025/oct/25/texas-heroic-rescue-baby",
      "pub_time_taipei": "2025-10-26T07:25:12+08:00",
      "summary": "<p>Fort Worth police share video of extraordinary effort by officers and motorists to pull car off baby and give CPR</p><p>A baby is expected to make a full recovery and two Fort Worth police officers are being hailed as heroes after saving the infant, who was pinned under an overturned car after a crash on Texas’s Interstate 30 on Thursday morning.</p><p>Fort Worth police said in a social media post that Sgt R Nichols and officer E Bounds responded to a crash around 9.30am where a woman and an infant had been in a collision that caused the infant to be ejected from the vehicle.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/25/texas-heroic-rescue-baby\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump raises tariffs on Canada by 10% over Reagan ad",
      "link": "https://www.washingtonpost.com/politics/2025/10/25/trump-canada-tariffs-reagan-ad/",
      "pub_time_taipei": "2025-10-26T06:58:05+08:00",
      "summary": "President Donald Trump had halted trade talks with Canada over a provincial government’s ad that has since been canceled."
    },
    {
      "source": "華盛頓郵報",
      "title": "Ireland elects a leftist who campaigned on economic justice, Gaza",
      "link": "https://www.washingtonpost.com/world/2025/10/25/ireland-president-catherine-connolly-elected/",
      "pub_time_taipei": "2025-10-26T06:43:37+08:00",
      "summary": "Catherine Connolly, an independent endorsed by Sinn Fein, campaigned on calls for urgent domestic reform with an unflinching critique of Israel’s war in Gaza."
    },
    {
      "source": "衛報",
      "title": "At least four killed in Russian strikes overnight on Ukraine",
      "link": "https://www.theguardian.com/world/2025/oct/25/russian-overnight-strikes-ukraine-zelenskyy-sanctions-oil",
      "pub_time_taipei": "2025-10-26T06:15:22+08:00",
      "summary": "<p>Attacks come after Volodymyr Zelenskyy appeals to US for long-range missiles and urges allies to expand sanctions on Russian oil</p><p>Russian missile and drone attacks on Ukraine overnight into Saturday killed at least four people and wounded 20, officials said, and prompted fresh pleas from Ukraine’s president for western air defence systems.</p><p>In the capital, Kyiv, two people were killed and 13 were wounded in a ballistic missile attack in the early hours of Saturday, Kyiv’s police said.</p> <a href=\"https://www.theguardian.com/world/2025/oct/25/russian-overnight-strikes-ukraine-zelenskyy-sanctions-oil\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "New Jersey officer charged after going out for pizza instead of responding to shooting",
      "link": "https://www.theguardian.com/us-news/2025/oct/25/new-jersey-pizza-double-homicide",
      "pub_time_taipei": "2025-10-26T06:10:03+08:00",
      "summary": "<p>Sgt Kevin Bollaro accused of misconduct and falsifying report after blowing off investigation of a double homicide</p><p>A New Jersey officer has been charged with misconduct after prosecutors say he didn’t quickly respond to and properly investigate reports of a shooting that turned out to be a double murder, instead stopping at an ATM and pizzeria.</p><p>Franklin township police sergeant Kevin Bollaro was the on-duty officer on the evening of 1 August when police received 911 calls reporting gunshots and screaming in Pittstown, about 60 miles (96 kilometers) from Manhattan in central New Jersey, according to Hunterdon county prosecutor Renée Robeson’s office.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/25/new-jersey-pizza-double-homicide\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump raises tariffs on Canada by 10% in retaliation for anti-tariff TV ad",
      "link": "https://www.theguardian.com/us-news/2025/oct/25/trump-tariffs-canada-ronald-reagan",
      "pub_time_taipei": "2025-10-26T05:48:46+08:00",
      "summary": "<p>Move is response to ad sponsored by Ontario that referenced Ronald Reagan’s support for free trade</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> announced on Saturday that he will raise US tariffs on Canada by 10% in retaliation for <a href=\"https://www.theguardian.com/us-news/2025/oct/24/trump-canada-trade-negotations-ontario-tariffs\">an anti-tariff advertisement</a> sponsored by the Ontario government, which has further strained one of the world’s largest trade partnerships.</p><p>The statement, posted on Trump’s Truth Social account, came after several days of public disputes over the ad, which referenced Ronald Reagan’s support for free trade and provoked the US president’s anger.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/25/trump-tariffs-canada-ronald-reagan\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "A year on as Queensland premier, will David Crisafulli’s small-target strategy prove his undoing?",
      "link": "https://www.theguardian.com/australia-news/2025/oct/26/queensland-premier-david-crisafulli-one-year-on",
      "pub_time_taipei": "2025-10-26T03:00:42+08:00",
      "summary": "<p>The LNP government has a firm stance on only one issue – youth crime – and is looking like it’s in need of an agenda</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/26/australia-news-live-anthony-albanese-asean-apac-coalition-matt-canavan-renewable-energy-solar-power\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>When David Crisafulli speaks to the Liberal National party faithful, his message tends to become a blunt warning to members and MPs to keep any unsavoury, unelectable tendencies out of sight.</p><p>“We don’t exist for culture wars,” the Queensland premier – who marks a year in office on Sunday – told the party’s state council just after the 2024 election.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/26/queensland-premier-david-crisafulli-one-year-on\">Continue reading...</a>"
    }
  ]
}