{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-29T20:40:07.159652+08:00",
  "window_end_taipei": "2025-09-30T20:40:07.159652+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "‘We’re ending the war on warriors’: Pete Hegseth addresses senior military leaders in Virginia – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
      "pub_time_taipei": "2025-09-30T20:30:22+08:00",
      "summary": "<p>Defense secretary speaks to hundreds of generals and admirals who have been summoned at short notice to the Marine Corps Museum in Quantico</p><p><strong>The US government is hurtling towards its first shutdown in six years, with no signs <a href=\"https://www.theguardian.com/us-news/us-congress\">congressional</a> leaders are near agreement on legislation to continue funding beyond the Tuesday night deadline to prevent workers from being furloughed and agencies from shutting their doors.</strong></p><p>Congress’s <a href=\"https://www.theguardian.com/us-news/republicans\">Republican</a> majority is pushing legislation to fund the government through 21 November, but Democrats have refused to vote for it unless it includes a series of concessions centered on healthcare.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Netanyahu says he did not agree to Palestinian state as part of Trump Gaza plan, and IDF will remain ‘in most of territory’ – live",
      "link": "https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live",
      "pub_time_taipei": "2025-09-30T20:28:36+08:00",
      "summary": "<p>Israeli PM says ‘we turned the tables and isolated Hamas’, while Qatar says it will hold talks on the proposals with Hamas and Turkey later on Tuesday</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas\">What’s in Trump’s 20-point peace plan for Gaza?</a></p></li></ul><p>The Gaza health ministry has announced on Telegram that<strong> 453 people, including 150 children, have died of famine and malnutrition in Gaza.</strong></p><p>Since the <strong>Integrated Food Security Phase Classification (IPC)</strong> declared famine in Gaza in August, a further <strong>175 deaths</strong> have been recorded, among them <strong>35 children</strong>.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Streeting calls Farage ‘snake-oil salesman’ and says Reform UK would be ‘disaster’ for NHS – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
      "pub_time_taipei": "2025-09-30T20:28:28+08:00",
      "summary": "<p>Health secretary’s Labour conference speech attacks Reform leader as ‘anti-science, anti-reason, anti-health’</p><p><strong>Wes Streeting</strong>, the health secretary, has said that Tony Blair could play a positive role in Gaza helping to lead the administration there proposed under Donald Trump’s peace plan.</p><p>In an interview on LBC, Streeting said that Blair’s decision to involve the UK in the Iraq war was “a catastrophic error” that had “devasting consequences”. He said that he personally opposed it at the time.</p><p>I also think about Tony Blair’s other legacy, great legacy, which is Northern Ireland, and there he showed that he could bring together sworn enemies to broker a lasting peace.</p><p>So if Tony Blair can put those skills to use, if he’s got the confidence of both the Israelis, the Palestinians, and the regional players, as seems to be the case, then great. If he can make that contribution, and that can be another legacy, a positive legacy under his belt, then so much the better.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nigel Farage a ‘snake oil salesman’ comparable to Andrew Tate, says No 10 chief secretary",
      "link": "https://www.theguardian.com/politics/2025/sep/30/nigel-farage-a-snake-oil-salesman-comparable-to-andrew-tate-says-no-10-chief-secretary",
      "pub_time_taipei": "2025-09-30T20:27:51+08:00",
      "summary": "<p>Senior ministers signal Labour will take stronger approach to attacking Reform rather than just ‘respond to the crazy things they’re saying’</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform\">UK politics live – latest updates</a></p></li></ul><p>Keir Starmer’s new No 10 enforcer has compared Nigel Farage to the influencer Andrew Tate, saying he is a “snake oil salesman” who is taking working-class boys down a dark path.</p><p>Darren Jones, the No 10 chief secretary to the prime minister, said Labour was going to take a more “muscular approach to attacking Reform” and it would be “more proactive than just responding to the crazy things they’re saying”.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/30/nigel-farage-a-snake-oil-salesman-comparable-to-andrew-tate-says-no-10-chief-secretary\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Europe must give strong and united response to Russian drone incursions, says von der Leyen – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/30/europe-russia-drones-ukraine-rutte-von-der-leyen-poland-kellogg-latest-updates",
      "pub_time_taipei": "2025-09-30T20:26:10+08:00",
      "summary": "<p>European Commission president met Nato secretary general while UK, France, Germany and Sweden have said they will help Denmark increase security ahead of Copenhagen summits</p><p>If you are keen to understand the dynamics between the US and Belarus a bit better (<a href=\"https://www.theguardian.com/world/live/2025/sep/30/europe-russia-drones-ukraine-rutte-von-der-leyen-poland-kellogg-latest-updates?page=with%3Ablock-68db8b538f08206a90f095d2#block-68db8b538f08206a90f095d2\">10:08</a>), here’s a brilliant story from our own <strong>Pjotr Sauer</strong>, who recently visited Minsk.</p><p><em>Since Trump took office, Lukashenko, an authoritarian strongman who has ruled <a href=\"https://www.theguardian.com/world/belarus\">Belarus</a> since 1994, has been edging out of the diplomatic freeze, cautiously probing for space beyond Moscow, which sees Belarus as both its closest ally and a vital buffer.</em></p><p><em>Sensing a political opening with the new Trump administration, Lukashenko has regularly met US officials and even held a call with the US president, who has floated the idea of a direct meeting. </em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/30/europe-russia-drones-ukraine-rutte-von-der-leyen-poland-kellogg-latest-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Afghanistan ‘blind without phones and internet’ on second day of telecoms blackout",
      "link": "https://www.theguardian.com/world/2025/sep/30/afghanistan-mobile-phones-internet-telecoms-blackout-taliban",
      "pub_time_taipei": "2025-09-30T20:16:07+08:00",
      "summary": "<p>Taliban authorities cut fibre-optic network in nationwide shutdown of communications to prevent ‘vice’</p><p>Afghans are living under a near-complete communications blackout after Taliban authorities cut internet and mobile phone services for a second day as part of an unprecedented country-wide crackdown.</p><p>The former insurgents, who retook control of Afghanistan in 2021, began gradual <a href=\"https://www.theguardian.com/global-development/2025/sep/23/taliban-afghanistan-internet-shutdown-women-girls-education-hope\">restrictions on internet access earlier this month</a>. The measures also affect telephone lines, as they are often routed over the internet.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/afghanistan-mobile-phones-internet-telecoms-blackout-taliban\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump pressure tactics in Comey case ‘chilling’ – but they could backfire, experts say",
      "link": "https://www.theguardian.com/us-news/2025/sep/30/trump-comey-prosecution-justice-department",
      "pub_time_taipei": "2025-09-30T20:00:41+08:00",
      "summary": "<p>Former prosecutors condemn ‘takeover of the DoJ’ but say chance of success could be tainted by president’s comments</p><p>Donald Trump’s public and private push to have ex-FBI director James Comey indicted on criminal charges is<strong> </strong>a strong sign of the US slipping into authoritarianism, but it could also taint the case’s chances of success because it is evidence of a selective and biased political prosecution, ex-prosecutors and scholars say.</p><p>Trump’s retribution drive against an old foe he blames for legal and political problems notched a big win when Comey was indicted last week on two criminal counts in Virginia.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/30/trump-comey-prosecution-justice-department\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US government heads toward first shutdown in six years as lawmakers fail to reach agreement",
      "link": "https://www.theguardian.com/us-news/2025/sep/30/us-government-shutdown-congress-trump-republicans",
      "pub_time_taipei": "2025-09-30T19:43:05+08:00",
      "summary": "<p>Republicans push legislation to fund government through late November, but Democrats refuse unless it includes concessions centered on healthcare</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\">US politics – latest updates</a></p></li></ul><p>The US government is hurtling towards its first shutdown in six years, with no signs <a href=\"https://www.theguardian.com/us-news/us-congress\">congressional</a> leaders are near agreement on legislation to continue funding beyond the Tuesday night deadline to prevent workers from being furloughed and agencies from shutting their doors.</p><p>Congress’s <a href=\"https://www.theguardian.com/us-news/republicans\">Republican</a> majority is pushing legislation to fund the government through 21 November, but Democrats have refused to vote for it unless it includes a series of concessions centered on healthcare.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/30/us-government-shutdown-congress-trump-republicans\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Base formulation may be linked to 20 sunscreens falling short of SPF claims, drug regulator finds",
      "link": "https://www.theguardian.com/australia-news/2025/sep/30/base-formulation-may-be-linked-to-20-sunscreens-falling-short-of-spf-claims-drug-regulator-finds",
      "pub_time_taipei": "2025-09-30T19:39:17+08:00",
      "summary": "<p>TGA investigation also finds some testing laboratories may be more reliable than others</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The same base formulation has been identified in 20 sunscreens that Australia’s medicines regulator has warned are unlikely to have a sun protection factor (SPF) rating of more than 21, with some products as low as SPF 4.</p><p>The Therapeutic Goods Administration (TGA) on Tuesday identified sunscreens sold by 17 different companies using a base formulation made by manufacturer Wild Child Laboratories as likely to fall far short of their sun protection factor claims.</p><p>Aspect Sun SPF50+ Physical Sun Protection</p><p>Aspect Sun SPF50+ Tinted Physical Sun Protection</p><p>Aesthetics Rx Ultra Protection Sunscreen Cream</p><p>New Day Skin Good Vibes Sunscreen SPF50+</p><p>New Day Skin Happy Days Sunscreen SPF50+</p><p>Allganics Light Sunscreen SPF50+</p><p>Beauti-FLTR Lustre Mineral SPF50+</p><p>Found My Skin SPF 50+ Tinted Face/Body Cream</p><p>Ethical Zinc Daily Wear Light Sunscreen</p><p>Ethical Zinc Daily Wear Tinted Facial Sunscreen (Dark)</p><p>Ethical Zinc Daily Wear Tinted Facial Sunscreen (Light)</p><p>Endota Mineral Protect SPF50 Sunscreen</p><p>We are Feel Good Inc Mineral Sunscreen SPF50+</p><p>GlindaWand The Fountain of Youth Environmental Defence Cream SPF50+</p><p>Ultra Violette Velvet Screen SPF50 (product export only - not available in Australia)</p><p>People4Ocean SPF 50+ Mineral Bioactive Shield Lightly Tinted Cream</p><p>McoBeauty SPF50+ Mineral Mattifying Sunscreen</p><p>Naked Sundays Collagen Glow Mineral Sunscreen</p><p>Outside Beauty &amp; Skincare SPF 50+ Mineral Primer</p><p>Salus SPF50+ Daily Facial Sunscreen Broad Spectrum</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/30/base-formulation-may-be-linked-to-20-sunscreens-falling-short-of-spf-claims-drug-regulator-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Andrew Tate to face no criminal charges over abuse claims made in UK civil case",
      "link": "https://www.theguardian.com/news/2025/sep/29/andrew-tate-to-face-no-criminal-charges-over-abuse-claims-made-in-uk-civil-case",
      "pub_time_taipei": "2025-09-30T19:26:23+08:00",
      "summary": "<p>Four women are suing influencer at high court but CPS rules legal test for criminal prosecution not met</p><p>Andrew Tate will face no criminal charges over allegations made by four women who are suing him in a civil case at the high court in London.</p><p>The women accuse the self-proclaimed misogynist influencer of sexual violence, including grabbing one by the throat on several occasions in 2015, whipping her with a belt and pointing a gun at her face.</p> <a href=\"https://www.theguardian.com/news/2025/sep/29/andrew-tate-to-face-no-criminal-charges-over-abuse-claims-made-in-uk-civil-case\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Netanyahu tries to sell Trump’s Gaza peace plan to a skeptical right wing",
      "link": "https://www.washingtonpost.com/world/2025/09/30/trump-netanyahu-gaza-war-ceasefire/",
      "pub_time_taipei": "2025-09-30T19:21:56+08:00",
      "summary": "Hamas has not commented on President Donald Trump’s ceasefire proposal, which Netanyahu said would include the release of all Israeli hostages but keep Israeli forces in most of Gaza."
    },
    {
      "source": "衛報",
      "title": "Trump gutting protected status for immigrants will strain US healthcare, Democrats warn",
      "link": "https://www.theguardian.com/us-news/2025/sep/30/trump-temporary-protected-status-healthcare-democrats",
      "pub_time_taipei": "2025-09-30T19:00:07+08:00",
      "summary": "<p>Exclusive: more than 100 members of Congress warn TPS cancellations will result in significant staff losses that US healthcare facilities will struggle to replace</p><p>The US healthcare system faces a “perfect storm”, more than 100 members of Congress warn today, as Donald Trump’s administration risks exacerbating pressure on its workforce by stripping nearly one million US immigrants of work authorization and legal protection.</p><p>Temporary Protected Status (TPS) has granted about 570,000 US workers protection from deportation, as their home countries are regarded as dangerous, due to factors like war and natural disaster.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/30/trump-temporary-protected-status-healthcare-democrats\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sock it to the shoes: why more offices are going footwear-free",
      "link": "https://www.theguardian.com/money/2025/sep/30/sock-it-to-the-shoes-why-more-offices-are-going-footwear-free",
      "pub_time_taipei": "2025-09-30T19:00:06+08:00",
      "summary": "<p>British companies are trialling no-shoes policies as a way to improve focus, comfort and morale – but not everyone is convinced</p><p>Slippers, socks and the occasional novelty toe warmer are fast becoming part of the office dress code for startups hoping to ease stress and boost creativity.</p><p>It might sound like a gimmick conjured up during a yoga retreat, but asking staff to leave their shoes at the door taps into something more serious: how to make the workplace feel a little less like work.</p> <a href=\"https://www.theguardian.com/money/2025/sep/30/sock-it-to-the-shoes-why-more-offices-are-going-footwear-free\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: Trump and Netanyahu tell Hamas to accept Gaza peace plan or face consequences",
      "link": "https://www.theguardian.com/us-news/2025/sep/30/first-thing-trump-and-netanyahu-tell-hamas-to-accept-gaza-peace-plan-or-face-consequences",
      "pub_time_taipei": "2025-09-30T18:57:39+08:00",
      "summary": "<p>The Israeli PM threatens to ‘finish the job’ if Hamas does not agree. Plus, do AI ‘actors’ pose an existential threat to their human counterparts?</p><p>Good morning.</p><p>President Donald Trump and the Israeli prime minister, Benjamin Netanyahu, <a href=\"https://www.theguardian.com/world/2025/sep/29/trump-netanyahu-gaza-peace-plan\">have given Hamas an ultimatum</a>, warning the militant group to accept their 20-point peace plan or face the consequences.</p><p><strong>What does the plan call for?</strong> A ceasefire, a swap of hostages held by Hamas for Palestinian prisoners held by Israel, a staged Israeli withdrawal from Gaza, Hamas disarmament and a transitional government led by an international body.</p><p><a href=\"https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live\">Head to our live blog for the latest updates</a>.</p><p><strong>What healthcare provisions are Democrats demanding?</strong> An extension of subsidies for Affordable Care Act health plans, which expire at the end of the year, and a reversal of Medicaid cuts.</p><p><strong>How would a shutdown be received?</strong> 45% of voters would blame congressional Republicans for a shutdown, while 32% would blame Democrats, according to polling from Morning Consult.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/30/first-thing-trump-and-netanyahu-tell-hamas-to-accept-gaza-peace-plan-or-face-consequences\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nothing to link Banbury gang-rape to migrant accommodation, police say",
      "link": "https://www.theguardian.com/uk-news/2025/sep/30/nothing-to-link-banbury-gang-rape-to-migrant-accommodation-police-say",
      "pub_time_taipei": "2025-09-30T18:22:26+08:00",
      "summary": "<p>Thames Valley police say any speculation is unfounded and unhelpful as they investigate weekend attack</p><p>There is no information to link the rape of a woman by a group of men in a Banbury churchyard to migrant accommodation, police have said as they attempt to quell online speculation.</p><p>The woman, who is in her 30s, was raped by a group of men in the grounds of St Mary’s church and the surrounding area of Banbury town centre overnight on Saturday, Thames Valley police said.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/30/nothing-to-link-banbury-gang-rape-to-migrant-accommodation-police-say\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Former aide in European Parliament convicted of spying for China",
      "link": "https://www.washingtonpost.com/world/2025/09/30/germany-spying-china-aide-european-parliament/",
      "pub_time_taipei": "2025-09-30T18:16:55+08:00",
      "summary": "The former aide to a legislator from the far-right Alternative for Germany was convicted of spying on the European Parliament, German politicians and Chinese dissidents."
    },
    {
      "source": "衛報",
      "title": "Trump’s peace proposal welcomed by world leaders but Palestinians remain sceptical",
      "link": "https://www.theguardian.com/world/2025/sep/30/trump-gaza-proposal-peace-reactions-welcomed-world-leaders-palestinian-residents-remain-sceptical",
      "pub_time_taipei": "2025-09-30T17:06:35+08:00",
      "summary": "<p>After being welcomed by Arab, Islamic and European leaders, experts say onus now rests on Hamas to accept plan</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live\">Middle East crisis – live updates</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/sep/29/trump-netanyahu-gaza-peace-plan\">Trump and Netanyahu to Hamas: accept Gaza peace plan or face consequences</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/sep/29/trumps-gaza-peace-plan-is-a-back-of-an-envelope-sketch-but-could-work\">Analysis: Trump’s plan for Gaza is ambitious but peace is far from guaranteed</a></p></li></ul><p>Middle Eastern and European leaders have expressed cautious support for Donald Trump’s <a href=\"https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas\">20-point plan</a> to end the war in Gaza, backing that was tempered by scepticism from some in the territory.</p><p>The <a href=\"https://www.theguardian.com/world/2025/sep/29/trump-netanyahu-gaza-peace-plan\">plan announced on Monday</a> by Trump and Israel’s prime minister, Benjamin Netanyahu, calls for an immediate ceasefire, an exchange of hostages held by Hamas for Palestinian prisoners held by Israel, a staged Israeli withdrawal from Gaza, Hamas disarmament and a transitional government led by an international body.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/trump-gaza-proposal-peace-reactions-welcomed-world-leaders-palestinian-residents-remain-sceptical\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The RBA dithers on its next interest rate cut – but it’s not the political flashpoint it once was",
      "link": "https://www.theguardian.com/business/2025/sep/30/rba-interest-rate-news-decision-dithers-on-cut-not-political-flashpoint-it-was",
      "pub_time_taipei": "2025-09-30T16:39:40+08:00",
      "summary": "<p>Despite signs of rising prices, economists believe the Reserve Bank’s choice is still when, not whether, to cut rates further</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The former US president Harry Truman famously asked for a one-armed economist after growing tired of hearing “on the one hand, this” and “on the other hand, that”.</p><p>Those listening to Michele Bullock, the Reserve Bank of Australia’s governor, talk about the future path for interest rates may sympathise.</p> <a href=\"https://www.theguardian.com/business/2025/sep/30/rba-interest-rate-news-decision-dithers-on-cut-not-political-flashpoint-it-was\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Michele Bullock says ‘nothing I can do personally’ about house prices – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
      "pub_time_taipei": "2025-09-30T16:39:23+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>McIntosh says ‘something needs to happen’ with Optus CEO</strong></p><p>McIntosh said Australians hadn’t heard enough from Optus, saying the CEO of the telco needed to take responsibility for the outrages.</p><p>Australians have lost confidence in Optus and they’ve lost confidence in the CEO doing his job. So it would be logical that the person at the top needs to take responsibility for this.</p><p>That is going to be up to the Optus board, but something needs to happen.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Afghanistan’s internet goes down amid fears of a Taliban crackdown",
      "link": "https://www.washingtonpost.com/world/2025/09/29/afghanistan-taliban-internet-blackout/",
      "pub_time_taipei": "2025-09-30T16:06:36+08:00",
      "summary": "The internet, now in widespread blackout, has been a lifeline for Afghan women trying to access education — and for Taliban officials trying to run the country."
    },
    {
      "source": "華盛頓郵報",
      "title": "In Germany, a boxing match decides fight over birthplace of bratwurst",
      "link": "https://www.washingtonpost.com/world/2025/09/30/germany-oldest-bratwurst-sausage-boxing/",
      "pub_time_taipei": "2025-09-30T15:36:25+08:00",
      "summary": "Two regions competing for bragging rights to bratwurst, Germany’s signature sausage, took their battle into a boxing ring in a ham-fisted bid to settle the matter."
    },
    {
      "source": "衛報",
      "title": "Optus boss ‘has a lot of work to do’, Anika Wells says after meeting telco in wake of triple-zero outages",
      "link": "https://www.theguardian.com/business/2025/sep/30/optus-triple-zero-outages-anika-wells-meeting-singtel-lot-of-work-to-do",
      "pub_time_taipei": "2025-09-30T14:44:27+08:00",
      "summary": "<p>Minister asks parent company to appoint external reviewer in attempt to restore Australians’ faith in emergency calls</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The government has asked Optus’s parent company to appoint an external reviewer to hold Optus to account after triple-zero outages this month, to address the “serious lack of confidence” Australians have in the telco.</p><p>The prime minister, Anthony Albanese, said Optus had “let down its customers and has let down the nation” after two outages in less than a fortnight piled political and public pressure on the company.</p> <a href=\"https://www.theguardian.com/business/2025/sep/30/optus-triple-zero-outages-anika-wells-meeting-singtel-lot-of-work-to-do\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Typhoon Bualoi death toll rises to at least 30 across Vietnam, Thailand and Philippines",
      "link": "https://www.theguardian.com/world/2025/sep/30/typhoon-bualoi-death-toll-rises-across-vietnam-thailand-and-philippines",
      "pub_time_taipei": "2025-09-30T14:43:52+08:00",
      "summary": "<p>Vietnamese authorities say typhoon was the most devastating storm to hit the country this year</p><p>The death toll from Typhoon Bualoi in south-east Asia has risen to more than 30 as heavy rains continued to lash the region.</p><p>In Vietnam, authorities said 19 people had been killed and 21 were missing, making it the most devastating storm to hit the country this year. Heavy rain on Tuesday raised the risk of more flooding and landslides in northern regions.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/typhoon-bualoi-death-toll-rises-across-vietnam-thailand-and-philippines\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Productivity commission under fire for failing to consult Australian artists about copyright issues around AI recommendations",
      "link": "https://www.theguardian.com/australia-news/2025/sep/30/briggs-warns-about-artist-copyright-ai-australia-productivity-commission-abandoning-creatives",
      "pub_time_taipei": "2025-09-30T14:33:24+08:00",
      "summary": "<p>Productivity commission under fire for failing to consult Australian artists about copyright issues around AI recommendations</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Productivity Commission is under fire for failing to consult artists or model the impact of a key recommendation in its AI report on the creative industry, as the creative community urges the government <a href=\"https://www.theguardian.com/australia-news/commentisfree/2025/aug/06/australia-productivity-commission-tdm-copyright-exception-proposal\">not to allow data mining exemptions</a> for big tech companies to train AI models.</p><p>First Nations rapper Adam Briggs said it would be “hard to get genie back in the bottle” if Australia allowed companies to access Australian creativity without fair pay.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/30/briggs-warns-about-artist-copyright-ai-australia-productivity-commission-abandoning-creatives\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "South Korea raises cyber threat level after huge data centre fire sparks hacking fears",
      "link": "https://www.theguardian.com/world/2025/sep/30/south-korea-raises-cyber-threat-level-after-huge-data-centre-fire-sparks-hacking-fears",
      "pub_time_taipei": "2025-09-30T13:41:55+08:00",
      "summary": "<p>National cyber security centre raises alert level to ‘caution’ as technicians race to restore government systems after battery fire sparked nationwide chaos</p><p>South Korea’s intelligence agency has raised the national cyber threat level, amid concerns that hackers could take advantage of the chaos caused by a fire at a government datacentre that paralysed critical digital infrastructure across the country.</p><p>The national cybersecurity centre, operating under the intelligence service, <a href=\"https://www.ncsc.go.kr/main/cop/bbs/selectBoardArticle.do?bbsId=CyberCrisis_main&amp;nttId=218020&amp;pageIndex=1\">elevated the alert</a> from “attention” to “caution” on Monday, citing fears hackers could exploit vulnerabilities as recovery work continues.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/south-korea-raises-cyber-threat-level-after-huge-data-centre-fire-sparks-hacking-fears\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "China sentences 11 criminal gang leaders to death for scam operations",
      "link": "https://www.washingtonpost.com/world/2025/09/30/china-scam-operation-death-sentences-myanmar/",
      "pub_time_taipei": "2025-09-30T13:31:55+08:00",
      "summary": "The court punished the ringleaders of a huge scam operation in northern Myanmar, which officials say involved human trafficking, illegal gambling and cybercrime."
    },
    {
      "source": "衛報",
      "title": "Indonesia school collapse: one dead, 65 buried under rubble as rescuers race to find survivors",
      "link": "https://www.theguardian.com/world/2025/sep/30/indonesia-school-collapse-one-dead-65-buried-under-rubble-as-rescuers-race-to-find-survivors",
      "pub_time_taipei": "2025-09-30T11:23:26+08:00",
      "summary": "<p>Death toll expected to rise as instability of building in East Java town hampers rescue efforts </p><p>At least one student has been killed, dozens injured and 65 presumed buried under rubble after a school building collapsed in Indonesia on Monday, with rescuers running oxygen and water to those who remained trapped more than 12 hours later.</p><p>Rescue workers, police and soldiers digging through the night pulled out eight weak and injured survivors hours after the building at Al Khoziny Islamic boarding school in the East Java town of Sidoarjo collapsed while students were praying.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/indonesia-school-collapse-one-dead-65-buried-under-rubble-as-rescuers-race-to-find-survivors\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘I think we’re headed to a shutdown,’ says JD Vance as Mike Johnson calls for more time for negotiations – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
      "pub_time_taipei": "2025-09-30T10:02:33+08:00",
      "summary": "<p>This live blog is now closed. For the latest on US politics, read more of our coverage <a href=\"https://www.theguardian.com/us-news/us-politics\">here</a></p><p><strong>Trump officials to announce plan to boost coal output</strong></p><p>The US is set to announce on Monday policies <strong>to try to boost the output of coal</strong>, the interior department said, as the Trump administration seeks to reverse the decline of the fossil fuel’s use.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "China court sentences 11 people to death over alleged role in family-run Myanmar scam operations",
      "link": "https://www.theguardian.com/world/2025/sep/30/china-court-sentences-11-people-to-death-over-alleged-role-in-family-run-myanmar-scam-operations",
      "pub_time_taipei": "2025-09-30T09:22:27+08:00",
      "summary": "<p>Another five people given suspended death sentences over alleged role in gang that operated scam centres and illegal gambling worth $1.4bn</p><p>A court in China has sentenced 11 people to death for their alleged roles in a family-run crime syndicate accused of running illegal gambling and scam operations worth more than $1.4bn, and for the deaths of workers who disobeyed them.</p><p>The Wenzhou intermediate people’s court on Monday sentenced 11 members of the powerful Ming family in Kokang, Myanmar to death while another five were handed death sentences suspended for two years.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/china-court-sentences-11-people-to-death-over-alleged-role-in-family-run-myanmar-scam-operations\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Tony Blair has never quit the Middle East. Now, he could run Gaza.",
      "link": "https://www.washingtonpost.com/world/2025/09/29/tony-blair-gaza-strip/",
      "pub_time_taipei": "2025-09-30T06:50:52+08:00",
      "summary": "Blair is a key player in planning for the rebuilding and governance of the Gaza Strip if a ceasefire deal between Israel and Hamas is finally signed."
    },
    {
      "source": "衛報",
      "title": "What’s in Trump’s 20-point peace plan for Gaza?",
      "link": "https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas",
      "pub_time_taipei": "2025-09-30T05:35:16+08:00",
      "summary": "<p>Plan calls for immediate end to war between Israel and Hamas but lacks detail on how key points will be executed</p><p>The White House peace plan for Gaza proposes an immediate end to the devastating war between Israel and Hamas that has raged in the coastal territory for nearly two years, while <a href=\"https://www.theguardian.com/world/2025/sep/29/trump-netanyahu-gaza-peace-plan\">pointedly excluding the Palestinian militant group from any future governing role</a>.</p><p>Assuming both sides agree to a detailed list of conditions, the end of fighting will be accompanied by the release of all Israeli hostages, both dead and alive, “within 72 hours” of Israel publicly accepting the deal.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump’s plan for Gaza is ambitious but peace is far from guaranteed",
      "link": "https://www.theguardian.com/world/2025/sep/29/trumps-gaza-peace-plan-is-a-back-of-an-envelope-sketch-but-could-work",
      "pub_time_taipei": "2025-09-30T05:27:50+08:00",
      "summary": "<p>The US president has won regional backing, but Hamas’s response and Israel’s intentions leave the outcome in doubt</p><p>At first glance, the 20-point plan outlined by President Trump and agreed by Benjamin Netanyahu appears more likely to end the two-year conflict in Gaza than anything we have seen so far. Trump has sunk a lot of political capital in bringing peace to the Middle East after “thousands of years”, as he put it. There is apparent deep and wide regional support and, seemingly, that of the Israeli prime minister.</p><p>But this is less a detailed roadmap than a rough back of an envelope sketch that allows an equal chance of getting badly lost as reaching the desired destination.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/trumps-gaza-peace-plan-is-a-back-of-an-envelope-sketch-but-could-work\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Madagascar’s president dissolves government amid youth-led protests",
      "link": "https://www.theguardian.com/world/2025/sep/29/madagascars-president-dissolves-government-amid-youth-led-protests",
      "pub_time_taipei": "2025-09-30T02:38:51+08:00",
      "summary": "<p>Demonstrations over water and power cuts inspired by ‘gen-Z’ protests elsewhere have left at least 22 dead, says UN</p><p><a href=\"https://www.theguardian.com/world/madagascar\">Madagascar</a>’s president, Andry Rajoelina, has dissolved the government after youth-led protests over water and power cuts in which the UN says at least 22 people have been killed and more than 100 injured.</p><p>Inspired by the “gen Z” protests in Kenya and Nepal, the three days of demonstrations are the largest the Indian Ocean island has seen in years, and the most serious challenge Rajoelina has faced since <a href=\"https://www.theguardian.com/world/2023/nov/25/madagascars-andry-rajoelina-re-elected-after-boycotted-presidential-poll\">his re-election in 2023</a>.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/madagascars-president-dissolves-government-amid-youth-led-protests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Eleven arrested for placing pigs’ heads near French mosques and other hate crimes",
      "link": "https://www.theguardian.com/world/2025/sep/29/eleven-arrested-for-placing-pigs-heads-near-french-mosques-and-other-hate-crimes",
      "pub_time_taipei": "2025-09-30T01:49:06+08:00",
      "summary": "<p>Serbian nationals also accused by Serbian police of defacing Jewish sites, as French officials investigate foreign interference</p><p>Serbian police have arrested 11 people, accusing them of “inciting hatred” in France and Germany, and linking them to acts that include placing pigs’ heads near mosques and defacing Jewish sites.</p><p>The arrests came days after French prosecutors said foreign interference <a href=\"https://www.bfmtv.com/police-justice/video-neuf-dossier-en-region-parisienne-d-ingerence-etrangere-depuis-octobre-2023-detaille-la-procureure-de-paris-laure-beccuau_VN-202509120335.html\">was probably to blame</a> for a spate of provocative acts that had targeted Jewish and Muslim sites in France in recent years, as tensions run high over the war in Gaza. French officials <a href=\"https://www.theguardian.com/world/article/2024/may/22/france-russia-paris-holocaust-memorial-graffiti-red-hand\">have previously</a> said they were investigating Russia’s role in destabilising operations that have stoked social tensions and sown division in France.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/eleven-arrested-for-placing-pigs-heads-near-french-mosques-and-other-hate-crimes\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Canada designates Indian gang linked to high-profile killings as terrorist entity",
      "link": "https://www.theguardian.com/world/2025/sep/29/canada-lawrence-bishnoi-gang-terrorist-entity",
      "pub_time_taipei": "2025-09-30T01:38:05+08:00",
      "summary": "<p>Canadian government accuses the Lawrence Bishnoi gang of being involved in murder of prominent Sikh activist Hardeep Singh Nijjar near Vancouver</p><p>Canada’s federal government has announced that a powerful and ruthless Indian gang which uses “murder, shootings and arson” to extort and intimidate diaspora communities – and has alleged links to India’s ruling government – has been designated as a terrorist entity.</p><p>Canada has accused the Lawrence Bishnoi gang of possible involvement in the murder of prominent Sikh activist and Canadian citizen Hardeep Singh Nijjar near Vancouver.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/canada-lawrence-bishnoi-gang-terrorist-entity\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Wildfire in Namibia is contained, says PM, after criticism of response",
      "link": "https://www.theguardian.com/world/2025/sep/29/wildfire-in-namibia-is-contained-says-pm-after-criticism-of-response",
      "pub_time_taipei": "2025-09-30T00:41:21+08:00",
      "summary": "<p>A third of Etosha national park has been burned despite efforts of volunteers, who say troops were sent in too late</p><p>Wildfires that raged through one of Africa’s largest national parks have been brought under control, Namibia’s government has said, amid criticisms over the response mechanism and limited resources.</p><p>The fire <a href=\"https://www.theguardian.com/world/2025/sep/28/namibia-army-wildfire-etosha-game-reserve\">broke out</a> in Etosha national park, in the arid desert nation’s north, on 22 September. The government said it suspected charcoal production next to the park, which is home to 114 mammal species including the critically endangered black rhino, was to blame.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/wildfire-in-namibia-is-contained-says-pm-after-criticism-of-response\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Afghanistan hit by communications blackout after Taliban shuts internet",
      "link": "https://www.theguardian.com/world/2025/sep/29/afghanistan-communications-blackout-taliban-shuts-internet",
      "pub_time_taipei": "2025-09-30T00:28:58+08:00",
      "summary": "<p>Telecoms disrupted nationwide after authorities cut fibre-optic connections in several provinces to prevent ‘vice’</p><p>A huge communications blackout has hit Afghanistan after Taliban authorities began severing fibre-optic connections in several provinces to prevent “vice”.</p><p>“A nationwide telecoms blackout is now in effect,” said Netblocks, a watchdog organisation that monitors cybersecurity and internet governance.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/afghanistan-communications-blackout-taliban-shuts-internet\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "West Africans deported from US to Ghana ‘dumped without documents in Togo’",
      "link": "https://www.theguardian.com/us-news/2025/sep/29/west-africans-deported-us-ice-ghana-togo",
      "pub_time_taipei": "2025-09-30T00:20:54+08:00",
      "summary": "<p>Men removed from US by Ice say they were held near Accra then taken over border and left without passports or ID</p><p>West Africans deported by the US to Ghana are now fending for themselves in Togo after being dumped in the country without documents, according to lawyers and deportees.</p><p>The latest chapter in Donald Trump’s deportation programme, their saga became public earlier this month when the Ghanaian president, John Mahama, disclosed that his country had struck <a href=\"https://www.theguardian.com/world/2025/sep/23/west-africans-deported-by-the-us-were-denied-their-rights-says-lawyer\">a deal to accept deportees</a> from the region.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/29/west-africans-deported-us-ice-ghana-togo\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hybrid attacks such as drones ‘part of new reality’, Danish minister warns, as Russia embarks on huge army call-up – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live",
      "pub_time_taipei": "2025-09-29T23:00:19+08:00",
      "summary": "<p>Peter Hummelgaard compared recent spate of hybrid attacks on Europe to 9/11 terrorism; 135,000 called up in Russia. This live blog is closed</p><p>But <strong>Zelenskyy</strong> also warns about the worsening situation in <strong>Georgia</strong> and <strong>Belarus</strong>.</p><p>“<strong>That is why we cannot afford to lose a single day or a single country.</strong> After Moldova’s election, we must keep supporting Moldova. The hardest task is to meet voters’ expectations,” he says.</p><p><em>Russia failed to destabilise Moldova, even after spending huge, huge resources to undermine it and to corrupt whoever they could.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "It’s goodnight Vienna as Paris sleeper train to Austria and Berlin hit by cuts",
      "link": "https://www.theguardian.com/travel/2025/sep/29/night-trains-paris-berlin-vienna-suspended-obb-france-funding",
      "pub_time_taipei": "2025-09-29T22:57:10+08:00",
      "summary": "<p>Some Nightjet services suspended from mid-December after French withdrawal amid public budget crisis</p><p>Night train services linking Paris, Berlin and Vienna are to end from mid-December because of the French government’s withdrawal of funding, the Austrian national rail operator has said, in a blow to sleeper travel on important European routes.</p><p>ÖBB, the largest provider of such trains in Europe, has led a drive to revive a once popular form of low-emission transport as an alternative to flying.</p> <a href=\"https://www.theguardian.com/travel/2025/sep/29/night-trains-paris-berlin-vienna-suspended-obb-france-funding\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Moldova’s president Maia Sandu hails voters’ refusal to be ‘bought’ by Moscow",
      "link": "https://www.theguardian.com/world/2025/sep/29/moldova-election-result-boosts-move-towards-eu-away-from-moscow",
      "pub_time_taipei": "2025-09-29T22:38:19+08:00",
      "summary": "<p>Ruling party holds on to its majority in Sunday’s poll, which it says is ‘strong mandate for EU accession’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live\">Europe live – latest updates</a></p></li></ul><p>Moldova’s pro-western president, Maia Sandu, has hailed voters’ refusal to be “bought” by Moscow after her ruling party held on to its parliamentary majority in Sunday’s pivotal election, bolstering the tiny country’s aspiration of joining the EU and distancing itself from Russia’s influence.</p><p>“We did not allow ourselves to be bought, intimidated or frightened,” she said on Monday. “We mobilised and defended our country through honest, democratic choice.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/moldova-election-result-boosts-move-towards-eu-away-from-moscow\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "In defeat for Russia, pro-E.U. party wins Moldovan parliamentary majority",
      "link": "https://www.washingtonpost.com/world/2025/09/29/moldova-europe-election-result/",
      "pub_time_taipei": "2025-09-29T21:41:56+08:00",
      "summary": "The results brought a sigh of relief for the European Union, as Moldova showed firm public support for the ruling party’s pro-Europe course."
    }
  ]
}