{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-28T20:40:06.073709+08:00",
  "window_end_taipei": "2025-09-29T20:40:06.073709+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Labour conference to vote on whether Israel is committing genocide in Gaza",
      "link": "https://www.theguardian.com/politics/2025/sep/29/labour-party-conference-vote-israel-genocide-gaza",
      "pub_time_taipei": "2025-09-29T20:19:09+08:00",
      "summary": "<p>Motion backed by unions calls for tougher action, including trade suspension, to end risk of UK complicity</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news\">UK politics live – latest updates</a></p></li></ul><p>The Labour conference will vote on whether it believes Israel is committing a genocide in Gaza and whether the the UK-Israel trade agreement should be suspended in what could become a significant conference showdown.</p><p>Labour members are preparing to use the vote on Monday to highlight their unease with the government’s refusal to conclude that Israel is committing a genocide in Gaza.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/29/labour-party-conference-vote-israel-genocide-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Donald Trump and Benjamin Netanyahu to discuss Gaza peace plan at the White House – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
      "pub_time_taipei": "2025-09-29T20:12:07+08:00",
      "summary": "<p>US president to push Israeli prime minister to agree to new framework to end war in Gaza and free remaining hostages held by Hamas</p><p><strong>Trump officials to announce plan to boost coal output</strong></p><p>The US is set to announce on Monday policies <strong>to try to boost the output of coal</strong>, the interior department said, as the Trump administration seeks to reverse the decline of the fossil fuel’s use.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labour plans to consult on use of live facial recognition before wider roll-out",
      "link": "https://www.theguardian.com/technology/2025/sep/29/labour-plans-consult-live-facial-recognition-roll-out",
      "pub_time_taipei": "2025-09-29T20:11:07+08:00",
      "summary": "<p>Policing minister says government will ‘put some parameters’ around its deployment in England</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news\">UK politics live – latest updates</a></p></li></ul><p>Labour plans to consult on the use of live facial recognition (LFR) technology before expanding it across England, the new policing minister has told the party’s annual conference.</p><p>Sarah Jones, a Home Office minister, said the government would “put some parameters” over when and where it could be used in future.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/29/labour-plans-consult-live-facial-recognition-roll-out\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Putin ‘does not want a ceasefire and does not want peace for Ukraine’, says German defence minister – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live",
      "pub_time_taipei": "2025-09-29T20:10:21+08:00",
      "summary": "<p>Boris Pistorius says Europe ‘will not be lured into Putin’s trap of continuous escalation’</p><p>But <strong>Zelenskyy</strong> also warns about the worsening situation in <strong>Georgia</strong> and <strong>Belarus</strong>.</p><p>“<strong>That is why we cannot afford to lose a single day or a single country.</strong> After Moldova’s election, we must keep supporting Moldova. The hardest task is to meet voters’ expectations,” he says.</p><p><em>Russia failed to destabilise Moldova, even after spending huge, huge resources to undermine it and to corrupt whoever they could.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: At least four dead and eight injured after shooting at Mormon church in Michigan",
      "link": "https://www.theguardian.com/us-news/2025/sep/29/first-thing-at-least-four-dead-and-eight-injured-after-shooting-at-mormon-church-in-michigan",
      "pub_time_taipei": "2025-09-29T20:07:10+08:00",
      "summary": "<p>Church set ablaze on weekend when shooting attacks also took place in North Carolina, Texas and New Orleans. Plus, the secrets of Birkenstock’s enduring success</p><p>Good morning.</p><p>At least <a href=\"https://www.theguardian.com/us-news/2025/sep/28/mass-shootings-north-carolina-texas-new-orleans\">four people were killed and eight others injured</a> after a gunman opened fire at a Mormon church in Michigan and then set the building ablaze, authorities said.</p><p><strong>Was it the only mass shooting this weekend?</strong> No, the shooting happened during a particularly violent weekend in the US and marked the 324th mass shooting in the US in 2025, according to the Gun Violence Archive. Multiple mass shootings – cases in which four or more people are shot or killed – were reported in the US in public places including in North Carolina, Texas and New Orleans.</p><p><strong>What did the facility say?</strong> The facility, which is run by the private corrections and detention company CoreCivic, directed the Guardian to Ice for comment, which in turn directed the Guardian to the Department of Homeland Security (DHS), the parent agency, though a report from Ice’s juvenile coordinator said the agency was complying with legal requirements. Comment was requested from DHS but a response was not received prior to publication.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/29/first-thing-at-least-four-dead-and-eight-injured-after-shooting-at-mormon-church-in-michigan\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Reeves says she won’t take economic risks, hints at hard choices, and warns Reform will threaten living standards – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
      "pub_time_taipei": "2025-09-29T19:59:15+08:00",
      "summary": "<p>Chancellor references chaos under Liz Truss but says some people ‘peddle idea we can abandon economic responsibility’</p><p>In her Today interview <strong>Rachel Reeves</strong> was asked about <a href=\"https://www.ft.com/content/8600718c-e06b-4e79-abb6-7397c9fbcd48\">a FT report</a> saying she will urge business leaders to highlight the risks of a Reform UK government in her speech later.</p><p>The FT say Reeves will tell the Labour conference.</p><p>Who is standing up for Britain’s stability. A Labour government that is resolute in cutting interest rates and borrowing or a Reform party that cheered on Liz Truss’ mini-budget?</p><p>Who is standing up for Britain’s businesses? A Labour government that is forging a closer relationship with our nearest trading partners or a Reform party that talks Britain down and is hungry to cut us off from the world?</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Half of Claire’s stores in UK and Ireland to be rescued by private equity firm",
      "link": "https://www.theguardian.com/business/2025/sep/29/claires-accessories-stores-uk-ireland-rescue-administration-closures-job-losses",
      "pub_time_taipei": "2025-09-29T19:33:18+08:00",
      "summary": "<p>Modella Capital warns of ‘inevitable’ closures and job losses at accessories chain while administrators will run remaining stores</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news\">Business live – latest updates</a></p></li></ul><p>The private equity firm which owns Hobbycraft has signed a deal to rescue half of the UK and Irish stores of the accessories chain Claire’s but warned some job losses and shop closures were “inevitable”.</p><p>Modella Capital said it had bought 156 Claire’s stores in the UK and Ireland from administrators, securing the immediate future of 1,000 employees, “in the hope that it will be able to rescue this well-known and highly regarded brand”.</p> <a href=\"https://www.theguardian.com/business/2025/sep/29/claires-accessories-stores-uk-ireland-rescue-administration-closures-job-losses\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. considers Ukraine’s request for long-range Tomahawk missiles",
      "link": "https://www.washingtonpost.com/world/2025/09/29/ukraine-tomahawks-russia-kellogg-vance/",
      "pub_time_taipei": "2025-09-29T19:10:30+08:00",
      "summary": "Tomahawk cruise missiles, which have a range of at least 1,500 miles, would boost Ukraine’s ability to hit deep inside Russia, including Moscow."
    },
    {
      "source": "衛報",
      "title": "Police arrest 66 for alleged Palestine Action support near Labour conference",
      "link": "https://www.theguardian.com/uk-news/2025/sep/29/police-arrest-people-palestine-action-rally-labour-conference",
      "pub_time_taipei": "2025-09-29T19:09:49+08:00",
      "summary": "<p>Protesters aged between 21 and 83 held on suspicion of supporting proscribed terror group at rally in Liverpool </p><p>Police have arrested 66 people, including an 83-year-old, on suspicion of supporting Palestine Action at a rally outside the Labour party conference in Liverpool.</p><p>Dozens of protesters gathered outside the venue on Sunday, many holding signs that read: “I oppose genocide. I support Palestine Action.”</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/29/police-arrest-people-palestine-action-rally-labour-conference\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pastor linked to Lutheran church group also linked to neo-Confederate movement",
      "link": "https://www.theguardian.com/us-news/2025/sep/29/pastor-john-eidsmoe-lutheran-lutheran-church-missouri-synod-neo-confederate",
      "pub_time_taipei": "2025-09-29T19:00:27+08:00",
      "summary": "<p>John Eidsmoe, associated with Lutheran Church Missouri Synod, has history with public defenses of Confederacy</p><p>A Presbyterian pastor linked to the Lutheran Church Missouri Synod (LCMS) via various aligned or affiliated organizations also has a history of associations with the neo-Confederate movement, including speaking dates for prominent neo-Confederate groups, and public defenses of the Confederacy and Confederate monuments.</p><p>One group whose conference Colonel John Eidsmoe addressed, the Council for Concerned Citizens (CCC), was credited by racist mass murderer Dylann Roof for contributing to the radicalization of his views on race, which culminated in his deadly attack on Mother Emanuel AME Church in Charleston, South Carolina, in June 2015.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/29/pastor-john-eidsmoe-lutheran-lutheran-church-missouri-synod-neo-confederate\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Moldova’s election result bolsters move towards EU and away from Moscow",
      "link": "https://www.theguardian.com/world/2025/sep/29/moldova-election-result-boosts-move-towards-eu-away-from-moscow",
      "pub_time_taipei": "2025-09-29T18:46:49+08:00",
      "summary": "<p>Pro-European ruling party win comes after ‘massive pressure from Russia and its proxies’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live\">Europe live – latest updates</a></p></li></ul><p>Moldova’s pro-European ruling party held on to its parliamentary majority after Sunday’s pivotal election, strengthening the country of 2.4 million’s attempt to move towards the EU and away from Moscow.</p><p>With more than 99.9% of ballots counted, president Maia Sandu’s pro-western Action and Solidarity party (PAS) had 50.03% of the vote, putting it on track to win 55 of the 101 seats in parliament. That compared with 24.26% for a Moscow-leaning alliance of Soviet-nostalgic parties led by the former president Igor Dodon, according to results published on the election commission’s website.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/moldova-election-result-boosts-move-towards-eu-away-from-moscow\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "In defeat for Russia, pro-E.U. party wins Moldovan parliamentary majority",
      "link": "https://www.washingtonpost.com/world/2025/09/29/moldova-europe-election-result/",
      "pub_time_taipei": "2025-09-29T18:31:59+08:00",
      "summary": "The results brought a sign of relief for the European Union, as Moldova showed firm public support for the ruling party’s pro-Europe course."
    },
    {
      "source": "衛報",
      "title": "Prime Minister’s Literary awards 2025: Michelle de Kretser wins $80,000 for Theory & Practice",
      "link": "https://www.theguardian.com/books/2025/sep/29/prime-ministers-literary-awards-2025-michelle-de-kretser-wins-80000-for-theory-practice",
      "pub_time_taipei": "2025-09-29T18:31:12+08:00",
      "summary": "<p>The Stella prize-winning author used her acceptance speech to call out the Australian government’s response to the war in Gaza, in a ceremony marked by pointed political commentary from the podium</p><ul><li><p><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=cvau_sfl\">Get our weekend culture and lifestyle email</a></p></li></ul><p>When Michelle de Kretser decided to use her <a href=\"https://stella.org.au/2025/05/michelle-de-kretsers-2025-acceptance-speech/\">acceptance of the Stella prize</a> in May to speak out about Israel’s invasion of Gaza and the Australian government’s role in the ongoing humanitarian crisis, she admitted the speech might be a “career ender”.</p><p>It wasn’t: on Monday, De Kretser collected the $80,000 Prime Minister’s Literary award for fiction for the same book, her eighth novel, Theory &amp; Practice.</p><p><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=copyembed\">Sign up for the fun stuff with our rundown of must-reads, pop culture and tips for the weekend, every Saturday morning</a></p> <a href=\"https://www.theguardian.com/books/2025/sep/29/prime-ministers-literary-awards-2025-michelle-de-kretser-wins-80000-for-theory-practice\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Harris calls Trump ‘incompetent and unhinged’ and makes call to ‘fight fire with fire’",
      "link": "https://www.theguardian.com/us-news/2025/sep/29/kamala-harris-trump-black-caucus-foundation-speech",
      "pub_time_taipei": "2025-09-29T18:00:39+08:00",
      "summary": "<p>President’s 2024 election rival delivers fiery remarks while accepting Congressional Black Caucus Foundation award</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has proven himself to be an “unchecked, incompetent, unhinged president,” and his opposition must follow leaders who are ready to “fight fire with fire,” his 2024 election rival <a href=\"https://www.theguardian.com/us-news/kamala-harris\">Kamala Harris</a> has said.</p><p>The former Democratic US vice-president delivered those fiery remarks on Saturday evening while accepting an award from the Congressional Black Caucus Foundation in Washington DC – and after Trump’s fellow Republican allies have demanded that his liberal opponents tone down their rhetoric in the wake of the 10 September shooting <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">death of rightwing political activist Charlie Kirk</a>.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/29/kamala-harris-trump-black-caucus-foundation-speech\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Stephen Miller takes leading role in strikes on alleged Venezuelan drug boats",
      "link": "https://www.theguardian.com/us-news/2025/sep/29/stephen-miller-venezuela-drug-boat-strike",
      "pub_time_taipei": "2025-09-29T18:00:38+08:00",
      "summary": "<p>Exclusive: Miller’s homeland security council has played a key part in coordinating operations, sources say</p><p>Stephen Miller, the White House deputy chief of staff, has played a leading role in directing US <a href=\"https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike\">strikes</a> <a href=\"https://www.theguardian.com/us-news/2025/sep/19/trump-military-strike-boat-caribbean\">against</a> <a href=\"https://x.com/RapidResponse47/status/1969184320288878719\">suspected</a> Venezuelan drug boats, according to three people familiar with the situation. At times, his role has superseded that of Marco Rubio, the secretary of state and national security adviser.<strong> </strong></p><p>The strikes on the <a href=\"https://www.theguardian.com/world/venezuela\">Venezuelan</a> boats allegedly carrying narcotics, which the administration has claimed were necessary because interdiction did not work, have been orchestrated through the homeland security council (HSC), which Miller leads as the homeland security adviser.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/29/stephen-miller-venezuela-drug-boat-strike\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Rachel Reeves confirms she no longer stands by pledge not to raise taxes",
      "link": "https://www.theguardian.com/politics/2025/sep/29/rachel-reeves-confirms-she-no-longer-stands-by-pledge-not-to-raise-taxes",
      "pub_time_taipei": "2025-09-29T17:18:35+08:00",
      "summary": "<p>Chancellor says ‘world has changed’ and UK not immune to effects of wars, US tariffs and higher borrowing costs</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news\">UK politics live – latest updates</a></p></li></ul><p>Rachel Reeves has confirmed ahead of her speech to the Labour party conference that she no longer stands by a pledge last year not to raise taxes , saying “the world has changed” due to a mixture of conflicts, US tariffs and higher borrowing costs.</p><p>In a series of broadcast interviews before she addressed the gathering in Liverpool on Monday, the chancellor strongly hinted, however, that VAT was not due to rise in November’s budget.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/29/rachel-reeves-confirms-she-no-longer-stands-by-pledge-not-to-raise-taxes\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Tony Blair has never quit the Middle East. Now, he could run Gaza.",
      "link": "https://www.washingtonpost.com/world/2025/09/29/tony-blair-gaza-strip/",
      "pub_time_taipei": "2025-09-29T17:00:31+08:00",
      "summary": "Blair is a key player in planning for the rebuilding and governance of the Gaza Strip if a ceasefire deal between Israel and Hamas is finally signed."
    },
    {
      "source": "華盛頓郵報",
      "title": "New antiaircraft weapons propel Sudan’s war, imperil global security",
      "link": "https://www.washingtonpost.com/world/2025/09/29/sudan-war-weapons-rsf-darfur/",
      "pub_time_taipei": "2025-09-29T17:00:17+08:00",
      "summary": "Fighters now possess antiaircraft weapons that could threaten civilian air traffic and what appears to be a Chinese surface-to-air missile system, experts said."
    },
    {
      "source": "華盛頓郵報",
      "title": "Behind Taiwan’s ‘unification’ party, Chinese espionage — and a criminal gang",
      "link": "https://www.washingtonpost.com/world/2025/09/29/china-influence-taiwan-gangsters/",
      "pub_time_taipei": "2025-09-29T17:00:14+08:00",
      "summary": "The murky activities of the Chinese Unification Promotion Party show how Beijing is using organized crime to extend its reach in Taiwan."
    },
    {
      "source": "衛報",
      "title": "Albanese government urged to protect Australians on aid ships bound for Gaza – As it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared",
      "pub_time_taipei": "2025-09-29T16:56:12+08:00",
      "summary": "<p>Eight Australians, including Muslim activist Abubakir Rafiq, are part of the Sumud flotilla coalition which is hoping to reach Gaza this week. This blog is now closed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Police recover man’s body from boat in Sydney harbour</strong></p><p><strong>NSW police </strong>discovered the body of a man on board a boat in Sydney harbour on Sunday evening.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Dolly Parton postpones Las Vegas residency, citing ‘health challenges’",
      "link": "https://www.theguardian.com/music/2025/sep/29/dolly-parton-postpones-las-vegas-residency-citing-health-challenges",
      "pub_time_taipei": "2025-09-29T16:37:11+08:00",
      "summary": "<p>Country music superstar was due to play six-concert run at Caesars Palace in December</p><p>Dolly Parton has postponed her upcoming Las Vegas concert residency due to health issues.</p><p>Parton, 79, was due to begin a six-concert run at the Colosseum at Caesars Palace on 4 December. She announced on social media that she has “been dealing with some health challenges, and my doctors tell me that I must have a few procedures”.</p> <a href=\"https://www.theguardian.com/music/2025/sep/29/dolly-parton-postpones-las-vegas-residency-citing-health-challenges\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Anika Wells to meet Singtel’s boss as Optus experiences second triple-zero outage in less than two weeks",
      "link": "https://www.theguardian.com/business/2025/sep/29/optus-triple-zero-outage-experiences-second-anika-wells-to-meet-singtel-boss",
      "pub_time_taipei": "2025-09-29T15:59:28+08:00",
      "summary": "<p>Optus says it confirmed the welfare of all callers who called triple zero after an issue affected Illawarra region in NSW</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The federal government is resisting political pressure to launch a sweeping independent inquiry into the entire triple-zero system after the second Optus outage in less than a fortnight.</p><p>The treasurer, Jim Chalmers, said Optus was guilty of an “absolutely shocking failure” but maintained the government would await the findings of an existing probe into the besieged telco before considering further steps.</p> <a href=\"https://www.theguardian.com/business/2025/sep/29/optus-triple-zero-outage-experiences-second-anika-wells-to-meet-singtel-boss\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Four teens arrested after car chase ends at Bourke Street mall in Melbourne CBD",
      "link": "https://www.theguardian.com/australia-news/2025/sep/29/four-teens-arrested-after-car-chase-ends-at-bourke-street-mall-in-melbourne-cbd-ntwnfb",
      "pub_time_taipei": "2025-09-29T15:34:18+08:00",
      "summary": "<p>A pedestrian was allegedly struck on Exhibition Street before boys abandoned car and fled on foot, police say</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Four teenage boys have been arrested after a car chase through <a href=\"https://www.theguardian.com/australia-news/melbourne\">Melbourne’s</a> eastern suburbs and into the city centre, which ended when they abandoned the allegedly stolen BMW in the middle of Bourke Street mall.</p><p>Police said they had first become aware of the teenagers about 12.30pm on Monday, when they saw them allegedly driving erratically in a BMW on the Eastern Freeway in Doncaster.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/29/four-teens-arrested-after-car-chase-ends-at-bourke-street-mall-in-melbourne-cbd-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Man sentenced to five years in jail for arson attack on Bondi home of YouTube commentator FriendlyJordies",
      "link": "https://www.theguardian.com/australia-news/2025/sep/29/friendlyjordies-jordan-shanks-arson-attack-bondi-home-youtuber-tufi-junior-tauese-auelua-jailed-five-years",
      "pub_time_taipei": "2025-09-29T14:00:01+08:00",
      "summary": "<p>Judge says Tufi Junior Tauese-Auelua, who assisted in targeted attack in 2022, was ‘used as muscle for third parties’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Moments before another lengthy jail term, the arsonist who set the home of a popular YouTuber on fire has apologised from “the bottom of my heart”.</p><p>Jordan Shanks – better known by his online alias of FriendlyJordies – had been making videos about Sydney identities when arsonists set upon his Bondi residence in 2022.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/29/friendlyjordies-jordan-shanks-arson-attack-bondi-home-youtuber-tufi-junior-tauese-auelua-jailed-five-years\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Moldova’s pro-European party retains majority in key election",
      "link": "https://www.theguardian.com/world/2025/sep/28/moldova-heads-to-the-polls-in-tense-vote-that-could-steer-country-closer-to-eu-or-russia",
      "pub_time_taipei": "2025-09-29T13:48:17+08:00",
      "summary": "<p>PAS garners 50.03% of vote after more than 99.5% of ballots counted in poll deciding whether country steers closer to EU or Russia</p><p>Moldova’s ruling pro-European party has retained its parliamentary majority after Sunday’s pivotal election, seen as a test of the president’s push to keep the country of 2.4 million on track for EU membership rather than drifting back towards Moscow.</p><p>With more than 99.5% of the ballots counted, Maia Sandu’s pro-western Action and Solidarity party (PAS) garnered 50.03% of the vote to elect members of the 101-seat parliament.</p> <a href=\"https://www.theguardian.com/world/2025/sep/28/moldova-heads-to-the-polls-in-tense-vote-that-could-steer-country-closer-to-eu-or-russia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Britain may already be at war with Russia, former head of MI5 says",
      "link": "https://www.theguardian.com/politics/2025/sep/29/britain-may-already-be-at-war-with-russia-former-head-of-mi5-says",
      "pub_time_taipei": "2025-09-29T12:30:31+08:00",
      "summary": "<p>Eliza Manningham-Buller points to extent of cyber-attacks and other hostile activity orchestrated by Moscow</p><p>Britain may already be at war with Russia because of the depth and intensity of cyber-attacks, sabotage and other hostile activity orchestrated by Moscow against the UK, according to a former head of MI5.</p><p>Eliza Manningham-Buller, who led the domestic spy agency two decades ago, said she agreed with comments made by the Russia expert Fiona Hill, who argued <a href=\"https://www.theguardian.com/politics/2025/jun/06/russia-is-at-war-with-uk-and-us-no-longer-reliable-ally\">in a Guardian interview</a> earlier this year that Moscow was at war with the west.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/29/britain-may-already-be-at-war-with-russia-former-head-of-mi5-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Environmental damage is putting European way of life at risk, says report",
      "link": "https://www.theguardian.com/environment/2025/sep/29/environmental-damage-is-putting-european-way-of-life-at-risk-says-report",
      "pub_time_taipei": "2025-09-29T12:00:30+08:00",
      "summary": "<p>EU officials warn climate breakdown and wildlife loss ‘are ruining ecosystems that underpin the economy’</p><p>The European way of life is being jeopardised by environmental degradation, a <a href=\"https://www.eea.europa.eu/en/europe-environment-2025/main-report\">report</a> has found, with EU officials warning against weakening green rules.</p><p>The continent has made “important progress” in cutting planet-heating pollution, according to the European Environment Agency, but the death of wildlife and breakdown of the climate are ruining ecosystems that underpin the economy.</p><p>More than 80% of protected habitats are in a poor or bad state, with “unsustainable” consumption and production patterns driving loss of wildlife.</p><p>The EU’s “carbon sink” has declined by about 30% in a decade as logging, wildfires and pests damage forests.</p><p>Emissions from transport and food have barely budged since 2005, despite progress in other sectors.</p><p>Member states have failed to adapt to extreme weather as fast as risk levels have risen.</p><p>Water stress already affects one in three Europeans and will worsen as the climate changes.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/29/environmental-damage-is-putting-european-way-of-life-at-risk-says-report\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel defies global pressure, but its isolation grows",
      "link": "https://www.washingtonpost.com/world/2025/09/29/israel-netanyahu-speech-gaza-trump/",
      "pub_time_taipei": "2025-09-29T12:00:00+08:00",
      "summary": "Israeli Prime Minister Benjamin Netanyahu’s message has rarely fallen on less receptive ears."
    },
    {
      "source": "衛報",
      "title": "Dismay in New Zealand after government fails to recognise Palestinian statehood",
      "link": "https://www.theguardian.com/world/2025/sep/29/new-zealand-government-fails-to-recognise-palestinian-statehood",
      "pub_time_taipei": "2025-09-29T11:24:59+08:00",
      "summary": "<p>PM Christopher Luxon had suggested recognition was only a matter of time, prompting disappointment from opposition parties and activists</p><p>Opposition parties, Palestinian groups and a former prime minister have expressed dismay over New Zealand’s decision not to recognise Palestinian statehood, saying it places the country on the wrong side of history and puts it at odds with its traditional allies.</p><p>Last week, the UK, Canada, Australia and others <a href=\"https://www.theguardian.com/world/2025/sep/21/uk-canada-and-australia-announce-formal-recognition-of-palestine-with-wave-of-israel-allies-to-follow\">formally declared their recognition of statehood</a> ahead of a special UN conference in New York. As of this month, 157 of the 193 UN member countries have recognised a Palestinian state.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/new-zealand-government-fails-to-recognise-palestinian-statehood\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US citizen Amir Amiry freed by Taliban in Afghanistan",
      "link": "https://www.theguardian.com/world/2025/sep/29/us-citizen-amir-amiry-freed-by-taliban-in-afghanistan",
      "pub_time_taipei": "2025-09-29T09:45:26+08:00",
      "summary": "<p>Secretary of state Marco Rubio welcomes release as ‘important step forward’ as Taliban seek to normalise relations with US</p><p>The Taliban on Sunday freed a US citizen from an Afghan prison, weeks after they said they had reached an agreement with US envoys on a prisoner exchange as part of an effort to normalise relations.</p><p>US secretary of state Marco Rubio <a href=\"https://www.state.gov/releases/office-of-the-spokesperson/2025/09/welcoming-the-release-of-amir-amiry-in-afghanistan/\">welcomed</a> the release of Amir Amiry, saying it marked the administration’s determination, reinforced by Donald Trump’s recent executive order, to protect American nationals from wrongful detention abroad.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/us-citizen-amir-amiry-freed-by-taliban-in-afghanistan\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Threatened kārearea falcon wins New Zealand’s 2025 bird of the year",
      "link": "https://www.theguardian.com/world/2025/sep/29/new-zealand-bird-of-the-year-2025-karearea-falcon-nz-winner",
      "pub_time_taipei": "2025-09-29T08:47:46+08:00",
      "summary": "<p>The country’s fastest bird has taken out the top prize in a scandal-free year for the annual poll</p><p>New Zealand’s fastest bird, capable of flying 200km/h in its pursuit of prey, has been crowned bird of the year – a long-running annual competition that has previously been a lightning rod for scandal and hijinks.</p><p>The threatened kārearea is New Zealand’s only falcon. It is small and tawny, with impressive talons and large dark eyes. Kārearea are powerful aerial hunters and watch other birds, lizards or small mammals – sometimes larger than themselves – from a high vantage point before diving at high speed to snatch their prey.</p> <a href=\"https://www.theguardian.com/world/2025/sep/29/new-zealand-bird-of-the-year-2025-karearea-falcon-nz-winner\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tropical Storm Imelda forming and expected to become hurricane",
      "link": "https://www.theguardian.com/us-news/2025/sep/28/tropical-storm-imelda-hurricane-humberto",
      "pub_time_taipei": "2025-09-29T04:35:59+08:00",
      "summary": "<p>Forecast track could take storm, which caused disruption in Bahamas and Cuba, away from US east coast</p><p>Tropical Storm Imelda formed on Sunday and was expected to become a hurricane on a forecast track that could take it away from the US east coast in the coming days. The storm was causing disruption in the Bahamas and Cuba on Sunday, and a tropical storm watch was posted in parts of <a href=\"https://www.theguardian.com/us-news/florida\">Florida</a>.</p><p>Meanwhile, <a href=\"https://www.theguardian.com/world/hurricanes\">Hurricane</a> Humberto weakened very slightly but remained a strong category 4 storm in the Atlantic, threatening Bermuda.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/28/tropical-storm-imelda-hurricane-humberto\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel presses on with Gaza assault as Trump again claims ceasefire is close",
      "link": "https://www.theguardian.com/world/2025/sep/28/israel-presses-on-with-gaza-assault-as-trump-again-claims-ceasefire-is-close",
      "pub_time_taipei": "2025-09-29T01:15:02+08:00",
      "summary": "<p>IDF launches 140 airstrikes in last 24 hours as tanks advance in Gaza City and death toll for same period is put at 77</p><p>Israel has pressed on with its offensive in Gaza as Donald Trump claimed again to be on the brink of a breakthrough in negotiations for a ceasefire in the devastated territory.</p><p>Witnesses and medics said Israeli tanks were advancing through central and western neighbourhoods of Gaza City towards crowded coastal areas where hundreds of thousands of people are sheltering.</p> <a href=\"https://www.theguardian.com/world/2025/sep/28/israel-presses-on-with-gaza-assault-as-trump-again-claims-ceasefire-is-close\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Namibia deploys army to fight wildfire burning third of Etosha game reserve",
      "link": "https://www.theguardian.com/world/2025/sep/28/namibia-army-wildfire-etosha-game-reserve",
      "pub_time_taipei": "2025-09-28T21:09:11+08:00",
      "summary": "<p>Vast tract of park that is home to 114 mammal species, including critically endangered black rhino, affected</p><p>Namibia has begun deploying hundreds of soldiers to fight a fire that has burned through a third of the vast Etosha national park, one of Africa’s largest game reserves, officials said.</p><p>The park in the north of the largely desert country is home to 114 species of mammals, notably the critically endangered black rhinoceros, and is a major tourist attraction.</p> <a href=\"https://www.theguardian.com/world/2025/sep/28/namibia-army-wildfire-etosha-game-reserve\">Continue reading...</a>"
    }
  ]
}