{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-11T20:40:03.932196+08:00",
  "window_end_taipei": "2025-09-12T20:40:03.932196+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Charlie Kirk shooting latest: Trump says ‘with high degree of certainty’ suspect is in custody",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
      "pub_time_taipei": "2025-09-12T20:21:10+08:00",
      "summary": "<p>President makes remark during interview with Fox News at their studio in New York</p><p>Here are some images coming to us via the wires.</p><p>Democracy is the way that we have diverse societies that don’t kill each other, largely,” Lilliana Mason, a leading scholar of partisanship, <a href=\"https://youtube.com/watch?v=vIQiVQ21VN0\">observed recently</a>. She added: “As soon as we stop believing in it, it disappears.” Dr Mason’s own research suggests that there is sharply rising tolerance of political violence. On Wednesday, it claimed one more victim.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Poland says Russia’s drone incursion ‘wasn’t a mistake’ after Trump’s speculation – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/12/poland-russia-drones-ukraine-war-latest-news-europe-live",
      "pub_time_taipei": "2025-09-12T20:20:39+08:00",
      "summary": "<p>Donald Trump appeared to be dismissive Thursday night as he said it ‘could have been an mistake’</p><p><strong>Tusk</strong> also says <strong>the announcement with BAE Systems is “only a part of our cooperation with the UK.”</strong></p><p>He says he “<strong>received another message from prime minister Starmer about greater UK involvement in military assistance, here in Poland</strong>, on an urgent basis,” without offering further details.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/12/poland-russia-drones-ukraine-war-latest-news-europe-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labour MPs despondent after Rayner and Mandelson departures, says cabinet minister – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner",
      "pub_time_taipei": "2025-09-12T20:20:17+08:00",
      "summary": "<p>Scotland secretary Douglas Alexander said of Rayner’s departure that MPs ‘feel quite acutely that sense of loss’</p><p>Speaking at the Reform press conference in <strong>Caerphilly</strong>, <strong>Nigel Farage</strong> said he had a “very expensive week” seeking advice from tax experts, reports the PA news agency.</p><p>The Reform UK leader said last year he had bought a home in his <strong>Essex</strong> constituency, but it was later reported that his partner had actually made the purchase. Questions over the home have resurfaced after <strong>Angela Rayner</strong> resigned last week over underpaying stamp duty on a seaside flat she bought this year.</p><p>The money was legally hers, she bought the house. I don’t have any financial stake in it whatsoever – other than she lets me stay there.</p><p>I have paid a lot of money to make sure we have done everything right.</p><p>I have done everything I can to prove everything I have done has been legal and correct.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "South Korea outraged at 300 workers treated as ‘prisoners of war’ in US raid",
      "link": "https://www.theguardian.com/global-development/2025/sep/12/south-korean-outrage-at-us-detention-ordeal-as-300-workers-return-home",
      "pub_time_taipei": "2025-09-12T20:07:35+08:00",
      "summary": "<p>As Hyundai-LG workers fly home after visa ordeal, Koreans bristle at ‘humiliation’ and sense of betrayal by Seoul’s ally</p><p>More than 300 South Korean workers arrived at Incheon international airport on Friday afternoon, ending a week-long ordeal that began with the US Department of Homeland Security’s <a href=\"https://www.theguardian.com/us-news/2025/sep/05/immigration-ice-raid-hyundai-georgia\">largest ever single-site raid</a> by Immigration and Customs Enforcement (ICE) agents, and has left South Korea questioning whether it can trust its closest ally.</p><p>The 316 Koreans, along with 14 workers of other nationalities, landed shortly after 3pm local time on a chartered Korean Air flight after being detained since 4 September at a Hyundai-LG battery plant construction site in Georgia.</p> <a href=\"https://www.theguardian.com/global-development/2025/sep/12/south-korean-outrage-at-us-detention-ordeal-as-300-workers-return-home\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: New video of suspect released by FBI amid urgent appeal to public for help",
      "link": "https://www.theguardian.com/us-news/2025/sep/12/first-thing-new-video-of-suspect-released-by-fbi-amid-urgent-appeal-for-help-from-the-public",
      "pub_time_taipei": "2025-09-12T19:41:19+08:00",
      "summary": "<p>Reward of $100,000 and direct appeal appear to indicate struggle to identify Charlie Kirk’s killer. Plus, the rise of ecoanxiety on the frontline of climate breakdown</p><p>Good morning.</p><p>US officials have issued an <a href=\"https://www.theguardian.com/us-news/2025/sep/12/charlie-kirk-shooting-new-video-of-suspect-released-by-fbi-asamid-urgent-appeal-for-help-from-the-public\">urgent appeal for help from the public</a> as they continue to search for the shooter of Charlie Kirk, releasing new videos and photos from the scene of the attack in Utah.</p><p><strong>Who was Charlie Kirk?</strong> The Donald Trump ally and star of the US Republican right <a href=\"https://www.theguardian.com/us-news/2025/sep/12/charlie-kirk-young-conservatives-social-media\">galvanized young conservatives through online antics and inflammatory views</a>, helping to push a new generation to the right. Even those who did not agree with his values could not deny his ubiquity on the political scene.</p><p><strong>This is a live story.</strong> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah\">Follow the latest updates here</a>.</p><p><strong>What did the judges say?</strong> Announcing Bolsonaro’s sentence for crimes including coup d’etat and violently attempting to abolish Brazil’s democracy, the <a href=\"https://www.theguardian.com/world/2025/sep/08/judge-alexandre-de-moraes-jair-bolsonaro-trial\">supreme court justice Alexandre de Moraes</a> said: “[He tried to] annihilate the essential pillars of the democratic rule-of-law state … ​the greatest consequence ​[of which] … would have been the return of dictatorship to Brazil​.”</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/12/first-thing-new-video-of-suspect-released-by-fbi-amid-urgent-appeal-for-help-from-the-public\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Alleged rape of Sikh woman in West Midlands being treated as hate crime",
      "link": "https://www.theguardian.com/world/2025/sep/12/alleged-rape-sikh-woman-west-midlands-hate-crime",
      "pub_time_taipei": "2025-09-12T19:38:00+08:00",
      "summary": "<p>Police hunting for two male suspects who are alleged to have racially abused the victim during the assault</p><p>Police investigating the alleged rape of a Sikh woman in the West Midlands say they are treating it as a hate crime.</p><p>Detectives are hunting for two white male suspects alleged to have racially abused the woman during the assault in broad daylight. Police say they believe one suspect had a shaved head and wore gloves.</p> <a href=\"https://www.theguardian.com/world/2025/sep/12/alleged-rape-sikh-woman-west-midlands-hate-crime\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hundreds of prison officers may have to leave UK after Labour’s visa rule change",
      "link": "https://www.theguardian.com/society/2025/sep/12/prison-officers-uk-skilled-work-visa-rule-change",
      "pub_time_taipei": "2025-09-12T19:33:08+08:00",
      "summary": "<p>Prison Officers’ Association says change in eligibility for skilled work visas is ‘disgraceful’ and ‘pandering to Reform’ </p><p>Hundreds of foreign prison officers will lose their jobs and could be forced to return to their home countries at short notice because of a change in visa rules introduced by Labour, governors and a union have warned.</p><p>More than 1,000 staff, mainly from African countries, have been sponsored by prisons across England and Wales allowing them to come to the UK on skilled worker visas.</p> <a href=\"https://www.theguardian.com/society/2025/sep/12/prison-officers-uk-skilled-work-visa-rule-change\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hopes rise of pardon for Abd el-Fattah as Starmer speaks with Egypt president",
      "link": "https://www.theguardian.com/world/2025/sep/12/hopes-rise-of-pardon-for-abd-el-fattah-as-starmer-speaks-with-egypt-president",
      "pub_time_taipei": "2025-09-12T19:32:05+08:00",
      "summary": "<p>Decision expected soon after reports in Cairo about status of imprisoned dual-national human rights activist</p><p>Keir Starmer has spoken to Abdel Fatah al-Sisi amid reports the Egyptian president has directed his officials to study an internal request to grant a pardon to release the British-Egyptian human rights activist and writer Alaa Abd el-Fattah.</p><p>Abd el-Fattah’s British-based family are not commenting on developments save to say they are praying for his release.</p> <a href=\"https://www.theguardian.com/world/2025/sep/12/hopes-rise-of-pardon-for-abd-el-fattah-as-starmer-speaks-with-egypt-president\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Poland tells Trump Russian drone incident wasn’t a mistake",
      "link": "https://www.washingtonpost.com/world/2025/09/12/trump-russia-poland-drones-nato/",
      "pub_time_taipei": "2025-09-12T19:22:53+08:00",
      "summary": "President Donald Trump said violations of Poland’s airspace by Russian drones “could have been a mistake,” contradicting NATO allies including Poland, who said it was intentional."
    },
    {
      "source": "衛報",
      "title": "Digested week: Marsupial brings cheer in dark and dysfunctional days | Emma Brockes",
      "link": "https://www.theguardian.com/uk-news/2025/sep/12/digested-week-marsupial-brings-cheer-in-dark-and-dysfunctional-days",
      "pub_time_taipei": "2025-09-12T19:04:39+08:00",
      "summary": "<p>It was left to a – albeit extinct – tiny relative of the kangaroo to offer some relief from the blizzard of major events</p><p>Where to start in a week so fraught with major events you could hardly draw breath for the news flashes? It started with Trump’s alleged contribution to Jeffrey Epstein’s “birthday book,” shared by the Democrats on social media on Monday and leading to the discovery of a name not widely recognised in the US but of intense interest in the UK – Peter Mandelson. The British ambassador to the US had proffered an undiplomatically warm birthday message to the late child sex offender financier, starting a press scramble that ended, on Thursday, with Keir Starmer firing him.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/12/digested-week-marsupial-brings-cheer-in-dark-and-dysfunctional-days\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Man jailed for life over London shooting that left girl, nine, with bullet in brain",
      "link": "https://www.theguardian.com/uk-news/2025/sep/12/man-jailed-life-london-shooting-girl-bullet-brain",
      "pub_time_taipei": "2025-09-12T19:04:02+08:00",
      "summary": "<p>Javon Riley, 33, sentenced to at least 34 years after gangland attack in Hackney that also injured three men </p><p>A 33-year-old man has been jailed for life with a minimum term of 34 years for his role in a gangland shooting outside a restaurant in east London, which left a nine-year-old girl with a bullet lodged in her brain.</p><p>The girl was hit in the head by one of six bullets fired by a man on a passing motorbike as she sat with her family in the Evin restaurant in Kingsland High Street, Hackney, on 29 May last year.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/12/man-jailed-life-london-shooting-girl-bullet-brain\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Community groups warn against push to ‘rip up’ UK nuclear industry rules",
      "link": "https://www.theguardian.com/environment/2025/sep/12/nuclear-regulatory-taskforce-consultation-new-power-stations-uk",
      "pub_time_taipei": "2025-09-12T19:00:33+08:00",
      "summary": "<p>Joint response by 25 bodies says proposals to speed up approval of new power plants weaken protection for public </p><p>A coalition of civil society groups is warning of the dangers of cutting safety regulations as the government pushes to “rip up the rules” to accelerate the construction of new nuclear power stations.</p><p>The 25 groups from communities neighbouring nuclear sites have submitted a joint response to a consultation by the nuclear regulatory taskforce, saying its proposals lack “both credibility and rigour”.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/12/nuclear-regulatory-taskforce-consultation-new-power-stations-uk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘I’m here to help people, which gives me a superpower’: one man’s challenge to swim 10 Swiss lakes",
      "link": "https://www.theguardian.com/lifeandstyle/2025/sep/12/devon-man-challenge-swim-10-swiss-lakes",
      "pub_time_taipei": "2025-09-12T18:59:04+08:00",
      "summary": "<p>Neil Gilson is undertaking a huge mental and physical task to raise awareness of a neuropsychiatric condition that affected his son Jack</p><p>The physical effort as he battles currents, coldness and wind is massive, but the mental challenge of ploughing on alone for hours on end is even more testing.</p><p><a href=\"https://www.neilgilson.com/\">Neil Gilson</a>, a father of three from Devon, is about to set off on the next leg of his attempt to become the first person to swim the 10 largest lakes in Switzerland, a total of about 230 miles.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/sep/12/devon-man-challenge-swim-10-swiss-lakes\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump’s attacks on judges have gone global, reaching foreign court systems",
      "link": "https://www.washingtonpost.com/national-security/2025/09/12/trump-foreign-courts-sanctions-bolsonaro/",
      "pub_time_taipei": "2025-09-12T18:50:55+08:00",
      "summary": "The White House’s efforts against a judge who tried former Brazilian president Jair Bolsonaro is the latest example of it criticizing or putting sanctions on judicial officials in other countries."
    },
    {
      "source": "衛報",
      "title": "Will the UK ever rejoin the EU? – podcast",
      "link": "https://www.theguardian.com/politics/audio/2025/sep/12/will-the-uk-ever-rejoin-the-eu-podcast",
      "pub_time_taipei": "2025-09-12T18:03:41+08:00",
      "summary": "<p>Pippa Crerar and Kiran Stacey speak to the minister for EU relations, Nick Thomas-Symonds, about the fallout from Brexit and our relationship with the European Union. Plus, we hear his thoughts on Keir Starmer’s leadership and how Labour should take on Nigel Farage and the rise of Reform –– </p><ul><li><p><strong>Send your thoughts and questions to politicsweeklyuk@theguardian.com</strong></p></li></ul> <a href=\"https://www.theguardian.com/politics/audio/2025/sep/12/will-the-uk-ever-rejoin-the-eu-podcast\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How Cambodia, a staunch ally of China, became infatuated with Trump",
      "link": "https://www.washingtonpost.com/world/2025/09/10/cambodia-trump-relationship/",
      "pub_time_taipei": "2025-09-12T18:00:36+08:00",
      "summary": "Cambodia’s elite is taken with Trump, partly thanks to his disregard for democratic processes, but also due to his efforts to secure ceasefire in a border conflict with Thailand."
    },
    {
      "source": "衛報",
      "title": "Strongest tornado ever recorded in Japan hits Shizuoka prefecture",
      "link": "https://www.theguardian.com/environment/2025/sep/12/weather-tracker-strongest-tornado-ever-recorded-japan-hits-shizuoka-prefecture",
      "pub_time_taipei": "2025-09-12T17:52:00+08:00",
      "summary": "<p>Devastating twister packs gusts of up to 168mph, injuring 89 people and leaving trail of destruction</p><p>Japan has experienced the strongest tornado in its recorded history after a devastating twister tore through Shizuoka prefecture.</p><p>Classified as a JEF3, level 3 out of 5 on Japan’s tornado intensity scale, the tornado packed wind gusts of up to 168mph last Friday, injuring 89 people and leaving a trail of destruction. The hardest hit areas included Makinohara and Yoshida, where vehicles were overturned and more than 1,200 structures were damaged. Since records began in 1961, Japan has experienced 13 level 3 tornadoes, but none have reached level 4.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/12/weather-tracker-strongest-tornado-ever-recorded-japan-hits-shizuoka-prefecture\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Giorgio Armani’s will says his brand should be sold or seek IPO",
      "link": "https://www.theguardian.com/fashion/2025/sep/12/giorgio-armani-will-says-brand-sold-ipo",
      "pub_time_taipei": "2025-09-12T17:46:41+08:00",
      "summary": "<p>Late founder instructs heirs to gradually sell stakes in fashion house with priority given to LVMH, L’Oréal or EssilorLuxottica</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/12/uk-gdp-report-economy-july-tariffs-inflation-consumer-confidence-business-live\">Business live – latest updates</a></p></li></ul><p>The Italian fashion house Giorgio Armani could soon be sold or become a publicly listed company, according to the late founder’s will.</p><p>The fashion designer, <a href=\"https://www.theguardian.com/fashion/2025/sep/04/giorgio-armani-celebrated-italian-fashion-designer-dies-at-91\">who died last week at the age of 91</a>, has said in his will that he wants his heirs to sell a 15% stake in the business within 18 months.</p> <a href=\"https://www.theguardian.com/fashion/2025/sep/12/giorgio-armani-will-says-brand-sold-ipo\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Gulf countries question value of U.S. protection after Israeli attack",
      "link": "https://www.washingtonpost.com/world/2025/09/12/israel-qatar-attack-persian-gulf/",
      "pub_time_taipei": "2025-09-12T17:32:11+08:00",
      "summary": "Israel’s airstrike Tuesday in Doha, Qatar, which hosts a major American military base, is making other U.S. allies in the Persian Gulf area nervous."
    },
    {
      "source": "華盛頓郵報",
      "title": "Ukraine pleads for air defense as Russia’s strikes grow in sophistication",
      "link": "https://www.washingtonpost.com/world/2025/09/12/ukraine-air-defense-russia-poland-drones/",
      "pub_time_taipei": "2025-09-12T17:18:51+08:00",
      "summary": "Kyiv fears that Europe will react to Russia’s drone incursion into Poland by keeping its air defenses to itself instead of helping embattled Ukraine."
    },
    {
      "source": "華盛頓郵報",
      "title": "Prince Harry makes surprise visit to Kyiv to see wounded veterans",
      "link": "https://www.washingtonpost.com/world/2025/09/12/prince-harry-ukraine-kyiv-visit/",
      "pub_time_taipei": "2025-09-12T17:10:15+08:00",
      "summary": "“We cannot stop the war but what we can do is do everything we can to help the recovery process,” Harry told the Guardian newspaper of his second visit to Ukraine."
    },
    {
      "source": "衛報",
      "title": "UK needed ‘unconventional’ US ambassador when picking Mandelson, minister says",
      "link": "https://www.theguardian.com/politics/2025/sep/12/uk-needed-unconventional-us-ambassador-when-picking-mandelson-minister-says",
      "pub_time_taipei": "2025-09-12T16:18:59+08:00",
      "summary": "<p>Douglas Alexander says he would not have been appointed if PM had known the depth of his links to Jeffrey Epstein</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner\">UK politics live – latest updates</a></p></li></ul><p>The UK government believed an “unconventional presidential administration” required an “unconventional ambassador” when it appointed Peter Mandelson as US ambassador, a cabinet minister has said.</p><p>But the Scotland secretary, Douglas Alexander, told broadcasters Mandelson would not have been given the role had the prime minister known the depth of his association with the convicted child sex offender Jeffrey Epstein.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/12/uk-needed-unconventional-us-ambassador-when-picking-mandelson-minister-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Peter Mandelson’s advisory firm cuts ties amid Jeffrey Epstein revelations",
      "link": "https://www.theguardian.com/politics/2025/sep/12/peter-mandelson-advisory-firm-global-counsel-cuts-ties-amid-jeffrey-epstein-revelations",
      "pub_time_taipei": "2025-09-12T16:13:55+08:00",
      "summary": "<p>Global Counsel, co-founded by the sacked ambassador to the US, is selling off his multimillion-pound stake</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner\">UK politics live – latest updates</a></p></li><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/12/uk-gdp-report-economy-july-tariffs-inflation-consumer-confidence-business-live\">Business live – latest updates</a></p></li></ul><p>Peter Mandelson’s advisory firm is cutting ties with him after his <a href=\"https://www.theguardian.com/politics/2025/sep/11/keir-starmer-sacks-peter-mandelson-over-jeffrey-epstein-revelations\">firing as US ambassador</a> after the extent of his relationship with the child sex offender Jeffrey Epstein was revealed in emails.</p><p>Global Counsel, which Mandelson co-founded in 2010 alongside Benjamin Wegg-Prosser, is selling off his multimillion pound stake.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/12/peter-mandelson-advisory-firm-global-counsel-cuts-ties-amid-jeffrey-epstein-revelations\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Neo-Nazi Thomas Sewell given community work order for intimidating police officer and wife",
      "link": "https://www.theguardian.com/australia-news/2025/sep/12/neo-nazi-thomas-sewell-found-guilty-of-intimidating-police-officer-by-threatening-to-dox-them-ntwnfb",
      "pub_time_taipei": "2025-09-12T16:09:22+08:00",
      "summary": "<p>Police officer gave evidence to Melbourne court about feeling ‘highly anxious’ over his and his family’s safety after Sewell’s podcast comments</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A neo-Nazi leader has been handed a community work order for intimidating a police officer and his wife.</p><p>Thomas Sewell, 32, was on Friday found guilty of three charges of intimidation of a law enforcement officer, and his wife, over targeted threats to expose his personal information.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/12/neo-nazi-thomas-sewell-found-guilty-of-intimidating-police-officer-by-threatening-to-dox-them-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK imposes 100 new sanctions targeting Russia’s revenues and military supplies",
      "link": "https://www.theguardian.com/world/2025/sep/12/uk-imposes-sanctions-russia-revenues-military-supplies-yvette-cooper",
      "pub_time_taipei": "2025-09-12T15:43:18+08:00",
      "summary": "<p>Electronics firms and ‘shadow fleet’ carrying oil among targets as UK foreign secretary, Yvette Cooper, travels to Ukraine</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner\">UK politics live – latest updates</a></p></li></ul><p>The UK government has implemented 100 new sanctions designed to hit Russia’s revenues and military supplies, including against its so-called shadow fleet carrying oil and electronics companies.</p><p>The move announced by the UK foreign secretary, Yvette Cooper, as she travels to Kyiv, comes as Vladimir Putin continues to obstruct peace efforts by launching the largest air attack of the war against Ukraine, with more than 800 missiles and drones fired in a single night.</p> <a href=\"https://www.theguardian.com/world/2025/sep/12/uk-imposes-sanctions-russia-revenues-military-supplies-yvette-cooper\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Health ministers agree to new fertility sector accreditation regime – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
      "pub_time_taipei": "2025-09-12T15:36:35+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/environment/2025/sep/12/north-west-shelf-gas-project-extended-to-2070-with-partial-protection-for-indigenous-rock-art\">Australia’s biggest gas project greenlit to 2070 with ‘partial’ protection for Indigenous rock art</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australians are dying from dementia more than any other disease, as advocates warn the number of people with the disease could exceed 1 million without government intervention, <strong>AAP</strong> reports.</p><p>Dementia accounted for almost 17,400 deaths in 2023, equivalent to almost one in 10 of all deaths, according to the Australian Institute of Health and Welfare.</p><p>This has been an entirely unedifying week for the Coalition. Not something that we want to repeat. Something we should learn from.</p><p>I think there has been mishandling on all sides, but the good news is we have cauterised the wound. We are going to move on now and talk about what’s important to ordinary Australians.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Utah officials share video of Charlie Kirk shooting suspect as governor pledges death penalty - as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
      "pub_time_taipei": "2025-09-12T15:31:02+08:00",
      "summary": "<p>This blog is now closed, you can read our new live blog <a href=\"https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah\">here</a></p><p>A <strong>UK</strong> offshoot of a <strong>US</strong> conservative group set up by <strong>Charlie</strong> <strong>Kirk</strong> is to hold a vigil in <strong>London</strong> after he was shot dead, reports the PA news agency.</p><p><strong>Turning Point UK</strong> has said its activists will gather on Friday evening by the <strong>Montgomery statue</strong> in <strong>Whitehall</strong> and called on others to “join us in remembering Charlie”.</p><p>It’s absolutely shocking, we’re heartbroken over here in the UK.</p><p>My thoughts this evening are with the loved ones of Charlie Kirk.</p><p>It is heartbreaking that a young family has been robbed of a father and a husband.</p><p>Political violence has no place in our societies.</p><p>Our thoughts and condolences are with his family.</p><p>An atrocious murder, a deep wound for democracy and for those who believe in freedom.</p><p>My condolences to his family, to his loved ones, and to the American conservative community.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Threatened, harassed and spat on: envoy details rise in attacks and recommends Islamophobia be treated with urgency",
      "link": "https://www.theguardian.com/news/2025/sep/12/islamophobia-report-envoy-aftab-malik-hands-down-recommendations-to-albanese-government",
      "pub_time_taipei": "2025-09-12T14:21:20+08:00",
      "summary": "<p>Aftab Malik cites bomb threats and assaults when releasing report containing 54 recommendations</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Counter-terrorism laws should be reviewed, and the Racial Discrimination Act should be updated to protect religious groups , according to a long-awaited report from the special envoy to combat Islamophobia.</p><p>The report <a href=\"https://www.oseci.gov.au/sites/default/files/2025-09/national-response-final-report.pdf\">makes 54 recommendations</a> to parliament and government departments to tackle Islamophobia, improve data collection on hate crimes, and calls on the government to “confront Islamophobia with equivalent urgency to other discriminatory practices, and provide it with the same rights, protections, and legal recourse”.</p> <a href=\"https://www.theguardian.com/news/2025/sep/12/islamophobia-report-envoy-aftab-malik-hands-down-recommendations-to-albanese-government\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Australia’s biggest gas project greenlit to 2070 with ‘partial’ protection for Indigenous rock art",
      "link": "https://www.theguardian.com/environment/2025/sep/12/north-west-shelf-gas-project-extended-to-2070-with-partial-protection-for-indigenous-rock-art",
      "pub_time_taipei": "2025-09-12T13:16:44+08:00",
      "summary": "<p>Approval met with fury from conservation groups and the Greens, who called it a ‘betrayal’ of Australians who want climate action</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Albanese government has approved an extension to 2070 of one of the world’s biggest gas export projects, saying it has agreed on conditions to protect more than 1 million pieces of ancient world heritage-listed Indigenous rock art that sit nearby.</p><p>Climate campaigners have described Woodside’s North West Shelf extension as a “carbon bomb” incompatible with global climate goals. The approval was met with fury from conservation groups and the Greens on Friday, who said it was a “betrayal” of Australians who wanted climate action.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/12/north-west-shelf-gas-project-extended-to-2070-with-partial-protection-for-indigenous-rock-art\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jail for Bolsonaro by no means signals the end of his political movement",
      "link": "https://www.theguardian.com/world/2025/sep/12/jail-for-bolsonaro-by-no-means-signals-the-end-of-his-political-movement",
      "pub_time_taipei": "2025-09-12T12:00:27+08:00",
      "summary": "<p>With widespread support at home and from Trump, his heir will take the fight to Lula in the 2026 presidential election</p><p>Four years have passed since <a href=\"https://www.theguardian.com/world/jair-bolsonaro\">Jair Bolsonaro</a> laid out three possible denouements for his extraordinary political career, during which the oft-ridiculed fringe politician rose to become one of leading lights of the global populist right alongside Viktor Orbán and Donald Trump.</p><p>“Going to jail, being killed or victory,” predicted Brazil’s then president as he grappled with a deluge of political crises in August 2021.</p> <a href=\"https://www.theguardian.com/world/2025/sep/12/jail-for-bolsonaro-by-no-means-signals-the-end-of-his-political-movement\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Nepal’s uprising was a generation in the making",
      "link": "https://www.washingtonpost.com/world/2025/09/12/nepal-uprising-government/",
      "pub_time_taipei": "2025-09-12T12:00:00+08:00",
      "summary": "A young Nepali who witnessed both the 2006 uprising and this week’s upheavals says “it’s the uncertainty that lies ahead that now scares me.”"
    },
    {
      "source": "衛報",
      "title": "Venezuela says 11 killed in US boat strike were not gang members amid reports vessel was returning to shore",
      "link": "https://www.theguardian.com/world/2025/sep/11/venezuela-boat-strike-tren-de-aragua-trump",
      "pub_time_taipei": "2025-09-12T09:50:42+08:00",
      "summary": "<p>Interior minister says ‘murder has been committed’ while US Congress demands justification for attack</p><p>None of the 11 people killed in a US <a href=\"https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike\">military strike</a> on a boat in the Caribbean last week were members of Venezuelan gang Tren de Aragua, Venezuela’s interior minister has said, while US media reported the attack came after the vessel had turned around and was heading back to shore.</p><p>The administration of Donald Trump has said the boat was transporting illegal narcotics, but has provided little further information about the incident, even amid demands from members of the US Congress for a justification for the action.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/venezuela-boat-strike-tren-de-aragua-trump\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Bolsonaro sentenced to over 27 years in prison for coup plot in Brazil",
      "link": "https://www.washingtonpost.com/world/2025/09/11/bolsonaro-convicted-election-plot-assassinations/",
      "pub_time_taipei": "2025-09-12T07:13:25+08:00",
      "summary": "Brazil’s Supreme Court ruled the former president tried to reverse his 2022 election loss with a plot that included plans to assassinate President Luiz Inácio Lula da Silva."
    },
    {
      "source": "衛報",
      "title": "Bolsonaro sentenced to 27 years for plotting military coup in Brazil",
      "link": "https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup",
      "pub_time_taipei": "2025-09-12T06:21:20+08:00",
      "summary": "<p>Former president sought to ‘annihilate’ country’s democracy after losing 2022 election</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/11/jair-bolsonaro-conviction-attempted-coup-what-happens-next-explainer\">Explainer: what did Bolsonaro’s trial reveal?</a></p></li></ul><p>​Brazil’s former far-right president <a href=\"https://www.theguardian.com/world/jair-bolsonaro\">Jair Bolsonaro</a> ​has been sentenced to more than 27 years in prison for plotting a military coup​ and seeking to “annihilate” the South American country’s democracy.</p><p>Justices Cármen Lúcia Antunes Rocha and Cristiano Zanin ruled on ​Thursday that Bolsonaro – a former paratrooper who was elected president in 2018 – was guilty of seeking to forcibly cling to power after losing the 2022 election, meaning four of the five judges involved in the trial had found Brazil’s former leader guilty.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Greenlandic women detail Danish forced contraception program in new report",
      "link": "https://www.washingtonpost.com/world/2025/09/10/denmark-forced-contraception-greenland/",
      "pub_time_taipei": "2025-09-12T06:16:20+08:00",
      "summary": "Denmark forced contraception on more than 350 Greenlandic Indigenous women and girls, who reported cases that date back to the 1960s."
    },
    {
      "source": "衛報",
      "title": "Archaeologists scramble to evacuate Gaza artefacts threatened by Israeli strike",
      "link": "https://www.theguardian.com/world/2025/sep/11/antiquities-evacuated-from-gaza-city-storehouse-ahead-of-israeli-strike",
      "pub_time_taipei": "2025-09-12T04:17:31+08:00",
      "summary": "<p>Officials hurriedly remove nearly three decades of finds in ‘high-risk operation’</p><p>An official in charge of nearly three decades of archaeological finds in <a href=\"https://www.theguardian.com/world/gaza\">Gaza</a> has described how the artefacts were hurriedly evacuated from a Gaza City building threatened by an Israeli strike.</p><p>“This was a high-risk operation, carried out in an extremely dangerous context for everyone involved – a real last-minute rescue,” said Olivier Poquillon, director of the French Biblical and Archaeological School of Jerusalem (EBAF), which housed the relics.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/antiquities-evacuated-from-gaza-city-storehouse-ahead-of-israeli-strike\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Canada: Carney unveils array of national projects to ‘turbocharge’ economy",
      "link": "https://www.theguardian.com/world/2025/sep/11/canada-mark-carney-national-projects-economy",
      "pub_time_taipei": "2025-09-12T03:51:37+08:00",
      "summary": "<p>List leaves out oil pipelines and focuses on LNG expansion, mines and nuclear power as it fends off US trade war</p><p>Canada’s Liberal government has said that a liquefied natural gas facility, critical mineral mines, a nuclear reactor and port expansion will mark the first wave of major national projects to “turbocharge” the country’s economy as it fends off a trade war with the United States.</p><p>Notably, the list unveiled by the prime minster, Mark Carney, on Thursday does not include any new oil pipelines – projects which have proven to be deeply divisive and politically fractious in recent years.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/canada-mark-carney-national-projects-economy\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Russian diva condemns Putin’s war on Ukraine in first interview since exile",
      "link": "https://www.washingtonpost.com/world/2025/09/11/alla-pugacheva-russia-ukraine-interview/",
      "pub_time_taipei": "2025-09-12T03:51:12+08:00",
      "summary": "Alla Pugacheva, Russia’s “prima donna,” dominated the Soviet music scene and gave her first interview since being forced into exile after the invasion of Ukraine."
    },
    {
      "source": "衛報",
      "title": "Senators say US is complicit in Israel’s ethnic cleansing of Gaza",
      "link": "https://www.theguardian.com/us-news/2025/sep/11/democratic-senators-gaza-ethnic-cleansing",
      "pub_time_taipei": "2025-09-12T03:39:44+08:00",
      "summary": "<p>Democrats Chris Van Hollen and Jeff Merkley reach ‘inescapable conclusion’ after fact-finding trip to region</p><p>Two Democratic senators claim they have reached the “inescapable conclusion” that Israel is acting on a systematic plan to destroy and ethnically cleanse Palestinians from Gaza to force local people to leave, and they say the US is complicit.</p><p>Chris Van Hollen of Maryland and Jeff Merkley of Oregon, both members of the Senate foreign relations committee, released <a href=\"https://www.vanhollen.senate.gov/imo/media/doc/van_hollen_merkley_report_following_2025_codel_to_gaza_border_israel_west_bank_jordan_and_egypt.pdf\">their findings in a report</a> on Thursday after returning from a congressional delegation to the Middle East where, they note, the destruction goes beyond bombs and bullets. They say they also found a systematic campaign to strangle humanitarian aid, which they call “using food as a weapon of war”.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/11/democratic-senators-gaza-ethnic-cleansing\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel’s strike in Qatar scrambles Trump’s ceasefire plans",
      "link": "https://www.washingtonpost.com/national-security/2025/09/11/israel-qatar-strike-hamas-trump-ceasefire/",
      "pub_time_taipei": "2025-09-12T03:10:16+08:00",
      "summary": "Israel’s strike on Hamas leaders in Doha has upended ceasefire negotiations and undermined President Donald Trump’s goal of regional integration."
    },
    {
      "source": "衛報",
      "title": "What did Jair Bolsonaro’s trial reveal about an attempted coup in Brazil?",
      "link": "https://www.theguardian.com/world/2025/sep/11/jair-bolsonaro-conviction-attempted-coup-what-happens-next-explainer",
      "pub_time_taipei": "2025-09-12T03:04:05+08:00",
      "summary": "<p>Far-right ex-president was found to have led a ‘criminal organisation’ to try to stay in power</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup\">Bolsonaro found guilty of plotting military coup</a></p></li></ul><p>Brazil’s supreme court has made Jair Bolsonaro <a href=\"https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup\">the first former president in the country’s history to be convicted for attempting a coup</a>.</p><p>The 70-year-old far-right leader claims he is the victim of political persecution, but four out of five judges concluded on Thursday that it was sufficiently proven that Bolsonaro and his close allies attempted to overturn the 2022 election, <a href=\"https://www.theguardian.com/world/2022/oct/30/lula-stages-astonishing-comeback-to-beat-bolsonaro-in-brazil-election\">which he lost</a> to Luiz Inácio Lula da Silva.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/jair-bolsonaro-conviction-attempted-coup-what-happens-next-explainer\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump expands ‘third country’ deportation policy to Ghana",
      "link": "https://www.washingtonpost.com/world/2025/07/15/trump-third-countries-migrants-deportation/",
      "pub_time_taipei": "2025-09-12T02:39:56+08:00",
      "summary": "The U.S. policy echoes approaches tried in Australia, Britain and elsewhere."
    },
    {
      "source": "衛報",
      "title": "Fiji ant study provides new evidence of insects’ decline on remote islands",
      "link": "https://www.theguardian.com/environment/2025/sep/11/fiji-ant-science-evidence-decline-insect-extinctions-remote-islands-aoe",
      "pub_time_taipei": "2025-09-12T02:00:13+08:00",
      "summary": "<p>DNA analysis of endemic specimens in museums finds 79% of ant populations in Pacific archipelago are shrinking</p><p>Island-dwelling insects have not been spared the ravages of humanity that have pushed so many of their invertebrate kin into freefall around the world, new research on Fijian ant populations has found.</p><p>Hundreds of thousands of insect species have been lost over the past 150 years and it is believed the world is now losing between 1% and <a href=\"https://www.theguardian.com/environment/2019/feb/10/plummeting-insect-numbers-threaten-collapse-of-nature\">2.5% a year of its remaining insect biomass</a> – a decline so steep that many entomologists say we are living through an <a href=\"https://www.theguardian.com/environment/2025/jun/03/climate-species-collapse-ecology-insects-nature-reserves-aoe\">“insect apocalypse”</a>. Yet long-term data for individual insect populations is sparse and patchy.</p> <a href=\"https://www.theguardian.com/environment/2025/sep/11/fiji-ant-science-evidence-decline-insect-extinctions-remote-islands-aoe\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "NATO allies accuse Russia of deliberate drone incursion to test readiness",
      "link": "https://www.washingtonpost.com/world/2025/09/11/nato-russia-drones-poland-test/",
      "pub_time_taipei": "2025-09-12T01:29:56+08:00",
      "summary": "Russian drones breached Poland’s airspace and, experts said, by Kremlin design or not, the incident tested NATO’s readiness to defend its easternmost members."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.K. dismisses ambassador to U.S. over links to Jeffrey Epstein",
      "link": "https://www.washingtonpost.com/world/2025/09/11/uk-withdraws-ambassador-peter-mandelson-epstein/",
      "pub_time_taipei": "2025-09-11T22:11:34+08:00",
      "summary": "British Prime Minister Keir Starmer fired Peter Mandelson after diplomats said “additional information” emerged about his links with sex offender Jeffrey Epstein."
    },
    {
      "source": "衛報",
      "title": "Festival axes German orchestra over concerns about Israeli conductor",
      "link": "https://www.theguardian.com/world/2025/sep/11/festival-axes-german-orchestra-over-concerns-about-israeli-conductor",
      "pub_time_taipei": "2025-09-11T21:04:06+08:00",
      "summary": "<p>Belgian organisers are accused of ‘naked antisemitism’ after cancelling performance by Lahav Shani</p><p>A Belgian classical music festival has axed a leading German orchestra from its programme over concerns about its Israeli conductor, drawing accusations of antisemitism from Berlin.</p><p>Flanders Festival Ghent announced it had cancelled a concert by the Munich Philharmonic scheduled for 18 September, citing insufficient clarity over Lahav Shani’s attitude to the Israeli government.</p> <a href=\"https://www.theguardian.com/world/2025/sep/11/festival-axes-german-orchestra-over-concerns-about-israeli-conductor\">Continue reading...</a>"
    }
  ]
}