{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-30T20:40:03.928815+08:00",
  "window_end_taipei": "2025-10-01T20:40:03.928815+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Miliband vows to ban fracking, labels Reform ‘ideological extremists’ and tells Musk to ‘get the hell out of our politics’ – live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/01/keir-starmer-labour-conference-nigel-farage-reform-uk-politics-latest-news-updates",
      "pub_time_taipei": "2025-10-01T20:27:15+08:00",
      "summary": "<p>Environmental groups have welcomed the energy secretary’s fracking announcement</p><p>At the Labour conference Ed Miliband, the energy secretary, has just started his speech.</p><p>Responding to the news that he will announce a total ban on fracking (see <a href=\"https://www.theguardian.com/politics/live/2025/oct/01/keir-starmer-labour-conference-nigel-farage-reform-uk-politics-latest-news-updates?page=with%3Ablock-68dce39b8f0896412d7c1481#block-68dce39b8f0896412d7c1481\">9.19am</a>), Asad Rehman, chief executive of <strong>Friends of the Earth</strong>, said:<strong><br /></strong></p><p>By providing a clear vision for our energy future based on helping people, not on ignoring the science, the energy secretary has sent an important message that the government is listening to communities.</p><p>Fracking is and always has been unpopular, both with people facing it off locally and the wider public. The government must now translate its plans to ban fracking permanently into policy, alongside closing a loophole in planning law that still allows it to happen by the backdoor.</p><p>Andy Burnham is doing a fantastic job as the mayor of Manchester. I actually worked closely with him. We’ve reset that relationship between Westminster and our mayors, and we’re working well together. So I’ve got no personal issue with Andy in the slightest.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/01/keir-starmer-labour-conference-nigel-farage-reform-uk-politics-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Europe ‘in most difficult and dangerous situation since second world war,’ Danish PM warns – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/01/mette-frederiksen-denmark-europe-russia-vladimir-putin-volodymyr-zelenskyy-ukraine-hybrid-war-security-europe-live-news",
      "pub_time_taipei": "2025-10-01T20:24:47+08:00",
      "summary": "<p>Mette Frederiksen says she backs the European Commission’s proposal for a reparation loan for Ukraine, secured on frozen Russian assets</p><p><strong>Siliņa </strong>says <strong>the EU should move on drones very quickly</strong>, as she rejects some criticism that fully developing the bloc’s “drone wall” could take up to three-four years.</p><p><em>“We don’t need three years, and <strong>I believe we can do it in a much shorter time.</strong></em></p><p><em>It just depends on the leaders [if] we can agree on a much shorter time, <strong>because with drones, how they’re developing so fast, three years is too long.</strong>”</em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/01/mette-frederiksen-denmark-europe-russia-vladimir-putin-volodymyr-zelenskyy-ukraine-hybrid-war-security-europe-live-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israeli minister says ‘last opportunity’ for Gaza City residents to flee – Middle East crisis live",
      "link": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-offensive-benjamin-netanyahu-hamas-donald-trump-middle-east-crisis-live-news",
      "pub_time_taipei": "2025-10-01T20:20:40+08:00",
      "summary": "<p>Israeli offensive intensifies amid reports Hamas will seek amendments to Trump’s Gaza plan</p><p>Here are some images coming in via the newswires today:</p><p>The <strong>International Committee of the Red Cross (ICRC)</strong> said that the “intensification of military operations in Gaza City” has forced the humanitarian organisation to temporarily suspend operations at its <strong>Gaza City</strong> office and relocate its staff to ICRC offices in <strong>southern Gaza</strong> “to ensure staff safety and operational continuity”.</p><p>The ICRC will continue to strive to provide support to civilians in Gaza City, whenever circumstances allow, from our offices in Deir al-Balah and Rafah, which remain fully operational. This includes providing medical donations to the few remaining health facilities in Gaza City and doing the utmost to facilitate the movements of first responders. In Rafah, the Red Cross Field hospital will continue to be a lifeline for the many wounded patients pouring in.</p><p>The ICRC has been in Gaza City for decades. Following the latest intensification of hostilities, ICRC teams stayed as long as they possibly could to protect and support the most vulnerable people. The ICRC remains committed to returning as soon as conditions allow.</p><p>The rapid and unimpeded passage of humanitarian assistance must be allowed and facilitated across the Gaza Strip.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-offensive-benjamin-netanyahu-hamas-donald-trump-middle-east-crisis-live-news\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Pope Leo speaks out on abortion and treatment of immigrants in U.S.",
      "link": "https://www.washingtonpost.com/world/2025/10/01/pope-leo-trump-immigrants-abortion-durbin/",
      "pub_time_taipei": "2025-10-01T20:19:57+08:00",
      "summary": "Pope Leo, asked about a debate roiling Chicago’s diocese, questioned whether someone could be “pro-life” if they stood against abortion but favored the death penalty."
    },
    {
      "source": "衛報",
      "title": "US government shutdown live: first closure since 2018 begins after funding bill fails",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
      "pub_time_taipei": "2025-10-01T20:16:16+08:00",
      "summary": "<p>Competing bills rejected in Senate as Republicans and Democrats accuse each other of partisan politics</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/01/us-government-shuts-down\">US government shuts down</a></p></li><li><p><a href=\"https://www.theguardian.com/us-news/ng-interactive/2025/sep/30/us-senate-government-funding-votes\">Tracker: how each US senator voted</a></p></li></ul><p>This shutdown is expected to be worse than previous ones. The impact on federal workers could be even more severe.</p><p>Before Trump’s most recent threat of mass layoffs on Tuesday, a memo released last week by the White House’s office of management and budget told agencies not just to prepare for temporary furloughs <a href=\"https://www.theguardian.com/us-news/2025/sep/25/trump-administration-government-shutdown\">but for permanent layoffs</a> in the event of a shutdown.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "International students left in limbo by UCL after university exceeds visa allocations",
      "link": "https://www.theguardian.com/education/2025/oct/01/international-students-ucl-university-college-london-visa-allocations",
      "pub_time_taipei": "2025-10-01T20:15:03+08:00",
      "summary": "<p>Hundreds of students accepted on courses facing costs and even deportation after being told to defer studies until 2026</p><p>Hundreds of international students accepted on courses by University College London have been left in limbo and facing thousands of pounds in costs, after the university admitted it had run out of places just days before many were due to start.</p><p>About 200 students from China alone have been affected after UCL exceeded its visa allocations for the coming academic year, with the university initially telling the students that they would have to defer their studies until 2026.</p> <a href=\"https://www.theguardian.com/education/2025/oct/01/international-students-ucl-university-college-london-visa-allocations\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Pro-Palestine flotilla heading towards Gaza ‘harassed by Israeli naval boats’",
      "link": "https://www.theguardian.com/world/2025/oct/01/pro-palestine-flotilla-heading-towards-gaza-harassed-by-israeli-naval-boats",
      "pub_time_taipei": "2025-10-01T20:14:09+08:00",
      "summary": "<p>Account of ‘intimidatory operation’ comes as Italy and Greece repeat call for Israel to guarantee safety of flotilla</p><p>A pro-Palestinian flotilla heading to Gaza has said it has been approached and harassed by Israeli naval boats that cut one of its lead vessels’ communication systems as Italy and Greece reiterated calls for Israel to guarantee the safety of those onboard.</p><p>The Global Sumud Flotilla (GSF), carrying about 500 people including the climate campaigner Greta Thunberg and former Barcelona mayor Ada Colau, said it had an encounter with Israeli navy vessels that circled the fleet’s “lead boat for around six minutes” while remotely disabling its communication systems.</p> <a href=\"https://www.theguardian.com/world/2025/oct/01/pro-palestine-flotilla-heading-towards-gaza-harassed-by-israeli-naval-boats\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US government shuts down after Democrats refuse to back Republican funding plan",
      "link": "https://www.theguardian.com/us-news/2025/oct/01/us-government-shuts-down",
      "pub_time_taipei": "2025-10-01T20:09:19+08:00",
      "summary": "<p>First shutdown in nearly seven years as Republicans accused of ‘risking America’s healthcare’ in spending bill</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news\">US government shutdown – live updates</a></p></li></ul><p>The US government shut down on Wednesday, after congressional Democrats refused to support a Republican plan to extend funding for federal departments unless they won a series of concessions centered on healthcare.</p><p>The GOP, which controls the Senate and the House of Representatives, repudiated their demands, setting off a legislative scramble that lasted into the hours before funding lapsed at midnight, when the Senate failed to advance both parties’ bills to keep funding going.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/01/us-government-shuts-down\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather warnings as Storm Amy to batter UK this weekend",
      "link": "https://www.theguardian.com/uk-news/2025/oct/01/uk-weather-storm-amy-yellow-warnings-rain-wind",
      "pub_time_taipei": "2025-10-01T20:09:15+08:00",
      "summary": "<p>First named storm of season expected to bring heavy rain and winds over 80mph to northern and western regions</p><p>Storm Amy, the first named storm of the season, is due to batter northern parts of the UK late on Friday and into Saturday, <a href=\"https://x.com/metoffice/status/1973320625067311451\">the Met Office has warned</a>.</p><p>Forecasters said the storm was likely to bring gale force winds of over 80mph as well as heavy rain to northern and western regions.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/01/uk-weather-storm-amy-yellow-warnings-rain-wind\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘We can leave knowing we left a mark’: how Corsica Studios transformed London nightlife – and why it’s closing",
      "link": "https://www.theguardian.com/music/2025/oct/01/how-corsica-studios-transformed-london-nightlife-and-why-its-closing",
      "pub_time_taipei": "2025-10-01T20:07:43+08:00",
      "summary": "<p>The beloved south London club has announced it will shut next year as redevelopment of the site goes ahead. Founder Adrian Jones, DJs and promoters look back</p><p>Ask any music-loving Londoner to name the city’s best venues, and there’s a decent chance Corsica Studios will appear somewhere near the top of their list. Opened in 2002 by Adrian Jones and Amanda Moss, for 23 years this unassuming railway arch beneath Elephant &amp; Castle station, with its pummelling sound, no-frills aesthetics and adventurous musical programming, has become one of the capital’s most influential and beloved clubs.</p><p>Founded and envisaged as a multi-purpose creative space rather than just a nightclub, it’s attracted massive names such as Jeff Mills and Björk, nurtured underground scenes from acid techno to jungle and pushed the boundaries of what a clubnight can be, via Evian Christ’s maximalist Trance Parties, Hyperdub’s groundbreaking Ø series or more recent forays into sex-positive raving.</p> <a href=\"https://www.theguardian.com/music/2025/oct/01/how-corsica-studios-transformed-london-nightlife-and-why-its-closing\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Miami deal for Trump library next to famous Freedom Tower angers critics",
      "link": "https://www.theguardian.com/us-news/2025/oct/01/miami-deal-for-trump-library-angers-critics",
      "pub_time_taipei": "2025-10-01T20:00:25+08:00",
      "summary": "<p>Advocates say reopened tower, which tells story of Miami as welcoming city for immigrants, will be tarnished</p><p>The donation by the state of Florida of prime development land in Miami for Donald Trump’s presidential library has angered critics who say it is a betrayal of the city’s famous <a href=\"https://www.mdc.edu/freedomtower/about/\">Freedom Tower</a>, a beacon of hope for generations of immigrants.</p><p>Ron DeSantis, Florida’s Republican governor, and his three cabinet colleagues <a href=\"https://www.flgov.com/eog/news/press/2025/governor-ron-desantis-and-cabinet-deed-land-donald-j-trump-presidential-library\">voted unanimously</a> on Tuesday to deed the almost three-acre parcel of land immediately adjacent to the building – also known as El Refugio (the shelter) – to the foundation that will build the library devoted to the legacy of the 45th and 47th president.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/01/miami-deal-for-trump-library-angers-critics\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Reverse Midas touch’: Starmer plan prompts collapse in support for digital IDs",
      "link": "https://www.theguardian.com/politics/2025/oct/01/keir-starmer-labour-collapse-public-support-digital-id-cards",
      "pub_time_taipei": "2025-10-01T19:52:09+08:00",
      "summary": "<p>Net public backing for scheme has fallen to -14% after prime minister’s announcement, according to polling</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/oct/01/keir-starmer-labour-conference-nigel-farage-reform-uk-politics-latest-news-updates\">UK politics live – latest updates</a></p></li></ul><p>Public support for <a href=\"https://www.theguardian.com/politics/idcards\">digital IDs</a> has collapsed after Keir Starmer <a href=\"https://www.theguardian.com/politics/2025/sep/26/keir-starmer-digital-id-cards-enormous-opportunity-uk\">announced plans</a> for their introduction, in what has been described as a symptom of the prime minister’s “reverse Midas touch”.</p><p>Net support for digital ID cards fell from 35% in the early summer to -14% at the weekend after Starmer’s announcement, according to polling by More in Common.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/01/keir-starmer-labour-collapse-public-support-digital-id-cards\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Philippines earthquake death toll rises to at least 69 as Cebu hospitals struggle",
      "link": "https://www.theguardian.com/world/2025/sep/30/central-philippines-hit-by-powerful-earthquake",
      "pub_time_taipei": "2025-10-01T19:47:35+08:00",
      "summary": "<p>More than 700 aftershocks recorded – mostly minor – while rescuers search for casualties in coastal city of Bogo</p><p>The death toll from a powerful earthquake in the Philippines has risen to at least 69, with the number of patients overwhelming hospitals on the island of Cebu.</p><p>Injured children cried and adults screamed as they were treated on beds beneath blue tents outside the Cebu provincial hospital. They had been wheeled outside as a precaution against waves of aftershocks overnight.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/central-philippines-hit-by-powerful-earthquake\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "First Thing: US government shuts down after Democrats refuse to back Republican funding plan",
      "link": "https://www.theguardian.com/us-news/2025/oct/01/first-thing-us-government-shuts-down-after-democrats-refuse-to-back-republican-funding-plan",
      "pub_time_taipei": "2025-10-01T19:15:54+08:00",
      "summary": "<p>Democrats accuse Republicans of ‘risking America’s healthcare’ in spending bill. Plus, Trump says military should use US cities as training grounds</p><ul><li><p><a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p></li></ul><p>Good morning.</p><p>The US government <a href=\"https://www.theguardian.com/us-news/2025/oct/01/us-government-shuts-down\">shut down on Wednesday</a>, after congressional Democrats refused to support a Republican plan to extend funding unless they were granted certain concessions on healthcare.</p><p><strong>What does a shutdown mean in practice?</strong> Federal employees <a href=\"https://www.theguardian.com/us-news/2025/sep/27/government-shutdown-explainer\">classified as “non-excepted” are placed on unpaid furlough</a>, while excepted staff, whose jobs involve protecting life and property, must work without pay until the shutdown ends.</p><p><strong>Will there be another vote?</strong> Yes: Senate Republicans have scheduled another round of votes on the two funding bills on Wednesday morning, stating they did so to allow Democrats to change their minds. <a href=\"https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news\">Follow our liveblog here</a>.</p><p><strong>What else did Trump say?</strong> The president’s comments included encouragement of retaliation by immigration enforcement agents: he said that when faced with people throwing bricks at their vehicles, “you can get out of that car and you do whatever the hell you want to do”.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/01/first-thing-us-government-shuts-down-after-democrats-refuse-to-back-republican-funding-plan\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Ukrainian nuclear plant’s longest stretch on backup power raises alarm",
      "link": "https://www.washingtonpost.com/world/2025/10/01/ukraine-nuclear-znpp-zaporizhzhia-generators/",
      "pub_time_taipei": "2025-10-01T19:01:24+08:00",
      "summary": "The Zaporizhzhia Nuclear Power Plant has been on backup power for over a week, Ukrainian officials and the International Atomic Energy Agency are sounding the alarm."
    },
    {
      "source": "華盛頓郵報",
      "title": "Taliban’s ongoing internet shutdown paralyzes Afghanistan",
      "link": "https://www.washingtonpost.com/world/2025/09/30/afghanistan-internet-blackout-taliban/",
      "pub_time_taipei": "2025-10-01T18:57:25+08:00",
      "summary": "Two weeks after the Taliban signaled plans to ban fiber-optic internet, nearly all links to the outside world are cut. But regime denied it is a “ban on the internet.”"
    },
    {
      "source": "華盛頓郵報",
      "title": "Bomb threat temporarily closes Oktoberfest in Munich",
      "link": "https://www.washingtonpost.com/world/2025/10/01/oktoberfest-bomb-threat-munich-germany/",
      "pub_time_taipei": "2025-10-01T18:28:02+08:00",
      "summary": "Authorities said the threat to the annual beer celebration could be related to an explosion that occurred at a house in northern Munich."
    },
    {
      "source": "衛報",
      "title": "Veterans react to Hegseth’s ‘insulting’ address to generals and admirals",
      "link": "https://www.theguardian.com/us-news/2025/oct/01/pete-hegseth-generals-speech-veterans-react",
      "pub_time_taipei": "2025-10-01T18:00:22+08:00",
      "summary": "<p>Defense secretary’s speech touching on physical fitness and doctrine of lethality was seen as ‘egotistical’ and ‘dangerous’</p><p>Naveed Shah, a veteran and activist who served as an enlisted public affairs specialist – an army journalist – uncharacteristically found himself searching for words to describe the <a href=\"https://www.theguardian.com/us-news/2025/sep/30/pete-hegseth-war-diversity-efforts-military\">address</a> of the newly styled secretary of war to flag officers on Tuesday.</p><p>“A lot of the words that are coming to me aren’t fit to print,” said Shah, policy director for Common Defense, a veterans advocacy organization. “The people in that room who have served for 20, 30-plus years in uniform do not need Pete Hegseth to tell them about warrior ethos.”</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/01/pete-hegseth-generals-speech-veterans-react\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Taiwan now biggest importer of Russian naphtha despite being Ukraine ally",
      "link": "https://www.theguardian.com/world/2025/oct/01/taiwan-biggest-importer-russian-naphtha-despite-ukraine-ally-report",
      "pub_time_taipei": "2025-10-01T17:30:55+08:00",
      "summary": "<p>Island imported $1.3bn of crude oil product in first half of 2025 despite joining sanctions against Moscow, report finds</p><p>Taiwan has become the world’s biggest importer of Russian naphtha, a petroleum derivative used to make chemicals needed for the semiconductor industry, despite the fact that it has joined other sanctions against Russia and considers itself an ally of Ukraine.</p><p>In the first half of 2025, Taiwan imported $1.3bn worth of Russian naphtha, and average monthly imports reached a level nearly six times higher than the 2022 average, according to <a href=\"https://energyandcleanair.org/publication/taiwan-becomes-worlds-largest-importer-of-russian-naphtha/\">a report</a> published on Wednesday. Compared to the first half of 2024, Taiwan’s naphtha imports this year increased by 44%.</p> <a href=\"https://www.theguardian.com/world/2025/oct/01/taiwan-biggest-importer-russian-naphtha-despite-ukraine-ally-report\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "As Russia menaces NATO skies, E.U. plans to build a shield against drones",
      "link": "https://www.washingtonpost.com/world/2025/10/01/eu-drone-wall-russia-nato/",
      "pub_time_taipei": "2025-10-01T17:00:54+08:00",
      "summary": "E.U. leaders say they want to build a “drone wall” along the borders with Russia and Ukraine after incursions into NATO airspace have raised alarm."
    },
    {
      "source": "衛報",
      "title": "Caribbean nations launch EU-style deal to let citizens work freely across borders",
      "link": "https://www.theguardian.com/world/2025/oct/01/caribbean-citizens-live-work-across-borders",
      "pub_time_taipei": "2025-10-01T17:00:08+08:00",
      "summary": "<p>Barbados, Belize, Dominica and St Vincent agree landmark pact letting citizens live and work freely across their borders</p><p>A historic EU-style free movement agreement comes into force in four <a href=\"https://www.theguardian.com/world/caribbean\">Caribbean</a> countries on Wednesday, in a deal which officials hope will stem the flow of skilled professionals leaving the region for North America and Europe.</p><p>The agreement between Barbados, Belize, Dominica and St Vincent and the Grenadines (SVG) follows decades of discussions and negotiations among members of the Caribbean Community (Caricom) – a regional grouping of 15 member countries.</p> <a href=\"https://www.theguardian.com/world/2025/oct/01/caribbean-citizens-live-work-across-borders\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least a third of EU citizens in UK report discrimination by public bodies",
      "link": "https://www.theguardian.com/politics/2025/oct/01/at-least-a-third-of-eu-citizens-in-uk-report-discrimination-by-public-bodies",
      "pub_time_taipei": "2025-10-01T17:00:08+08:00",
      "summary": "<p>Long-term residents post Brexit also say they have faced difficulties exercising travel and equal treatment rights</p><p>A significant number of EU citizens living long term in the UK post Brexit are experiencing discrimination in work and in public services, a report by the UK’s statutory Brexit watchdog has revealed.</p><p>Five years after the UK quit the bloc, more than a third reported feeling discriminated against by public bodies. One in five said they had experienced difficulties accessing their rights including the right to work, the right to travel in and out of the country and their right to equal treatment in public services.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/01/at-least-a-third-of-eu-citizens-in-uk-report-discrimination-by-public-bodies\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Base formulation may be linked to 21 sunscreens falling short of SPF claims, drug regulator finds",
      "link": "https://www.theguardian.com/australia-news/2025/sep/30/base-formulation-may-be-linked-to-20-sunscreens-falling-short-of-spf-claims-drug-regulator-finds",
      "pub_time_taipei": "2025-10-01T16:52:50+08:00",
      "summary": "<p>TGA investigation also finds some testing laboratories may be more reliable than others</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The same base formulation has been identified in 21 sunscreens that Australia’s medicines regulator has warned are unlikely to have a sun protection factor (SPF) rating of more than 21, with some products as low as SPF 4.</p><p>The Therapeutic Goods Administration (TGA) on Tuesday identified sunscreens sold by 17 different companies using a base formulation made by manufacturer Wild Child Laboratories as likely to fall far short of their sun protection factor claims.</p><p>Aspect Sun SPF50+ Physical Sun Protection</p><p>Aspect Sun SPF50+ Tinted Physical Sun Protection</p><p>Aesthetics Rx Ultra Protection Sunscreen Cream</p><p>New Day Skin Good Vibes Sunscreen SPF50+</p><p>New Day Skin Happy Days Sunscreen SPF50+</p><p>Allganics Light Sunscreen SPF50+</p><p>Beauti-FLTR Lustre Mineral SPF50+</p><p>Found My Skin SPF 50+ Tinted Face/Body Cream</p><p>Ethical Zinc Daily Wear Light Sunscreen</p><p>Ethical Zinc Daily Wear Tinted Facial Sunscreen (Dark)</p><p>Ethical Zinc Daily Wear Tinted Facial Sunscreen (Light)</p><p>Endota Mineral Protect SPF50 Sunscreen</p><p>We are Feel Good Inc Mineral Sunscreen SPF50+</p><p>GlindaWand The Fountain of Youth Environmental Defence Cream SPF50+</p><p>Ultra Violette Velvet Screen SPF50 (product export only – not available in Australia)</p><p>People4Ocean SPF 50+ Mineral Bioactive Shield Lightly Tinted Cream</p><p>McoBeauty SPF50+ Mineral Mattifying Sunscreen</p><p>Naked Sundays Collagen Glow Mineral Sunscreen</p><p>Outside Beauty &amp; Skincare SPF 50+ Mineral Primer</p><p>Salus SPF50+ Daily Facial Sunscreen Broad Spectrum</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/30/base-formulation-may-be-linked-to-20-sunscreens-falling-short-of-spf-claims-drug-regulator-finds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Police conduct ‘planned operation’ in Victorian town in hunt for Dezi Freeman – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
      "pub_time_taipei": "2025-10-01T16:44:56+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/01/government-deeply-concerned-about-safety-australians-aboard-gaza-flotilla-reports-interception\">Government ‘deeply concerned’ about safety of Australians aboard Gaza flotilla</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Clare O’Neil</strong> notes Treasury has advised the government scheme will push up home prices by 0.5% over six years.</p><p>Guardian Australia’s <strong>Luca Ittimani</strong> wrote an explainer on the new plan, and experts’ concerns with that estimate, below:</p><p>They’ve spent the last three years trying to slow our government down and stop us from providing supports to Australians who are struggling. Now, I say out of touch because if you think, firstly, that billionaires’ children are going to be using this scheme, then you haven’t looked very hard at it.</p><p>We’ve got probably people listening right now who are on reasonable incomes but are paying high rents and are not in a position to save for a home deposit. This is for them. This is for every single young person around the country who’s struggling to get those savings together.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Jailed Georgian politicians allege links between ruling party and Iran in letter to UK",
      "link": "https://www.theguardian.com/world/2025/oct/01/jailed-georgian-politicians-allege-links-between-ruling-party-and-iran-in-letter-to-uk",
      "pub_time_taipei": "2025-10-01T16:38:17+08:00",
      "summary": "<p>Exclusive: Imprisoned opposition leaders call on foreign secretary to impose sanctions over ‘unprecedented expansion’ of Iranian influence</p><p>Jailed opposition leaders in Georgia have written to the British foreign secretary, Yvette Cooper, warning of what they consider to be the growing links between their country’s ruling party, Georgian Dream, and Iran.</p><p>The seven politicians, writing from prisons in Rustavi, a city in south-east Georgia about 12 miles (20km) from the capital, Tbilisi, have alerted London to what they say is an “unprecedented expansion” of Iranian influence.</p> <a href=\"https://www.theguardian.com/world/2025/oct/01/jailed-georgian-politicians-allege-links-between-ruling-party-and-iran-in-letter-to-uk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Aged care waiting lists a ‘calculated denial of services’ that could be fatal, Senate inquiry warns",
      "link": "https://www.theguardian.com/australia-news/2025/oct/01/aged-care-services-in-home-care-funding-packages-inquiry-report",
      "pub_time_taipei": "2025-10-01T15:10:52+08:00",
      "summary": "<p>Greens-chaired inquiry says system should be demand driven despite Labor’s dissenting view that this could cause unintended flow-on issues</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A Senate inquiry into the delayed aged care scheme has sounded the alarm on the potentially fatal consequences of what it has labelled a “calculated denial” of services as more than 200,000 elderly Australians remain on waiting lists.</p><p>The <a href=\"https://www.aph.gov.au/Parliamentary_Business/Tabled_Documents/13032\">majority report</a> of the Greens-chaired inquiry, released on Wednesday, said the system should be demand-driven, as recommended by the aged care royal commission, instead of offering elderly Australians a limited number of places.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/01/aged-care-services-in-home-care-funding-packages-inquiry-report\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Government ‘deeply concerned’ about safety of Australians aboard Gaza flotilla",
      "link": "https://www.theguardian.com/world/2025/oct/01/government-deeply-concerned-about-safety-australians-aboard-gaza-flotilla-reports-interception",
      "pub_time_taipei": "2025-10-01T13:55:34+08:00",
      "summary": "<p>The Global Sumud Flotilla is aiming to break Israel’s blockade of Gaza and deliver aid</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The Australian government has said it is “deeply concerned” about the safety of its citizens on board a flotilla to Gaza, with expectations the boats could be intercepted by Israeli forces on Wednesday.</p><p>The Department of Foreign Affairs and Trade has said they have been in contact with six Australians confirmed to be on flotilla consisting of more than 40 ships.</p> <a href=\"https://www.theguardian.com/world/2025/oct/01/government-deeply-concerned-about-safety-australians-aboard-gaza-flotilla-reports-interception\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Albanese hopes China’s reported BHP iron ore ban ‘very much short-term’ as ASX dips",
      "link": "https://www.theguardian.com/business/2025/oct/01/albanese-hopes-chinas-reported-bhp-iron-ore-ban-very-much-short-term-as-asx-dips",
      "pub_time_taipei": "2025-10-01T13:04:32+08:00",
      "summary": "<p>Treasurer Jim Chalmers and BHP CEO Mike Henry to discuss reports of Chinese iron ore blockade</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The treasurer, Jim Chalmers, will meet with the boss of BHP amid a shock report that the world’s largest mining company faces a Chinese blockade on its iron ore shipments.</p><p>Beijing’s state iron ore buyer has told steelmakers to pause imports of BHP ore, amid hardball negotiations over the price of the crucial resource, <a href=\"https://www.bloomberg.com/news/articles/2025-09-30/china-bans-all-bhp-iron-ore-cargoes-as-pricing-dispute-deepens\">Bloomberg reported</a> on Tuesday.</p> <a href=\"https://www.theguardian.com/business/2025/oct/01/albanese-hopes-chinas-reported-bhp-iron-ore-ban-very-much-short-term-as-asx-dips\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Powerful earthquake in central Philippines kills at least 69",
      "link": "https://www.washingtonpost.com/climate-environment/2025/09/30/philippines-earthquake-cebu-bogo/",
      "pub_time_taipei": "2025-10-01T12:56:34+08:00",
      "summary": "A 6.9-magnitude earthquake struck the central Philippines, damaging numerous businesses and leaving towns without power. Casualty numbers are expected to rise"
    },
    {
      "source": "華盛頓郵報",
      "title": "A veteran of Middle East peace talks reflects on a history of failure",
      "link": "https://www.washingtonpost.com/world/2025/10/01/gaza-peace-process-history-robert-malley/",
      "pub_time_taipei": "2025-10-01T12:35:43+08:00",
      "summary": "Robert Malley, a key diplomat in the Clinton administration, talks Oct. 7, ending the war in Gaza and the collapse of the two-state solution."
    },
    {
      "source": "衛報",
      "title": "Row erupts after Venice opera house hires conductor linked to Meloni government",
      "link": "https://www.theguardian.com/music/2025/oct/01/row-erupts-after-venice-opera-house-hires-conductor-linked-to-meloni-government",
      "pub_time_taipei": "2025-10-01T12:00:03+08:00",
      "summary": "<p>Musicians and staff at the theatre say Beatrice Venezi is not experienced enough for the role and should be replaced</p><p>Venice’s prestigious La Fenice opera house is embroiled in controversy over the hiring of a conductor with close ties to Giorgia Meloni’s far-right government.</p><p>The theatre’s orchestra musicians and staff are calling for Beatrice Venezi’s appointment as music director to be revoked, claiming she does not have enough experience for the high-profile role and was picked only because of her government connections.</p> <a href=\"https://www.theguardian.com/music/2025/oct/01/row-erupts-after-venice-opera-house-hires-conductor-linked-to-meloni-government\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Slovakia marks ‘dark day’ as LGBTQ+ rights rolled back in parliament",
      "link": "https://www.theguardian.com/world/2025/oct/01/slovakia-marks-dark-day-as-lgbtq-rights-rolled-back-in-parliament",
      "pub_time_taipei": "2025-10-01T12:00:03+08:00",
      "summary": "<p>Amendment to constitution stipulates that male and female are the only recognised sexes and makes adoption nearly impossible for same-sex couples</p><p>Recent changes to Slovakia’s constitution mark a “dark day” for the country, LGBTQ+ campaigners have warned, describing measures such as the recognition of only two sexes as part of a wider rollback of human rights and rule of law in the central European country.</p><p>On Friday, Slovakia’s parliament <a href=\"https://apnews.com/article/slovakia-constitution-amendment-gender-25f350137d390725e06d286501cb2824\">passed an amendment</a> that included measures targeting LGBTQ+ rights in the country, from stipulating that male and female are the only recognised sexes to making it nearly impossible for same-sex couples to adopt children.</p> <a href=\"https://www.theguardian.com/world/2025/oct/01/slovakia-marks-dark-day-as-lgbtq-rights-rolled-back-in-parliament\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Indonesia school collapse: 91 missing and three dead as rescuers search rubble for second day",
      "link": "https://www.theguardian.com/world/2025/oct/01/indonesia-school-collapse-rescue-search-update-al-khoziny-building-sidoarjo",
      "pub_time_taipei": "2025-10-01T08:27:52+08:00",
      "summary": "<p>Desperate search for more than 90 missing after building collapses while students held prayers at school in Sidoarjo</p><p>Parents and rescuers in Indonesia were desperately searching for dozens of teenage boys believed to be trapped, a day after the collapse of an Islamic boarding school which has already left three dead, authorities said.</p><p>Authorities said 91 people were listed as missing after the Al Khoziny school building collapsed while pupils held late afternoon prayers in a mosque housed on a lower floor of a building whose upper floors were under construction.</p> <a href=\"https://www.theguardian.com/world/2025/oct/01/indonesia-school-collapse-rescue-search-update-al-khoziny-building-sidoarjo\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Italy to end support for international Gaza flotilla as it nears destination",
      "link": "https://www.theguardian.com/world/2025/oct/01/gaza-aid-flotilla-sumud-update-location-tracker-greta-thunberg-israel-blockade",
      "pub_time_taipei": "2025-10-01T07:36:40+08:00",
      "summary": "<p>The Global Sumud Flotilla, with over 500 people including Swedish climate campaigner Greta Thunberg, aims to break Israel’s blockade of Gaza</p><p>Italy has said it will stop tracking an international flotilla attempting to deliver aid to Gaza with a military vessel, as activists on board announced they were on “high alert” as they moved closed to their destination.</p><p>The Global Sumud Flotilla, consisting of more than 40 civilian boats with over 500 people including parliamentarians, lawyers and Swedish climate campaigner Greta Thunberg, aims to <a href=\"https://www.theguardian.com/environment/2025/aug/31/aid-flotilla-with-greta-thunberg-set-to-sail-for-gaza-to-break-siege\">break Israel’s blockade of Gaza</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/01/gaza-aid-flotilla-sumud-update-location-tracker-greta-thunberg-israel-blockade\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.N. approves militarized force to take on Haiti’s gangs",
      "link": "https://www.washingtonpost.com/world/2025/09/30/haiti-gang-suppression-force-un-security-council/",
      "pub_time_taipei": "2025-10-01T05:50:15+08:00",
      "summary": "The Security Council vote was an acknowledgment that the police mission it once backed had failed to wrest back control of the beleaguered Caribbean nation."
    },
    {
      "source": "衛報",
      "title": "UN security council approves new military force to fight Haiti gangs",
      "link": "https://www.theguardian.com/world/2025/sep/30/un-security-council-approves-new-military-force-to-fight-haiti-gangs",
      "pub_time_taipei": "2025-10-01T04:11:39+08:00",
      "summary": "<p>Unit will have up to 5,500 soldiers and police officers who will tackle the violence that has overwhelmed the country</p><p>The United Nations has adopted a resolution to transform a security mission in gang-dominated Haiti into a larger, fully fledged force with military troops.</p><p>The new unit can now have a maximum of 5,500 uniformed personnel, including police officers and soldiers, unlike the current mission, which is just law enforcement. The US ambassador to the UN, Mike Waltz, said the vote by 12 security council members to “transform the multinational security support (MSS) mission to the new gang suppression force, a mission five times the size of its predecessor” showed the “international community was sharing the burden”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/un-security-council-approves-new-military-force-to-fight-haiti-gangs\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Saudi comedy festival draws big names and backlash",
      "link": "https://www.washingtonpost.com/world/2025/09/30/saudi-comedy-festival-backlash/",
      "pub_time_taipei": "2025-10-01T02:27:22+08:00",
      "summary": "Human rights advocates and some comics say the festival, at which Bill Burr, Louis C.K., Dave Chappelle and Kevin Hart are performing, whitewashes abuses."
    },
    {
      "source": "衛報",
      "title": "Former DRC president Joseph Kabila sentenced to death in absentia",
      "link": "https://www.theguardian.com/world/2025/sep/30/former-drc-president-joseph-kabila-sentenced-to-death-in-absentia",
      "pub_time_taipei": "2025-10-01T02:19:46+08:00",
      "summary": "<p>Military court convicts Kabila of war crimes, treason and other offences in verdict that could fuel enduring tensions</p><p>A military court in the Democratic Republic of the Congo has sentenced the country’s former president Joseph Kabila to death in absentia after convicting him of war crimes, treason and crimes against humanity.</p><p>The case stems from his alleged role in backing the advance of <a href=\"https://www.theguardian.com/world/2025/jan/27/who-are-m23-rebels-fighting-in-eastern-drc-congo\">M23 rebels</a> supported by Rwanda in DRC’s volatile eastern provinces. Kabila, who led the country from 2001 to 2019, has denied wrongdoing and said the judiciary had been politicised.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/former-drc-president-joseph-kabila-sentenced-to-death-in-absentia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump gives Hamas ‘three or four days’ to respond to Gaza peace plan or face ‘a very sad end’ – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live",
      "pub_time_taipei": "2025-10-01T00:55:05+08:00",
      "summary": "<p>Ultimatum comes as Netanyahu says he did not agree to Palestinian state as part of Trump Gaza plan, and IDF will remain ‘in most of territory’. This live blog is closed</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas\">What’s in Trump’s 20-point peace plan for Gaza?</a></p></li></ul><p>The Gaza health ministry has announced on Telegram that<strong> 453 people, including 150 children, have died of famine and malnutrition in Gaza.</strong></p><p>Since the <strong>Integrated Food Security Phase Classification (IPC)</strong> declared famine in Gaza in August, a further <strong>175 deaths</strong> have been recorded, among them <strong>35 children</strong>.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump gives Hamas ‘three or four days’ to respond to his peace plan for Gaza",
      "link": "https://www.theguardian.com/world/2025/sep/30/hamas-mulls-options-as-countries-rush-to-welcome-trump-gaza-peace-plan",
      "pub_time_taipei": "2025-10-01T00:47:37+08:00",
      "summary": "<p>US president warns militant group will ‘pay in hell’ if it rejects the deal, which seeks to end two-year-long war</p><p>Donald Trump has given Hamas an ultimatum of “three or four days” to respond to his proposed peace and reconstruction plan in Gaza, warning the militant group would “pay in hell” if it rejects the deal, as the Israeli offensive continued, inflicting further civilian casualties.</p><p>Trump’s proposal<a href=\"https://www.theguardian.com/world/2025/sep/29/trump-netanyahu-gaza-peace-plan\"> was announced in a joint press conference in Washington with Israel’s prime minister, Benjamin Netanyahu</a>, and seeks a definitive end to the relentless two-year-long war. At least 31 Palestinians were killed across Gaza on Tuesday, local hospitals said.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/hamas-mulls-options-as-countries-rush-to-welcome-trump-gaza-peace-plan\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Netanyahu tries to sell Trump’s Gaza peace plan to a skeptical right wing",
      "link": "https://www.washingtonpost.com/world/2025/09/30/trump-netanyahu-gaza-war-ceasefire/",
      "pub_time_taipei": "2025-10-01T00:06:33+08:00",
      "summary": "The Israeli premier’s reluctance to fully withdraw troops or make way for a Palestinian state, combined with Hamas’s reluctance to disarm, may result in a fragile deal, analysts say."
    },
    {
      "source": "華盛頓郵報",
      "title": "Poland arrests Ukrainian suspected in sabotage of gas pipelines",
      "link": "https://www.washingtonpost.com/world/2025/09/30/poland-ukrainian-arrested-nord-stream-explosions/",
      "pub_time_taipei": "2025-09-30T22:35:43+08:00",
      "summary": "Authorities in Poland arrested a Ukrainian man who is suspected in undersea explosions that damaged the Nord Stream gas pipelines between Russia and Germany."
    },
    {
      "source": "衛報",
      "title": "Indonesia school collapse: three dead and over 90 missing as rescue effort continues",
      "link": "https://www.theguardian.com/world/2025/sep/30/indonesia-school-collapse-dead-buried-rubble-rescuers-survivors",
      "pub_time_taipei": "2025-09-30T22:08:52+08:00",
      "summary": "<p>Instability of building in East Java town hampers search but 99 boys and school staff known to have survived</p><p>Parents were desperately searching for scores of missing teenage boys feared trapped under huge piles of concrete on Tuesday after a building at an Islamic boarding school collapsed in Indonesia.</p><p>Authorities said 91 people were listed as missing at Al Khoziny school after the collapse as pupils held late-afternoon prayers in a mosque housed on a lower floor of a building whose upper floors were under construction.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/indonesia-school-collapse-dead-buried-rubble-rescuers-survivors\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "AfD politician’s former aide convicted of spying for China",
      "link": "https://www.theguardian.com/world/2025/sep/30/afd-politician-former-aide-spying-china-maximilian-krah",
      "pub_time_taipei": "2025-09-30T21:08:33+08:00",
      "summary": "<p>Jian Guo jailed for five years after acting as agent for Chinese intelligence while working for Maximilian Krah</p><p>A former aide to a member of parliament for the far-right Alternative für Deutschland party has been sentenced to almost five years in prison for spying on behalf of China.</p><p>Jian Guo was convicted on Tuesday of acting as an agent for the Chinese intelligence service while working for Maximilian Krah, a former member of the European parliament who now sits for the AfD in Germany’s Bundestag.</p> <a href=\"https://www.theguardian.com/world/2025/sep/30/afd-politician-former-aide-spying-china-maximilian-krah\">Continue reading...</a>"
    }
  ]
}