{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-19T20:40:07.607397+08:00",
  "window_end_taipei": "2025-09-20T20:40:07.607397+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Poland scrambles aircraft as Russia attacks Ukraine with hundreds of drones and missiles – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/20/poland-russia-estonia-ukraine-war-europe-latest-news-updates",
      "pub_time_taipei": "2025-09-20T20:10:09+08:00",
      "summary": "<p>Poland said it had scrambled aircraft to protect its airspace as Ukraine reported a Russian attack featuring more than 600 drones and missiles</p><p>At least 10 flights were cancelled out of <strong>Brussels airport</strong> and another 17 delayed by over an hour after <a href=\"https://www.theguardian.com/world/live/2025/sep/20/poland-russia-estonia-ukraine-war-europe-latest-news-updates?CMP=share_btn_url&amp;page=with%3Ablock-68ce624c8f08e4203c9a8536#block-68ce624c8f08e4203c9a8536\">the system was hit by a “cyber-attack” overnight on Friday,</a> the airport said.</p><p>EasyJet, among Europe’s biggest airlines, said it was currently operating as normal and did not expect the problem to impact its flights for the rest of the day, Reuters reports.</p><p><em>Information on the situation is being continuously gathered, and Polish authorities are in contact with authorities in other countries.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/sep/20/poland-russia-estonia-ukraine-war-europe-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘These results are sobering’: US high-school seniors’ reading and math scores plummet",
      "link": "https://www.theguardian.com/education/2025/sep/20/high-school-students-scores",
      "pub_time_taipei": "2025-09-20T20:00:14+08:00",
      "summary": "<p>Educators worry about absenteeism and smartphones as NAEP report shows scores at lowest levels in two decades</p><p>The average reading and math scores of American high school seniors fell to their lowest levels in two decades in 2024, according to new national data released last week.</p><p>The results, from the <a href=\"https://www.nationsreportcard.gov/\">National Assessment of Educational Progress (NAEP)</a>, found that, on average, reading scores for 12th graders were 10 points lower in 2024 than they were in 1992, when the test was first administered, and that math scores fell to their lowest levels since 2005, when the math assessment began.</p> <a href=\"https://www.theguardian.com/education/2025/sep/20/high-school-students-scores\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Zelenskyy accuses allies of ‘wasting time’ as he prepares for Trump meeting",
      "link": "https://www.theguardian.com/world/2025/sep/20/zelenskyy-accuses-allies-of-wasting-time-as-he-prepares-for-trump-meeting",
      "pub_time_taipei": "2025-09-20T19:26:16+08:00",
      "summary": "<p>Ukrainian president will urge his US counterpart to impose more sanctions on Russia when they meet next week</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/20/poland-russia-estonia-ukraine-war-europe-latest-news-updates\">Europe live – latest news</a></p></li></ul><p>Volodymyr Zelenskyy will urge Donald Trump to impose sanctions on Russia when they meet next week at the United Nations in New York, and has called on Ukraine’s allies to “stop wasting time”.</p><p>Zelenskyy said he expected further sanctions to be imposed if Vladimir Putin refuses to meet him for face-to-face talks or to agree to a ceasefire. “If the war continues and there are no moves towards peace we expect sanctions,” he said.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/zelenskyy-accuses-allies-of-wasting-time-as-he-prepares-for-trump-meeting\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UN security council fails to prevent ‘snapback’ nuclear sanctions on Iran",
      "link": "https://www.theguardian.com/world/2025/sep/20/un-security-council-fails-to-prevent-snapback-nuclear-sanctions-on-iran",
      "pub_time_taipei": "2025-09-20T19:12:52+08:00",
      "summary": "<p>Iranian foreign ministry urges further diplomacy and says return to pre-2015 measures are unlawful and unfounded</p><p>The UN security council failed to pass a resolution on Friday that would have prevented the reimposition of UN sanctions on Iran over its nuclear programme before the deadline for the “snapping back” of punitive measures.</p><p>UN sanctions on Iran are set to be re-established at the end of the month unless the nine-member security council agrees to further extend sanctions relief. Friday’s resolution, put forth by South Korea, only received support from four countries – China, Russia, Pakistan and Algeria.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/un-security-council-fails-to-prevent-snapback-nuclear-sanctions-on-iran\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Northern Ireland at risk of race riot ‘permacrisis’, government files warn",
      "link": "https://www.theguardian.com/uk-news/2025/sep/20/northern-ireland-at-risk-of-race-riot-permacrisis-government-files-warn",
      "pub_time_taipei": "2025-09-20T19:00:12+08:00",
      "summary": "<p>Officials fear widespread unrest amid violence and intimidation of ethnic minorities</p><p>Northern Ireland faces a “permacrisis” from recurring race riots and may need to use military bases to shelter people burnt out of their homes, government documents reveal.</p><p>Officials fear the region faces prolonged instability and that a single incident, local or international, could spark widespread disorder.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/northern-ireland-at-risk-of-race-riot-permacrisis-government-files-warn\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "MSNBC pundit ousted over Kirk talk says network agreed comments were misconstrued",
      "link": "https://www.theguardian.com/us-news/2025/sep/20/matthew-dowd-msnbc-charlie-kirk-comments-misconstrued",
      "pub_time_taipei": "2025-09-20T19:00:12+08:00",
      "summary": "<p>Matthew Dowd tells Katie Couric ex-employer concurred but ‘it didn’t matter’ and they dismissed him anyway</p><p>The political analyst <a href=\"https://www.theguardian.com/us-news/2025/sep/11/msnbc-fires-matthew-dowd-charlie-kirk-shooting\">fired</a> by MSNBC over his <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">Charlie Kirk</a> commentary says his former employer agreed with him that his remarks were being misconstrued as “insensitive” – but said “it didn’t matter” to the network, and they dismissed him anyway.</p><p>“I said: ‘I think you guys are making a huge mistake,’” Matthew Dowd recounted on Katie Couric’s podcast in an <a href=\"https://www.youtube.com/watch?v=cTE7oW1stfc\">episode</a> launched Friday that addressed his purported pre-firing discussions with MSNBC. “I said: ‘You know and I know that’s not anything what I meant. You know it’s been misconstrued,’ and they agreed with that.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/20/matthew-dowd-msnbc-charlie-kirk-comments-misconstrued\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Immigrant rights activists braced for crackdown as Trump threatens to target ‘leftwing’ groups",
      "link": "https://www.theguardian.com/us-news/2025/sep/20/immigrant-rights-groups-trump-crackdown",
      "pub_time_taipei": "2025-09-20T18:00:12+08:00",
      "summary": "<p>Advocates advise staff and volunteers to practice caution but say they will not give up their first amendment rights</p><p>Immigrant advocacy organizations and activists are bracing for a crackdown from the federal government following threats from the Trump administration to root out and criminally prosecute non-profit groups it believes are sympathetic to “leftwing” politics.</p><p>Donald Trump and his closest allies have periodically threatened immigrant rights activists and nonprofits, including those that distribute food and water to migrants or provide immigrants with legal services, with arrest. But their rhetoric has been heightened in the days following <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">the killing</a> of rightwing activist Charlie Kirk this month.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/20/immigrant-rights-groups-trump-crackdown\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Under Trump, Palestinians seeking U.S. asylum face new hurdle, documents show",
      "link": "https://www.washingtonpost.com/world/2025/09/20/palestinian-asylum-united-states-trump/",
      "pub_time_taipei": "2025-09-20T18:00:00+08:00",
      "summary": "Palestinian asylum applicants must pass a secondary review that lawyers say has not been used before as a blanket requirement for an ethnonational group."
    },
    {
      "source": "衛報",
      "title": "Rachel Reeves due to appear at gambling lobbyist’s event amid tax review",
      "link": "https://www.theguardian.com/politics/2025/sep/20/rachel-reeves-due-to-speak-at-gambling-lobbyists-event-amid-12bn-tax-review",
      "pub_time_taipei": "2025-09-20T17:06:19+08:00",
      "summary": "<p>Chancellor’s invitation criticised as ‘strange timing’ with Treasury looking at whether to raise duties on £12bn sector </p><p>The chancellor, Rachel Reeves, has been urged to cancel plans to be the guest of honour at an event hosted by the chief lobbyist of the gambling industry while the Treasury is in the midst of a review of taxes on the £12bn sector.</p><p>Reeves is slated to appear at a “private reception” for business leaders, organised by the corporate communications company Brunswick, at the forthcoming Labour party conference in Liverpool.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/20/rachel-reeves-due-to-speak-at-gambling-lobbyists-event-amid-12bn-tax-review\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Heathrow warns of delays as suspected cyber-attack hits European airports",
      "link": "https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport-delays-cyber-attack-berlin-brussels-cancelled-delays",
      "pub_time_taipei": "2025-09-20T17:06:17+08:00",
      "summary": "<p>Brussels and Berlin airports also affected as ‘technical issue’ hits service provider for check-in and boarding systems</p><p>Flights have been delayed and cancelled at airports including Heathrow after an alleged cyber-attack targeted a service provider for check-in and boarding systems.</p><p>Airports in Brussels and Berlin are also experiencing delays and disruption after the “technical issue” affecting Collins Aerospace, which works for several airlines at airports across the world.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport-delays-cyber-attack-berlin-brussels-cancelled-delays\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Starvation or execution: Sudanese under siege face ‘death everywhere’",
      "link": "https://www.washingtonpost.com/world/2025/09/18/sudan-war-el-fashir-rsf/",
      "pub_time_taipei": "2025-09-20T17:00:28+08:00",
      "summary": "Families in El Fashir are eating animal feed. Children have been raped while foraging for food. Those who try to escape have been kidnapped and killed."
    },
    {
      "source": "衛報",
      "title": "Norway finds place in spotlight during ‘golden age’ of film-making",
      "link": "https://www.theguardian.com/world/2025/sep/20/norway-film-making-cinema-drama-golden-age",
      "pub_time_taipei": "2025-09-20T17:00:10+08:00",
      "summary": "<p>Distinctive and critically acclaimed films and drama series from ‘a big hub of talent’ are appealing to audiences around the world</p><p>When it comes to film-making, Norway has long been left watching on while its Nordic neighbours Sweden and Denmark put out hit after hit by luminaries such as Lars von Trier, Thomas Vinterberg and Ruben Östlund.</p><p>But after years in the shadows, the country has finally found its place in the international spotlight with a number of distinctive, relationship-centred and critically acclaimed films and television shows in what many are describing as a Norwegian “golden age”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/norway-film-making-cinema-drama-golden-age\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Huge crater under North Sea was created by asteroid impact, scientists say",
      "link": "https://www.theguardian.com/science/2025/sep/20/huge-crater-under-north-sea-was-created-by-asteroid-impact-scientists-say",
      "pub_time_taipei": "2025-09-20T17:00:10+08:00",
      "summary": "<p>Silverpit crater off Yorkshire coast was caused by cathedral-sized asteroid that set off 100-metre tsunami 43m years ago</p><p>Deep below the seabed, 80 miles off the coast of Yorkshire, is a remarkable crater that has divided scientists – was it, thrillingly, created by an asteroid crash? Or more mundanely was it the result of geological salt movements?</p><p>Today, the decades-long scientific debate can be settled. The Silverpit crater 700 metres below the seabed under the North Sea was in all likelihood created by a direct hit from an asteroid or comet about the size of York Minster that hurtled towards the Earth more than 43m years ago.</p> <a href=\"https://www.theguardian.com/science/2025/sep/20/huge-crater-under-north-sea-was-created-by-asteroid-impact-scientists-say\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Zarah Sultana consults defamation lawyers after spat with Jeremy Corbyn over party funds",
      "link": "https://www.theguardian.com/politics/2025/sep/20/zarah-sultana-consults-defamation-lawyers-after-spat-with-jeremy-corbyn-over-party-funds",
      "pub_time_taipei": "2025-09-20T16:57:30+08:00",
      "summary": "<p>MP says she faced ‘baseless attacks’ over paid membership portal, which Corbyn told supporters not to use</p><p>Zarah Sultana has consulted defamation lawyers after <a href=\"https://www.theguardian.com/politics/2025/sep/18/jeremy-corbyn-clashes-zarah-sultana-your-party-split\">her public spat with Jeremy Corbyn</a> over the launch of a paid membership system for the party they were to co-lead.</p><p>Sultana said she has been on the receiving end of “politically motivated” attacks amid the row that has engulfed the launch of Your party. Corbyn had previously urged people not to use the “supposed membership portal”, and said legal advice was being taken over its launch.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/20/zarah-sultana-consults-defamation-lawyers-after-spat-with-jeremy-corbyn-over-party-funds\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘I can’t survive in a house’: Petra’s Bedouin resist moves to evict them from ancient cave homes",
      "link": "https://www.theguardian.com/world/2025/sep/20/petra-bedouin-evict-ancient-cave-homes",
      "pub_time_taipei": "2025-09-20T15:00:08+08:00",
      "summary": "<p>Plans to improve the world heritage site for tourists put its living culture at risk, say locals and campaigners</p><p>By noon, the sun is high over Petra, bleaching the coloured sandstone cliffs and temporarily emptying its celebrated ruins of tourists. Vines and a canopy keep the terrace of Mohammed Feras s cave home cool despite the searing summer heat rising from the rocky valley.</p><p>“I have lived here all my life. I’ve never been anywhere else and I cannot imagine not living here. This area is part of who I am and I cannot leave it,” the 44-year-old farmer and sometime tourist guide said.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/petra-bedouin-evict-ancient-cave-homes\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Tony Abbott implores Cpac to give Liberals ‘one last chance’ and condemns party’s ‘factional warlords’",
      "link": "https://www.theguardian.com/australia-news/2025/sep/20/tony-abbott-implores-cpac-to-give-liberals-one-last-chance-and-condemned-partys-factional-warlords",
      "pub_time_taipei": "2025-09-20T13:36:57+08:00",
      "summary": "<p>Former PM, Jacinta Nampijinpa Price and conference chair Warren Mundine among right faction heavyweights urging conservative voters to unite</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Tony Abbott has urged conservatives to give the Liberals “one last chance” and apologised for the party’s 2025 election drubbing, joining a host of high-profile Coalition figures at a major political conference in imploring voters not to abandon the opposition for right-wing minor parties.</p><p>Jacinta Nampijinpa Price, recently dumped from the shadow frontbench, exhorted the Conservative Political Action Conference<em><strong> </strong></em>(Cpac) in Brisbane to stick with the Liberal party, and encouraged her parliamentary colleagues to dump a net zero climate target, to cheers from attendees.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/20/tony-abbott-implores-cpac-to-give-liberals-one-last-chance-and-condemned-partys-factional-warlords\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. kills 3 in another strike on ‘narcoterrorists’ vessel, Trump says",
      "link": "https://www.washingtonpost.com/national-security/2025/09/20/trump-us-strike-drug-boat-attack/",
      "pub_time_taipei": "2025-09-20T13:14:17+08:00",
      "summary": "The strike marks the third such attack on boats alleged to be carrying illicit drugs this month. Experts have questioned the legality of the strikes."
    },
    {
      "source": "衛報",
      "title": "Optus confirms fourth death after CEO reveals warnings of failed triple zero calls not escalated",
      "link": "https://www.theguardian.com/business/2025/sep/20/optus-network-outage-in-which-three-people-died-lasted-eight-hours-longer-than-telco-initially-said",
      "pub_time_taipei": "2025-09-20T13:03:03+08:00",
      "summary": "<p>Emergency calls were offline for nearly 14 hours, during which four people died – including an eight-week-old baby</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A fourth person died during Optus’s network outage on Thursday, its CEO has confirmed.</p><p>Stephen Rue said in a statement released on Saturday afternoon that the telco was “saddened to learn of a new fatality in Western Australia, which appears to have occurred during the outage period”.</p> <a href=\"https://www.theguardian.com/business/2025/sep/20/optus-network-outage-in-which-three-people-died-lasted-eight-hours-longer-than-telco-initially-said\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "IDF warns aid workers only hospitals are protected sites in northern Gaza",
      "link": "https://www.theguardian.com/world/2025/sep/20/idf-warns-aid-workers-only-hospitals-are-protected-sites-in-northern-gaza",
      "pub_time_taipei": "2025-09-20T12:00:04+08:00",
      "summary": "<p>Israeli military says aid infrastructure could be targeted after order to ‘all Gaza residents and inhabitants’ to leave</p><p>Humanitarian workers in northern <a href=\"https://www.theguardian.com/world/gaza\">Gaza </a>have been repeatedly warned by the Israeli military that only hospitals will be considered protected sites and all other aid infrastructure could be targeted.</p><p>In messages and conversations with aid workers in recent days seen by the Guardian, the Israel Defense Forces (IDF) said an order to “all Gaza residents and inhabitants” to evacuate Gaza City, the biggest urban centre in the territory, applied “to all humanitarian locations [there], except hospitals” and warned that “to defeat Hamas [Israeli troops] will operate … with great force”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/idf-warns-aid-workers-only-hospitals-are-protected-sites-in-northern-gaza\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘This is their attempt to silence him’: Umar Khalid reaches five years in Indian jail without trial",
      "link": "https://www.theguardian.com/world/2025/sep/20/umar-khalid-five-years-in-jail-without-trial-india",
      "pub_time_taipei": "2025-09-20T12:00:03+08:00",
      "summary": "<p>Held since 2020, India’s most prominent political prisoner has become a symbol of repression under the Modi regime</p><p>“There is indeed something about captivity that makes one feel like a state of somewhere between life and death,” wrote Umar Khalid in June in a letter penned as his fifth year languishing behind bars approached.</p><p>Few understand the purgatory of jail like Khalid. For five years – since his <a href=\"https://www.theguardian.com/world/2020/sep/14/india-student-activist-umar-khalid-arrested-over-delhi-riots\">arrest in September 2020</a> under a draconian terrorism law – he has remained India’s most prominent political prisoner, to many a potent symbol of the systematic crushing of dissent under the dominant Hindu nationalist regime of the prime minister, Narendra Modi.</p> <a href=\"https://www.theguardian.com/world/2025/sep/20/umar-khalid-five-years-in-jail-without-trial-india\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Attorney investigating Trump critics resigns after pressure from officials – as it happened",
      "link": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
      "pub_time_taipei": "2025-09-20T10:11:08+08:00",
      "summary": "<p>Trump said ‘I want him out’ about Erik Siebert, who was investigating New York attorney general Letitia James and former FBI director James Comey. This blog is now closed.</p><p>Today, lawmakers in the House will vote on legislation, known as a “continuing resolution” (CR), to prevent a looming government shutdown at the end of September.</p><p>The bill, introduced by Republicans, would fund the government until 21 November. According to Politico, House GOP whip <strong>Tom Emmer</strong> was confident, as of Thursday, that his party had enough votes. “We’re going to pass this,” he said in an interview.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Chinese executive jailed for 25 years in US for trafficking fentanyl chemicals",
      "link": "https://www.theguardian.com/us-news/2025/sep/19/chinese-executive-jailed-fentanyl",
      "pub_time_taipei": "2025-09-20T09:30:36+08:00",
      "summary": "<p>Qingzhou Wang of Amarvel Biotech accused by prosecutors of turning chemical company into ‘pipeline of poison’ </p><p>A Chinese company executive has been sentenced to 25 years in prison for trafficking in chemicals used to manufacture fentanyl, the US justice department has said.</p><p>Qingzhou Wang, 37, principal executive of Amarvel Biotech, a company based in Wuhan, and Yiyi Chen, 33, the firm’s marketing manager, were convicted in New York in February of fentanyl precusor importation and money laundering.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/19/chinese-executive-jailed-fentanyl\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Incompetent’: SA premier slams Optus as eight-week-old baby among three who died when triple zero calls failed",
      "link": "https://www.theguardian.com/business/2025/sep/19/three-people-died-when-optus-network-upgrade-affected-triple-zero-calls-ceo-confirms",
      "pub_time_taipei": "2025-09-20T08:02:16+08:00",
      "summary": "<p>Peter Malinauskas criticised the telco for its communications after two people in South Australia and one in Western Australia died during the network upgrade</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The South Australian premier has said he’s never witnessed “such incompetence” from an Australian communications company after an eight-week-old baby was among three people who died during a botched Optus network upgrade.</p><p>Optus chief executive Stephen Rue admitted on Friday that the upgrade, which prevented people from making triple-zero calls the day before, impacted up to 600 households in South Australia, Western Australia and the Northern Territory.</p> <a href=\"https://www.theguardian.com/business/2025/sep/19/three-people-died-when-optus-network-upgrade-affected-triple-zero-calls-ceo-confirms\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump again asks supreme court to end protections for Venezuelans in US",
      "link": "https://www.theguardian.com/us-news/2025/sep/19/trump-tps-immigration-venezuela",
      "pub_time_taipei": "2025-09-20T08:01:03+08:00",
      "summary": "<p>Justice department urges court to overturn ruling that Kristi Noem lacked authority to end TPS program</p><p>The Trump administration asked the US supreme court on Friday to intervene for the second time in a case involving its bid to end deportation protections the former president, Joe Biden, granted to hundreds of thousands of Venezuelans in the United States.</p><p>The justice department filed an emergency application asking the justices to lift a federal judge’s ruling that the homeland security secretary, Kristi Noem, lacked the authority to end the protections for Venezuelans under the temporary protected status, or TPS, program.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/19/trump-tps-immigration-venezuela\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "BHP blames ‘coal tax’ for job layoffs. But there’s obvious reasons coalmines aren’t as profitable anymore",
      "link": "https://www.theguardian.com/australia-news/2025/sep/20/bhp-blames-coal-tax-for-job-layoffs-but-theres-obvious-reasons-coalmines-arent-as-profitable-anymore",
      "pub_time_taipei": "2025-09-20T08:00:02+08:00",
      "summary": "<p>Rising wages and costs of having to dig deeper for minerals – not royalty payments – are behind job cuts in a sector that appears to be in decline</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Australia’s big miners are not averse to a political fight.</p><p>Consider the biggest miner of them all: BHP.</p><p><em>Jonathan Barrett is business editor of Guardian Australia</em></p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/20/bhp-blames-coal-tax-for-job-layoffs-but-theres-obvious-reasons-coalmines-arent-as-profitable-anymore\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nato intercepts Russian fighter jets on ‘reckless’ violation of Estonian airspace",
      "link": "https://www.theguardian.com/world/2025/sep/19/estonia-accuses-russia-of-brazen-violation-of-its-airspace",
      "pub_time_taipei": "2025-09-20T06:36:34+08:00",
      "summary": "<p>Russia denies what EU calls ‘dangerous provocation’ after Italian air force heads off three MiG-31s over Gulf of Finland</p><p>Nato has intercepted three Russian MiG-31 fighter jets that violated Estonia’s airspace over the Baltic Sea in a 12-minute incursion, calling it proof of Moscow’s “reckless” behaviour.</p><p>The EU’s top diplomat, Kaja Kallas, a former Estonian prime minister, accused Moscow of an “extremely dangerous provocation” and said the latest Russian violation of Nato’s eastern borders “further escalates tensions in the region”.</p> <a href=\"https://www.theguardian.com/world/2025/sep/19/estonia-accuses-russia-of-brazen-violation-of-its-airspace\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump says Xi Jinping has agreed to approve TikTok deal, but details unclear",
      "link": "https://www.theguardian.com/technology/2025/sep/19/deal-to-transfer-tiktok-to-us-control-unresolved-trump-xi-call",
      "pub_time_taipei": "2025-09-20T06:34:08+08:00",
      "summary": "<p>Trump’s statement suggests preliminary agreement between leaders in the first direct contact between them since June</p><p>Donald Trump said on Friday that he and Xi Jinping had agreed to approve a deal over TikTok.</p><p>“He approved the TikTok deal,” Trump said about Xi to reporters in the Oval Office, suggesting the leaders signed off on a preliminary agreement. But Trump offered no details about the agreement or when it would be signed.</p> <a href=\"https://www.theguardian.com/technology/2025/sep/19/deal-to-transfer-tiktok-to-us-control-unresolved-trump-xi-call\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Value of Australia’s coal and gas exports will plunge 50% in five years, treasury modelling forecasts",
      "link": "https://www.theguardian.com/business/2025/sep/20/australias-fossil-fuel-earnings-set-to-fall-by-50bn-a-year-by-2035",
      "pub_time_taipei": "2025-09-20T06:20:49+08:00",
      "summary": "<p>Figure amounts to a $60bn fall by 2030 under any future scenario of emissions reduction in Australia, modelling predicts</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>The value of Australia’s coal and gas exports is predicted to plummet by 50% over the next five years as global demand for fossil fuel falls, according to Treasury modelling.</p><p>The modelling, released on Thursday as the government announced its emissions reduction target for 2035, found the annual value of fossil fuel exports is predicted to fall by more than $60bn by 2030 under any future scenario of emissions reduction within Australia.</p> <a href=\"https://www.theguardian.com/business/2025/sep/20/australias-fossil-fuel-earnings-set-to-fall-by-50bn-a-year-by-2035\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labour rules against dozens of motions about Palestine being debated at party conference",
      "link": "https://www.theguardian.com/politics/2025/sep/19/labour-rules-against-dozens-of-motions-about-palestine-being-debated-at-party-conference",
      "pub_time_taipei": "2025-09-20T04:52:05+08:00",
      "summary": "<p>Calls for sanctions on Israel and ban on trade that aids international law violations among snubbed motions</p><p>Labour has ruled out motions about Palestine being debated at its party conference later this month, triggering accusations that it is trying to stifle debate.</p><p>The conference arrangement committee, made up of Labour elected reps and officials, has ruled about 30 motions about Palestine from local parties out of order.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/19/labour-rules-against-dozens-of-motions-about-palestine-being-debated-at-party-conference\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Estonia requests Nato article 4 consultation after ‘unacceptable’ violation of its airspace by Russian MiG-31s – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/19/eu-sanctions-russia-oil-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-france-macron-europe-live-news",
      "pub_time_taipei": "2025-09-20T04:27:27+08:00",
      "summary": "<p>This live blog is now closed. You can read our latest report here:</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/19/estonia-accuses-russia-of-brazen-violation-of-its-airspace\">Nato intercepts Russian fighter jets on ‘reckless’ violation of Estonian airspace</a></p></li></ul><p><strong>Here we go</strong>: we are now getting more details on the 19th package of sanctions, via Commission president <strong>Ursula von der Leyen</strong> and foreign policy chief <strong>Kaja Kallas.</strong></p><p>We are still waiting for the announcement on <strong>when </strong>we will get more detail on the 19th sanctions package.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/19/eu-sanctions-russia-oil-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-france-macron-europe-live-news\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Sally Rooney skips literary award ceremony out of fear of U.K. arrest",
      "link": "https://www.washingtonpost.com/world/2025/09/19/sally-rooney-uk-arrest-award/",
      "pub_time_taipei": "2025-09-20T03:11:36+08:00",
      "summary": "The Irish author said she had been advised not to enter Britain over concerns she could be arrested over support for pro-Palestinian group Palestine Action."
    },
    {
      "source": "華盛頓郵報",
      "title": "Russian fighter jets breach Estonian airspace",
      "link": "https://www.washingtonpost.com/world/2025/09/19/russia-estonia-jets-breach-air-space/",
      "pub_time_taipei": "2025-09-20T02:37:41+08:00",
      "summary": "The Russian breach of E.U. air space is the third in just a matter of days after drone incursions into Poland and Romania."
    },
    {
      "source": "衛報",
      "title": "UN votes to allow Palestinian president to address annual gathering via video link",
      "link": "https://www.theguardian.com/world/2025/sep/19/un-palestinian-president-annual-gathering-video-link",
      "pub_time_taipei": "2025-09-20T01:08:53+08:00",
      "summary": "<p>Trump had refused to grant visas for Palestinian delegation due to attend conference and UN general assembly</p><p>The United Nations general assembly has voted to allow the Palestinian president, Mahmoud Abbas, to address next week’s annual gathering of world leaders next week in New York via video link after Donald Trump said he would not give him a US visa.</p><p>The resolution received 145 votes in favour and five votes against, while six countries abstained.</p> <a href=\"https://www.theguardian.com/world/2025/sep/19/un-palestinian-president-annual-gathering-video-link\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump, Xi to meet as U.S.-China tensions shape world order",
      "link": "https://www.washingtonpost.com/world/2025/09/19/trump-xi-phone-call-trade-tensions/",
      "pub_time_taipei": "2025-09-20T00:54:43+08:00",
      "summary": "The leaders of the world’s two biggest economies spoke for the first time since June and agreed to meet in six weeks."
    },
    {
      "source": "衛報",
      "title": "Israel army says it will use ‘unprecedented force’ in Gaza City and urges residents to leave – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/sep/19/palestinian-state-palestine-recognition-gaza-israel-middle-east-latest-news-updates",
      "pub_time_taipei": "2025-09-20T00:36:48+08:00",
      "summary": "<p>IDF tells residents of Gaza City to flee south but closes Salah al-Din road evacuation route. This live blog is closed</p><p><strong>Pakistan’s</strong> defence minister says his nation’s nuclear programme “will be made available” to <strong>Saudi Arabia</strong> if needed under the countries’ new defence pact, marking the first specific acknowledgment that Islamabad had put the kingdom under its nuclear umbrella.</p><p>Defence minister Khawaja Mohammad Asif’s comments underline the importance of the pact struck this week between Pakistan and Saudi Arabia, which have had military ties for decades, AP reports.</p><p>I welcome the excellent cooperation with the Palestinian Authority. We are working together to ensure his swift extradition.</p><p>This is another step forward for justice and truth. My thoughts are with all the families who have endured the pain of waiting for so long.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/19/palestinian-state-palestine-recognition-gaza-israel-middle-east-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Swiss theatre director told to withdraw book alleging Austrian politician mocked Holocaust victims",
      "link": "https://www.theguardian.com/books/2025/sep/19/swiss-theatre-director-told-to-withdraw-book-alleging-austrian-politician-mocked-holocaust-victims",
      "pub_time_taipei": "2025-09-19T23:45:13+08:00",
      "summary": "<p>Court fines publisher after Milo Rau falsely claimed that far-right former vice-chancellor Heinz-Christian Strache sang a song ridiculing the six million Jews murdered by the Nazis</p><p>A Swiss theatre director known for re-enacting landmark trials has been told by a judge in Vienna that his publisher must withdraw a book in which he alleged that a far-right Austrian politician sang a song mocking the victims of the Holocaust.</p><p>On Thursday, Vienna’s regional court fined independent German publishing house Verbrecher Verlag €1,500 (£1,300) for publishing a book in which Milo Rau alleged that Heinz-Christian Strache, the former leader of the Freedom party (FPÖ), once sang a song with the line: “We’ll manage the seventh million”, a reference to the approximately 6 million European Jews murdered at the hands of the Nazi regime.</p> <a href=\"https://www.theguardian.com/books/2025/sep/19/swiss-theatre-director-told-to-withdraw-book-alleging-austrian-politician-mocked-holocaust-victims\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel killed 31 journalists in Yemen strike, press freedom group says",
      "link": "https://www.washingtonpost.com/world/2025/09/19/yemen-journalists-strike-israel-houthis/",
      "pub_time_taipei": "2025-09-19T23:36:45+08:00",
      "summary": "Last week’s attack was “the deadliest strike on journalists in the Middle East” documented by the Committee to Protect Journalists."
    },
    {
      "source": "衛報",
      "title": "Scores killed by RSF drone strike on mosque in besieged Sudanese city",
      "link": "https://www.theguardian.com/world/2025/sep/19/rsf-drone-strike-kills-scores-people-mosque-sudan",
      "pub_time_taipei": "2025-09-19T22:45:42+08:00",
      "summary": "<p>First responders say 75 worshippers dead as paramilitaries push to capture last foothold of Sudanese army in Darfur</p><p>A drone strike by the paramilitary Rapid Support Forces on the besieged Sudanese city of El Fasher has killed 75 people worshipping in a mosque, first responders have said, as the group continued its push to capture the last foothold of Sudan’s army in the Darfur region.</p><p>The attack, one of the deadliest this year in the city, hit the al-Daraja neighbourhood, where civilians from the famine-hit Abu Shouk displacement camp had fled after it was overrun by fighters .</p> <a href=\"https://www.theguardian.com/world/2025/sep/19/rsf-drone-strike-kills-scores-people-mosque-sudan\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Rare war critic in Putin’s inner circle resigns",
      "link": "https://www.washingtonpost.com/world/2025/09/19/russia-kozak-putin-kremlin-resign/",
      "pub_time_taipei": "2025-09-19T22:41:11+08:00",
      "summary": "Dmitry Kozak had been with Putin since the 1990s and was one of the few who could be frank with him about his opposition to the Ukraine invasion."
    }
  ]
}