{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-20T20:40:06.015250+08:00",
  "window_end_taipei": "2025-10-21T20:40:06.015250+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Covid inquiry live: children paid ‘huge price’ to protect rest of society in pandemic, says Johnson",
      "link": "https://www.theguardian.com/uk-news/live/2025/oct/21/covid-19-inquiry-boris-johnson-pandemic-children-lockdown-impact-live-updates",
      "pub_time_taipei": "2025-10-21T20:26:28+08:00",
      "summary": "<p>Former prime minister grilled over pandemic’s impact on young people and says he wishes ‘another solution’ could have been found over school closures</p><p>Former prime minister <strong>Boris Johnson</strong> tries to give the inquiry context around the decision making on the closure of educational settings. He says:</p><p>Don’t forget that we didn’t know the effect this disease had on kids. We didn’t know much about the transmissibility of the disease. There were all sorts of things that were simply unknown and difficult to plan for. And the thing was moving very fast.</p><p>And from the point of view of No 10, we were focused very much on trying to stave off, trying to avoid an appalling public health crisis, and we were focused on getting enough ventilators, on getting enough PPE, trying to avoid a significant number of casualties, and I think it’s important for the inquiry to focus, to remember that at the time that the school closures were first mentioned, they were seen as something you put in at the peak of the pandemic, and we didn’t think we were yet at the peak of the pandemic.</p> <a href=\"https://www.theguardian.com/uk-news/live/2025/oct/21/covid-19-inquiry-boris-johnson-pandemic-children-lockdown-impact-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Bank of England chief warns of ‘worrying echoes’ of 2008 financial crisis",
      "link": "https://www.theguardian.com/business/2025/oct/21/bank-of-england-chief-warns-worrying-echoes-2008-financial-crisis-tricolor-first-brands",
      "pub_time_taipei": "2025-10-21T20:25:30+08:00",
      "summary": "<p>Andrew Bailey says a close look is needed at the private credit market after collapse of two big US firms </p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/21/uk-borrowing-outstrips-forecasts-reeves-amazon-web-services-outage-resolved-bank-of-england-stock-markets-business-live-news\">Business live – latest updates</a></p><p></p></li></ul><p>The governor of the Bank of England, Andrew Bailey, has warned <a href=\"https://www.theguardian.com/business/2025/oct/18/what-is-private-credit-us-first-brands-tricolor-banks\">recent events in US private credit markets</a> have worrying echoes of the sub-prime mortgage crisis that kicked off the global financial crash of 2008.</p><p><a href=\"https://www.theguardian.com/business/live/2025/oct/21/uk-borrowing-outstrips-forecasts-reeves-amazon-web-services-outage-resolved-bank-of-england-stock-markets-business-live-news\">Appearing before a House of Lords committee</a>, the governor said it was important to have the “drains up” and analyse the collapse of two leveraged US firms, First Brands and Tricolor, in case they are not isolated events but “the canary in the coalmine”.</p> <a href=\"https://www.theguardian.com/business/2025/oct/21/bank-of-england-chief-warns-worrying-echoes-2008-financial-crisis-tricolor-first-brands\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Impact of Brexit on UK economy even worse than critics predicted, says chancellor – UK politics live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/21/rachel-reeves-economy-starmer-labour-streeting-sentencing-bill-uk-politics-live-news-updates",
      "pub_time_taipei": "2025-10-21T20:24:41+08:00",
      "summary": "<p>Rachel Reeves also highlights austerity and lack of capital spending as key harms to UK economy</p><p>Labour is spending significantly more on levelling up projects than previous Conservative government, new research suggests.</p><p>In <a href=\"https://www.newstatesman.com/politics/2025/10/exclusive-starmer-outspends-johnson-on-levelling-up-in-first-year\">a New Statesman article</a>, <strong>Anoosh Chakelian</strong> reports on figures produced by the Independent Commission on Neighbourhoods thinktank that show that Keir Starmer has spent more on levelling up projects in his first year than any of his Tory predecessors did in the same timescale. Chakelian says:</p><p>In its first year in office, Keir Starmer’s government has invested £2bn more than Johnson did in his first year – with £4.5bn allocated to regional investment programmes in Labour’s first year compared with £2.5bn spent in the equivalent period under Johnson – according to new analysis by the Independent Commission on Neighbourhoods.</p><p>Investment in the North East will be seven times higher than under Johnson, and five times higher in the North West and Yorkshire and Humber by the end of the Parliament, based on current trends identified in this analysis of 46 government programmes and funds.</p><p>Lab, Con &amp; LibDems today all agreed the decision by Weds Mids police to ban the Jewish fans is wrong, disgraceful etc, but nothing they can do because ‘operational independence’. Only Reform UK will change the law to put the police under the control of elected politicians.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/21/rachel-reeves-economy-starmer-labour-streeting-sentencing-bill-uk-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump to host GOP senators at White House amid demolition work and government shutdown – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates",
      "pub_time_taipei": "2025-10-21T20:21:43+08:00",
      "summary": "<p>The president will host a lunch for Republicans in the Rose Garden as construction is carried out on the White House’s east wing</p><p><strong>The Central Intelligence Agency is providing the bulk of the intelligence used to carry out the controversial lethal air strikes by the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> against small, fast-going boats in the Caribbean Sea suspected of carrying drugs from Venezuela, according to three sources familiar with the operations.</strong></p><p>Experts say the agency’s central role means much of the evidence used to select which alleged smugglers to kill on the open sea will almost certainly remain secret.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Poland threatens Putin with arrest if he flies through its airspace on way to Hungary – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/21/nicolas-sarkozy-france-jail-russia-ukraine-europe-news-live-updates",
      "pub_time_taipei": "2025-10-21T20:18:37+08:00",
      "summary": "<p>Poland’s foreign minister says Putin’s plane could be escorted down and Russian president handed to The Hague</p><p>A lawyer for <strong>Nicolas Sarkozy</strong> said a motion had been filed for his release moments after the former French president entered jail, Agence France-Presse (AFP) reports.</p><p>Attorney <strong>Christophe Ingrain</strong> told reporters:</p><p><em>A request has been filed for Nicolas Sarkozy’s release.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/21/nicolas-sarkozy-france-jail-russia-ukraine-europe-news-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Repair bills could force hundreds of UK churches to close within five years",
      "link": "https://www.theguardian.com/culture/2025/oct/21/repair-bills-could-force-hundreds-of-uk-churches-to-close-within-five-years-survey",
      "pub_time_taipei": "2025-10-21T20:13:23+08:00",
      "summary": "<p>Two in five say their roof is at risk and one in three are using reserves for basics,  National Churches Trust survey finds</p><p>Hundreds of Britain’s churches may be forced to close in the next five years as the cost of maintaining heritage buildings becomes unmanageable, a conference at the V&amp;A in London has heard.</p><p>Many of the UK’s 20,000-plus listed places of worship contain important heritage treasures, such as stained glass windows, and monuments of historic significance. They are also hubs for community groups and social action projects.</p> <a href=\"https://www.theguardian.com/culture/2025/oct/21/repair-bills-could-force-hundreds-of-uk-churches-to-close-within-five-years-survey\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sanae Takaichi appoints just two women to cabinet after becoming Japan’s first female PM",
      "link": "https://www.theguardian.com/world/2025/oct/21/sanae-takaichi-japan-first-female-pm-appoints-two-women-to-cabinet",
      "pub_time_taipei": "2025-10-21T20:06:05+08:00",
      "summary": "<p>New leader had promised levels of female representation comparable to those in Iceland, where six of cabinet of 11 are women</p><p>Sanae Takaichi <a href=\"https://www.theguardian.com/world/2025/oct/21/pm-sanae-takaichi-japan-prime-minister\">made history</a> on Tuesday when she became <a href=\"https://www.theguardian.com/world/japan\">Japan</a>’s first female prime minister. But hours after she was elected by MPs, it was evident that female <a href=\"https://www.theguardian.com/world/2023/apr/07/i-decided-i-could-do-better-than-them-the-women-taking-on-japans-male-dominated-politics\">under representation</a> in the country’s political establishment would continue when she appointed just two women to her cabinet.</p><p>Takaichi had promised levels of female representation in her government comparable to those in Iceland, Finland and Norway.</p> <a href=\"https://www.theguardian.com/world/2025/oct/21/sanae-takaichi-japan-first-female-pm-appoints-two-women-to-cabinet\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Fears of heat-rationing for millions in US as shutdown delays energy aid",
      "link": "https://www.theguardian.com/us-news/2025/oct/21/us-shutdown-energy-aid-bills",
      "pub_time_taipei": "2025-10-21T20:00:36+08:00",
      "summary": "<p>Most vulnerable families could be without critical energy assistance, experts warn, as electricity and gas bills surge</p><p>Millions of Americans face having to ration heating this winter as the US federal government shutdown and mass layoffs by the Trump administration cause unprecedented delays in getting energy assistance aid to low-income households, a group that helps people pay energy bills has warned.</p><p>Congress approved about $4bn for the Low-Income Home Energy Assistance Program (Liheap), after Trump’s proposal to cancel the life-saving heating and cooling scheme in this year’s budget was ultimately unsuccessful.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/21/us-shutdown-energy-aid-bills\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trump EPA seeks to weaken scrutiny for some of US’s most toxic chemicals",
      "link": "https://www.theguardian.com/environment/2025/oct/21/trump-epa-toxic-chemicals",
      "pub_time_taipei": "2025-10-21T20:00:36+08:00",
      "summary": "<p>New rule would prohibit states from banning dangerous chemicals, and could invalidate hundreds of protections</p><p>A new rule proposed by the Trump administration would dramatically weaken safety reviews for some of the nation’s most toxic chemicals that are already on the market, public health advocates and an EPA employee warn.</p><p>Many of the chemicals that would receive less scrutiny are among the nation’s most dangerous substances, including PFAS, formaldehyde, asbestos and dioxins. Each poses serious health risks in consumer goods, or for workers handling the substances, advocates say.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/21/trump-epa-toxic-chemicals\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza ceasefire live: Vance arrives in Israel as Gaza officials say level of aid delivered is far below what was promised",
      "link": "https://www.theguardian.com/world/live/2025/oct/21/israel-gaza-ceasefire-jd-vance-hostages-hamas-netanyahu-latest-news-updates",
      "pub_time_taipei": "2025-10-21T19:59:24+08:00",
      "summary": "<p>Gaza officials say 600 trucks of aid were supposed to enter daily, but the number actually arriving is below 90</p><p>Gaza’s Government Media Office has posted to Telegram to say only 986 aid trucks have entered the Gaza Strip since the ceasefire began just over a week ago, out of the 6,600 trucks that it says were supposed to have arrived by Monday evening.</p><p>Gaza’s Government Media Office said:</p><p><em>The humanitarian convoys included (14) trucks loaded with cooking gas and (28) diesel trucks designated to operate bakeries, generators, hospitals and various vital sectors, in light of the severe shortage of these vital materials that the population directly depends on for daily life, after long months of siege and systematic destruction caused by the genocide committed by the “Israeli” occupation against our people in the Gaza Strip.</em></p><p><em>We note that the average number of trucks entering the Gaza Strip daily since the ceasefire began does not exceed (89) trucks out of (600) trucks that are supposed to enter daily, which reflects the continued policy of strangulation, starvation and humanitarian blackmail practiced by the occupation against more than (2.4) million citizens in Gaza.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/21/israel-gaza-ceasefire-jd-vance-hostages-hamas-netanyahu-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Santos’ release from prison felt like Trump ‘stuck me in the gut with a knife’, alleged fraud victim says",
      "link": "https://www.theguardian.com/us-news/2025/oct/21/santos-release-prison-richard-osthoff",
      "pub_time_taipei": "2025-10-21T19:39:10+08:00",
      "summary": "<p>Richard Osthoff says commutation was not the first time Trump did something disrespectful to a military veteran</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates\">US politics live – latest updates</a></p></li></ul><p>A retired member of the US navy who alleges to have lost thousands of dollars meant for his dying dog when the Donald Trump-freed <a href=\"https://www.theguardian.com/us-news/george-santos\">George Santos</a> defrauded him says he now views the president as a “walking middle finger”.</p><p>Richard Osthoff’s <a href=\"https://www.youtube.com/watch?v=2l1TmPl_fI0&amp;list=PLDIVi-vBsOEzjfOEky76nwtmywxElUI_L&amp;index=3\">emotional comments</a> on Monday on MSNBC’s Chris Jansing Reports came three days after Trump <a href=\"https://www.theguardian.com/us-news/2025/oct/17/trump-commuted-sentence-george-santos\">commuted Santos’s seven-year, three-month prison sentence</a>, which was given to the former New York representative in connection with federal fraud charges.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/21/santos-release-prison-richard-osthoff\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Hamas took 251 hostages from Israel into Gaza. Where are they?",
      "link": "https://www.washingtonpost.com/world/interactive/hamas-hostages-israel-war-gaza/",
      "pub_time_taipei": "2025-10-21T19:30:43+08:00",
      "summary": "We’re tracking what happened to the hostages taken by Hamas on Oct. 7, 2023, from Israel."
    },
    {
      "source": "衛報",
      "title": "What can Sarkozy expect in La Santé prison and what has he taken with him?",
      "link": "https://www.theguardian.com/world/2025/oct/21/what-can-nicolas-sarkozy-expect-la-sante-prison-france",
      "pub_time_taipei": "2025-10-21T19:14:58+08:00",
      "summary": "<p>Former French president will reportedly be held in isolation and has a copy of The Count of Monte Cristo for company</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/21/nicolas-sarkozy-france-jail-russia-ukraine-europe-news-live-updates\">Europe live – latest updates</a></p></li></ul><p>Perhaps France’s most fabled jail, La Santé – where the former French president Nicolas Sarkozy <a href=\"https://www.theguardian.com/world/2025/oct/21/nicolas-sarkozy-enters-prison-paris-france\">has begun a five-year jail term for criminal conspiracy</a> to raise campaign funds from Libya – is the last remaining prison inside the Paris city limits.</p><p>Located in the southern Montparnasse district of the capital, it opened in 1867 and was the scene of at least 40 executions, the last in 1972. Partially closed for renovation in 2014, the prison reopened five years later and houses more than 1,100 inmates.</p> <a href=\"https://www.theguardian.com/world/2025/oct/21/what-can-nicolas-sarkozy-expect-la-sante-prison-france\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "CIA playing ‘most important part’ in US strikes in the Caribbean, sources say",
      "link": "https://www.theguardian.com/us-news/2025/oct/21/us-strikes-caribbean-cia-role",
      "pub_time_taipei": "2025-10-21T19:06:37+08:00",
      "summary": "<p>Exclusive: sources say the agency is providing real-time intelligence collected by satellites and signal intercepts</p><p>The Central Intelligence Agency is providing the bulk of the intelligence used to carry out the controversial lethal air strikes by the Trump administration against small, fast-going boats in the Caribbean Sea suspected of carrying drugs from Venezuela, according to three sources familiar with the operations. Experts say the agency’s central role means much of the evidence used to select which alleged smugglers to kill on the open sea will almost certainly remain secret.</p><p>The agency’s central role in the boat strikes has not previously been disclosed. Donald Trump <a href=\"https://www.theguardian.com/us-news/2025/oct/15/trump-venezuela-cia-maduro\">confirmed</a> last Wednesday that he had authorized covert CIA action in Venezuela, but not what the agency would be doing.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/21/us-strikes-caribbean-cia-role\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Two more men arrested over death of Lostprophets singer Ian Watkins",
      "link": "https://www.theguardian.com/uk-news/2025/oct/21/men-arrested-death-lostprophets-singer-ian-watkins",
      "pub_time_taipei": "2025-10-21T18:56:53+08:00",
      "summary": "<p>Police say pair held on suspicion of conspiracy to murder after former frontman died at HMP Wakefield</p><p>Two more men have been arrested in connection with the death of the former Lostprophets frontman, Ian Watkins, at HMP Wakefield, West Yorkshire police said.</p><p>Watkins, 48, who was serving a 29-year sentence with a further six years to be served on licence after admitting a string of offences including the attempted rape of a baby, died after being assaulted in the high-security jail on 11 October.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/21/men-arrested-death-lostprophets-singer-ian-watkins\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Mosquitoes found in Iceland for first time as climate crisis warms country",
      "link": "https://www.theguardian.com/environment/2025/oct/21/mosquitoes-found-iceland-first-time-climate-crisis-warms-country",
      "pub_time_taipei": "2025-10-21T18:41:08+08:00",
      "summary": "<p>Three specimens discovered in what was previously one of the only places in the world without the insects</p><p>Mosquitoes have been found in Iceland for the first time as global heating makes the country more hospitable for insects.</p><p>The country was until this month one of the only places in the world that did not have a mosquito population. The other is Antarctica.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/21/mosquitoes-found-iceland-first-time-climate-crisis-warms-country\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "A Trump visit, a creaking coalition and a cost of living crisis: Japan’s new PM needs a fast start",
      "link": "https://www.theguardian.com/world/2025/oct/21/pm-sanae-takaichi-japan-prime-minister",
      "pub_time_taipei": "2025-10-21T18:37:18+08:00",
      "summary": "<p>Sanae Takaichi has made history but will have little time to settle in before negotiating the pitfalls of rising prices, power struggles and a mercurial US president</p><p>It is hard to overstate the symbolism of Sanae Takaichi’s achievement in becoming <a href=\"https://www.theguardian.com/world/2025/oct/20/sanae-takaichi-likely-become-japan-first-female-prime-minister\">the first female prime minister</a> of Japan, a country that consistently ranks poorly in global gender equality comparisons, not least in politics and business.</p><p>However, she will have precious little time to savour her historic appointment on Tuesday.</p> <a href=\"https://www.theguardian.com/world/2025/oct/21/pm-sanae-takaichi-japan-prime-minister\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel IDs more hostages’ bodies as Hamas says return of others will be hard",
      "link": "https://www.washingtonpost.com/world/2025/10/14/hamas-gaza-israel-hostages-killed/",
      "pub_time_taipei": "2025-10-21T18:05:40+08:00",
      "summary": "Here’s what to know about the hostages whose bodies have been returned to Israel — or that remain in Gaza as pressure mounts on Hamas to turn them over."
    },
    {
      "source": "華盛頓郵報",
      "title": "Vance arrives in Israel to bolster fragile Gaza ceasefire",
      "link": "https://www.washingtonpost.com/world/2025/10/21/vance-israel-gaza-hamas-ceasefire/",
      "pub_time_taipei": "2025-10-21T17:57:21+08:00",
      "summary": "Vice President JD Vance came to Israel as the U.S. tries to show it will enforce a Gaza ceasefire deal that is off to a shaky start."
    },
    {
      "source": "華盛頓郵報",
      "title": "Rare tornado tears through Paris suburb, toppling cranes and killing 1",
      "link": "https://www.washingtonpost.com/weather/2025/10/21/paris-france-tornado-suburb/",
      "pub_time_taipei": "2025-10-21T17:44:54+08:00",
      "summary": "The tornado uprooted trees, tore off roofs and injured at least nine other people. French media said it was the country’s first deadly twister in 17 years."
    },
    {
      "source": "衛報",
      "title": "Jacinta Nampijinpa Price shouldn’t ‘just parrot’ claims without verifying, defamation trial hears",
      "link": "https://www.theguardian.com/australia-news/2025/oct/21/jacinta-nampijinpa-price-defamation-trial-ntwnfb",
      "pub_time_taipei": "2025-10-21T17:41:21+08:00",
      "summary": "<p>Central Land Council chief executive Lesley Turner alleges the Liberal senator defamed him in a 2024 press release</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/21/australia-news-live-michaelia-cash-china-jet-raaf-prime-minister-anthony-albanese-donald-trump-white-house-critical-minerals-deal-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Liberal senator Jacinta Nampijinpa Price should have verified claims about the head of an Aboriginal land council before publicly harming his reputation, a defamation trial has heard.</p><p>Central Land Council chief executive, Lesley Turner, has brought federal court proceedings <a href=\"https://www.theguardian.com/australia-news/article/2024/sep/07/central-land-council-ceo-lesley-turner-launches-defamation-case-against-jacinta-price-ntwnfb\">alleging the senator defamed him</a> through a July 2024 press release.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/21/jacinta-nampijinpa-price-defamation-trial-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Don’t use AI to tell you how to vote in election, says Dutch watchdog",
      "link": "https://www.theguardian.com/world/2025/oct/21/ai-chatbots-unreliable-biased-advice-voters-dutch-watchdog",
      "pub_time_taipei": "2025-10-21T17:14:11+08:00",
      "summary": "<p>Data protection authority says chatbots are ‘clearly biased’, as Netherlands prepares for national poll</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/21/dutch-election-key-players-and-main-issues-snap-poll\">Dutch election: key players and main issues</a></p></li><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/21/nicolas-sarkozy-france-jail-russia-ukraine-europe-news-live-updates\">Europe live – latest updates</a></p></li></ul><p>AI chatbots are “unreliable and clearly biased” when offering voting advice, the Dutch data protection authority (AP) has said, warning of a threat to democracy eight days before national elections.</p><p>The four chatbots tested by the AP “often end up with the same two parties, regardless of the user’s question or command”, the authority said in a report ahead of the 29 October election.</p> <a href=\"https://www.theguardian.com/world/2025/oct/21/ai-chatbots-unreliable-biased-advice-voters-dutch-watchdog\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Delhi awakes to a toxic haze after Diwali as pollution season begins",
      "link": "https://www.theguardian.com/world/2025/oct/21/delhi-awakes-toxic-haze-diwali-pollution-season-begins",
      "pub_time_taipei": "2025-10-21T17:11:18+08:00",
      "summary": "<p>Air breathed by people in the city categorised as ‘severe’ in quality after fireworks contribute to thick smog</p><p>Delhi awoke to a thick haze on Tuesday, a day after millions of people celebrated the Hindu festival of Diwali with fireworks, marking the beginning of the pollution season that has become an annual blight on India’s capital.</p><p>Those in the most polluted city in the world once again found themselves breathing dangerously toxic air that fell into the “severe” category on Tuesday morning.</p> <a href=\"https://www.theguardian.com/world/2025/oct/21/delhi-awakes-toxic-haze-diwali-pollution-season-begins\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Nicolas Sarkozy enters prison to begin five-year sentence over criminal conspiracy",
      "link": "https://www.theguardian.com/world/2025/oct/21/nicolas-sarkozy-enters-prison-paris-france",
      "pub_time_taipei": "2025-10-21T17:05:03+08:00",
      "summary": "<p>Former president organised stage-managed departure from his Paris home before becoming first French postwar leader to be jailed</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/21/nicolas-sarkozy-france-jail-russia-ukraine-europe-news-live-updates\">Europe live – latest updates</a></p></li></ul><p>The former French president <a href=\"https://www.theguardian.com/world/2025/oct/19/france-former-president-nicolas-sarkozy-prison\">Nicolas Sarkozy</a> has been jailed in Paris, after a court sentenced him to five years for <a href=\"https://www.theguardian.com/world/2025/sep/25/nicolas-sarkozy-found-guilty-of-criminal-conspiracy-in-libya-trial\">criminal conspiracy</a> over a scheme to obtain election campaign funds from the regime of the late Libyan dictator Muammar Gaddafi.</p><p>France’s rightwing president between 2007 and 2012 is the first former head of an EU country to serve time in prison, and the first French postwar leader to go to prison.</p> <a href=\"https://www.theguardian.com/world/2025/oct/21/nicolas-sarkozy-enters-prison-paris-france\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Islamist extremists have taken this African country to the brink",
      "link": "https://www.washingtonpost.com/world/2025/10/21/mali-jnim-militants-fuel-blockade/",
      "pub_time_taipei": "2025-10-21T17:00:35+08:00",
      "summary": "A fuel blockade imposed by al-Qaeda-aligned militants has paralyzed the capital of Mali and roiled its repressive military government."
    },
    {
      "source": "衛報",
      "title": "Australian Christian Lobby says any new laws protecting people from cults could be ‘very dangerous’",
      "link": "https://www.theguardian.com/australia-news/2025/oct/21/australian-christian-lobby-says-any-new-laws-protecting-people-from-cults-could-be-very-dangerous",
      "pub_time_taipei": "2025-10-21T16:15:24+08:00",
      "summary": "<p>Lobby groups tell Victorian inquiry legitimate churches could be caught up in any proposed crackdown on coercive practices</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Two Christian lobby groups have pushed back against any new laws to protect vulnerable people from cults, with a Victorian inquiry told of a “palpable fear” they could affect mainstream churches.</p><p>The Australian Christian Lobby (ACL) and Freedom for Faith were among witnesses to appear before the <a href=\"https://www.parliament.vic.gov.au/cofg#:~:text=Snapshot%20of%20inquiry,about%20protecting%20people%20from%20harm.\">parliamentary inquiry into cults</a> and organised fringe groups on Tuesday.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/21/australian-christian-lobby-says-any-new-laws-protecting-people-from-cults-could-be-very-dangerous\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How Israeli strikes that killed 5 journalists at a Gaza hospital unfolded",
      "link": "https://www.washingtonpost.com/world/2025/10/21/gaza-hospital-strike-journalists-killed/",
      "pub_time_taipei": "2025-10-21T16:00:24+08:00",
      "summary": "The strikes on Nasser Hospital fit what military and legal experts said has been a pattern of reckless targeting and weaponeering by Israeli forces in Gaza."
    },
    {
      "source": "衛報",
      "title": "Pat Conroy says China’s claims RAAF aircraft illegally entered its airspace ‘factually incorrect’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/21/australia-news-live-michaelia-cash-china-jet-raaf-prime-minister-anthony-albanese-donald-trump-white-house-critical-minerals-deal-ntwnfb",
      "pub_time_taipei": "2025-10-21T14:50:57+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/21/malcolm-turnbull-hails-albanese-trump-meeting\">Turnbull hails Albanese’s handling of Trump meeting but warns ‘warm words don’t build submarines’</a></p></li><li><p><a href=\"https://www.theguardian.com/world/2025/oct/21/australia-us-critical-minerals-rare-earths-deal-china-explainer\">Australia and the US have signed a critical minerals deal to take on China’s monopoly. Here’s what you need to know</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p><p></p></li></ul><p>The foreign affairs minister was asked about <strong>Donald Trump</strong>’s remark that he didn’t like the Australian ambassador, <strong>Kevin Rudd,</strong> and “probably never will” during the White House meeting early this morning.</p><p>Trump made the testy remark, telling Rudd “I don’t like you either”, at the White House cabinet room table, prompting uncomfortable laughter. <strong>Penny Wong</strong> told RN the ambassador had done an “extremely good job” getting the meeting between the US president and Albanese:</p><p>Look, I think those comments were clearly tongue-in-cheek. I’m very pleased that the meeting has been such a success. That is a good thing for our country. It’s extremely good to have this critical minerals deal backed in, and it’s extremely positive for the country to have the president so supportive of Aukus and the delivery of the submarines, which is an important capability for us.</p><p>Kevin did an extremely good job not only in getting the meeting but doing the work on the critical minerals deal. And the meeting reflects the success of that work.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/21/australia-news-live-michaelia-cash-china-jet-raaf-prime-minister-anthony-albanese-donald-trump-white-house-critical-minerals-deal-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "October heat records broken across Australia as Sydney braces for temperatures way above the norm",
      "link": "https://www.theguardian.com/environment/2025/oct/21/australia-weather-october-heat-records-sydney-birdsville-temperature-forecast",
      "pub_time_taipei": "2025-10-21T14:36:49+08:00",
      "summary": "<p>Birdsville sets new high as BoM forecasts more record hot weather, with heatwave warnings in place in some states</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/21/australia-news-live-michaelia-cash-china-jet-raaf-prime-minister-anthony-albanese-donald-trump-white-house-critical-minerals-deal-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>October heat records have been broken in several states this week as authorities in New South Wales prepare for temperatures above the norm to hit Sydney and the east coast of Australia.</p><p>The Queensland outback town of Birdsville broke a new record on Tuesday, hitting 46.1C at 2.28pm local time, according to the Bureau of Meteorology, making it the highest temperature recorded in the state in October. The state’s previous October record was 45.1C at Birdsville police station on 31 October 1995.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/21/australia-weather-october-heat-records-sydney-birdsville-temperature-forecast\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Death of British overseas territories citizen prompts calls for reform of UK rules",
      "link": "https://www.theguardian.com/world/2025/oct/21/death-of-british-overseas-territories-citizen-prompts-calls-for-reform-of-uk-rules",
      "pub_time_taipei": "2025-10-21T14:00:35+08:00",
      "summary": "<p>Family of Robert Baker call for change of healthcare policies that limit NHS access to 10 BOT citizens a year</p><p>Friends and family of a British overseas territory (BOT) citizen who died after the UK refused him medical assistance have called for reform of “flawed” policies governing healthcare for the territories.</p><p>Robert Baker, a 63-year-old dual citizen of Jamaica and Montserrat, died on Friday, after travelling to Jamaica to receive treatment for blackouts that was unavailable in the British overseas territory of Montserrat.</p> <a href=\"https://www.theguardian.com/world/2025/oct/21/death-of-british-overseas-territories-citizen-prompts-calls-for-reform-of-uk-rules\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Japan elects first female leader, a hawk who promotes ‘Japan First’",
      "link": "https://www.washingtonpost.com/world/2025/10/20/japan-prime-minister-sanae-takaichi/",
      "pub_time_taipei": "2025-10-21T12:53:16+08:00",
      "summary": "After some last-minute political maneuvering, Sanae Takaichi became Japan’s prime minister just days before President Donald Trump arrives in the country."
    },
    {
      "source": "衛報",
      "title": "More than 1,000 guns and parts seized in illicit weapon crackdown in Australia and New Zealand",
      "link": "https://www.theguardian.com/australia-news/2025/oct/21/australia-new-zealand-gun-control-firearms-seized-weapon-crackdown",
      "pub_time_taipei": "2025-10-21T11:22:25+08:00",
      "summary": "<p>Police make more than 180 arrests and capture 281 privately manufactured weapons and parts, including those made by 3D printers</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/21/australia-news-live-michaelia-cash-china-jet-raaf-prime-minister-anthony-albanese-donald-trump-white-house-critical-minerals-deal-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Authorities have seized more than 1,000 firearms and gun parts in a crackdown on the spread of illicit weapons in Australia and New Zealand.</p><p>The week-long transnational operation led to more than 180 arrests, according to Australian Border Force, and the seizure of 281 privately manufactured firearms and parts, including those made by 3D printers.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/21/australia-new-zealand-gun-control-firearms-seized-weapon-crackdown\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Thousands detained as Myanmar military raids notorious KK park scam compound",
      "link": "https://www.theguardian.com/world/2025/oct/21/myanmar-kk-park-raid-scam-cybercrime-centre-compound",
      "pub_time_taipei": "2025-10-21T09:16:06+08:00",
      "summary": "<p>Myanmar's military moved in to tackle a major online scam operation near the Thailand border, state media reported</p><p>Myanmar’s military has raided a major online scam operation near the border with Thailand, detaining more than 2,000 people and seizing dozens of Starlink satellite internet terminals, state media has reported.</p><p>According to a report in Monday’s Myanma Alinn newspaper, Myanmar’s army raided KK Park, a well-documented cybercrime centre, as part of operations starting in early September to suppress online fraud, illegal gambling, and cross-border cybercrime.</p> <a href=\"https://www.theguardian.com/world/2025/oct/21/myanmar-kk-park-raid-scam-cybercrime-centre-compound\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "How the Louvre heist unfolded",
      "link": "https://www.washingtonpost.com/world/2025/10/20/how-louvre-heist-unfolded/",
      "pub_time_taipei": "2025-10-21T07:45:48+08:00",
      "summary": "Graphics show how thieves made away with priceless French crown jewels from the Louvre in under seven minutes."
    },
    {
      "source": "衛報",
      "title": "Anti-malaria funding cuts could lead to ‘deadliest resurgence ever’, study warns",
      "link": "https://www.theguardian.com/global-development/2025/oct/21/global-health-infectious-disease-aid-cuts-malaria-funding-cost-deaths-gdp-africa",
      "pub_time_taipei": "2025-10-21T07:01:26+08:00",
      "summary": "<p>Expected reduction in contributions by wealthy countries likely to cost millions of lives and billions in lost growth</p><p>Slashed contributions from wealthy countries to an anti-malaria fund could allow a resurgence of the disease, costing millions of lives and billions of pounds by the end of the decade, according to a new analysis.</p><p>The fight against malaria faces new threats, including extreme weather and humanitarian crises increasing the number of people exposed, and growing biological resistance to insecticides and drugs, the report warns.</p> <a href=\"https://www.theguardian.com/global-development/2025/oct/21/global-health-infectious-disease-aid-cuts-malaria-funding-cost-deaths-gdp-africa\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Could Trump's boat strikes turn into war?",
      "link": "https://www.washingtonpost.com/podcasts/post-reports/could-trumps-boat-strikes-turn-into-war/",
      "pub_time_taipei": "2025-10-21T04:58:20+08:00",
      "summary": "There’s been an unexpected twist in the Trump administration’s escalating attacks on alleged “narco-terrorists” from Venezuela: Two people survived a boat attack."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. ramps up diplomacy around Gaza ceasefire; Vance travels to Israel",
      "link": "https://www.washingtonpost.com/world/2025/10/20/israel-gaza-ceasefire-trump-witkoff/",
      "pub_time_taipei": "2025-10-21T04:24:20+08:00",
      "summary": "Steve Witkoff and Jared Kushner’s trip was planned in advance of Israeli strikes across Gaza, launched after two Israeli soldiers were killed in Rafah."
    },
    {
      "source": "衛報",
      "title": "Trump says China ‘doesn’t want’ to invade Taiwan and reaffirms trust in Xi",
      "link": "https://www.theguardian.com/us-news/2025/oct/20/trump-china-taiwan-invasion-xi-jinping",
      "pub_time_taipei": "2025-10-21T01:51:00+08:00",
      "summary": "<p>US president says ‘I want to be good to China’ after Pentagon previously warned China may attempt takeover of Taiwan</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has expressed doubt on Monday that <a href=\"https://www.theguardian.com/world/china\">China</a> would invade <a href=\"https://www.theguardian.com/world/taiwan\">Taiwan</a> as he voiced confidence in his relationship with his Chinese counterpart, <a href=\"https://www.theguardian.com/world/xi-jinping\">Xi Jinping</a>, whom he will meet later this month.</p><p>Trump was asked about an earlier Pentagon assessment that Xi could <a href=\"https://www.theguardian.com/world/2021/mar/10/china-could-invade-taiwan-in-next-six-years-top-us-admiral-warns\">in the next six years attempt to seize Taiwan,</a> a self-governing democracy claimed by China.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/20/trump-china-taiwan-invasion-xi-jinping\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brazil greenlights oil drilling in Amazon as environmentalists raise alarm",
      "link": "https://www.theguardian.com/world/2025/oct/20/brazil-greenlights-oil-drilling-amazon",
      "pub_time_taipei": "2025-10-21T01:36:25+08:00",
      "summary": "<p>Conservationists argue president’s oil expansion plans clash with his image as a global leader on climate change</p><p><a href=\"https://www.theguardian.com/world/brazil\">Brazil’s</a> Petrobras has been given permission to drill for oil near the mouth of the Amazon River, casting a shadow over the country’s green ambitions as it prepares to host UN climate talks.</p><p>Luiz Inácio Lula da Silva, the president, has come under fire from conservationists who argue his oil expansion plans clash with his image as a global leader on climate change.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/brazil-greenlights-oil-drilling-amazon\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Israel will disarm Hamas and demilitarise Gaza, says Netanyahu",
      "link": "https://www.theguardian.com/world/2025/oct/20/israel-will-disarm-hamas-and-demilitarise-gaza-says-netanyahu",
      "pub_time_taipei": "2025-10-21T01:00:59+08:00",
      "summary": "<p>US seeks to downplay seriousness of attacks over weekend as Palestinian officials arrive in Cairo for further peace talks</p><p>The Israeli prime minister, Benjamin Netanyahu, said he is committed to disarming Hamas and demilitarising the Gaza Strip during a speech before the Knesset on Monday, as Palestinian officials arrived in Cairo for further peace negotiations.</p><p>In his speech, Netanyahu said that the current deal provided for the return of all Israeli hostages, the Israeli military’s control over the majority of Gaza’s territory and an internationally backed consensus that Hamas would be disarmed.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/israel-will-disarm-hamas-and-demilitarise-gaza-says-netanyahu\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hamas says it will hand over another hostage body as tensions over truce continue – as it happened",
      "link": "https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates",
      "pub_time_taipei": "2025-10-21T00:57:19+08:00",
      "summary": "<p>Group says it will release body on Monday evening as delay in returning hostage remains causes outrage in Israel. This live blog is closed</p><p>The Guardian’s global affairs correspondent, <a href=\"https://www.theguardian.com/profile/roth-andrew\">Andrew Roth</a>, has written <a href=\"https://www.theguardian.com/news/ng-interactive/2025/oct/19/the-enormous-conflict-of-interest-at-centre-of-jared-kushners-gaza-ceasefire-deal\">an interesting profile</a> on <strong>Jared Kushner</strong> in which he explores his central role in the ceasefire negotiations and his extensive business dealings in the Middle East. Here is a snippet:</p><p><em>The soft-spoken heir to his father’s real estate empire has quietly become a key conduit for Trump’s outreach to the Middle East, leveraging his Rolodex of leaders in the region and positioning himself to win a lucrative windfall if the goal of redeveloping Gaza ever comes to fruition.</em></p><p><em>It has been a notable return to the political fold after Kushner and his wife, Ivanka Trump, effectively swore off politics after the January 6 riots at the US Capitol that followed Trump’s loss in the 2020 elections.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Colombia recalls US ambassador amid spat with Trump over strikes on alleged drug boats",
      "link": "https://www.theguardian.com/world/2025/oct/20/colombia-recalls-us-ambassador-trump",
      "pub_time_taipei": "2025-10-21T00:23:33+08:00",
      "summary": "<p>Feud casts doubt on future of counter-narcotics and security cooperation between two countries, analysts warn</p><p>Colombia has recalled its ambassador to Washington amid a furious war of words between the Colombian president, Gustavo Petro, and Donald Trump over deadly US strikes on boats in the Caribbean.</p><p>The row took a sharp turn this weekend when Petro accused the US of “murdering” a Colombian fisher in an attack on a vessel in its territorial waters. Petro and his administration said the mid-September strike was a “<a href=\"https://www.cancilleria.gov.co/newsroom/news/comunicado-prensa-39\">direct threat to national sovereignty</a>” and that the <a href=\"https://x.com/petrogustavo/status/1979952036860113284\">victim was</a> a “lifelong fisherman” and a “humble human being”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/colombia-recalls-us-ambassador-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least 135 mutilated bodies of Palestinians had been held at notorious Israeli jail, say Gaza officials",
      "link": "https://www.theguardian.com/world/2025/oct/20/mutilated-bodies-palestinians-held-notorious-israeli-jail-gaza-officials",
      "pub_time_taipei": "2025-10-20T23:09:29+08:00",
      "summary": "<p>Documents indicate they came from Sde Teiman, which already faces allegations of torture and unlawful deaths</p><p>At least 135 mutilated bodies of Palestinians returned by Israel to Gaza had been held in a notorious detention centre already facing allegations of torture and unlawful deaths in custody, officials from Gaza’s health ministry have told the Guardian.</p><p>The director general of the health ministry, Dr Munir al-Bursh, and a spokesperson for Nasser hospital in Khan Younis, where the bodies are being examined, said a <a href=\"https://edition.cnn.com/2025/10/17/middleeast/unidentified-palestinian-bodies-handed-over-by-israel-intl\">document found inside each body bag</a> indicated the bodies all came from Sde Teiman, a military base in the Negev desert where, according to photos and testimonies <a href=\"https://www.theguardian.com/world/article/2024/may/23/whistleblowers-allege-widespread-abuses-at-israeli-detention-camp-sde-teiman\">published by the Guardian last year</a>, Palestinian detainees were held in cages, blindfolded and handcuffed, shackled to hospital beds and forced to wear nappies.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/mutilated-bodies-palestinians-held-notorious-israeli-jail-gaza-officials\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘I wanted to do something more meaningful’: the Chinese nationals fighting for Ukraine",
      "link": "https://www.theguardian.com/world/2025/oct/20/i-was-doing-nothing-at-home-the-chinese-nationals-fighting-for-ukraine",
      "pub_time_taipei": "2025-10-20T22:50:30+08:00",
      "summary": "<p>Volunteers defy their government and public opinion in China to risk their lives for an adversary of Beijing’s main geopolitical partner</p><p>In a war that has been characterised by merciless attacks on civilians, one of the worst took place on 8 July 2024. Russian missile strikes <a href=\"https://ukraine.ohchr.org/sites/default/files/2024-08/Ukraine%20-%20protection%20of%20civilians%20in%20armed%20conflict%20%28July%202024%29_ENG.pdf\">killed at least 43 people</a> in cities across Ukraine in one of the deadliest days of the war last year. One of the most shocking blows was to the <a href=\"https://www.theguardian.com/world/article/2024/jul/08/ukraine-horror-russian-bombing-kyiv-childrens-hospital\">Okhmatdyt children’s hospital in central Kyiv</a>, which reduced the country’s largest paediatric clinic to rubble.</p><p>Tim, 43, was delivering aid on the outskirts of Kyiv when he heard a missile fly overhead. A short while later, he saw the news on his phone that the children’s hospital had been hit. Along with a British friend, the Chinese national, who asked to be referred to by just his English name, rushed to the scene to help with the recovery efforts. “Seeing the severed limbs, some of them belonging to children, I started crying,” the father-of-two said, tears in his eyes at the memory. “I thought about the kind of anger that Chinese people have. Once it’s ignited … It’s intense. I decided to join the army.”</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/i-was-doing-nothing-at-home-the-chinese-nationals-fighting-for-ukraine\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Argentina formalizes $20bn currency swap deal with US",
      "link": "https://www.theguardian.com/world/2025/oct/20/argentina-us-currency-swap-bailout",
      "pub_time_taipei": "2025-10-20T22:36:18+08:00",
      "summary": "<p>Bailout by Trump attempts to stabilize shaky economy under Javier Milei as he faces mounting midterms pressure</p><p><a href=\"https://www.theguardian.com/world/argentina\">Argentina</a> has formalized a currency swap agreement with the United States for up to $20bn aimed “at contributing to Argentina’s economic stability”, the South American country’s central bank said.</p><p>The deal is part of huge financial support from the administration of <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>, a strong backer of the Argentinian president, <a href=\"https://www.theguardian.com/world/javier-milei\">Javier Milei</a>, who is <a href=\"https://www.theguardian.com/world/2025/oct/07/javier-milei-argentina-economy\">under pressure</a> ahead of midterm elections on 26 October.</p> <a href=\"https://www.theguardian.com/world/2025/oct/20/argentina-us-currency-swap-bailout\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Police hunt Louvre jewel thieves as questions swirl over museum’s security",
      "link": "https://www.washingtonpost.com/world/2025/10/20/louvre-museum-france-paris-robbery-investigation/",
      "pub_time_taipei": "2025-10-20T21:28:15+08:00",
      "summary": "Thieves broke into the Louvre Museum in Paris and stole thousands of diamonds and other precious jewels, prompting questions about the museum’s security."
    },
    {
      "source": "華盛頓郵報",
      "title": "In tense meeting, Trump told Zelensky to concede land, meet Putin’s demands",
      "link": "https://www.washingtonpost.com/world/2025/10/20/zelensky-trump-meeting-europe-russia/",
      "pub_time_taipei": "2025-10-20T21:00:13+08:00",
      "summary": "In an often fraught encounter, Trump told Zelensky to accept Putin’s terms to end the war, according to people familiar with the meeting."
    },
    {
      "source": "華盛頓郵報",
      "title": "China’s economy grows at slowest pace in a year as trade war bites",
      "link": "https://www.washingtonpost.com/world/2025/10/20/china-economy-gdp-growth/",
      "pub_time_taipei": "2025-10-20T20:44:20+08:00",
      "summary": "Official data put the annual growth rate at 4.8 percent, a sobering number for Chinese Communist Party leaders as they begin an important planning meeting."
    }
  ]
}