{
  "mode": "last_24h",
  "window_start_taipei": "2025-10-16T20:40:05.637588+08:00",
  "window_end_taipei": "2025-10-17T20:40:05.637588+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Infectious diseases in Gaza ‘spiralling out of control’, says WHO – Middle East live",
      "link": "https://www.theguardian.com/world/live/2025/oct/17/israel-gaza-ceasefire-hostages-hamas-benjamin-netanyahu-middle-east-latest-news-updates",
      "pub_time_taipei": "2025-10-17T20:22:09+08:00",
      "summary": "<p>UN official says: ‘Whether meningitis … diarrhoea, respiratory illnesses, we’re talking about a mammoth amount of work’</p><p>We’ve got a bit more from the UN’s World Food Programme on the situation in Gaza.</p><p>WFP spokeswoman Abeer Etefa told a media briefing in Geneva that, from Saturday until Wednesday, around 230 trucks with 2,800 tonnes of food supplies crossed into Gaza.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/17/israel-gaza-ceasefire-hostages-hamas-benjamin-netanyahu-middle-east-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hungary to ensure Putin can enter Budapest for summit with Trump – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/oct/17/viktor-orban-vladimir-putin-volodymyr-zelenskyy-donald-trump-europe-latest-news-updates-russia-ukraine-war",
      "pub_time_taipei": "2025-10-17T20:21:09+08:00",
      "summary": "<p>Russian president is facing arrest warrrant from International Criminal Court for war crimes</p><p><strong>‘The key to success is in the sky’: the Ukrainian defenders struggling to stem Russia’s air assault</strong></p><p>First came the sound of drones. Then a boom that rattled windows. Shortly after that, two columns of black smoke rose over the Shebelinka gas processing plant in Ukraine’s Kharkiv region. Towering flames threatened storage tanks.</p> <a href=\"https://www.theguardian.com/world/live/2025/oct/17/viktor-orban-vladimir-putin-volodymyr-zelenskyy-donald-trump-europe-latest-news-updates-russia-ukraine-war\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "John Bolton expected to surrender to authorities on Friday after being indicted – US politics live",
      "link": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
      "pub_time_taipei": "2025-10-17T20:20:59+08:00",
      "summary": "<p>Eighteen-count indictment of former Trump adviser handed down by federal grand jury in Maryland as US president calls ex-ally a ‘bad guy’</p><p><strong>The <a href=\"https://www.theguardian.com/us-news/us-senate\">US Senate</a> failed on Thursday to re-open the government and to vote to fund the military during the federal government shutdown, ensuring that the standoff will stretch into next week.</strong></p><p>The Senate vote on a short-term <a href=\"https://www.theguardian.com/us-news/republicans\">Republican</a> funding bill failed for the 10th time with just 51 votes. A second vote on Pentagon funding in the afternoon similarly failed in a floor vote, meaning the process to begin fully funding military operations also becomes a non-starter. After the votes, senators are expected to leave Washington for the weekend, almost guaranteeing the shutdown lasts until at least Monday.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Global markets fall and gold hits record high amid jitters over US banks",
      "link": "https://www.theguardian.com/business/2025/oct/17/global-stock-markets-fall-and-gold-hits-record-high-amid-jitters-over-us-banks",
      "pub_time_taipei": "2025-10-17T20:18:55+08:00",
      "summary": "<p>Signs of credit stress send markets in Europe and Asia down, while investors turn to safe haven assets</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/oct/17/us-dollar-worst-week-since-august-trade-tensions-stock-markets-bonds-business-live-news\">Business live – latest updates</a></p><p></p></li></ul><p>Global stock markets fell sharply and gold hit a record high after two US regional banks said they had been exposed to <a href=\"https://www.theguardian.com/business/2025/oct/16/us-regional-bank-stocks-fall\">millions of dollars of bad loans and alleged fraud</a>.</p><p>Signs of credit stress rattled markets across Europe and Asia. In London the FTSE 100 fell 1.5%, Germany’s Dax fell 2%, the Ibex in Spain was off 0.8% and France’s Cac 40 dropped 1.5%, before recovering some ground.</p> <a href=\"https://www.theguardian.com/business/2025/oct/17/global-stock-markets-fall-and-gold-hits-record-high-amid-jitters-over-us-banks\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gaza aid still critically scarce, say agencies, as Israel delays convoys",
      "link": "https://www.theguardian.com/world/2025/oct/17/gaza-aid-still-critically-scarce-say-agencies-as-israel-delays-convoys",
      "pub_time_taipei": "2025-10-17T20:14:07+08:00",
      "summary": "<p>UN urges opening of all crossing points as fewer than half of intended trucks enter strip and WHO warns of ‘spiralling’ disease</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/17/israel-gaza-ceasefire-hostages-hamas-benjamin-netanyahu-middle-east-latest-news-updates\">Middle East crisis – live updates</a></p></li></ul><p>Aid remains critically scarce in Gaza one week into the ceasefire, humanitarian agencies have warned, as Israel delays the entry of food convoys into the territory. The Israeli government and Hamas continue to trade blame over violations of the truce.</p><p>The UN World Food Programme (WFP) said on Friday that it had brought about 560 tonnes of food per day on average into Gaza since the ceasefire began, but it was still below what was needed.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/gaza-aid-still-critically-scarce-say-agencies-as-israel-delays-convoys\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "No 10 says talks happening ‘at pace’ across government to lift ban on Maccabi Tel Aviv fans attending Aston Villa match – live",
      "link": "https://www.theguardian.com/politics/live/2025/oct/17/keir-starmer-uk-politics-latest-news-updates-maccabi-tel-aviv-fans-banned",
      "pub_time_taipei": "2025-10-17T20:09:15+08:00",
      "summary": "<p>Fans of Israeli football team Maccabi Tel Aviv banned from match at Aston Villa next month</p><p><strong>Zarah Sultana</strong>, the former Labour MP who is now a member of the Independent Alliance in parliament, alongside Ayoub Khan and four others, has also defended the Maccabi ban on the grounds that Israeli teams should not be competing in international sport. She <a href=\"https://x.com/zarahsultana/status/1978941801646973159\">says</a>:</p><p>Next UEFA must ban all Israeli teams.</p><p>We cannot have normalisation with genocide and apartheid.</p><p>Apartheid South Africa was banned from the Olympics for 32 years.</p><p>The same people who called Nelson Mandela a “terrorist” now say we can’t boycott apartheid Israel.</p><p>There are two distinct issues.<em> </em>One is the safety aspect … If the police in West Midlands find it challenging because they simply do not have the resources to ensure safety, then that’s one aspect.</p><p>The second aspect is a moral argument that Maccabi Tel Aviv should not even be playing in this international competition.</p> <a href=\"https://www.theguardian.com/politics/live/2025/oct/17/keir-starmer-uk-politics-latest-news-updates-maccabi-tel-aviv-fans-banned\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Manhattan district attorney works to curb interstate gun trafficking: ‘It’s a national issue’",
      "link": "https://www.theguardian.com/us-news/2025/oct/17/alvin-bragg-prosecutors-against-gun-violence",
      "pub_time_taipei": "2025-10-17T20:00:17+08:00",
      "summary": "<p>Alvin Bragg was appointed co-chair of Prosecutors Against Gun Violence and sets sights on addressing flow of guns</p><p>At a time of intense focus on high-profile and local incidents of gun violence in the US, Alvin Bragg, the Manhattan district attorney, has been appointed to help lead Prosecutors Against Gun Violence (PAGV), a national group that has been trying to decrease shootings and violence since 2014.</p><p>Bragg says he plans to bring his “big city experience” to the national group, and wants to collaborate with his peers to address interstate gun trafficking.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/17/alvin-bragg-prosecutors-against-gun-violence\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Gavin Newsom’s veto on bill to ban Pfas hands industry a win, advocates fear",
      "link": "https://www.theguardian.com/environment/2025/oct/17/gavin-newsoms-veto-on-bill-to-ban-pfas-hands-industry-a-win-advocates-fear",
      "pub_time_taipei": "2025-10-17T20:00:16+08:00",
      "summary": "<p>Decision from governor, eyeing presidential bid, could echo across US as similar bans considered in states like New York</p><ul><li><p><a href=\"https://www.theguardian.com/global/2025/jan/03/pfas-forever-chemicals\">Are Pfas in everything? What you need to know about ‘forever chemicals’</a></p></li></ul><p>A decision by <a href=\"https://www.theguardian.com/us-news/gavin-newsom\">Gavin Newsom</a>, the <a href=\"https://www.theguardian.com/us-news/california\">California</a> governor, to <a href=\"https://www.theguardian.com/us-news/2025/oct/14/california-pfas-ban-gavin-newsom\">veto</a> a bill that would have banned the sale of cookware and some other consumer products made with toxic Pfas “forever chemicals” may reverberate across the US by slowing or killing similar legislation in other states, public health advocates fear.</p><p>California is often looked to for guidance by other states considering new environmental rules, and some legislatures, including large states like New York and Illinois, are weighing bans on Pfas in cookware.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/17/gavin-newsoms-veto-on-bill-to-ban-pfas-hands-industry-a-win-advocates-fear\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Laurence Fox’s libel claim over racism accusations to go to retrial",
      "link": "https://www.theguardian.com/culture/2025/oct/17/laurence-fox-social-media-libel-claim-goes-to-retrial-after-court-of-appeal-ruling",
      "pub_time_taipei": "2025-10-17T19:55:55+08:00",
      "summary": "<p>Court of appeal rules in former actor’s favour after finding tweets calling him racist did cause harm to his reputation</p><p>Laurence Fox’s libel claim after he was called a racist on social media will go to a retrial, the court of appeal has ruled.</p><p>The <a href=\"https://www.theguardian.com/culture/2024/jan/29/laurence-fox-loses-libel-battle-with-twitter-x-users-he-called-paedophiles\">former actor was successfully sued</a> by Simon Blake, who is now the chief executive of Stonewall, and the drag artist Crystal over a row on the social media platform Twitter, now called X.</p> <a href=\"https://www.theguardian.com/culture/2025/oct/17/laurence-fox-social-media-libel-claim-goes-to-retrial-after-court-of-appeal-ruling\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Italian investigative journalism TV host targeted in bomb attack near Rome",
      "link": "https://www.theguardian.com/world/2025/oct/17/italian-investigative-journalist-bomb-attack-sigfrido-ranucci",
      "pub_time_taipei": "2025-10-17T19:47:35+08:00",
      "summary": "<p>Rudimentary but powerful device planted outside home of Report presenter Sigfrido Ranucci in Campo Ascolano</p><p>A prominent Italian investigative journalist has been targeted in a bomb attack, with the rudimentary but powerful device almost destroying his car and damaging a neighbour’s home.</p><p>Sigfrido Ranucci, who hosts Report, an investigative programme aired by the state broadcaster, Rai, said the explosion happened about 20 minutes after he returned to his home in Campo Ascolano, close to Rome, on Thursday night.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/italian-investigative-journalist-bomb-attack-sigfrido-ranucci\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Son of Mango fashion chain founder allegedly a suspect over tycoon’s death",
      "link": "https://www.theguardian.com/world/2025/oct/17/fashion-tycoons-son-allegedly-a-suspect-over-his-death-on-hiking-trip",
      "pub_time_taipei": "2025-10-17T19:42:40+08:00",
      "summary": "<p>Isak Andic died in plunge down ravine near Barcelona</p><p>The family of Isak Andic, the founder of the fashion chain Mango, have insisted on his son’s innocence after media reports suggested he was a potential suspect over the billionaire’s death.</p><p>Andic, who was 71, died last December after apparently falling 100 metres down a ravine while hiking at Montserrat near Barcelona with his son, Jonathan. His death prompted <a href=\"https://www.theguardian.com/world/2024/dec/15/tributes-paid-to-mango-founder-isak-andic-after-his-death\">tributes from politicians, journalists and the fashion world</a>.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/fashion-tycoons-son-allegedly-a-suspect-over-his-death-on-hiking-trip\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Legal challenge to Palestine Action ban can go ahead, court rules",
      "link": "https://www.theguardian.com/uk-news/2025/oct/17/legal-challenge-to-palestine-action-ban-can-go-ahead-court-rules",
      "pub_time_taipei": "2025-10-17T19:40:15+08:00",
      "summary": "<p>Judges reject Home Office attempt to block judicial review of group’s proscription under Terrorism Act</p><p>A legal challenge to the ban on Palestine Action can go ahead next month after the court of appeal rejected the Home Office’s attempt to block the case.</p><p>On Friday, three judges, led by the lady chief justice, upheld <a href=\"https://www.theguardian.com/uk-news/2025/jul/30/palestine-action-co-founder-wins-permission-to-challenge-ban\">Mr Justice Chamberlain’s decision</a> to grant the Palestine Action co-founder Huda Ammori a judicial review of the group’s proscription under the Terrorism Act.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/17/legal-challenge-to-palestine-action-ban-can-go-ahead-court-rules\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ex-Trump adviser John Bolton indicted on charges of mishandling classified information",
      "link": "https://www.theguardian.com/us-news/2025/oct/16/john-bolton-indictment-trump",
      "pub_time_taipei": "2025-10-17T19:23:22+08:00",
      "summary": "<p>Ex-national security adviser turned Trump critic expected to surrender to authorities Friday </p><p>John Bolton, the former national security adviser to Donald Trump who has since become one of the US president’s biggest Republican critics, was expected to surrender to the authorities on Friday and make an initial appearance in court to face criminal charges that he mishandled classified information.</p><p>The justice department filed federal charges against Bolton, accusing him of transmitting and retaining highly classified information under the Espionage Act.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/16/john-bolton-indictment-trump\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Barnaby Joyce actively considering defection to One Nation, say Coalition sources",
      "link": "https://www.theguardian.com/australia-news/2025/oct/17/barnaby-joyce-actively-considering-defection-to-one-nation-say-coalition-sources",
      "pub_time_taipei": "2025-10-17T19:18:59+08:00",
      "summary": "<p>Former Nationals leader has not commented on reports but any defection would be a blow for his party and the Coalition under Sussan Ley</p><ul><li><p><strong>Get our </strong><a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\"><strong>breaking news email</strong></a><strong>, </strong><a href=\"https://app.adjust.com/w4u7jx3\"><strong>free app</strong></a><strong> or </strong><a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\"><strong>daily news podcast</strong></a></p></li></ul><p>Former Nationals leader, Barnaby Joyce, is actively considering defecting to One Nation, according to Coalition figures, days after founder Pauline Hanson said Liberal and National party members believed they had no future.</p><p>A One Nation spokesperson declined to comment on <a href=\"https://www.theaustralian.com.au/nation/politics/barnaby-joyce-mulls-one-nation-move-after-talks-with-pauline-hanson/news-story/482dbd8ab06818073635433540a93988\">media reports on Friday</a>, or whether Hanson had spoken to Joyce about his party allegiance. The spokesman did not deny advance discussions had taken place.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/17/barnaby-joyce-actively-considering-defection-to-one-nation-say-coalition-sources\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump plans Putin summit on Ukraine, raising stakes for Zelensky meeting",
      "link": "https://www.washingtonpost.com/politics/2025/10/16/trump-buoyed-by-gaza-deal-plans-putin-summit-ukraine-peace/",
      "pub_time_taipei": "2025-10-17T19:10:07+08:00",
      "summary": "The call with Putin came right before his meeting with Zelensky where the Ukrainian leader was hoping to obtain new long-range weaponry to use against Russia."
    },
    {
      "source": "衛報",
      "title": "Government U-turns on support for bird-friendly swift bricks in new homes",
      "link": "https://www.theguardian.com/environment/2025/oct/17/government-u-turns-on-support-for-bird-friendly-swift-bricks-in-new-homes",
      "pub_time_taipei": "2025-10-17T19:09:14+08:00",
      "summary": "<p>Housing minister Steve Reed refuses to back mandating measure, despite giving support while in environment job</p><p>The government is refusing to support a new amendment to install a swift brick in every new home – a U-turn by Steve Reed since he became housing secretary.</p><p>When he was environment secretary, Reed told a campaigner, Hannah Bourne-Taylor, she was “pushing at an open door” and he and others wanted to add to the party’s manifesto her proposal that developers must include a £35 hollow brick in every new home.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/17/government-u-turns-on-support-for-bird-friendly-swift-bricks-in-new-homes\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Would Tomahawk cruise missiles be a game changer for Ukraine?",
      "link": "https://www.washingtonpost.com/national-security/2025/10/17/ukraine-tomahawk-russia-typhon-launcher/",
      "pub_time_taipei": "2025-10-17T19:05:35+08:00",
      "summary": "President Donald Trump says he is considering sending the long-range weapon to Ukraine for strikes deep inside Russian territory."
    },
    {
      "source": "衛報",
      "title": "Former Trump adviser John Bolton indicted on charges of mishandling classified information | First Thing",
      "link": "https://www.theguardian.com/us-news/2025/oct/17/first-thing-john-bolton-indicted-trump-adviser",
      "pub_time_taipei": "2025-10-17T19:04:34+08:00",
      "summary": "<p>Eighteen-count indictment handed down as US president calls former ally a ‘bad guy’. Plus, director Kathryn Bigelow on AI, Andy Warhol and nuclear Armageddon</p><p>• <a href=\"https://www.theguardian.com/info/2018/sep/17/guardian-us-morning-briefing-sign-up-to-stay-informed\"><strong>Don’t already get First Thing in your inbox? Sign up here</strong></a></p><p>Good morning.</p><p>The justice department has <a href=\"https://www.theguardian.com/us-news/2025/oct/16/john-bolton-indictment-trump\">filed federal charges against John Bolton</a>, the former national security adviser to Donald Trump who became one of his biggest critics. Bolton is accused of transmitting and retaining highly classified information under the Espionage Act.</p><p><strong>What did Trump say about the charges?</strong> In response to a question about the charges, Trump told reporters on Thursday that he was not aware of them but that Bolton was a “bad guy”.</p><p><strong>What has Trump said?</strong> In a presidential memo, Trump said the government needed to “investigate and disrupt networks, entities, and organizations that foment political violence”, adding a comment that Soros was at “the top of everything”.</p><p><strong>What has OSF said?</strong> “We have always and will continue to adhere to our rigorous compliance practices and operate within the bounds of the law while also refusing to surrender our legal and constitutional rights to free speech, association, due process, and the rule of law without challenge,” an OSF spokesperson said.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/17/first-thing-john-bolton-indicted-trump-adviser\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "King Charles to be first reigning English monarch in 500 years to pray publicly with pope",
      "link": "https://www.theguardian.com/uk-news/2025/oct/17/king-charles-first-reigning-english-monarch-500-years-pray-publicly-pope",
      "pub_time_taipei": "2025-10-17T19:00:56+08:00",
      "summary": "<p>Monarch will join Pope Leo XIV at an ecumenical service in Sistine Chapel during visit to the Vatican next month</p><p>King Charles will become the first reigning English monarch since Henry VIII split from Rome in 1534 to pray publicly with a pope during his state visit to the Holy See next week.</p><p>The king will join Pope Leo XIV at an ecumenical service in the Sistine Chapel during his visit with the queen to the Vatican on 22-23 October, a gesture regarded as a “significant moment” in relations between the Catholic church and the Church of England, of which Charles is supreme governor.</p> <a href=\"https://www.theguardian.com/uk-news/2025/oct/17/king-charles-first-reigning-english-monarch-500-years-pray-publicly-pope\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US anti-vax stance to blame for continent-wide surge in measles, say experts",
      "link": "https://www.theguardian.com/global-development/2025/oct/17/health-infectious-diseases-vaccination-measles-us-robert-kennedy-latin-america-antivax-blamed-cases-deaths-rise",
      "pub_time_taipei": "2025-10-17T19:00:55+08:00",
      "summary": "<p>The disease was eliminated across the Americas in 2024, but urgent vaccination drives are now under way as cases rise from Mexico to Bolivia after outbreaks farther north</p><p>Governments across Latin America are stepping up efforts to vaccinate their populations against measles, as outbreaks in North America drive a <a href=\"https://www.paho.org/en/news/15-8-2025-ten-countries-americas-report-measles-outbreaks-2025\">34-fold increase in the number of cases</a> reported in the region this year.</p><p><a href=\"https://www.weforum.org/stories/2025/09/measles-cases-rising-health-vaccines/\">Measles cases have surged worldwide</a> to a 25-year high, due to low vaccine coverage and the spread of misinformation about vaccine safety. However, there is added concern in parts of Latin America over unequal access to healthcare and the worrying situation in the US, which is facing its worst measles outbreak in decades following <a href=\"https://www.theguardian.com/us-news/2025/oct/09/cdc-separate-mmr-vaccines\">a reversal of vaccine policy</a> led by Donald Trump’s health secretary, Robert F Kennedy Jr.</p> <a href=\"https://www.theguardian.com/global-development/2025/oct/17/health-infectious-diseases-vaccination-measles-us-robert-kennedy-latin-america-antivax-blamed-cases-deaths-rise\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "China threatens UK with ‘consequences’ over delayed London mega embassy",
      "link": "https://www.theguardian.com/world/2025/oct/17/china-accuses-uk-of-bad-faith-over-delayed-embassy-project",
      "pub_time_taipei": "2025-10-17T18:37:08+08:00",
      "summary": "<p>Diplomatic tensions escalate amid rows over planning hold-ups and collapse of spying trial</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/oct/17/keir-starmer-uk-politics-latest-news-updates-maccabi-tel-aviv-fans-banned\">UK politics live – latest updates</a></p><p></p></li></ul><p>Tensions between Britain and China have escalated after Beijing criticised further delays to a planning decision on its proposed <a href=\"https://www.theguardian.com/world/2025/oct/04/china-mega-embassy-dilemma-starmer\">“mega embassy”</a> in London.</p><p>China’s ministry of foreign affairs expressed “grave concern and strong dissatisfaction” after Steve Reed, the housing secretary, pushed back his final decision on the proposal until 10 December.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/china-accuses-uk-of-bad-faith-over-delayed-embassy-project\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Weather tracker: Japanese islands struck by two successive typhoons",
      "link": "https://www.theguardian.com/world/2025/oct/17/weather-tracker-japan-izu-islands-typhoon-nakri-halong",
      "pub_time_taipei": "2025-10-17T17:22:49+08:00",
      "summary": "<p>Typhoon Nakri sweeps through Izu Islands off Tokyo, a week after Halong, causing damage and disruption</p><p>The Izu Islands in Japan have endured another powerful blow as Typhoon Nakri swept through on Monday, following in the footsteps of Typhoon Halong, which struck a week earlier.</p><p>Officials on Hachijojima Island, south of Tokyo, reported disruption and damage to about 220 homes after the storm brought 37mm (1.5in) of rain in one hour and gusts of up to 95mph (152km/h). Airport operations were disrupted, infrastructure damaged, and heavy rainfall caused landslides across the island chain. The typhoon also generated 9-metre waves, creating dangerous coastal conditions. Off the Pacific coast in Oiso, in Kanagawa prefecture, three men were swept away while fishing, one of whom has been confirmed dead.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/weather-tracker-japan-izu-islands-typhoon-nakri-halong\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Israel’s last living hostages describe trauma of Hamas captivity",
      "link": "https://www.washingtonpost.com/world/2025/10/17/israel-gaza-released-hostages/",
      "pub_time_taipei": "2025-10-17T17:00:57+08:00",
      "summary": "Israeli hospitals are treating the former captives, freed this week as part of the ceasefire deal, according to protocols honed over two years of hostage releases."
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump tariffs bring India’s massive garment industry to its knees",
      "link": "https://www.washingtonpost.com/world/2025/10/17/india-trump-tariffs-modi-manufacturing/",
      "pub_time_taipei": "2025-10-17T17:00:17+08:00",
      "summary": "Just seven weeks after Trump imposed a 50 percent tariff on India, many of Tiruppur’s garment factories have ground to a halt, putting thousands out of work."
    },
    {
      "source": "衛報",
      "title": "‘The key to success is in the sky’: the Ukrainian defenders struggling to stem Russia’s air assault",
      "link": "https://www.theguardian.com/world/2025/oct/17/ukrainian-defenders-struggling-to-stem-russia-air-assault",
      "pub_time_taipei": "2025-10-17T16:59:31+08:00",
      "summary": "<p>War in the air is becoming increasingly significant as conflict on the ground becomes bogged down</p><p>First came the sound of drones. Then a boom that rattled windows. Shortly after that, two columns of black smoke rose over the Shebelinka gas processing plant in Ukraine’s Kharkiv region. Towering flames threatened storage tanks.</p><p>A refinery worker emerged from the site. <a href=\"https://www.theguardian.com/world/2025/oct/16/russia-strikes-ukraine-gas-sites-zelenskyy-us-trump-meeting-cruise-missiles\">Russian drones and missiles had struck the plant</a> at 4.30am, he said. For now there was nothing for the fire crews to do but to stand back and watch.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/ukrainian-defenders-struggling-to-stem-russia-air-assault\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Sydney gay nightclub apologises after backlash over ‘Pink Pony’ name referencing lesbian pop hit",
      "link": "https://www.theguardian.com/australia-news/2025/oct/17/sydney-gay-nightclub-apologises-backlash-chappell-roan-pink-pony-name-lesbian-pop-hit",
      "pub_time_taipei": "2025-10-17T16:43:12+08:00",
      "summary": "<p>Owner and manager of venue which will be renamed say original decision was ‘error of judgment’ with mention of ‘preferred mix’ described as ‘tone deaf and hurtful’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A new gay nightclub in Sydney that was forced to change its name referencing a song by US lesbian popstar Chappell Roan has apologised for “any hurt caused” to the LGBTQ+ community.</p><p>The venue, which was to be named “Pink Pony”, also said nominating its preferred clientele as young gay men was “tone deaf and hurtful”.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/17/sydney-gay-nightclub-apologises-backlash-chappell-roan-pink-pony-name-lesbian-pop-hit\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Open AI breaks ranks with Tech Council of Australia over heated copyright issue",
      "link": "https://www.theguardian.com/australia-news/2025/oct/17/open-ai-breaks-ranks-with-tech-council-australia-over-copyright-restrictions",
      "pub_time_taipei": "2025-10-17T15:33:47+08:00",
      "summary": "<p>Chief global affairs officer of company behind ChatGPT tells Sydney audience ‘we are going to be in Australia, one way or the other’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Open AI has broken ranks with the Tech Council of Australia over copyright restrictions, declaring that its artificial intelligence models are “going to be in Australia, one way or the other”.</p><p>Chris Lehane, the chief global affairs officer of the artificial intelligence company responsible for ChatGPT, made a keynote appearance at SXSW Sydney on Friday, where he covered the geopolitics of AI, Australia’s tech future – and the global debate around using copyrighted material to train large language models.</p> <a href=\"https://www.theguardian.com/australia-news/2025/oct/17/open-ai-breaks-ranks-with-tech-council-australia-over-copyright-restrictions\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "The ‘messy’ trend behind Australia’s rising unemployment is worrying economists",
      "link": "https://www.theguardian.com/business/2025/oct/17/the-messy-trend-behind-australias-rising-unemployment-is-worrying-economists",
      "pub_time_taipei": "2025-10-17T14:33:50+08:00",
      "summary": "<p>The RBA is holding fire on further rate cuts until it is confident that inflation is easing. But the latest jobs data complicates matters</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>As <a href=\"https://www.theguardian.com/australia-news/jim-chalmers--australian-politician-\">Jim Chalmers</a> moves among the global elite during the G20 talkfest with fellow finance ministers and big-time investors in Washington this week, he will be spruiking Australia’s enviable economic performance over recent years.</p><p>A particular point of pride has been the strength of the labour market.</p> <a href=\"https://www.theguardian.com/business/2025/oct/17/the-messy-trend-behind-australias-rising-unemployment-is-worrying-economists\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Failed Liberal candidate for Kooyong to make tilt for state seat – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
      "pub_time_taipei": "2025-10-17T14:13:06+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/2025/oct/17/liberal-senator-says-she-is-too-fond-of-good-coffee-to-join-nationals-where-shed-have-to-talk-a-lot-slower\">Liberal senator says she is ‘too fond of good coffee’ to join Nationals where she’d ‘have to talk a lot slower’</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Hume: Ley describing Melbourne as Australia’s ‘crime capital’ just ‘explaining what every Victorian already knows’</strong></p><p>The federal<strong> </strong>Liberal senator for Victoria, <strong>Jane Hume</strong>, was on ABC Radio National a short time ago speaking about crime in the state.</p><p><em>Sussan and the shadow ministry team are putting together our policy agenda as we speak. It is only five months since the last election, but I don’t agree that there is nothing that a federal government cannot do. In fact, there are plenty of things that a federal government can get involved in to help states tackle crime, whether it be working for consistent bail laws across the country.</em></p> <a href=\"https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Hamas’s aim to retain authority in Gaza involves keeping the guns",
      "link": "https://www.theguardian.com/world/2025/oct/17/hamass-aim-to-retain-authority-in-gaza-involves-keeping-the-guns",
      "pub_time_taipei": "2025-10-17T13:01:02+08:00",
      "summary": "<p>With no law, order or any alternative administration under the ceasefire, the group is using violence to deter rivals</p><p>Throughout Israel’s two-year war in Gaza, aid officials working in the territory avoided naming Hamas in conversations they suspected might be intercepted, instead referring to the militant Islamist group as the “de facto authority”.</p><p>This careful euphemism for Hamas, which violently seized power in 2007, captured an important truth. Though the group was a less obvious presence in the last months of the conflict, in the absence of any alternative, it remained the closest the increasingly devastated territory had to a ruler.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/hamass-aim-to-retain-authority-in-gaza-involves-keeping-the-guns\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Peru to declare state of emergency after protests against new president leave one dead and dozens injured",
      "link": "https://www.theguardian.com/world/2025/oct/17/peru-protests-state-emergency-president-jose-jeri",
      "pub_time_taipei": "2025-10-17T12:46:41+08:00",
      "summary": "<p>Demonstrators clashed with police outside congress building amid public anger at crime crisis days after José Jerí assumed power </p><p>Peru is set to declare a state of emergency after at least one person was killed and dozens of police officers were injured in widespread protests against President José Jerí who assumed power just days ago.</p><p>Prime minister Ernesto Alvarez said late on Thursday that the government would declare the state of emergency in Lima within hours and is preparing a package of measures to tackle rising insecurity.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/peru-protests-state-emergency-president-jose-jeri\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Survivors reported after latest US attack on alleged drug boat in Caribbean",
      "link": "https://www.theguardian.com/us-news/2025/oct/16/survivors-attack-drug-boat-caribbean",
      "pub_time_taipei": "2025-10-17T09:12:51+08:00",
      "summary": "<p>It is unknown whether US military rendered aid to survivors after attack on suspected ‘narcoterrorist’ vessel</p><p>The <a href=\"https://www.theguardian.com/us-news/us-military\">US military</a> carried out a new strike on Thursday against a suspected drug vessel in the <a href=\"https://www.theguardian.com/world/caribbean\">Caribbean</a>, and in what is believed to be the first such case, there were survivors among the crew, a US official told Reuters.</p><p>The official, who spoke on condition of anonymity, did not offer additional details about the incident, which has not been previously reported. But it raises new questions, including whether the US military rendered aid to the survivors and whether they are now in US military custody.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/16/survivors-attack-drug-boat-caribbean\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘Wailing ghosts through loudspeakers’: Cambodia accuses Thailand of psychological warfare along border",
      "link": "https://www.theguardian.com/world/2025/oct/17/cambodia-accuses-thailand-psychological-warfare-border",
      "pub_time_taipei": "2025-10-17T08:38:20+08:00",
      "summary": "<p>Cambodia’s rights commission said ‘intense, high-pitched noises’ broadcast by Thai soldiers along the disputed border threatened to escalate tensions </p><p>Cambodia’s former leader Hun Sen has complained about Thailand broadcasting ghost-like sounds across a disputed border, while the country’s human rights commission has accused its neighbour of engaging in psychological warfare, despite both countries agreeing to a ceasefire in July.</p><p>Posting on Facebook, Hun Sen, 73, who now serves as Cambodia’s powerful senate president, said Cambodia’s human rights commission had complained to the United Nations about the “intense, high-pitched noises”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/17/cambodia-accuses-thailand-psychological-warfare-border\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Top military officer central to Trump’s drug war will step down early",
      "link": "https://www.washingtonpost.com/national-security/2025/10/16/alvin-holsey-venezuela-hegseth-trump/",
      "pub_time_taipei": "2025-10-17T07:30:34+08:00",
      "summary": "Adm. Alvin Holsey has served as the head of U.S. Southern Command for less than a year. The position typically rotates every three years."
    },
    {
      "source": "華盛頓郵報",
      "title": "Dispute over hostages’ bodies tests ceasefire as Israel buries its dead",
      "link": "https://www.washingtonpost.com/world/2025/10/16/israel-gaza-hamas-us-ceasefire-hostage-bodies/",
      "pub_time_taipei": "2025-10-17T05:39:56+08:00",
      "summary": "Hamas says finding the bodies of the remaining hostages requires special equipment it does not have. Israel says failing to return them would violate the ceasefire."
    },
    {
      "source": "華盛頓郵報",
      "title": "U.S. Special Operations helicopters, B-52s near Venezuela expand Caribbean mission",
      "link": "https://www.washingtonpost.com/national-security/2025/10/16/special-operations-helicopters-venezuela/",
      "pub_time_taipei": "2025-10-17T04:38:50+08:00",
      "summary": "U.S. Special Operations helicopters flew within 90 miles of Venezuelan territory, according to a Post analysis. Trump authorized CIA covert action inside the country."
    },
    {
      "source": "衛報",
      "title": "Israel and Hamas trade accusations as tensions rise over hostages’ remains",
      "link": "https://www.theguardian.com/world/2025/oct/16/hamas-hostage-bodies-recovered-amid-israel-gaza-fighting-ceasefire-deal",
      "pub_time_taipei": "2025-10-17T02:30:56+08:00",
      "summary": "<p>Militant group says it needs specialist equipment to recover bodies as Netanyahu says fight ‘is not over yet’</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/15/palestinian-leader-marwan-barghouti-assaulted-by-israeli-prison-guards-son-says\">Palestinian leader Marwan Barghouti assaulted by Israeli prison guards, son says</a></p></li></ul><p>Israel and Hamas have traded accusations of ceasefire violations amid tensions over the flow of aid into Gaza and warnings that the humanitarian crisis in the devastated territory risks deteriorating further.</p><p>The ceasefire deal signed last week between Israel and Hamas raised hopes of a surge of humanitarian aid finally reaching the territory after two years of war, but most restrictions have remained in place, throttling the supply of desperately needed assistance.</p> <a href=\"https://www.theguardian.com/world/2025/oct/16/hamas-hostage-bodies-recovered-amid-israel-gaza-fighting-ceasefire-deal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Brazil to ask countries at Cop30 to vastly increase biofuel use, leak suggests",
      "link": "https://www.theguardian.com/environment/2025/oct/16/brazil-ask-countries-quadruple-biofuel-use-leak-suggests",
      "pub_time_taipei": "2025-10-17T02:04:45+08:00",
      "summary": "<p>Exclusive: Document sets draft pledge for leaders gathering at climate summit to increase use of controversial fuels</p><p>Brazil will ask countries to quadruple the global use of “sustainable fuels”, including controversial biofuels, despite concerns from environmental experts, the Guardian has learned.</p><p>A leaked document seen by the Guardian sets out a draft pledge for world leaders gathering for the Cop30 climate conference next month in Brazil to increase the use of “sustainable fuels” – chiefly biofuels and biogas, but also hydrogen – in the next decade by four times compared with 2024 levels.</p><p>By 2030, biofuel crops would require land the size of France, which would make it equivalent to the sixth-largest country in terms of arable land use globally</p><p>A fifth of vegetable oil is used for cars rather than food.</p><p>That 3,000 litres of water are needed to drive 100km on biofuels.</p><p>That solar panels could create as much energy as biofuels while using just 3% as much land.</p> <a href=\"https://www.theguardian.com/environment/2025/oct/16/brazil-ask-countries-quadruple-biofuel-use-leak-suggests\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Trinidad citizens believed killed in US airstrike off Venezuela coast identified",
      "link": "https://www.theguardian.com/world/2025/oct/16/airstrike-venezuela-trinidad-us-death-investigation",
      "pub_time_taipei": "2025-10-17T01:46:23+08:00",
      "summary": "<p>Rishi Samaroo and Chad ‘Charpo’ Joseph believed to have been on boat Trump alleged was carrying drugs to US</p><p>Family members and neighbours have identified two men from <a href=\"https://www.theguardian.com/world/trinidad-and-tobago\">Trinidad and Tobago</a> who are believed to be among six people killed in a US airstrike on a boat allegedly transporting drugs from <a href=\"https://www.theguardian.com/world/venezuela\">Venezuela</a>.</p><p>Without providing evidence, <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> said on Tuesday that the strike in international waters had killed six “narcoterrorists” and claimed that “intelligence confirmed the vessel was trafficking narcotics” and it was “associated with illicit narcoterrorist networks”.</p> <a href=\"https://www.theguardian.com/world/2025/oct/16/airstrike-venezuela-trinidad-us-death-investigation\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Four dead as Kenyan security forces fire on crowds mourning Raila Odinga",
      "link": "https://www.theguardian.com/world/2025/oct/16/kenya-security-fire-on-crowds-mourning-raila-odinga",
      "pub_time_taipei": "2025-10-17T01:24:59+08:00",
      "summary": "<p>Thousands gather in Nairobi to pay respects to veteran opposition leader, prompting chaotic scenes at stadium</p><p>Four people have been killed in Kenya’s capital, Nairobi, after security forces fired shots and teargas to disperse huge crowds at a stadium where the body of the opposition leader Raila Odinga was lying in state.</p><p>Odinga, a major figure in Kenyan politics for decades who was once a political prisoner and ran unsuccessfully for president five times, <a href=\"https://www.theguardian.com/world/2025/oct/15/raila-odinga-former-kenya-pm-dies\">died on Wednesday aged 80 in India</a>, where he had been receiving medical treatment.</p> <a href=\"https://www.theguardian.com/world/2025/oct/16/kenya-security-fire-on-crowds-mourning-raila-odinga\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "India casts doubt on Trump’s claims that it has agreed to stop buying Russian oil",
      "link": "https://www.theguardian.com/world/2025/oct/16/india-casts-doubt-on-trumps-claims-that-it-has-agreed-to-stop-buying-russian-oil",
      "pub_time_taipei": "2025-10-17T01:18:07+08:00",
      "summary": "<p>The US president claimed Modi had assured him of deal, but Indian officials insist no such conversation took place</p><p>India has cast doubt on claims by Donald Trump that its prime minister, Narendra Modi, had agreed to stop buying Russian oil.</p><p>On Wednesday, Trump claimed that Modi had assured him “today” that India would put an end to its purchase of Russian oil.</p> <a href=\"https://www.theguardian.com/world/2025/oct/16/india-casts-doubt-on-trumps-claims-that-it-has-agreed-to-stop-buying-russian-oil\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Ministers plan high-level visits to China despite espionage trial outcry",
      "link": "https://www.theguardian.com/politics/2025/oct/16/ministers-plan-high-level-visits-to-china-despite-espionage-trial-outcry",
      "pub_time_taipei": "2025-10-17T01:10:22+08:00",
      "summary": "<p>National security adviser, education secretary and science minister to visit before end of year as part of policy to reset relations</p><p>Ministers are pushing ahead with their reset of relations with China, including several planned high-level visits before the end of the year, despite the furore triggered by the collapse of a high-profile espionage trial.</p><p>Plans have been drawn up for <a href=\"https://www.theguardian.com/politics/2025/oct/15/jonathan-powell-the-adviser-who-has-become-a-powerful-influence-on-uk-foreign-policy\">Jonathan Powell</a>, the national security adviser, to travel to Beijing in November for talks before an anticipated trip by Keir Starmer next year.</p> <a href=\"https://www.theguardian.com/politics/2025/oct/16/ministers-plan-high-level-visits-to-china-despite-espionage-trial-outcry\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Last surviving member of first team to conquer Everest dies aged 92",
      "link": "https://www.theguardian.com/world/2025/oct/16/kanchha-sherpa-last-surviving-member-of-first-team-to-reach-mount-everest-summit-dies",
      "pub_time_taipei": "2025-10-17T00:12:02+08:00",
      "summary": "<p>Kanchha Sherpa was part of expedition that put Tenzing Norgay and Edmund Hillary atop world’s highest peak in 1953</p><p>Kanchha Sherpa, the last surviving member of the mountaineering expedition team that first conquered Mount Everest, has died at the age of 92, according to the Nepal Mountaineering Association.</p><p>Kanchha died early on Thursday at his home in Kapan, Kathmandu district, said Phur Gelje Sherpa, the association’s president.</p> <a href=\"https://www.theguardian.com/world/2025/oct/16/kanchha-sherpa-last-surviving-member-of-first-team-to-reach-mount-everest-summit-dies\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "A Russian student sang protest songs in St. Petersburg. Then she was arrested.",
      "link": "https://www.washingtonpost.com/world/2025/10/16/russia-dissent-naoka-song-crackdown/",
      "pub_time_taipei": "2025-10-16T23:57:46+08:00",
      "summary": "The rare act of protest comes as Russia has cracked down on the arts, forcing out those who disagree with its war on Ukraine and quashing any acts of dissent."
    },
    {
      "source": "華盛頓郵報",
      "title": "In Europe, hate speech isn’t free speech. Some in D.C. hate that.",
      "link": "https://www.washingtonpost.com/world/2025/10/16/europe-free-speech-restrictions-debate/",
      "pub_time_taipei": "2025-10-16T22:02:18+08:00",
      "summary": "Debate is raging across Europe over whether governments have overreached in restricting hate speech, but criticism from President Trump is seen as hypocritical."
    },
    {
      "source": "衛報",
      "title": "Former Bush adviser charged with amassing top secret files",
      "link": "https://www.theguardian.com/us-news/2025/oct/16/indian-born-former-george-w-bush-adviser-ashley-tellis-accused-of-amassing-top-secret-files",
      "pub_time_taipei": "2025-10-16T21:30:28+08:00",
      "summary": "<p>Indian-American Ashley Tellis allegedly obtained US military data and passed envelopes to Chinese officials</p><p>A prominent Indian-American academic and former US government adviser has been arrested and charged with the unlawful detention of national security information, including thousands of pages of top secret documents that were found at his home in Virginia.</p><p>Ashley Tellis, 64, who served on the national security council of the former US president George W Bush and is credited for helping to negotiate <a href=\"https://www.theguardian.com/world/2006/mar/02/india.usa\">the US-India nuclear deal</a>, was arrested and charged over the weekend.</p> <a href=\"https://www.theguardian.com/us-news/2025/oct/16/indian-born-former-george-w-bush-adviser-ashley-tellis-accused-of-amassing-top-secret-files\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "India casts doubt as Trump says Modi pledged to stop buying Russian oil",
      "link": "https://www.washingtonpost.com/world/2025/10/16/india-trump-russian-oil-trade-us/",
      "pub_time_taipei": "2025-10-16T21:17:08+08:00",
      "summary": "President Donald Trump said Prime Minister Narendra Modi had promised that India would stop buying Russian oil. However, India said it was “not aware” Trump and Modi had spoken at all."
    }
  ]
}