{
  "mode": "last_24h",
  "window_start_taipei": "2025-09-27T20:40:09.307193+08:00",
  "window_end_taipei": "2025-09-28T20:40:09.307193+08:00",
  "items": [
    {
      "source": "衛報",
      "title": "Starmer calls Reform’s policy on immigration ‘racist’ and says Farage’s party would ‘tear country apart’ – Labour conference live",
      "link": "https://www.theguardian.com/politics/live/2025/sep/28/labour-conference-keir-starmer-latest-uk-politics-news-live-updates",
      "pub_time_taipei": "2025-09-28T20:19:29+08:00",
      "summary": "<p>PM calls Reform’s policy immoral but says people who want to vote for them are not racist but frustrated</p><p><strong>Kuenssberg</strong> ended her interview by asking about Andy Burnham, and the leadership.</p><p><strong>Starmer</strong> said Burnham was doing a very good job as mayor of Greater Manchester.</p><p>Comments about leaders and leadership are part and parcel of being in politics.</p><p>It is the bread and butter of politics, every leader get its, it always comes up, particularly at conference. It’s in the job description.</p><p>People are entitled to their views and I’m not sticking my fingers in my ear in the slightest.</p><p>What I am saying is that it is important to keep focusing on what it is that we are delivering, and saying, absolutely in clear terms, the difference it makes to people’s lives.</p><p>One, have we improved living standards? Do people genuinly feel better off? Two, have we improved public services? Is the NHS in a better place, and people can feel it. And, three, do people feel safe and secure in their home, in their neighbourhood, and that their country is secure.</p><p>It’s a five-year mandate, and I will be judged at the end of that five years, and quite right too.</p><p>I just need the space and get on and do what we need to do, and do those three things above all else.</p><p>I am saying we have got the fight of our lives ahead of us because we’ve got to take on Reform and we’ve got to beat them. So now is not the time for introspection or navel-gazing.</p><p>There is a fight that we are all in together, and every single member of our party and our movement – actually, everyone who cares about what this country is, whether they vote Labour or otherwise - it’s the fight of our lives for who we are as a country. We need to be in that fight, united not navel-gazing. I’m absolutely clear in my mind about that, and that’s what I will be talking about at conference.</p><p>Sir Keir Starmer gave land to his parents via a trust that meant their estates would never pay inheritance tax on the asset whatever its eventual value, according to legal experts.</p><p>The prime minister’s decision to place a seven-acre field within the structure meant its value was excluded from his parents’ estate, of which he was a beneficiary, when they died.</p> <a href=\"https://www.theguardian.com/politics/live/2025/sep/28/labour-conference-keir-starmer-latest-uk-politics-news-live-updates\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "UK businesses fear new EHRC guidance on toilets will be ‘unworkable’",
      "link": "https://www.theguardian.com/society/2025/sep/28/uk-businesses-fear-new-ehrc-guidance-on-toilets-will-be-unworkable",
      "pub_time_taipei": "2025-09-28T20:09:46+08:00",
      "summary": "<p>Exclusive: Stonewall writes to ministers and warns cost of compliance could be ‘significant’ for struggling companies</p><p>Businesses across the UK fear that new guidance from the Equality and Human Rights Commission (EHRC) on the use of toilets and changing rooms will be “confusing”, “unworkable” and could “undermine inclusion”.</p><p>The LGBTQ+ rights charity Stonewall has written to the newly appointed business and trade ministers to highlight the significant costs of compliance for struggling companies.</p> <a href=\"https://www.theguardian.com/society/2025/sep/28/uk-businesses-fear-new-ehrc-guidance-on-toilets-will-be-unworkable\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Zelenskyy condemns ‘vile’ and deadly Russian strikes on Ukraine; drones spotted over Danish military sites – Europe live",
      "link": "https://www.theguardian.com/world/live/2025/sep/28/ukraine-russia-war-volodymyr-zelenskyy-vladimir-putin-nato-europe-latest-live-news-updates",
      "pub_time_taipei": "2025-09-28T20:09:03+08:00",
      "summary": "<p>Twelve-year-old girl among those killed in Kyiv; unidentified drones spotted over Danish military bases on Saturday night</p><p>In an address at the UN general assembly in New York on Saturday, Moscow’s foreign minister <strong>Sergei Lavrov</strong> warned that “any aggression against my country will be met with a decisive response” but insisted Russia has no intention of attacking EU or Nato member states.</p><p>In a wide-ranging speech, Lavrov said threats against Russia by western countries were becoming “increasingly common”.</p> <a href=\"https://www.theguardian.com/world/live/2025/sep/28/ukraine-russia-war-volodymyr-zelenskyy-vladimir-putin-nato-europe-latest-live-news-updates\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Four dead as massive Russian attack on Kyiv hits apartments, hospital",
      "link": "https://www.washingtonpost.com/world/2025/09/28/russia-attacks-kyiv-ukraine/",
      "pub_time_taipei": "2025-09-28T20:04:52+08:00",
      "summary": "Russia’s missile and drone attack came days after Ukrainian President Volodymyr Zelensky’s meeting with President Donald Trump at the U.N. General Assembly."
    },
    {
      "source": "衛報",
      "title": "Zelenskyy condemns Russia’s ‘vile and brutal’ 12-hour bombardment of Ukraine",
      "link": "https://www.theguardian.com/world/2025/sep/28/hundreds-of-russian-missiles-and-drones-hit-ukraine-as-poland-scrambles-jets",
      "pub_time_taipei": "2025-09-28T20:03:41+08:00",
      "summary": "<p>Moscow targets Kyiv and other regions with about 500 drones and 40 missiles, killing at least four people</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/28/ukraine-russia-war-volodymyr-zelenskyy-vladimir-putin-nato-europe-latest-live-news-updates\">Russia-Ukraine war – latest news updates</a></p></li></ul><p>Kyiv has experienced one of its worst bombardments since the start of Vladimir Putin’s full-scale invasion of Ukraine, with at least four people killed in what Volodymyr Zelenskyy described as a “vile and brutal” attack.</p><p>Russia launched about 500 drones and more than 40 missiles, Ukraine’s president said, in a bombardment that lasted more than 12 hours over Saturday night and into Sunday morning. The main targets were the Ukrainian capital and the Zaporizhzhia, Khmelnytskyi, Sumy, Mykolaiv, Chernihiv and Odesa regions.</p> <a href=\"https://www.theguardian.com/world/2025/sep/28/hundreds-of-russian-missiles-and-drones-hit-ukraine-as-poland-scrambles-jets\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Leaders of Mexican megachurch led a sprawling sex-trafficking enterprise, US prosecutors allege",
      "link": "https://www.theguardian.com/world/2025/sep/28/la-luz-del-mundo-church-sex-trafficking-conspiracy-charges",
      "pub_time_taipei": "2025-09-28T20:00:11+08:00",
      "summary": "<p>The family behind La Luz del Mundo Church allegedly facilitated sexual abuse of children and women for decades</p><p>Since its inception nearly 100 years ago, La Luz del Mundo Church has been a family affair even as it spread from Mexico to the US and around the world.</p><p>Eusebio “Aaron” Joaquín Gonzalez, who founded the Guadalajara-based Christian church, was succeeded by his son, Samuel Joaquín Flores, upon his death in 1964.</p> <a href=\"https://www.theguardian.com/world/2025/sep/28/la-luz-del-mundo-church-sex-trafficking-conspiracy-charges\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Children left short of clean water and sleep amid ‘prolonged’ detention by Ice, watchdog groups allege",
      "link": "https://www.theguardian.com/us-news/2025/sep/28/ice-detention-texas-children",
      "pub_time_taipei": "2025-09-28T20:00:10+08:00",
      "summary": "<p>Legal experts speak of ‘cruel’ and harmful deprivations for families held in Texas immigration facility</p><p>Children, including the very young, have been spending weeks or months in an Immigration and Customs Enforcement (Ice) detention facility in a remote part of Texas where outside monitors have heard accounts of shortages of clean drinking water, chronic sleep deprivation and kids struggling for hygiene supplies and prompt medical attention, as revealed in a stark new court filing.</p><p>Legal experts able to witness conditions made a barrage of allegations about deprivations, violations of legally agreed basic detention standards and humanitarian concerns at the only known <a href=\"https://www.theguardian.com/us-news/ice-us-immigration-and-customs-enforcement\">Ice</a> center currently holding families. At the facility in Dilley, a small town an hour south-west of San Antonio, kids and their parents described a “prison-like environment” where the guards reportedly call them “inmates” despite them not being criminals, and said they live in “cell-like trailers”.</p><p><strong>prolonged, vaguely</strong><strong> explained detention</strong><strong>: </strong>This goes beyond the general <a href=\"https://www.americanimmigrationcouncil.org/fact-sheet/immigration-detention-united-states-agency/\">legal limit</a> of 20 days for children, with accounts of children held for two or three months and a family detained for 45 days, released, then quickly re-detained.</p><p><strong>lack of access to drinkable water</strong><strong>:</strong> Families have not wanted to consume “dirty” water that smells “so horrible”, but drinkable water is often unavailable unless they buy it.</p><p><strong>sleep deprivation</strong><strong>:</strong> Children, especially, are suffering sleeplessness because the lights are never switched off, while officials slam doors, walk in and out frequently and speak loudly on walkie-talkies all night.</p><p><strong>inadequate medical care</strong><strong>:</strong> One boy complained of “acute stomach pain” for six hours before he vomited and ended up being rushed to the hospital for emergency surgery for appendicitis. Monitors observed “children with diseases like leukemia [or] on the autism spectrum … suffering immensely from missing needed therapies and the harsh conditions”.</p><p><strong>lack of hygiene products</strong><strong>:</strong> Apart from liquid hand soap, which reportedly can cause rashes and hives, shampoo and body soap must be paid for.</p><p><strong>emotional abuse</strong><strong>:</strong> Mothers gave accounts such as “I am not allowed to hold my husband’s hand anywhere … there is no place where we can … speak privately”.</p><p><strong>poor education</strong><strong>:</strong> School takes place just one hour daily for each age group and typically constitutes drawing, painting and worksheets, but little real teaching.</p><p><strong>self-harm</strong><strong>:</strong> One parent said his son’s exhaustion, distress and anxiety over continued detention led him to start “throwing himself against the floor and getting bruises”.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/28/ice-detention-texas-children\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "At least 39 dead and more than 40 injured in crush at Vijay rally in India",
      "link": "https://www.theguardian.com/world/2025/sep/27/dead-and-injured-in-stampede-at-vijay-rally-in-india",
      "pub_time_taipei": "2025-09-28T19:18:00+08:00",
      "summary": "<p>Victims include nine children at election campaign gathering in Tamil Nadu led by popular actor and politician</p><p>Police in India have opened a criminal case against the leaders of a party headed by the actor turned politician Vijay, after a crowd crush at one of his rallies killed 40 people and injured at least 124 others.</p><p>Local officials reported that at least nine children had died at the rally, which took place on Saturday night in the Karur district of Tamil Nadu state in southern India. Vijay, one of the most popular and successful actors in Tamil cinema, who entered politics last year, was addressing the crowd for his Tamilaga Vettri Kazhagam (TVK) party before state elections early next year.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/dead-and-injured-in-stampede-at-vijay-rally-in-india\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Court dismisses Central American bank’s claim against former president",
      "link": "https://www.washingtonpost.com/world/2025/09/28/mossi-central-american-development-bank/",
      "pub_time_taipei": "2025-09-28T19:00:47+08:00",
      "summary": "The Central American Bank for Economic Integration had accused Dante Mossi of undermining its credit rating after he learned he would not be reappointed."
    },
    {
      "source": "衛報",
      "title": "UK government urged to restore Electoral Commission’s independence to protect democracy",
      "link": "https://www.theguardian.com/politics/2025/sep/28/uk-government-urged-to-restore-electoral-commissions-independence-to-protect-democracy",
      "pub_time_taipei": "2025-09-28T19:00:18+08:00",
      "summary": "<p>Oversight of watchdog could be abused by a future authoritarian government, report warns</p><p>The independence of the Electoral Commission must be fully restored to protect the UK’s electoral integrity from a future authoritarian government, a new report warns.</p><p>The Democracy in Danger report by the campaign group Spotlight on Corruption found the UK government was in breach of eight different international standards on ensuring the independence of electoral bodies by maintaining the government’s oversight of the watchdog.</p><p>The UK government is in breach of eight different international standards on ensuring the independence of electoral bodies by maintaining the new power in place.<br /></p><p>All the constitutional oversight bodies that reviewed the ministerial power opposed its introduction – including two parliamentary committees, the UK’s top ethics body, the Committee on Standards in Public Life, and the Electoral Commission’s oversight body, the Speaker’s Committee.<br /></p><p>The UK has plummeted down international rankings for electoral body autonomy since the power was introduced and now ranks 44th, among countries such as Ghana, Nepal and Croatia. It has fallen out of line with comparable countries such as Canada, Australia, Ireland and New Zealand.<br /></p><p>The power, which was described by the former MI5 director general and former chair of the committee on standards in public life, Jonathan Evans, as “giving a toddler a gun”, could be used by a future government with autocratic tendencies to distort electoral rules in its favour to maintain power.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/28/uk-government-urged-to-restore-electoral-commissions-independence-to-protect-democracy\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘It’s incredibly exciting’: ancient canoe unearthed after Hurricane Ian stormed through Florida",
      "link": "https://www.theguardian.com/us-news/2025/sep/28/florida-ancient-canoes",
      "pub_time_taipei": "2025-09-28T19:00:11+08:00",
      "summary": "<p>The latest find is likely from the 16th century and could have originated as far away as the Caribbean</p><p><a href=\"https://www.theguardian.com/us-news/florida\">Florida</a> already claims to be the world capital of golf, <a href=\"https://www.theguardian.com/environment/sharks\">shark</a> bites and lightning strikes. Now a remarkable discovery following a devastating <a href=\"https://www.theguardian.com/world/hurricanes\">hurricane</a> has enhanced its position as a global leader in another distinctive field: ancient canoes – some even prehistoric.</p><p>State archeologists have just completed a painstaking preservation of an <a href=\"https://sketchfab.com/3d-models/h-ian-fort-myers-canoe-0264733528fb4d38b2c26b2bbdc2b1fd?fbclid=IwY2xjawM-K75leHRuA2FlbQIxMAABHu-HIw3fDkimbssrMMiA-fC-K5ZnF0eyFSg66fbLLvhmEAX9b3l5MPP5wt2z_aem_dRyqdFupowDgGWCm8qLB6Q\">ancient wooden canoe</a> discovered by a resident of Fort Myers during the cleanup from Hurricane Ian in 2022.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/28/florida-ancient-canoes\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "US set for largest mass resignation in history as Trump continues deep cuts",
      "link": "https://www.theguardian.com/us-news/2025/sep/28/us-mass-resignation-federal-workers",
      "pub_time_taipei": "2025-09-28T19:00:10+08:00",
      "summary": "<p>Federal workers say they have little choice but to depart, with 100,000 leaving under deferred resignation program</p><p>The Trump administration is set to oversee the <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7375898216262946816/\">largest mass resignation </a>in US history on Tuesday, with more than 100,000 federal workers set to formally quit as part of the latest wave of its <a href=\"https://ourpublicservice.org/wp-content/uploads/2025/09/Deferred-Resignation-Program-Guide-FedSupport-Partnership-for-Public-Service.pdf\">deferred resignation program</a>.</p><p>With Congress facing a deadline of Tuesday to authorize more funding or spark a government shutdown, the White House has also ordered federal agencies to draw up plans for large-scale firings of workers if the partisan fight fails to yield a deal.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/28/us-mass-resignation-federal-workers\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Moldova heads to polls in pivotal vote that could steer it closer to EU or Russia",
      "link": "https://www.theguardian.com/world/2025/sep/28/moldova-heads-to-the-polls-in-tense-vote-that-could-steer-country-closer-to-eu-or-russia",
      "pub_time_taipei": "2025-09-28T18:38:56+08:00",
      "summary": "<p>President tells voters ‘our dear home is in danger’ as her pro-west party tries to hold on to parliamentary majority</p><p>Moldovans have begun voting in a pivotal parliamentary election that will decide whether the country of 2.4 million stays on its path towards EU membership or drifts back into Moscow’s orbit, amid widespread reports of Russian meddling.</p><p>The president, Maia Sandu, and her pro-western Action and Solidarity party (PAS) face a stiff challenge in Sunday’s election from an alliance of Soviet-nostalgic, pro-Russian parties led in part by the former president Igor Dodon, whom Sandu defeated in 2020.</p> <a href=\"https://www.theguardian.com/world/2025/sep/28/moldova-heads-to-the-polls-in-tense-vote-that-could-steer-country-closer-to-eu-or-russia\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Keir Starmer attacks ‘racist’ Farage plan to deport people settled in the UK",
      "link": "https://www.theguardian.com/uk-news/2025/sep/28/keir-starmer-says-farage-plan-racist-deport-people-settled-in-the-uk",
      "pub_time_taipei": "2025-09-28T18:31:53+08:00",
      "summary": "<p>Prime minister says Reform proposal to abolish indefinite leave to remain could ‘tear this country apart’</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/28/labour-conference-keir-starmer-latest-uk-politics-news-live-updates\">Labour conference – live updates</a></p></li></ul><p>Keir Starmer has attacked Reform UK’s plan to deport thousands of people already legally living in the UK as “racist” and “immoral”, as he said that Labour had a generational struggle ahead with the populist right.</p><p>The prime minister, in Liverpool for his party conference, said he did not think that Nigel Farage’s party was trying to appeal to racists, and that he understood people tempted to vote for Reform were frustrated and wanted change.</p> <a href=\"https://www.theguardian.com/uk-news/2025/sep/28/keir-starmer-says-farage-plan-racist-deport-people-settled-in-the-uk\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Iran angry as sweeping UN sanctions take effect after failure of nuclear talks",
      "link": "https://www.theguardian.com/world/2025/sep/28/sweeping-un-sanctions-on-iran-come-into-effect-after-nuclear-talks-fail",
      "pub_time_taipei": "2025-09-28T17:51:09+08:00",
      "summary": "<p>Foreign ministry attacks ‘unjustifiable’ return of measures expected to have wide effects on troubled economy</p><p>Widespread UN sanctions against Iran have come back into force for the first time in a decade, prompting anger from Tehran, after last-ditch nuclear talks with western powers failed to produce a breakthrough.</p><p>The sanctions, which came into effect late on Saturday and three months after Israel and the US bombed Iran, bar dealings related to Tehran’s nuclear and ballistic missiles programme and are also expected to have <a href=\"https://www.theguardian.com/world/2025/aug/30/far-more-dangerous-than-war-iranians-brace-for-prospect-of-un-sanctions\">wider effects on the country’s troubled economy</a>.</p> <a href=\"https://www.theguardian.com/world/2025/sep/28/sweeping-un-sanctions-on-iran-come-into-effect-after-nuclear-talks-fail\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Anti-gang drones kill children, and Haiti’s government remains silent",
      "link": "https://www.washingtonpost.com/world/2025/09/28/haiti-drone-simon-pele-children/",
      "pub_time_taipei": "2025-09-28T17:00:59+08:00",
      "summary": "At least eight children were killed in a government drone strike in Haiti while the gang leader who was targeted escaped unharmed. The families want answers."
    },
    {
      "source": "華盛頓郵報",
      "title": "Sweeping Israeli actions transform West Bank in shadow of Gaza war",
      "link": "https://www.washingtonpost.com/world/2025/09/28/west-bank-israel-settlements/",
      "pub_time_taipei": "2025-09-28T17:00:35+08:00",
      "summary": "The dramatic expansion of Israeli settlements and escalating violence by radical settlers aimed at evicting Palestinians are among the measures remaking the territory."
    },
    {
      "source": "衛報",
      "title": "Populist threat to rule of law a danger to UK working class, says attorney general",
      "link": "https://www.theguardian.com/politics/2025/sep/28/labour-richard-hermer-attorney-general-populist-danger-rule-of-law-uk-working-class",
      "pub_time_taipei": "2025-09-28T16:00:06+08:00",
      "summary": "<p>Richard Hermer to aim criticism at Nigel Farage and Robert Jenrick at Labour conference event </p><p>Rightwing populists threaten working-class people’s protections under the rule of law, the attorney general will say in his most political intervention yet.</p><p>In a criticism directed squarely at Nigel Farage and Robert Jenrick, Richard Hermer will say populist politicians pose a threat to the “everyday protections” afforded to people who use the legal system and the courts “to right significant wrongs”.</p> <a href=\"https://www.theguardian.com/politics/2025/sep/28/labour-richard-hermer-attorney-general-populist-danger-rule-of-law-uk-working-class\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Crisafulli insists on more shark nets to protect human lives despite trapped mother and baby whale",
      "link": "https://www.theguardian.com/australia-news/2025/sep/28/crisafulli-insists-on-more-shark-nets-to-protect-human-lives-despite-trapped-mother-and-baby-whale",
      "pub_time_taipei": "2025-09-28T15:39:22+08:00",
      "summary": "<p>Queensland premier says he won’t protect whales ‘at the expense of one single human’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Queensland’s premier said the state is “not for turning” on its plan to expand shark netting, and won’t put protecting whales “at the expense of one single human”.</p><p>A mother and baby humpback were discovered trapped in shark netting near Rainbow Beach on Saturday, <a href=\"https://www.theguardian.com/australia-news/2025/sep/27/mother-and-baby-whale-trapped-in-shark-net-off-queenslands-rainbow-beach\">the eighth and ninth whales to become entangled in nine days</a>.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/28/crisafulli-insists-on-more-shark-nets-to-protect-human-lives-despite-trapped-mother-and-baby-whale\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Labor’s proposed FoI clampdown ‘ripe’ for high court challenge, legal expert says",
      "link": "https://www.theguardian.com/australia-news/2025/sep/28/labors-proposed-foi-clampdown-ripe-for-high-court-challenge-legal-expert-says",
      "pub_time_taipei": "2025-09-28T15:16:31+08:00",
      "summary": "<p>Move to further restrict access to documents prepared for government ministers may go against the right to political free speech</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>A proposed move by the federal government to keep more official documents secret could fall foul of the constitution, a legal expert says.</p><p>According to Luke Beck, a Monash university professor of constitutional law, the Labor government’s disproportionate restriction of access to documents prepared for government ministers may contradict an implied freedom of political communication.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/28/labors-proposed-foi-clampdown-ripe-for-high-court-challenge-legal-expert-says\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Clive Palmer banks on Swiss strategy after court throws out $305bn mine compensation claim",
      "link": "https://www.theguardian.com/australia-news/2025/sep/28/clive-palmer-banks-on-swiss-strategy-after-court-throws-out-305bn-mine-compensation-claim",
      "pub_time_taipei": "2025-09-28T14:27:57+08:00",
      "summary": "<p>Queensland mining magnate had been ordered to pay $13m after tribunal dismissed claim of being a ‘foreign investor’</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Clive Palmer says he will challenge the decision of an international tribunal to dismiss his claim for $305bn in compensation from the commonwealth government, by appealing to a court in Switzerland.</p><p>On Saturday the attorney general, Michelle Rowland, announced that the permanent court of arbitration, in The Hague, the Netherlands, <a href=\"https://www.theguardian.com/australia-news/2025/sep/27/clive-palmer-ordered-to-pay-13m-after-claim-of-being-foreign-investor-in-australian-mining-project-thrown-out\">had ruled against</a> the Queensland mining magnate.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/28/clive-palmer-banks-on-swiss-strategy-after-court-throws-out-305bn-mine-compensation-claim\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "1 million people have returned to Syria since fall of Assad, U.N. says",
      "link": "https://www.washingtonpost.com/world/2025/09/28/syria-one-million-displaced-return/",
      "pub_time_taipei": "2025-09-28T14:00:00+08:00",
      "summary": "Displaced Syrians returning after 13 years of war are hopeful about their country — and wary of looming economic risks and instability."
    },
    {
      "source": "衛報",
      "title": "Lions coach hails AFL grand final win as ‘better than last year’ – as it happened",
      "link": "https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb",
      "pub_time_taipei": "2025-09-28T13:35:19+08:00",
      "summary": "<p>This blog is now closed</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>PM brushes off Coalition criticism for attending UK Labour party’s national conference</strong></p><p>Returning to Albanese’s appearance on Sky News this morning, the PM has shrugged off criticism from the Coalition that he is spending too much time engaging in international diplomacy after he attended the UK Labour party’s national conference.</p><p>What I do is work very hard representing Australia.</p><p>In Liverpool, I’ll be having discussions with ministers, not just with prime minister Starmer, about Aukus and about that progress, taking the opportunity to sit down with government ministers.</p><p>I think you can be strong on borders without being weak on humanity, and that’s what drives my government.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "‘You have to live’: Ukrainians on frontline practise normality despite Russian bombings",
      "link": "https://www.theguardian.com/news/ng-interactive/2025/sep/28/you-have-to-live-ukrainians-on-frontline-practice-normality-despite-russian-bombings",
      "pub_time_taipei": "2025-09-28T13:00:04+08:00",
      "summary": "<p>In once-occupied Sloviansk, war has become so routine that nobody pays attention to air-raid sirens</p><p>On a sunny afternoon this week the beach in the frontline Ukrainian city of Sloviansk was busy. Bathers paddled in a lake, sunbathed and sipped tea. At 3.30pm there was a sudden thunderclap. An artillery shell had crashed nearby, sending up a plume of twisting grey smoke. Ducks took off in panic. The swimmers glanced nonchalantly upwards and carried on bobbing in the salty water.</p><p>“After three years of fighting we’ve got used to booms. They don’t bother us any more,” Alyona, a pensioner in a swimsuit, explained. She pointed to a concrete box beyond a row of wooden changing cabins and outdoor showers. “If the bombs are close we’ve got a shelter,” she said. Alyona and her friend waded into the shallows. A man selling grapes sat engrossed reading a book.</p> <a href=\"https://www.theguardian.com/news/ng-interactive/2025/sep/28/you-have-to-live-ukrainians-on-frontline-practice-normality-despite-russian-bombings\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Albanese rules out holding Australian republic referendum while he is prime minister",
      "link": "https://www.theguardian.com/australia-news/2025/sep/28/albanese-rules-out-holding-australian-republic-referendum-while-he-is-prime-minister",
      "pub_time_taipei": "2025-09-28T10:14:53+08:00",
      "summary": "<p>PM previously advocated for republic but has gradually backed away from pushing for constitutional change</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb\">Follow our Australia news live blog for latest updates</a></p></li><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Anthony Albanese has comprehensively shut the door on the prospect of a referendum to make Australia a republic while he is prime minister, despite acknowledging his personal desire for an Australian head of state.</p><p>Albanese said there would only be one referendum during his time as the nation’s leader, during an interview on the ABC Insiders program on Sunday after his meeting with King Charles in Balmoral, Scotland.</p> <a href=\"https://www.theguardian.com/australia-news/2025/sep/28/albanese-rules-out-holding-australian-republic-referendum-while-he-is-prime-minister\">Continue reading...</a>"
    },
    {
      "source": "華盛頓郵報",
      "title": "Trump’s Gaza peace plan leaves door ajar for Palestinian state",
      "link": "https://www.washingtonpost.com/national-security/2025/09/27/trump-21-point-gaza-peace-plan/",
      "pub_time_taipei": "2025-09-28T08:25:29+08:00",
      "summary": "Trump’s 21-point peace plan includes Hamas disarmament, an international security force and a “Trump development plan” to rebuild the shattered enclave. But Israel might balk at some proposals."
    },
    {
      "source": "華盛頓郵報",
      "title": "At least 36 killed at Indian actor’s political rally",
      "link": "https://www.washingtonpost.com/world/2025/09/27/stampede-vijay-political-rally-india/",
      "pub_time_taipei": "2025-09-28T05:24:10+08:00",
      "summary": "At least 36 people were killed and dozens injured in a stampede Saturday at a political rally in India for a popular actor-turned-politician, authorities said."
    },
    {
      "source": "華盛頓郵報",
      "title": "Zelensky says Trump understands battlefield, has ‘faith in Ukraine’",
      "link": "https://www.washingtonpost.com/world/2025/09/27/zelensky-trump-us-weapons/",
      "pub_time_taipei": "2025-09-28T05:11:36+08:00",
      "summary": "Zelensky, seeking weapons and support, told reporters Saturday that he shared his “visions” for the battlefield with Trump in New York."
    },
    {
      "source": "衛報",
      "title": "Nato to step up vigilance in Baltic Sea region after drones spotted over military bases",
      "link": "https://www.theguardian.com/world/2025/sep/27/denmark-new-drone-sightings-biggest-military-base",
      "pub_time_taipei": "2025-09-28T04:33:20+08:00",
      "summary": "<p>Move comes after new drone sightings near major military installations in Denmark and Norway<br /></p><p>Nato has vowed to upgrade its mission in the Baltic Sea after Denmark’s armed forces said unidentified drones were seen near the country’s military installations overnight.</p><p>There have also been several drone incursions near airports and other critical infrastructure this week, with Copenhagen’s airport closed for several hours late on Monday as several drones were seen in its airspace.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/denmark-new-drone-sightings-biggest-military-base\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Three dead in Arizona flooding as the Carolinas brace for possible hurricane",
      "link": "https://www.theguardian.com/us-news/2025/sep/27/arizona-flooding-carolinas-hurricane",
      "pub_time_taipei": "2025-09-28T04:20:35+08:00",
      "summary": "<p>Flooding overwhelms town of Globe as North Carolina governor declares an emergency ahead of storm</p><p>At least three people died and others were believed missing after flooding in a rural community in <a href=\"https://www.theguardian.com/us-news/arizona\">Arizona</a>, officials said on Saturday.</p><p>Meanwhile, in <a href=\"https://www.theguardian.com/us-news/south-carolina\">South Carolina</a>, crews spent Saturday making preparations for an unnamed weather system that is forecast to approach that state’s coast as a hurricane early next week.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/27/arizona-flooding-carolinas-hurricane\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "NoViolet Bulawayo wins the Best of Caine award",
      "link": "https://www.theguardian.com/books/2025/sep/27/noviolet-bulawayo-wins-the-best-of-caine-award",
      "pub_time_taipei": "2025-09-28T04:00:51+08:00",
      "summary": "<p>The Zimbabwean writer – who has been twice nominated for the Booker – won the Caine Prize for African Writing in 2011, with her story Hitting Budapest</p><p>Zimbabwean writer NoViolet Bulawayo has won the Best of Caine award, an honorary prize celebrating a story from past winners of the Caine Prize for African Writing, to mark its 25th anniversary. The prize was given for a short story praised by judges for its “powerful language, distinctive tone of voice, and bold, compelling storytelling”.</p><p><a href=\"https://www.bostonreview.net/articles/bulawayo-hitting-budapest/\">Hitting Budapest</a>, which <a href=\"https://www.theguardian.com/books/2011/jul/12/noviolet-bulawayo-caine-prize\">won</a> the 2011 Caine prize, follows a group of six children who sneak from their shantytown, Paradise, into an affluent neighbourhood, Budapest, to steal guavas. First published in the Boston Review, it examines poverty, social and economic inequalities, and the dreams of children.</p> <a href=\"https://www.theguardian.com/books/2025/sep/27/noviolet-bulawayo-wins-the-best-of-caine-award\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Yvette Cooper suggests international community on brink of Gaza peace deal",
      "link": "https://www.theguardian.com/world/2025/sep/27/yvette-cooper-suggests-international-community-on-brink-of-gaza-peace-deal",
      "pub_time_taipei": "2025-09-28T03:37:17+08:00",
      "summary": "<p>Exclusive: Foreign secretary says world has ‘reached moment’ it wants to end war after Donald Trump signals plan within reach</p><p>The international community is on the brink of securing a peace deal for Gaza that could finally bring an end to two years of conflict and a humanitarian crisis that has claimed thousands of lives, Yvette Cooper has suggested.</p><p>The new foreign secretary, who has just returned from a UN summit, said that they had “reached a moment where the world wants to end this war” after the US president, Donald Trump, indicated a peace deal was within reach.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/yvette-cooper-suggests-international-community-on-brink-of-gaza-peace-deal\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "FBI arrest man who allegedly threatened to shoot people at Texas Pride parade",
      "link": "https://www.theguardian.com/us-news/2025/sep/27/fbi-arrest-man-texas-pride-parade",
      "pub_time_taipei": "2025-09-28T02:06:29+08:00",
      "summary": "<p>Suspect Joshua Cole allegedly used a Facebook account to threaten revenge for murder of Charlie Kirk</p><p>Federal authorities in Texas have arrested a man for allegedly threatening to shoot people at a pro-LGBTQ+ parade, to avenge the murder of <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">Charlie Kirk</a>.</p><p>According to court documents viewed by the Guardian, on 18 September, the FBI’s field office in Dallas was notified by Abilene, Texas, police about online threats from a local resident.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/27/fbi-arrest-man-texas-pride-parade\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Family of British couple held in Iran say their health is deteriorating in prison",
      "link": "https://www.theguardian.com/world/2025/sep/27/family-of-british-couple-held-in-iran-say-their-health-is-deteriorating-in-prison",
      "pub_time_taipei": "2025-09-28T01:58:45+08:00",
      "summary": "<p>Son of Lindsay Foreman expresses ‘real concerns’ after mother put on drip and stepfather, Craig, ‘constantly ill’</p><p>The family of Lindsay and Craig Foreman, a British couple <a href=\"https://www.theguardian.com/world/2025/aug/04/british-couple-held-in-iran-moved-to-separate-prisons-heightening-welfare-concerns\">detained in Iran</a> on espionage charges, have said their health is deteriorating in prison.</p><p>The pair, both 52 and who previously split their time between Spain and England, were seized in Kerman, central Iran, and taken into custody in January while on an around-the-world motorcycle tour.</p> <a href=\"https://www.theguardian.com/world/2025/sep/27/family-of-british-couple-held-in-iran-say-their-health-is-deteriorating-in-prison\">Continue reading...</a>"
    },
    {
      "source": "衛報",
      "title": "Donald Trump says he is deploying troops to Portland, Oregon",
      "link": "https://www.theguardian.com/us-news/2025/sep/27/portland-oregon-us-military-trump",
      "pub_time_taipei": "2025-09-28T01:06:42+08:00",
      "summary": "<p>Apparently misled by hyperbolic reporting from conservative outlets on a single small protest, president described peaceful city as ‘war ravaged’</p><p>Donald Trump said on Saturday he is deploying troops to Portland, Oregon, “authorizing Full Force, if necessary”, ignoring pleas from local officials and the state’s congressional delegation, who suggested that the president was misinformed or lying about the nature and scale of a single, small protest outside one federal immigration enforcement office.</p><p>Trump made the announcement on social media, where he claimed that the deployment was necessary “to protect War ravaged Portland,” and Immigration and Customs Enforcement (Ice) facilities he said were “under siege by antifascists “and other domestic terrorists”.</p> <a href=\"https://www.theguardian.com/us-news/2025/sep/27/portland-oregon-us-military-trump\">Continue reading...</a>"
    }
  ]
}